{"data":[{"pr_id":"019abe53-34a6-7a3d-8003-c5620a5529da","title":"Midnight Sealed-Bid: Private Auction Protocol ","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Public auctions on Cardano face front-running, sniping, and price anchoring. Lack of bid privacy exposes user balances, discouraging high-net-worth participation.","solution":"We build an open-source Sealed-Bid Auction POC on Midnight. ZK proofs keep bids encrypted until the end, ensuring fairness and privacy without revealing losing bids.","proposer_name":"Do Anh Ba","proposer_relevant_experience":"**Anh Ba Do – Blockchain & Systems Engineer**\n\n\n\nRole: Engineer for smart contract design, integration, and blockchain back-end architecture.\n\n\n\nExpertise: Over 5 years of experience working on Cardano projects, with robust capabilities in distributed systems, smart contracts, and system scalability.\n\n\n\nContribution: Delivers a secure, efficient smart contract layer to store tagging data on-chain and ensures seamless integration between AI, crowdsourcing, and blockchain infrastructure.\n\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/ba\\-do\\-anh/](https://www.linkedin.com/in/ba-do-anh/)","url":null,"funds":8000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Smart Contracts","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2368},{"pr_id":"019a7eef-7895-77f3-9ed5-771365d6059b","title":"Private RWA Tokenization: Secure Token Sale Framework","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Midnight will be excluded from a massive financial sector without a privacy-preserving framework for tokenizing real-world assets and distributing ownership through shielded native tokens.","solution":"Enable tokenization and practical distribution of real-world asset ownership through shielded native tokens on Midnight.","proposer_name":"BankFi (Andrew Caldwell)","proposer_relevant_experience":"**Andrew Caldwell \\- CEO \\(BankFi\\)**\n\n[https://www\\.linkedin\\.com/in/andrew\\-caldwell\\-94557baa/](https://www.linkedin.com/in/andrew-caldwell-94557baa/)\n\nAndrew serves as the key decision maker and driver of business growth and development at BankFi. He ensures operating budgets are properly managed, timelines are met, and key business partnerships are formed. As the CEO of Smart Choice, he brings in a wealth of knowledge and experience of managing complex systems at scale.\n\n**Stephen Caldwell \\- Financial Analyst &amp; Information Security Expert \\(BankFi\\)** [https://www\\.linkedin\\.com/in/stephen\\-caldwell\\-b882971b/](https://www.linkedin.com/in/stephen-caldwell-b882971b/)\n\nStephen provides critical insights into the designs for the flow of funds and associated cybersecurity measures to ensure transparent, efficient, and safe outputs in every project. As the Director of Financial Analysis and Director of Information Security at Smart Choice, he has a unique skillset that lends itself perfectly to the protection of protocol users and funds in all of the applications we build.\n\n**Jake Shearman \\- CTO \\(Yepple\\)**\n\n[https://www\\.linkedin\\.com/in/jake\\-shearman/](https://www.linkedin.com/in/jake-shearman/)\n\nJake is the lead developer for Yepple, which was acquired as the development arm of BankFi in early 2025. Jake led the development for all Yepple offerings, including the NFT &amp; token minting services. Jake has a firm and comprehensive understanding of Cardano native assets and UTxOs with an additional background in both Ethereum and Cardano smart contracts. He will continue to lead development to see through the completion of this proposal.\n\n**Nicholas Fekete \\- CEO \\(Yepple\\)**\n\n[https://www\\.linkedin\\.com/in/nicholas\\-fekete/](https://www.linkedin.com/in/nicholas-fekete/)\n\nNick leads the vision of Yepple’s development endeavors, particularly in terms of the user experience on our products. He ensures modern, reactive, and high quality product launches by providing UI/UX designs and overseeing the development team’s progress.\n\n**Tyler McVety \\- User Experiences &amp; DevOps \\(Yepple\\)**\n\n[https://www\\.linkedin\\.com/in/tyler\\-mcvety/](https://www.linkedin.com/in/tyler-mcvety/)\n\nTyler provides insight on user experience through a journey mapping approach, making sure that the overall experience of every user is convenient, clear, and useful. He also plays a key role within DevOps management – between the BankFi stake pool servers, Iagon nodes, and Cardano nodes for transaction processing, he ensures extremely high uptime to mirror the high quality of the products.\n\n**Dominic Monette \\- COO &amp; Developer \\(Yepple\\)**\n\n[https://www\\.linkedin\\.com/in/dominic\\-monette\\-7273b287/](https://www.linkedin.com/in/dominic-monette-7273b287/)\n\nThe master of pipelines and processes, Dom has streamlined the Yepple team to maximize efficiency without any compromise to quality and attention to detail. He also has development experience with a specialty in Cardano metadata and image layering/generation.","url":null,"funds":7500,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Tokenization","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2367},{"pr_id":"019abb2e-c95b-7e09-abab-eb4ae06c9381","title":"ZeroTag: Privacy Preserving RFID-NFT Mapping Protocol","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Current systems that represent ownership of physical assets through RFID-NFT based are vulnerable due to centralized UID–NFT mapping, leading to risks of data tampering and asset duplication.","solution":"A decentralized RFID-NFT protocol on the Midnight network that encrypts sensitive identifiers with ZK proofs, ensuring private, verifiable, and duplication-resistant asset ownership.","proposer_name":"Valdryan Ivandito","proposer_relevant_experience":"**Project Owner & Fullstack Developer \\- Valdryan Ivandito**\n\nThe proposer Valdryan Ivandito serves as the sole developer and project owner for this initiative. The proposer will be responsible for the entire software lifecycle, including system architecture, compact smart contract development, web and desktop application implementation, and integration with the RFID hardware layer.\n\n\n\nHis primary roles include:\n\n- **System Design & Architecture:** Designing the RFID–NFT interaction model and defining on-chain logic on the Midnight network.\n- **Backend & Smart Contract Development:** Building APIs, Zero-Knowledge proof integrations, and privacy-preserving transaction logic.\n- **Frontend Development:** Developing the ZeroTag Minter and ZeroTag Scanner application interfaces (either as a desktop or web application) for asset registration and verification.\n- **Documentation:** Producing open-source documentation for community reuse.\n\n\n\nThis streamlined, single-developer structure ensures maximum efficiency and consistency across the entire development process, minimizing overhead while maintaining full control over design integrity and technical execution.","url":null,"funds":8510,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"IoT","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2366},{"pr_id":"019a8947-3e0d-7d91-96a8-b512310c8dc9","title":"Privacy-First Mini DApps: Real-World Proofs on Midnight","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Users compelled over share personal data on forms verification should be done without compromising privacy in organization conventional digital media reveal sensitiv information and lead lack of trust","solution":"PrivD Forms helps individuals unveil what is needed. Zero knowledge proofs authenticate answers without revealing entire information. An uncomplicated privacy-sensitive online forms with Midnight.","proposer_name":"Dejene Mulatu","proposer_relevant_experience":"Led by Dejene Mulatu and assisted by co-workers in the fields of UI design, smart contract engineering and tooling privacy. The team is shown to have experience in blockchain development, creation of practical solutions, and involvement in open-source code repositories. We will commit our focus to providing work that enhances the Cardano and Midnight ecosystem. Our company is of the opinion that privacy should be easy to the users and this project will make that a reality to many users.","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Community Outreach","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2365},{"pr_id":"019aaa1f-4967-7387-8fa9-7a495c089386","title":"Zero-Knowledge Data Validator (Reference DApp)","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Buyers cannot verify dataset quality (schema, bias, nulls) without seeing it, while sellers risk theft if they reveal raw data. This trust gap halts the exchange of AI training data.","solution":"A Reference DApp where sellers use Midnight ZKPs to mathematically prove dataset quality without revealing raw content. It iterates through private file to verify, publishing only the result. ","proposer_name":"Bamboo Labs","proposer_relevant_experience":"Bamboo Labs consists of two core contributors for this project:\n\n\n\n1. Fitra Rahmani Khasyah - Software Engineer & Blockchain Developer\n\nLinkedIn: [https://www\\.linkedin\\.com/in/fitra\\-rahmani](https://www.linkedin.com/in/fitra-rahmani)\n\nGitHub: [https://github\\.com/khasyah\\-fr](https://github.com/khasyah-fr) \n\n\n\nWith 3 years of full-stack and Web3 development experience, Khasyah will lead the Compact smart contract implementation and front-end integration.\n\n\n\n2. Khresna Pandu Izzaturrahman - Research & AI Engineer\n\nLinkedIn: [https://www\\.linkedin\\.com/in/khresna\\-pandu/](https://www.linkedin.com/in/khresna-pandu/)\n\nGitHub: [https://github\\.com/KhresnaPanduI](https://github.com/KhresnaPanduI)\n\n\n\nWith 3 years of experience in research and AI engineering, Pandu will help develop the Compact smart contract and produce clear, developer-focused documentation and tutorials.","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Security","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2364},{"pr_id":"019ab8bb-1761-77c4-80a8-b0420e444303","title":"Glucovery: Privacy-Focused Diabetes Management","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Over 537M diabetics lose CGM data control to centralized silos. No true ownership, selective sharing, or lasting incentives exist. Uncontrolled glucose also drives obesity and cravings.","solution":"Glucovery: Midnight-powered dApp. Own your CGM data in shielded vaults, share only ZK proofs with doctors, earn $GLUCO for healthy glucose habits, redeem for sensors/food. True ownership + incentives.","proposer_name":"Bongisipho Mntambo","proposer_relevant_experience":"GitHub: [https://github\\.com/Innovatomus\\-Prime/glucovery](https://github.com/Innovatomus-Prime/glucovery)\n\nLinkedIn: [https://www\\.linkedin\\.com/in/bongisipho\\-mntambo\\-809021140/](https://www.linkedin.com/in/bongisipho-mntambo-809021140/)\n\ndemo/prototype: [https://glucovery\\-lime\\.vercel\\.app/](https://glucovery-lime.vercel.app/)\n\n**Role and Responsibilities:**\n\n- Architect and build Glocovery core features\n- Design and deploy Midnight smart contracts\n- Implementation of frontend, backend, and API layering\n- Lead product design, UX flow, and integration\n- Manage testing, QA, and security audits\n- Handle community outreach and test user onboarding","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Healthcare","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2363},{"pr_id":"019abc37-bb68-7b62-8643-a7fa40df174b","title":"A privacy-aware three-party escrow dApp with shielded tokens","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"It can be difficult for new devs to understand how to properly mint and transfer shielded tokens to/from contracts, as well as how to make good use of the witnesses and private state.","solution":"A reference dApp showcasing a real use case for witnesses and private state to protect users data through asymmetric encryption, utilising shielded tokens to demonstrate a 3-party escrow system.","proposer_name":"Gabriel Viganotti","proposer_relevant_experience":"Gabriel Viganotti: solo software developer\n\nGitHub: [https://github\\.com/bochaco](https://github.com/bochaco)\n\nLinkedin: www.linkedin.com/in/gabrielviganotti","url":null,"funds":8300,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Education","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2362},{"pr_id":"019abe52-7363-7d4a-9c39-4b0ac907fb70","title":"PyMidnight – Reference DApp & Python SDK for Midnight","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Python developers lack a clear Reference DApp and simple SDK to connect to Midnight and call Compact contracts, making it hard to start building privacy-preserving dApps.","solution":"PyMidnight: a lightweight Python SDK plus a minimal Compact Reference DApp with a simple UI and Lace integration, demonstrating a full end-to-end programmable privacy flow on Midnight.","proposer_name":"Do Duc Chau","proposer_relevant_experience":"**1\\. Do Duc Chau \\- Project Manager**\n\n- **Link**: [https://twitter\\.com/DucChauB](https://twitter.com/DucChauB)\n- **Description**: A blockchain technology enthusiast with deep knowledge of programming and data analysis. He operates multiple nodes including: the BBO pool, Mithril technology, ENO for World Mobile Token, Orcfax Validator Licenses, Midnight, and others.\n\n\n\n**2\\. Le Minh Tri \\- Technical Lead**\n\n- **Link**: [https://www\\.linkedin\\.com/in/le\\-minh\\-tri\\-b9875078/](https://www.linkedin.com/in/le-minh-tri-b9875078/)\n- **Description**: An expert with extensive experience in data science and credit risk, boasting over 12 years of advanced experience in predictive modeling, loan portfolio management, and quantitative analysis within banking, fintech, and e-commerce sectors. He currently serves as the Head of Risk Modeling at one of the leading lending finance companies in Vietnam, where he pioneered the integration of Machine Learning (ML), increasing the accuracy of credit scores by 30%, and designed real-time risk monitoring systems, mitigating millions of dollars in potential losses.\n\n\n\n**3\\. Nguyen Hoang Khai \\- Full Stack Developer**\n\n- **Link**: [https://www\\.linkedin\\.com/in/khai\\-hoang\\-nguyen\\-ba5a9b224/](https://www.linkedin.com/in/khai-hoang-nguyen-ba5a9b224/)\n- **Description**: Over 3 years of experience in API development, system architecture design and implementation, database management and optimization, building business functionality, and system performance and security optimization. Proficient in developing web applications from requirement analysis and programming through to deployment and maintenance.\n\n\n\n**4\\. Anh Huynh Nguyen Huy: Full Stack Developer**\n\n- **Link**: [https://www\\.linkedin\\.com/in/hu%E1%BB%B3nh\\-nguy%E1%BB%85n\\-huy\\-anh\\-b493a7183/](https://www.linkedin.com/in/hu%E1%BB%B3nh-nguy%E1%BB%85n-huy-anh-b493a7183/)\n- **Describe**: AI/ML Engineer with a strong background in Computer Science and hands-on experience implementing AI solutions to create applications with meaningful impact and sustainable value. Proficient in developing and optimizing chatbot systems, integrating Retrieval-Augmented Generation (RAG), and fine-tuning large language models using LoRA and Transfer Learning to achieve high performance even with limited resources. Proficient in Python, Django and FastAPI, with deep expertise in modern AI frameworks such as PyTorch, TensorFlow and YOLOv8, as well as database management with SQL, MySQL and SQLite. Demonstrate excellent problem-solving skills, collaborative thinking, and the ability to manage the entire AI project lifecycle, from data processing and model training to deployment and performance optimization.","url":null,"funds":8000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Developer Tools","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2361},{"pr_id":"019abb80-0099-71bb-bbd0-14ce00a41bbe","title":"Umbra | Privacy-First Prediction Markets on Midnight","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Transparent markets expose positions, enabling copy-trading and herd bias. We lack a mechanism for \"Public Volume, Private Direction\" betting to protect trader intent and ensuring fair outcomes.","solution":"Umbra uses Midnight's ZK Commit-Reveal pattern for private prediction markets. Bet volume is public but direction remains hidden, protecting trader strategy from copy-trading and bias.","proposer_name":"Eric Le","proposer_relevant_experience":"Tung Le Khac Thanh (Eric Le) Role: Lead Full-Stack & Smart Contract Engineer\n\n\n\n**Technical Expertise:**\n\n- Midnight Network Development: Hands-on experience building privacy-first DApps on the Midnight Testnet. Skilled in developing Compact smart contracts and implementing client-side ZK proof generation using the Midnight SDK.\n- Cardano Development: 1+ years of experience delivering dApps and smart contracts using Aiken, Lucid, and Mesh SDK.\n- Non-EVM Development: 2+ years of specialized experience in high-performance chain architecture (Sui, Cosmos,...), providing a strong foundation for managing Midnight's unique state model.\n\n\n\n**Portfolio & Code**: \n\n- Github: [https://github\\.com/tung\\-lee](https://github.com/tung-lee)","url":null,"funds":8000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"DeFi","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2360},{"pr_id":"019ab1b7-acdc-7816-8884-15f011ca8ca0","title":"Midnight Private Subscription Manager (Reference DApp)","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"In web3 DApps, When user makes  subscription to service provider, they (and entire world) can see the subscriber's full wallet balance and the subscription they have made, compromising their privacy.","solution":"We will build a Reference DApp that enables Private, Non-Custodial Recurring Payments. Allowing users to deposit funds into a Subscription Vault and authorize a provider to withdraw funds.","proposer_name":"Sahil Barnwal","proposer_relevant_experience":"Sahil Barnwal (Sole Proposer &amp; Full-Stack Engineer) I will be the sole developer responsible for the end-to-end delivery of this project. My role encompasses the full stack of Midnight application development:\n\n- Smart Contract Engineer: Designing and implementing the recurring_payment.compact contract the ZK circuits.\n- Frontend Developer: Building the Next.js application and integrating the Midnight.js SDK and Lace wallet.\n\nMy Background:\n\n- Functional Programming Expert: As a former Functional Programmer  (2+ years of experience), I have deep expertise in Haskell. Developing various protocols on Cardano. I have also been involved in Audits of various protocols on Cardano.\n- Algorithm Specialist: I am a Kaggle Competition Master (Global Rank: 489), demonstrating elite capability in complex algorithmic problem-solving and optimization.","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Payments","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2359},{"pr_id":"019ac03b-addb-76ba-819c-0c5b6f949dcc","title":"zkVaccine: Privacy-Preserving Vaccination Proof on Midnight","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Proving vaccination status currently requires revealing full medical records, exposing sensitive health data like dates, locations, and other vaccinations unnecessarily.","solution":"zkVaccine enables users to prove \"fully vaccinated for [disease]\" using ZK proofs without revealing their complete vaccination history or personal health information.","proposer_name":"Manh Nguyen","proposer_relevant_experience":"Manh Nguyen - Solo Developer (Full-Stack)\n\n\n\nI will handle all aspects of the project including smart contract development in Compact, TypeScript integration code, demo UI development, Lace wallet integration, testing and quality assurance, documentation and tutorials, and community engagement and project promotion.\n\n\n\nMy 7 years of professional software engineering includes extensive experience writing technical documentation and creating educational content for development teams. As a team lead for 4 years, I regularly produced architecture documents, onboarding guides, and technical specifications that helped junior developers understand complex systems. This experience directly translates to creating high-quality documentation for zkVaccine.\n\n\n\nI have 5 years designing AWS cloud infrastructure and 5 years working with TypeScript and JavaScript in production environments. My GitHub profile at [https://github\\.com/danny\\-nguyen\\-2702](https://github.com/danny-nguyen-2702) demonstrates my coding standards and documentation practices across multiple repositories.\n\n\n\nMy blockchain development experience includes completing the Plutus Pioneer Program, the Cardano Blockchain Course, and most relevantly, the Midnight Developer Academy. The Academy completion demonstrates my proficiency with Compact smart contract development, ZK proof concepts, Lace wallet integration, and Midnight testnet deployment. This is not theoretical knowledge but hands-on experience building and deploying Midnight applications.\n\n\n\nWithin the Catalyst ecosystem, I have served as a Community Reviewer since Fund 9, evaluating hundreds of proposals and understanding what makes technical projects successful. As a Milestone Reviewer since Fund 11, I have assessed project deliverables and understand exactly what constitutes acceptable proof of achievement. This experience means I know how to structure deliverables that meet community expectations and how to document progress clearly.\n\n\n\nVerifiable Links:\n\n- GitHub: [https://github\\.com/danny\\-nguyen\\-2702](https://github.com/danny-nguyen-2702)\n- LinkedIn: [https://www\\.linkedin\\.com/in/manh\\-nguyen\\-a51a3824b/](https://www.linkedin.com/in/manh-nguyen-a51a3824b/)","url":null,"funds":7000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Healthcare","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2358},{"pr_id":"019abbc0-2cfc-79fc-bf74-34ce00db7918","title":"5 Open-Source Privacy dApps on Midnight","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Lack of documentation, examples, and community support for Midnight privacy dApp developers makes learning and deploying dApps difficult.","solution":"Develop 5 open-source dApps on Midnight, leveraging zero-knowledge/privacy features and supporting the Midnight developer community.","proposer_name":"Tran Duc Long","proposer_relevant_experience":"**Mr\\. Tran Duc Long: Full\\-stack Developer/Blockchain Developer**\n\n**Experiences:**\n\n- Head of Technical department at Blockchain Pioneer Student: Responsible for leading blockchain development initiatives, mentoring members, and organizing technical workshops on Cardano smart contracts and dApp development. \n- Cardano Blockchain Development: 3+ years of experience in Cardano dApp and smart contract development with Aiken, Plutus, Lucid, and Mesh SDK integration.\n- EVM Blockchain Development: Over 1 year of experience building confidential dApps and smart contracts using Solidity, Hardhat, Wagmi, Oasis Sapphire, and ROFL for privacy-preserving computation.\n- Midnight Blockchain Development: 3+ months of experience in Midnight dApp and smart contract development with Compact, Midnight SDK\n\n\n\n**Contact:**\n\n- X: [https://x\\.com/tran\\_uc18824](https://x.com/tran_uc18824)\n- LinkedIn:www.linkedin.com/in/longdevbf\n- Github: [https://github\\.com/longdevbf](https://github.com/longdevbf)\n- Email: longtd4work@gmail.com","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Privacy","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2357},{"pr_id":"019a97bb-27e2-767a-aed5-ca47f231f83f","title":"LEGEON — Genesis Onboarding CompactDApp","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Consultant identity, credentials, and rates lack privacy. Web2 exposes PII; Web3 reveals metadata. A private, selective-disclosure onboarding layer is required for decentralized SAP consulting.\n","solution":"A CompactDApp using Midnight to create encrypted consultant profiles, verify credentials off-chain, generate selective-disclosure proofs, and mint a private ProfileNFT for secure onboarding.","proposer_name":"Charles Sklvanitis","proposer_relevant_experience":"**Charles N\\. Sklavanitis — Project Lead / Product Architect**\n\nFounder of Legeon, an emerging decentralized SAP consulting network.\n\nFormer founder of LiquidMedium, a vendor-management platform used for sourcing, procurement, and management of contingent labor for Fortune 500 companies (acquired by CDI).\n\n20+ years of SAP consulting experience (P2P, supplier integration, onboarding workflow design).\n\nResponsible for defining requirements, solution design, privacy model, UI flows, and ensuring alignment with enterprise onboarding realities.\n\nOversees project delivery, documentation, repository structure, and community communication.\n\n**CompactDApp Developer — To Be Sourced From Midnight Community**\n\nA dedicated CompactDApp engineer will be recruited from the Midnight/Cardano developer community.\n\nResponsibilities include: implementing the Compact script, designing the encrypted profile schema, building the proof logic, integrating Glacier + Lace flows, and supporting the reference UI.\n\nThe proposal intentionally avoids outsourcing to third-party vendors; the role is filled through the open-source Compact ecosystem to ensure alignment with Midnight foundations and best practices.\n\n**UI / Frontend Contributor — Supporting Resource \\(Part\\-Time\\)**\n\nFrontend contributor (community-sourced or internal) will develop the minimal reference UI demonstrating the onboarding flow, credential input, and Lace wallet interaction.\n\nSupporting tasks include: test plan execution, API wiring, and documentation.\n\n\n\nAll core development for this CompactDApp will be performed by the identified contributors and not outsourced.\n\nThe Compact scripts, PET logic, contract components, UI integration, and validation workflow will be implemented directly by the Legeon team (founder, Compact/Midnight developer, full-stack engineer, and privacy architect).\n\nThis ensures full alignment with the Midnight: CompactDApps category requirement that core development is executed by the proposal team itself.","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Identity & Verification","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2356},{"pr_id":"019aacee-b883-7b76-bc1f-de0e21028db8","title":"Midnight dApp Starter Kit","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Developers lack an open-source Midnight starter kit, making it hard to learn Compact, integrate wallets, and build privacy-enabled DApps—slowing onboarding and ecosystem growth.","solution":"Create an open-source Midnight dApp Starter Kit including a Compact contract, demo UI, Lace wallet integration, tests, and documentation to help developers quickly learn and build private DApps.","proposer_name":"Nguyễn Văn Hiếu","proposer_relevant_experience":"Team Size: 1\n\nRole: Lead Developer / Architect / Documentation Author\n\n\n\nName: Your Name\n\nGitHub: [https://github\\.com/hieunv6](https://github.com/hieunv6)\n\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/hieu\\-nguyen\\-044aaa201/](https://www.linkedin.com/in/hieu-nguyen-044aaa201/)\n\n\n\nSummary of Experience:\n\nI am an independent full-stack developer with experience in building web applications, smart contracts, and developer tooling. My background includes JavaScript/TypeScript, Rust (optional), Python, and modern frontend frameworks. I actively work with open-source tools and maintain public repositories demonstrating the ability to deliver complete software prototypes end-to-end.\n\n\n\nMy skillset includes:\n\n\n\n- Compact contract development (Midnight)\n- TypeScript / React frontend engineering\n- Wallet integration & dApp architecture\n- Writing developer documentation and tutorials\n- Designing small, functional developer-focused reference applications\n\n\n\nWhy I can deliver this proposal alone:\n\n- The scope aligns well with a single-developer workflow: one Compact contract, one demo UI, a simple test suite, and developer-focused documentation. These are areas I have practical experience in, demonstrated publicly on my GitHub.","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Developer Tools","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2355},{"pr_id":"019abf4e-e9a8-7ca1-97e8-f2883cf9cec4","title":"Proof of Plate: ZK-Compliance Circuit (Starting with Honey)","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"The honey market is plagued by Honey Laundering, depressing prices for honest farmers. Meanwhile, Swiss producers face strict labeling laws but cannot prove premium origin on public blockchains.","solution":"A Reference DApp on Midnight. ZK-proofs to verify that a physical product meets regulatory standards (e.g., Yield per Hive plausibility). We pilot this with a Swiss Honey Farm.","proposer_name":"Pascal Werlen","proposer_relevant_experience":"1. Project Lead & Domain Expert: Pascal Werlen\n\n\n\nRole: Product Owner, Legal Logic (Swiss Law), Testing, and Documentation.\n\n\n\nCompensation: 0 USDM (Pro-Bono). I am donating my time to ensure the project succeeds.\n\n\n\nBackground: Swiss Food Science Student & Beekeeper family background.\n\n\n\n2. Midnight Developer (Recruiting)\n\n\n\nRole: Technical Implementation (Compact Code, Lace Wallet Integration).","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"RWA","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2354},{"pr_id":"019aa52a-8f4f-7d57-86b3-187934c118dd","title":"PsycheCredit: Unsecured Lending App on Midnight ","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"1. The current DeFi system is largely over-collateralized lending, which limits financial access.\n2. On-chain data and sentiment data have not been securely harnessed to expand access to fair credit.","solution":"DApps use AI/ML to analyze wallet behavior, ecosystem roles, and psychological responses secured by Midnight to help determine loans and interest rates, increasing capital efficiency and privacy.","proposer_name":"Duc Chau Do","proposer_relevant_experience":"**1\\. Do Duc Chau \\- Project Manager**\n\n- **Link:** [https://twitter\\.com/DucChauB](https://twitter.com/DucChauB)\n- **Description:** A blockchain technology enthusiast with deep knowledge of programming and data analysis. He operates multiple nodes including: the BBO pool, Mithril technology, ENO for World Mobile Token, Orcfax Validator Licenses, Midnight, and others.\n- **Scope of Work**: Managing the project execution process, on-chain data collection, and API provisioning.\n\n**2\\. Le Minh Tri \\- Technical Lead**\n\n- **Link:** [https://www\\.linkedin\\.com/in/le\\-minh\\-tri\\-b9875078/](https://www.linkedin.com/in/le-minh-tri-b9875078/)\n- **Description:** An expert with extensive experience in data science and credit risk, boasting over 12 years of advanced experience in predictive modeling, loan portfolio management, and quantitative analysis within banking, fintech, and e-commerce sectors. He currently serves as the Head of Risk Modeling at one of the leading lending finance companies in Vietnam, where he pioneered the integration of Machine Learning (ML), increasing the accuracy of credit scores by 30%, and designed real-time risk monitoring systems, mitigating millions of dollars in potential losses.\n- **Scope of Work**: Developing smart contracts, training, and integrating the ML model.\n\n**3\\. Nguyen Hoang Khai \\- Full Stack Developer**\n\n- **Link:** [https://www\\.linkedin\\.com/in/khai\\-hoang\\-nguyen\\-ba5a9b224/](https://www.linkedin.com/in/khai-hoang-nguyen-ba5a9b224/)\n- **Description:** Over 3 years of experience in API development, system architecture design and implementation, database management and optimization, building business functionality, and system performance and security optimization. Proficient in developing web applications from requirement analysis and programming through to deployment and maintenance.\n- **Scope of Work:** UX-UI design, frontend &amp; backend programming, database construction, test case development, and documentation.","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Lending","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2353},{"pr_id":"019abf09-f812-74df-b24f-2b3ad33571de","title":"(MVP) Midnight VAT Guard (MVG)","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"SMEs overshare sensitive financial data to prove VAT compliance. They lack a private, verifiable method. A secure VAT calculator with zero-knowledge proofs solves this.","solution":"We will create a VAT tool where AI sorts transactions and Midnight stores private data and generates zero-knowledge proofs so SMEs can verify VAT totals without sharing raw financial records.","proposer_name":"Mohammad Hasan Akram","proposer_relevant_experience":"# **Mohammad Hasan Akram — Lead Developer **\nB.Sc Electrical Engineering, 10+ years of corporate experience\n\nHasan is a system architect, backend engineer, and blockchain integrator with a decade of experience working in the Middle East across corporate, regulatory, and technical environments. He is the creator and lead developer of Astral Wars, where he built the complete backend infrastructure including Node.js servers, MongoDB systems, event pipelines, authentication, account logic, APIs, and Hive-based on-chain activity logging.\n\nHe has extensive experience in:\n\n- Backend engineering &amp; scalable architectures\n- Blockchain integration (Hive, Web3, Cardano experiments)\n- CI/CD, DevOps, and production deployment\n- Financial logic engines and event-driven systems\n- Data ingestion, analytics, and automated pipelines\n\nHasan will lead all technical components of this project, including architecture, backend development, classification logic, VAT engine, proof-stub implementation, and final integration.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/mohammad\\-hasan\\-akram\\-a81308140/](https://www.linkedin.com/in/mohammad-hasan-akram-a81308140/)\n\n\n\n\n\n# Romaisa Alvi — Frontend &amp; Dashboard Engineer\nB.Sc Computer Science, 5 years of software development experience\n\nRomaisa is responsible for implementing UI/UX components, dashboards, and web-based tools for multiple Surgent Gaming products. She has delivered production-grade dashboards, analytics interfaces, and Web3-enabled user experiences.\n\nHer expertise includes:\n\nModern frontend frameworks\n\nUI/UX design for data-driven dashboards\n\nWallet integrations and Web3 interaction flows\n\nFrontend–backend integration for real-time systems\n\nShe has contributed to public tools such as Surgent Gaming’s products and promoted hive.io, a metrics and analytics platform for the Hive blockchain.\n\nGitHub: [https://github\\.com/Hajime711](https://github.com/Hajime711)\n\nPortfolio: [https://www\\.surgentgaming\\.com/](https://www.surgentgaming.com/)\n\nHive Metrics Platform: [https://promote\\.hive\\.io/](https://promote.hive.io/)","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Business Services","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2352},{"pr_id":"019aab20-6f71-7414-82b3-ac4ce2a72282","title":"Midnight Typeform","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Many dynamic forms today, such as Google Forms or Typeform, ask for your personal data to prevent duplicate registrations. ","solution":"Create a dynamic form system that allows individuals to fill it out anonymously, while ensuring that form data is not duplicated and is only filled out by people authorized to do so.","proposer_name":"Marco Santos","proposer_relevant_experience":"I've been a full-stack developer for over 20 years, specializing in big data, Java, and Go. Passionate about disruptive technologies, for the past few months I've been studying and dedicating myself to developing smart contracts on the Midnight network.\n\n\n\nThe team isn't fully formed yet, but I envision a squad of no more than 5 people.","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"DAO","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2351},{"pr_id":"019ab9df-0fe4-798a-b979-3721000886e8","title":"Glucose ZKP Reference: Private Health Data Proofs","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Patients must share sensitive data entirely to prove compliance e.g. to insurers.This risks total privacy loss.We lack an openSource DApp demonstrating ZKP-powered selective data disclosure for health","solution":"We will build the Glucose ZKP Reference DApp using a Compact contract to prove a specific glucose metric via a ZKP, without revealing the raw readings.","proposer_name":"DataScience computing plc","proposer_relevant_experience":"Our project is led by DataSciencePLC.com, firms with a proven track record of delivering successful, funded projects within the Cardano ecosystem. We have assembled a dedicated, multi-disciplinary team with the perfect blend of blockchain expertise, mobile application development skills, and crucial on-the-ground knowledge of the African market to ensure this project's success.\n\nPlease note that all the core team leaders have experience on previously funded successful projects such as  Blockchain Based Poultry Farm Management [https://milestones\\.projectcatalyst\\.io/projects/1200073](https://milestones.projectcatalyst.io/projects/1200073) Enhancing cardano developer ecosystem with open source tooling [https://projectcatalyst\\.io/funds/11/cardano\\-open\\-developers/enhancing\\-cardano\\-developer\\-ecosystem\\-with\\-open\\-source\\-tooling](https://projectcatalyst.io/funds/11/cardano-open-developers/enhancing-cardano-developer-ecosystem-with-open-source-tooling) Cardano for 100,000+ students [https://milestones\\.projectcatalyst\\.io/projects/1100051](https://milestones.projectcatalyst.io/projects/1100051) and Universal DevTools for Real-time Tracking for 45%+ of Global Websites Support [https://milestones\\.projectcatalyst\\.io/projects/1100282](https://milestones.projectcatalyst.io/projects/1100282)\n\nEsubalew Amenu - Linkedin profile [https://www\\.linkedin\\.com/in/esubalew\\-amenu/](https://www.linkedin.com/in/esubalew-amenu/)\n\nRole: Lead DevOps &amp; Blockchain Developer\n\nResponsibilities: As founder of DataScience computing plc and a Cardano Certified Associate, Esubalew will lead the backend and API development, ensuring a robust and scalable integration between the app and the Cardano blockchain.\n\nExperience:\n\nCurrently working at SingularityNet.io [https://singularitynet\\.io](https://singularitynet.io)\n\nEmail: esubalew.amenu@singularitynet.io\n\nCardano Blockchain Certified Associate (CBCA) - Certificate ID 64a11f630d345a3a7c07d6cb [https://www\\.linkedin\\.com/feed/update/urn:li:activity:7082244090058219520/](https://www.linkedin.com/feed/update/urn:li:activity:7082244090058219520/)\n\nCertified AWS Certified Cloud Practitioner - Certificate ID 0190f75fb2143df9c2798502bdcf751 [https://cp\\.certmetrics\\.com/amazon/en/public/verify/credential/d0190f75fb2143df9c2798502bdcf751](https://cp.certmetrics.com/amazon/en/public/verify/credential/d0190f75fb2143df9c2798502bdcf751)\n\nBSc in Computer Science [https://drive\\.google\\.com/file/d/1jdVCjDgwIPjMnBgvw2jS\\_KkyEl\\_SBKYO/view?usp=drive\\_link,,](https://drive.google.com/file/d/1jdVCjDgwIPjMnBgvw2jS_KkyEl_SBKYO/view?usp=drive_link,,) MSc in Software Engineering [https://drive\\.google\\.com/file/d/1srLK67BwraL95o8DOaD0v0eRPVfsUfXc/view?usp=drive\\_link](https://drive.google.com/file/d/1srLK67BwraL95o8DOaD0v0eRPVfsUfXc/view?usp=drive_link) , BA in Management\n\nFounder of DataSciencePLC.com\n\nMeron Muche (Msc): Linkedin profile [https://www\\.linkedin\\.com/in/meronmuche/](https://www.linkedin.com/in/meronmuche/)\n\nRole: Backend Developer\n\nResponsibilities: Meron will support Esubalew in building and documenting the necessary APIs and server-side logic.\n\nExperience: Contributed on previously funded projects.\n\nApplication &amp; Frontend:\n\nMatiyas Seifu -  Linkedin profile [https://www\\.linkedin\\.com/in/matiyas\\-seifu\\-217345213/](https://www.linkedin.com/in/matiyas-seifu-217345213/)\n\nRole: Lead Mobile Frontend Developer\n\nResponsibilities: As our lead frontend expert, Matiyas will lead all frontend development of the project, implementing the wallet integration and user interface for minting and verification\n\nExperience:\n\nDevelopment experience at iCog Labs [https://www\\.linkedin\\.com/company/18579529/?lipi=urn%3Ali%3Apage%3Ad\\_flagship3\\_profile\\_view\\_base%3Bv05%2BQud4SKKINdlIAtnHYg%3D%3D](https://www.linkedin.com/company/18579529/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base%3Bv05%2BQud4SKKINdlIAtnHYg%3D%3D) , A RC ICT TECHNOLOGIES PLC [https://www\\.linkedin\\.com/company/79763779/?lipi=urn%3Ali%3Apage%3Ad\\_flagship3\\_profile\\_view\\_base%3Bv05%2BQud4SKKINdlIAtnHYg%3D%3D](https://www.linkedin.com/company/79763779/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base%3Bv05%2BQud4SKKINdlIAtnHYg%3D%3D) , A2SV | Africa to Silicon Valley [https://www\\.linkedin\\.com/company/71497247/?lipi=urn%3Ali%3Apage%3Ad\\_flagship3\\_profile\\_view\\_base%3Bv05%2BQud4SKKINdlIAtnHYg%3D%3D](https://www.linkedin.com/company/71497247/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base%3Bv05%2BQud4SKKINdlIAtnHYg%3D%3D) , WhiteHat It Solution and Eskalate technologies [https://www\\.linkedin\\.com/company/65610760/?lipi=urn%3Ali%3Apage%3Ad\\_flagship3\\_profile\\_view\\_base%3Bv05%2BQud4SKKINdlIAtnHYg%3D%3D](https://www.linkedin.com/company/65610760/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base%3Bv05%2BQud4SKKINdlIAtnHYg%3D%3D)\n\nProficient in backend technologies and database management systems. Extensive experience in developing scalable and efficient blockchain related backend solutions.\n\nCertified AWS Certified Cloud Practitioner - Certificate ID 84d15c10-e267-4a5f-a94b-c7a73b0364fa [https://www\\.credly\\.com/badges/84d15c10\\-e267\\-4a5f\\-a94b\\-c7a73b0364fa/linked\\_in\\_profile](https://www.credly.com/badges/84d15c10-e267-4a5f-a94b-c7a73b0364fa/linked_in_profile)\n\nQuality Assurance:\n\nFikirte Gejo - Telegram [https://t\\.me/Realhabeshawit](https://t.me/Realhabeshawit)\n\nRole: QA Specialist\n\nResponsibilities: Fikirte will oversee all testing phases, from smart contract validation to the closed beta test and post-launch monitoring, ensuring a bug-free and reliable final product.\n\nAll staff members- website link [https://datascienceplc\\.com/](https://datascienceplc.com/) will support in developing the responsive UI components and will build the public verification webpage\n\nEngagement and Communications\n\nOur team is deeply embedded in the African Cardano community. Esubalew is an active member of the &quot;Cardano Ethiopia&quot; Telegram group, and we regularly participate in local developer meetups like &quot;CodeNight Addis.&quot; This provides us with direct channels for feedback, beta testers.","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Privacy","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2350},{"pr_id":"019aa0c8-682e-7cb0-a1ee-bef19f846c44","title":"Proof of Humanity Dapp on Midnight","event_id":16,"objective":43,"objective_title":"Midnight: Compact DApps","summary":"Online systems struggle to differentiate humans from bots without collecting sensitive personal information. CAPTCHAs are weak, intrusive, and often fail. More advanced identity systems required.","solution":"To builds a fully open-source, functional reference DApp that allows a user to prove they are a real human through zkp, verified by a Compact contract on Midnight without revealing any biometric data.","proposer_name":"Mahaprasad Martha","proposer_relevant_experience":"It's only Individual applying for the project\n\nName:- Mahaprasad Martha\n\nRole:- Full stack developer\n\nLinkedIn:- www.linkedin.com/in/mahaprasad-martha-502019330","url":null,"funds":10000,"currency":"token:usdm","extra":null,"links":null,"open_source":true,"score":null,"author":null,"tags":"Identity & Verification","public_key":null,"files_url":null,"has_reviewed":false,"row_id":2349}],"page":{"page":0,"size":20,"total":724}}