{"pr_id":"019ac37f-73f7-7563-8379-22805da84265","title":"MidnightAlpha Cardano L2 brand marketing, onboarding, & edu.","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Lack of liquidity and useage on Cardano, as stated by community members in public forums over the last 6 months.","solution":"Midnight is a Selective Privacy blockchain built on Cardano  goes live Dec. 8th. We want to onboard and educate new professional users with MidnightAlpha brand to drive use and liquidity to Cardano.","proposer_name":"John Santi (X = johnny5i) (Github = bytewizard42i) | CEO EnterpriseZk Labs LLC","proposer_relevant_experience":"John Santi (johnny5i)\n\n(@realjohnsanti on X)\n\n(Github =  bytewizard42i)\n\nCEO of EnterpriseZK Labs LLC\n\nenterprisezk.com\n\n- 4-time Midnight hackathon winner, including the London Midnight Summit for Ai track\n- Cardano certified blockchain associate\n- Emurgo certified blockchain business consultant\n- High-level theoretical blockchain systems architect\n- Owner of MidnightAlpha, BlockchainToday, CryptoFinancialWorld, Today's Ai, and Fabulous F (Fashion and luxury brand publication)","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"MidnightAlpha Cardano L2 brand marketing, onboarding, & edu.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"John Santi (X = johnny5i) (Github = bytewizard42i) | CEO EnterpriseZk Labs LLC","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":4,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Lack of liquidity and useage on Cardano, as stated by community members in public forums over the last 6 months.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Midnight is a Selective Privacy blockchain built on Cardano  goes live Dec. 8th. We want to onboard and educate new professional users with MidnightAlpha brand to drive use and liquidity to Cardano.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://medium.com/tap-in-with-taptools/breaking-down-the-midnight-nightpaper-2ddf8c9afdfb","https://timestabloid.com/midnight-is-a-game-changer-for-cardano-ada-heres-why/","https://www.okx.com/en-us/learn/cardano-midnight-privacy-efficiency-blockchain","https://docs.midnight.network/learn/introduction/what-is-midnight"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"apache 2.o fully open sourced","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Education","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We intend to attract, onboard, and educate fresh B2B, B2C, and B2G professionals, organizations, and entities from traditional web2 arenas in the extraordinary benefits of leveraging Midnight Network Blockchain, Cardano's first partnerchain, which boasts being the world's first selective privacy blockchain built on the robust and resilient backbone of the Cardano Network. We will leverage our MidnightAlpha brand channels in social media outlets such as X, LinkedIn, Discord, Instagram, Facebook, and Reddit to attract curious professionals, government employees, politicians, and others in medical, voting, and asset management","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"- Daily news aggregation of Cardano, Midnight, Crypto, and macro economic updates and breaking news that will interest those in the financial, government, and professiona sectors that we are targetting.\n- Clever, informative, and sometimes humorous morsels that people will enjoy reading and come to depend and trust our channel.\n- Weekly informative news reels updating busy professionals on the TL;DR of the week's macro economic events, an our take on them.\n- Weekly X Spaces designed bring in the curious and give them the resources to start their new journey in Midnight, Cardano, and web3.\n- Constant showcasing of upcomin and advancing projects within the Midnight, Cardano, web3, and tech community, that will serve to educate iindividuals on the potential of Midnight and Cardano.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"We live and die by data. \n\n\n\nWe intend to track our metrics in followers, links, interactions, a/b testing, and to make all the information public in a github repository for MidnightAlpha.\n\n\n\nOur goal is to attract and onboard professionals that are already in industries that could benefit from Midnight and Cardano technology, but may not be aware that we hold the potential solutions.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"MidnightAlpha brand channels, videos, news, and education will be the funnel by whic we attract an entire new segment of the professional public to Midnight and Cardano. With Cardano's rubst security and resilience, and Midnight's selective privacy functionality, I is a homerun solution forompanies looking for web3 solutions with auditability, compliance, and selective privacy baked in!\n\nThey just need to be made aware of it. And we will accomplish thi with the following:\n\n- Daily enlightening educational tidbits wrapped in memes, clever analogies, examples, and filled with humor. These bits will educate those on basice fundamentals of blockchain. We believe that an educated consumer is the best consumer!\n- Daily news aggregation that affects all professionals, and highlighting how web3 solutions can be the answer to some if not all of these issues.\n- Weekly news update reels\n- Weekly iteractive X spaces for newbies and professionals to ask about adapting Cardano and Midnight to thier business models, \"Reimagining all the world's digital systems\".\n- Becoming a source of truth and news that our growing community of varied business professionals will come to rely on and enjoy.\n- A generous daily protion of resources and educational links and invitations to get the curious plugged into the ecosystem where they can thrive and grow.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Listen guys, On December 8th, the lights come on at Midnight. If we play our cards right, we cn drive enterprise corporations, institutions, and governments to Midnight to reimagine everything that they have been doing up till now. MidnightAlpha brand channels will be the onboarding and educational funnel, getting our curious new friends to the right resources for effective adoption. This adoption will bring liquidity to Midnight, and therefore Cardano, as every Midnight SPO must also be a Cardano SPO, as they are partner chains. Everything that is good for Midnight directly benefits Cardano.\n\nMidnight's Light go on December 8th, and we can really drive businesses that have had no options in web3 until now. Not only will the lights come on at Midnight, but Midnight will make the lights in Cardano shine brighter than ever.\n\nGive us 4 months to show you all what we can do!","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Existing capabilities & why I’m well suited to deliver this project\n\n\n\nI’m an active builder and advocate in the Cardano and Midnight ecosystems, with a specific focus on privacy-preserving, real-world use cases. Over the past years I’ve:\n\n\n\nParticipated in multiple Midnight and Cardano hackathons, including building prototypes that use selective privacy and zero-knowledge proofs.\n\n\n\nDeveloped and refined concepts and architectures for decentralized identity, medical data sharing, and financial/privacy tools on Cardano/Midnight.\n\n\n\nBuilt and led community-facing educational initiatives, ranging from presentations and demos to long-form explanatory content aimed at non-technical professionals.\n\n\n\nThis project—using Midnight Alpha to onboard financial, medical, and other professionals—sits exactly at the intersection of what I already do: translating advanced privacy tech (ZKPs, selective disclosure, partner-chain architecture) into clear, trustworthy workflows that real-world professionals can understand and adopt.\n\n\n\nFrom a technical and product perspective, I bring:\n\n\n\nHands-on experience with the Midnight stack (Alpha devnet environment, documentation, privacy concepts, and the Cardano–Midnight relationship).\n\n\n\nStrong conceptual background in compliance-sensitive domains, especially finance and healthcare, where privacy, auditability, and consent are critical.\n\n\n\nThe ability to design step-by-step onboarding journeys: from high-level education → interactive demos → guided pilots → feedback loops and refinements.\n\n\n\nFrom a communication and adoption perspective, I specialize in:\n\n\n\nExplaining Midnight not just as “tech” but as a solution to real problems: data minimization, regulatory risk, professional liability, and client privacy.\n\n\n\nTailoring messaging for different professional audiences (financial advisors, compliance officers, clinicians, administrators, etc.).\n\n\n\nCreating structured materials (slide decks, one-pagers, walkthroughs, use-case maps) that these professionals can share internally within their organizations.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Getting setup: making the metrics and getting ready for the push","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Creating tests and metrics calculators for the channels and assets in order to produce the neccesary data for milestones. The community will be able to see what I have created and it will be open source","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"This proposal will be considered successfully delivered if:\n\n\n\nPublic GitHub repository is live and documented\n\n\n\nA dedicated repo (e.g., midnight-professional-onboarding-metrics) is created and the link is shared in the final report.\n\n\n\nThe repo includes a clear README.md explaining:\n\n\n\nThe project purpose\n\n\n\nWhat metrics are tracked\n\n\n\nHow data is collected and updated\n\n\n\nMetrics are consistently recorded and version-controlled\n\n\n\nA /metrics directory contains structured data (CSV/JSON/Markdown) with, at minimum:\n\n\n\nNumber of workshops / sessions delivered\n\n\n\nNumber of participants per session\n\n\n\nBreakdown by professional type (financial, medical, other)\n\n\n\nNumber of Midnight Alpha demos completed\n\n\n\nNumber of organizations requesting follow-up or pilots\n\n\n\nMetrics files are updated on a regular schedule (e.g., after each workshop or at least monthly) with clear timestamps.\n\n\n\nSummary dashboards / reports are available in the repo\n\n\n\nA /reports or /analysis folder includes:\n\n\n\nAt least one summary report of outcomes (e.g., FINAL_REPORT.md or similar)\n\n\n\nHigh-level KPI summaries and charts (even simple Markdown tables or basic visualizations).\n\n\n\nData is anonymous and compliant with privacy best practices\n\n\n\nNo personal identifying information of participants is stored.\n\n\n\nOnly aggregate or anonymized data is published (e.g., counts, categories, and high-level feedback themes).\n\n\n\nLinkage to Catalyst reporting\n\n\n\nThe final Catalyst report references this GitHub repo as the primary source of metrics, so reviewers can independently verify:\n\n\n\nActivities performed\n\n\n\nMeasured outcomes\n\n\n\nAlignment with the Education theme and onboarding goals.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence of completion of Milestone 1\n\n\n\nMilestone 1 – Design and preparation of educational materials for professional onboarding to Midnight\n\n\n\nThis milestone will be considered complete when the following evidence is available:\n\n\n\nPublic GitHub repository with education assets\n\n\n\nA dedicated repo (e.g. midnight-professional-onboarding) containing:\n\n\n\n/curriculum folder with structured outlines for at least two tracks:\n\n\n\nFinancial professionals\n\n\n\nMedical / healthcare professionals\n\n\n\n/slides folder with the finalized slide decks in source format (e.g. .pptx/.key or exported .pdf).\n\n\n\n/labs folder with step-by-step Midnight Alpha hands-on exercises, including prerequisites and clear instructions.\n\n\n\nDocumented learning objectives and session plans\n\n\n\nA CURRICULUM_OVERVIEW.md (or similar) in the repo, listing:\n\n\n\nLearning objectives for each track.\n\n\n\nSession structure (e.g. 60–90 minute format, topics per section).\n\n\n\nHow each session introduces Midnight and its benefits for Cardano in a professional context.\n\n\n\nReady-to-run workshop kit\n\n\n\n\n\n\n\nLinks to the education repo and key files.\n\n\n\nDate of completion.\n\n\n\nOnce these items are live and linked, reviewers can independently verify that all core educational content and Midnight Alpha demos needed for onboarding are fully prepared before moving to live sessions.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"onboarding","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This project delivers a structured onboarding journey that takes financial, medical, and other professionals from “I’ve heard of Cardano” to “I understand how to responsibly use Midnight in my work.” We design short, role-specific learning paths that explain Midnight as Cardano’s selective-privacy partner chain, why that matters for compliance, data protection, and client trust, and how simple example flows can be implemented using Midnight Alpha. Onboarding happens through live workshops, hands-on labs, and clear follow-up playbooks that participants can take back to their organizations. Success is measured by the number of professionals trained, Midnight Alpha demos completed, and organizations that request deeper pilots.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Acceptance will be based on clear, verifiable onboarding results. The project is successful if: (1) At least 120 professionals (finance, medical, and related fields) attend one or more Midnight education sessions; (2) A minimum of 60 participants complete at least one guided Midnight Alpha hands-on demo; (3) At least 8 workshops/webinars are delivered, with agendas and materials published in a public GitHub repo; (4) At least 5 organizations request follow-up conversations or pilots; (5) All onboarding metrics (attendance, demos completed, organization interest, qualitative feedback themes) are recorded in the public metrics repository and referenced in the final Catalyst report.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence of completion will be provided through transparent, verifiable artifacts. All educational assets (curricula, slide decks, lab guides) and facilitator notes will be stored in a public GitHub repo dedicated to this project. For each workshop/webinar, we will maintain dated attendance logs (anonymized), session agendas, and links to the exact materials used. Completion of hands-on Midnight Alpha demos will be documented via simple checklists or short post-session summaries in the repo. Organizations requesting follow-up or pilots will be counted and recorded in aggregate, with non-sensitive notes on their sector and interest. A final FINAL_REPORT.md in the metrics repo will summarize activities, KPIs, lessons learned, and links to all relevant files, allowing Catalyst reviewers to independently verify that the onboarding goals were met.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"growing the flowers: education, resources","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Evidence of completion will be provided through transparent, verifiable artifacts. All educational assets (curricula, slide decks, lab guides) and facilitator notes will be stored in a public GitHub repo dedicated to this project. For each workshop/webinar, we will maintain dated attendance logs (anonymized), session agendas, and links to the exact materials used. Completion of hands-on Midnight Alpha demos will be documented via simple checklists or short post-session summaries in the repo. Organizations requesting follow-up or pilots will be counted and recorded in aggregate, with non-sensitive notes on their sector and interest. A final FINAL_REPORT.md in the metrics repo will summarize activities, KPIs, lessons learned, and links to all relevant files, allowing Catalyst reviewers to independently verify that the onboarding goals were met.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Evidence of completion will be provided through transparent, verifiable artifacts. All educational assets (curricula, slide decks, lab guides) and facilitator notes will be stored in a public GitHub repo dedicated to this project. For each workshop/webinar, we will maintain dated attendance logs (anonymized), session agendas, and links to the exact materials used. Completion of hands-on Midnight Alpha demos will be documented via simple checklists or short post-session summaries in the repo. Organizations requesting follow-up or pilots will be counted and recorded in aggregate, with non-sensitive notes on their sector and interest. A final FINAL_REPORT.md in the metrics repo will summarize activities, KPIs, lessons learned, and links to all relevant files, allowing Catalyst reviewers to independently verify that the onboarding goals were met.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence of completion will be provided through a public, verifiable trail of artifacts. The education hub (GitHub repo or website) will contain the finalized curricula, slide decks, and lab guides, each with timestamps and version history. For every education session, we will publish an entry with the date, agenda, materials used, and anonymized attendance summary. The resources section will show a live list of official Midnight/Cardano docs and vetted explainers, with a visible update log to confirm monthly curation. The news-aggregation stream will have an accessible archive (e.g., dated digests or feed entries) demonstrating consistent, trustworthy coverage. Entertainment and engagement outputs (AMAs, short clips, themed sessions) will be listed with links to recordings or posts. A final FINAL_REPORT.md (or equivalent page) will summarize what was delivered, link to all sections, and map each acceptance criterion to the specific evidence item, allowing reviewers to independently verify completion.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"John Santi (johnny5i)\n\n(@realjohnsanti on X)\n\n(Github =  bytewizard42i)\n\nCEO of EnterpriseZK Labs LLC\n\nenterprisezk.com\n\n- 4-time Midnight hackathon winner, including the London Midnight Summit for Ai track\n- Cardano certified blockchain associate\n- Emurgo certified blockchain business consultant\n- High-level theoretical blockchain systems architect\n- Owner of MidnightAlpha, BlockchainToday, CryptoFinancialWorld, Today's Ai, and Fabulous F (Fashion and luxury brand publication)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Full time marketing, onboarding, news agregation, video creation, x space hosting, as well as resource preparations, research, and other initiatives within the scope of this comprehensive project for the MidnightAlpha brand.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Our budget represents a full time marketing, onboarding, education, video, and news aggregation initiative that will be 40 hours a week for 4 months, with a/b testing where appropriate and metrics tracking for accountability. We beiever that this will be an invaluable asset to the community, and the new onboarded users and businesses. We will be leveraging a first to maket advvantage for selective privacy of Midnight while also serving the community in a variety of ways.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Education","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1645}