{"pr_id":"019ac343-328b-7abb-814a-ed220b22fab7","title":"AnyToAny: The Universal Liquidity Router for Cardano","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"There's no simple way for a deFi user on Ethereum to get to Cardano AND there's no simple way for Cardano tokens to expand to new ecosystems. ","solution":"AnyToAny breaks down the barriers between Cardano and EVM by acting as the universal liquidity layer and router. Dapps can now truly go multichain on one unified front-end. ","proposer_name":"VIA Labs LLC","proposer_relevant_experience":"Robert - “Cletus” - Co-founder / COO\n\nRobert leads VIA Labs’ operations and strategy, bridging teams with his experience on multi-million-dollar solar projects. He holds a BS and MS in Electrical Engineering and is the glue between the development team and strategic pursuits.\n\nRobert will coordinate development efforts and work with Jake with BD and project involvement.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/robert\\-pilat/](https://www.linkedin.com/in/robert-pilat/)\n\nAndre - “Druuu” - CTO\n\nAndre is a full-stack developer with a strong track record in the medical and fintech sectors. He has built diverse backend tools, is proficient in frameworks like React, Nuxt, Next, and Vue, and is exploring AI technology and wallet abstraction.\n\nAndre will lead the technical-side of the integration.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/andrea\\-verri\\-712a6783/](https://www.linkedin.com/in/andrea-verri-712a6783/)\n\nRaymond - “Atlas” - Co-Founder / CSO\n\nRaymond brings 20+ years of enterprise experience in development, security, operations, Agile, management, and consulting, specializing in complex systems engineering. He has scaled teams from 5 to 75 employees and managed high-traffic, regulated platforms in fintech, education, and ecommerce.\n\nRaymond will do the back-end and smart contracts.\n\nX Page: [https://x\\.com/Atlas\\_VIA](https://x.com/Atlas_VIA)\n\nJake - &quot;Jake&quot; - VP Operations / Head of BD\n\nJake drives business development at VIA Labs, using his background as a senior conductor on the British railway system to forge strategic partnerships in blockchain. His logistical and people management skills have been key to the company’s growth.\n\nJake will work with project teams in BD to help bring their tokens cross-chain from EVM to Cardano and vice versa.\n\nBrad - &quot;Bert&quot; - Full Stack Development\n\nBert swapped sports science for front-end development, bringing a performance-driven mindset from South Africa. A perpetual learner, he tackles tough CSS and JavaScript challenges head-on, ensuring VIA Labs’ interfaces are both intuitive and lightning-fast.\n\nBrad will supply the front-end for AnyToAny on both testnet and mainnet.","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"AnyToAny: The Universal Liquidity Router for Cardano","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"VIA Labs LLC","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":5,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"There's no simple way for a deFi user on Ethereum to get to Cardano AND there's no simple way for Cardano tokens to expand to new ecosystems. ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"AnyToAny breaks down the barriers between Cardano and EVM by acting as the universal liquidity layer and router. Dapps can now truly go multichain on one unified front-end. ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://vialabs.io/","https://developer.vialabs.io/general/technology-overview","https://github.com/VIALabs-io","https://x.com/VIA_Labs"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Open-source components will be released under Apache-2.0 or MIT; the underlying infrastructure (routing, pathfinding, etc.) will remain under a proprietary VIA Labs commercial license.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Cross-chain","group":"Interoperability"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"AnyToAny will be a example of what can be built on top of VIA Labs’ VIA Network, the cross-chain interoperability layer VIA is finalizing on Cardano. AnyToAny is unique because it leverages both swapping and aggregation: projects that go cross-chain with VIA Labs are natively added into AnyToAny, but AnyToAny is also flexible. Projects or protocols that opt for different cross-chain solutions can still be aggregated through AnyToAny, making it a universal liquidity layer that DeFi users and protocols can leverage to swap between EVM and Cardano ecosystems. Other existing protocols do NOT have this kind of cross-chain aggregation and do not offer the same flexibility (speed, security) to integrating parties.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"This grant will enable an advanced mainnet MVP for AnyToAny including a \"Universal Frontend\" for cross-chain tokens hosted by VIA Labs.\n\n\n\nThe final product will demonstrate a live swap from an EVM mainnet (ETH, Base, Avax, etc.) to Cardano mainnet. \n\n\n\nTransaction Flow:\n\nAssume the user has USDC on Base and wants to swap into cross-chain memecoin X on Cardano\n\n- The system swaps USDC -> ETH -> memecoin X (via its EVM Aggregator).\n- The system bridges memecoin X (Base) -> memecoin X (Cardano)\n\n\n\nAs low-slippage cross-chain liquidity routes become available, AnyToAny will have the tooling to route through those specific routes.\n\n\n\nThis will be able to be accessed from a public URL (e.g., cardano-pilot.anytoany.io) and a GitHub repo for the integration contracts.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"- **Volume:** >$100,000 USD in cross-chain volume routed to Cardano tokens within the first 3 months of Mainnet beta.\n- **Integrations:** Successful API binding with at least 1 major Cardano DEX Aggregator and 1 major EVM Aggregator.\n- **Token Support:** \"Whitelisting\" of at least 5 top Cardano assets (e.g., SNEK, WMT, AGIX) available for purchase from EVM chains on Day 1.\n- **Speed:** End-to-end cross-chain swap completion in <3 minutes (constrained by Cardano block times, but optimized).","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The Problem: Cardano liquidity is trapped. EVM users find it too hard to buy Cardano tokens. \n\nThe Solution: An aggregation router that connects the two worlds.\n\n\n\nThis can be broken down into three simple steps:\n\n1. EVM Aggregation: AnyToAny will scan leading EVM DEXs to get the best price for the user's input token (e.g., PEPE on ETH) into the bridgeable asset.\n2. VIA Transport: AnyToAny will use VIA's secure message passing to move the value to Cardano. Routing through the cross-chain token itself (if its on both chains already) OR an optimal bridging token (usually stablecoins)\n3. Cardano Aggregation: We trigger a smart contract on Cardano that utilizes local liquidity (e.g DEXHunter/MinSwap) to buy the specific asset the user requested. This removes the \"Bridge Dilemma\" where users have to manually hop between 4 different dApps just to buy one token.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"- **New Capital Inflows:** This is a direct pipe for EVM capital to enter Cardano. It lowers the barrier to entry for retail investors who want exposure to Cardano ecosystem tokens but have been reluctant to learn the Cardano ecosystem. AnyToAny puts everything in one place for these users.\n- **RWA Utility:** Real-World Asset projects can use AnyToAny to enable purchases from other blockchains into Cardano -- increasing their addressable market.\n- **DEX Volume:** By routing orders through Cardano DEX aggregators, AnyToAny generates fee revenue for the entire underlying Cardano DeFi stack (LPs &amp; Aggregators).","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"VIA Labs is a cross-chain intereropabilty protocol that has been building for 4+ yeras. We've sent over 20M cross-chain messages, and are live on over 140 different blockchain ecosystems. We're working in collaboration with the Midnight Foundation to enable cross-chain messaging between Cardano &amp; Midnight and have successfully demonstrated this at the Midnight Summit in London (Nov 2025). See the video link here: [https://www\\.youtube\\.com/live/1vphhGXf5VA](https://www.youtube.com/live/1vphhGXf5VA) Fast forward to 17:20 for the start of the presentation and 27:00 for the demo itself.\n\nOutside the Cardano ecosystem, our team has received grants from titans in the space such as Circle, Avalanche, and Stellar to expand cross-chain interoperability to those ecosystems or build out novel products. For example, VIA Labs was the first protocol to deploy Circle's Bridged USDC Standard and worked with them to develop their methodology for approving github requests. We've also gracefully tied to together Avalanche's built-in cross-chain messaging platform, ICM, with Circle's CCTP, demonstrating our expertise at working on external (non-VIA) cross-chian messaging solutions and tying them together with VIA products.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Universal Front-End (Testnet)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Deployed cross-chain token smart contracts between both EVM and Cardano with the AnyToAny basic front-end.\n\nSupporting:\n\n- Selecting source chain, token on source chain, destination chain, and token on destination chain\n- Sending a cross-chain token from EVM testnet to Cardano preprod testnet","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The acceptance criteria shall be that a user can connect their wallets (EVM and Cardano testnets), select tokens, and execute a transfer to/from EVM testnet and Cardano testnet without any critical blockers on UI / UX.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- AnyToAny testnet URL live. \n- Completed transaction hashes receipt on both an EVM testnet explorer and a Cardano testnet explorer.\n- Short video demo + README describing how to use the testnet UI.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cardano Swap Capability + DEX Aggration Tie In","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Cardano-side router/adapter that can call a Cardano DEX aggregator (e.g., DexHunter).\n- Front-end flow updated to support “bridge-in → swap on Cardano” with slippage controls and output preview.\n- Route estimation using aggregator quotes.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The acceptance criteria shall be that a user on Cardano testnet will be able to:\n\n\n\n- Bridge a token into Cardano preprod testnet and swap it via a Cardano DEX aggregator in a single guided flow.\n- Swaps show minimums out / basic slippage parameters in the UI.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Contract/adapter repo published.\n- Transaction hashes showing at least 5 successful “bridge + swap” routes through a DEX router or DEX. \n- Screenshots/video of the full “EVM → Cardano → swapped token” testnet flow.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Major EVM Chains + EVM Aggregation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Support for at least two major EVM chains (e.g., Ethereum + Base/Arbitrum).\n\n\n\nAdapter to at least one EVM DEX aggregator.\n\n\n\nRouting logic that allows:\n\n- EVM token → Cardano token (with Cardano swap).\n- Cardano token → EVM token (with optional EVM swap).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A user on testnet can:\n\n\n\n- Go from EVM chain A token → Cardano token via AnyToAny.\n- Go from Cardano token → EVM chain B token via AnyToAny.\n- The route selection respects the user configured caps and slippage from the UI.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- List of supported EVM chains and tokens documented.\n- Tx hashes for at least 5 multi-chain routes covering both directions and both EVM chains.\n- Updated docs showing how to call these routes via SDK/API.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cross-Chain Aggregation of at Least One Alternate Route","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Integration with at least one alternate cross-chain route for a specific token (existing bridge or token-specific infra).\n\nRouting policy that can choose between:\n\n- Pure VIA route.\n- Alternate route (or a combination).\n\n\n\nBasic monitoring for alternate routes including fee estimation and approximate timing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"For the chosen token, the router can successfully execute a cross-chain transfer using either:\n\n\n\n- The native VIA Network path\n- Alternate infra path\n\n\n\nThe UI shall not demonstrate any critical failures when switching between paths under test conditions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Code for alternate-path adapter and routing policy committed.\n- Tx hashes showing at least 5 routes that use the alternate path and 5 that use VIA for the same asset.\n- Short technical note explaining when/why each path is chosen.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mainnet Launch + Developer Documentation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Mainnet deployment of Cardano router/adapter contracts and EVM-side pieces for the supported chains.\n- Public integration documentation showing how a dApp would use AnyToAny's API.\n- Production-ready mainnet front-end.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Mainnet UI can execute:\n\n\n\n- EVM → Cardano → final token routes.\n- Cardano → EVM routes.\n\n\n\nAt least 2 external partners (wallet/dapp/token team) have integrated and are listed on AnyToAny. \n\n\n\nDocumentation that demonstrates how a dApp can integrate and submit a request to add their token to AnyToAny's front-end.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Mainnet URLs (UI + docs), SDK published (e.g., NPM package).\n- Mainnet tx hashes showing at least 10 successful routes across supported chains.\n- Confirmation from at least 2 integrator projects (short written statements or public posts) that they are live or in active integration using AnyToAny.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Robert - “Cletus” - Co-founder / COO\n\nRobert leads VIA Labs’ operations and strategy, bridging teams with his experience on multi-million-dollar solar projects. He holds a BS and MS in Electrical Engineering and is the glue between the development team and strategic pursuits.\n\nRobert will coordinate development efforts and work with Jake with BD and project involvement.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/robert\\-pilat/](https://www.linkedin.com/in/robert-pilat/)\n\nAndre - “Druuu” - CTO\n\nAndre is a full-stack developer with a strong track record in the medical and fintech sectors. He has built diverse backend tools, is proficient in frameworks like React, Nuxt, Next, and Vue, and is exploring AI technology and wallet abstraction.\n\nAndre will lead the technical-side of the integration.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/andrea\\-verri\\-712a6783/](https://www.linkedin.com/in/andrea-verri-712a6783/)\n\nRaymond - “Atlas” - Co-Founder / CSO\n\nRaymond brings 20+ years of enterprise experience in development, security, operations, Agile, management, and consulting, specializing in complex systems engineering. He has scaled teams from 5 to 75 employees and managed high-traffic, regulated platforms in fintech, education, and ecommerce.\n\nRaymond will do the back-end and smart contracts.\n\nX Page: [https://x\\.com/Atlas\\_VIA](https://x.com/Atlas_VIA)\n\nJake - &quot;Jake&quot; - VP Operations / Head of BD\n\nJake drives business development at VIA Labs, using his background as a senior conductor on the British railway system to forge strategic partnerships in blockchain. His logistical and people management skills have been key to the company’s growth.\n\nJake will work with project teams in BD to help bring their tokens cross-chain from EVM to Cardano and vice versa.\n\nBrad - &quot;Bert&quot; - Full Stack Development\n\nBert swapped sports science for front-end development, bringing a performance-driven mindset from South Africa. A perpetual learner, he tackles tough CSS and JavaScript challenges head-on, ensuring VIA Labs’ interfaces are both intuitive and lightning-fast.\n\nBrad will supply the front-end for AnyToAny on both testnet and mainnet.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Total request: 200,000 ADA\n\n\n\nTime denoted in man-days / person-days\n\n\n\nPer milestone:\n\n\n\n**Milestone 1 \\- Universal Front\\-End \\(Testnet\\)**\n\n- 50,000 ADA\n- Month 1: Deployed cross-chain smart contracts on EVM &amp; Cardano w/ Front-end\n- System architect: 2, blockchain engineer: 10, front-end dev: 20, PM: 3\n\n**Milestone 2 \\- Cardano Swap Capability \\+ DEX Aggration Tie In**\n\n- 40,000 ADA\n- Month 2: Cardano adapter that can call a Cardano-native DEX aggregator\n- System architect: 2, blockchain engineer: 15, front-end dev: 10, PM: 3\n\n**Milestone 3 \\- Major EVM Chains \\+ EVM Aggregation**\n\n- 40,000 ADA\n- Month 3: EVM adapter that can call an EVM DEX aggregator\n- System architect: 2, blockchain engineer: 15, front-end dev: 10, PM: 3, BD: 5\n\n**Milestone 4 \\- Cross\\-Chain Aggregation of at Least One Alternate Route**\n\n- 35,000 ADA\n- Month 4: Addition of another cross-chain provider for routinh\n- System architect: 2, blockchain engineer: 15, front-end dev: 10, PM: 3, BD: 5\n\n**Milestone 5 \\- Mainnet Launch \\+ Developer Documentation**\n\n- 35,000 ADA\n- Month 5: Launch of mainnet, documentation, and Catalyst close-out report + video.\n- System architect: 1, blockchain engineer: 15, front-end dev: 3, PM: 3, BD: 5","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The relative ask is low compared to what has already been built and the expertise our team is bringing to Cardano. The hardest part of any integration is getting the VIA Network itself deployed and battle-tested. Because VIA is already working with Midnight to enable cross-chain connectivity between Midnight and Cardano, most of the heavy lifting and core infrastructure cost for bringing VIA to Cardano has already been absorbed outside of this proposal. VIA has spent years, along with non-Cardano grant support, building and hardening this cross-chain infrastructure; we’re not asking Catalyst to fund that again.\n\n\n\nThis proposal is specifically for the Cardano-facing work required to make AnyToAny a practical, ecosystem-wide tool: Cardano routing, integrations with Cardano and EVM DEX aggregators, the universal front-end, SDKs, documentation, testing, and a focused security review. That work directly benefits the entire ecosystem. DeFi users get a simple routing platform to move into and trade within Cardano without juggling multiple bridges and UIs. Protocols get a clear path to go cross-chain and list their tokens so users can actually trade them. DEX aggregators on Cardano gain additional routed volume through their existing liquidity, rather than competing with a new silo. Even other cross-chain protocols benefit: if they have deep, reliable pools, the AnyToAny router can choose their liquidity when it produces the best route.\n\n\n\nIn short, funding AnyToAny is funding the Cardano integration layer on a proven cross-chain engine, turning it into reusable public infrastructure for the ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Cross-chain","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1646}