{"pr_id":"019ac352-7ff1-7f47-a0c0-81bd42c05755","title":"RealFi CredID: Cardano-Powered RealFi for Students","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"In LATAM, 70% of 210M students lack formal credit. Missing banking signals leads to exclusion and pushes them to high-cost lenders, limiting their progress, stability, and economic mobility.\n","solution":"We will launch Cardano’s first institutional microlending platform using verifiable student credentials. Smart contracts will score with ZK proofs and offer fair, transparent microloans for students.","proposer_name":"Extrimian LLC","proposer_relevant_experience":"Esteban Musso — CEO\n\nEsteban serves as CEO, guiding the strategic direction, business vision, and overall execution of the initiative. With strong experience in leadership and innovation, he manages key partnerships, oversees growth strategies, and ensures the project delivers meaningful social and economic impact.\n\n\n\nGuillermo Villanueva — CTO\n\nGuillermo is the Chief Technology Officer and leads the technical architecture of the project. With extensive experience in software development and infrastructure design, he ensures the platform is secure, scalable, and efficient. His technical leadership drives the integration of identity, payments, and financial services into a robust, reliable system.\n\n\n\nFabio Budris — CBO\n\nFabio is responsible for business development, identifying market opportunities and building strategic alliances with universities, institutions, and partners. He develops sustainable business models and drives adoption, ensuring the solution reaches the communities that need it most.\n\n\n\nCelina Villanueva — Product Manager\n\nCelina leads product strategy and execution, ensuring the platform is user-centered, intuitive, and aligned with the project’s goals of identity-driven inclusion and financial access. She oversees product development end-to-end, combining strategic vision with a deep understanding of student and institutional needs.\n\n\n\nAnibal Jalaris — Technical Legal Consultant\n\nAnibal provides legal and regulatory guidance, ensuring compliance with data protection, digital identity, financial regulations, and institutional requirements. As both a lawyer and an IT leader, he brings a dual perspective that combines technical depth with legal rigor. His expertise strengthens trust, mitigates regulatory risks, and supports the legal structure essential for deploying payments and microcredit solutions.\n\n\n\nAilen Díaz — Technical Leader\n\nAilen is the Technical Leader overseeing backend development, security standards, and system integration. She coordinates the technical team and ensures every component—identity workflows, payments, data handling, and user authentication—meets high standards of reliability and performance.","url":null,"funds":175000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"RealFi CredID: Cardano-Powered RealFi for Students","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Extrimian LLC","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":175000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":10,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"In LATAM, 70% of 210M students lack formal credit. Missing banking signals leads to exclusion and pushes them to high-cost lenders, limiting their progress, stability, and economic mobility.\n","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will launch Cardano’s first institutional microlending platform using verifiable student credentials. Smart contracts will score with ZK proofs and offer fair, transparent microloans for students.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://docs.google.com/document/d/1H4tSgtM5rjDOHql6xuujaZjehl11UyAxcRsTLqvzuG4/edit?tab=t.0"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Partnership dependencies only (no technical blockers):  • Universidad Autónoma de Guerrero (UAGro): Signed contract for platform deployment and operations. UAGro provides institutional access, user base, and integration support.  All partnerships formalized through executed agreements. No external funding dependencies for this proposal.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All core deliverables will be open-sourced under Apache 2.0 license within 3 months of project completion.\n","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Financial Services","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Competitive Landscape Analysis:\n\n\n\nTraditional banking excludes students entirely—they require employment history, collateral, or existing credit scores that students lack. Result: 70% of Latin American students have zero access to formal credit.\n\n\n\nFintech microlenders (Kueski, Monedo in Mexico) fill the gap but charge 48-120% APR. Their black-box credit algorithms perpetuate information asymmetry rather than solving it. Students can't understand why they're denied or how to improve their standing.\n\n\n\nDeFi lending (Aave, Compound) requires crypto collateral exceeding 100% of loan value. Students without existing crypto wealth are excluded by design. Anonymous protocols can't verify student status or enrollment—identity is absent by design.\n\n\n\nOther blockchain identity projects focus on SSI infrastructure without unlocking economic value. They prove credentials work technically but don't demonstrate what verified identity enables for real people.\n\n\n\nOur Innovation:\n\n\n\nWe combine five elements no competitor has integrated:\n\n\n\n1. Proven institutional deployment: 640,000 users across government (Buenos Aires) and university (UAGro) environments, not theoretical prototypes. We've operationalized SSI at scale.\n\n\n\n2. Zero-knowledge credit scoring: Credit scores live in student wallets as verifiable credentials, not on-chain. Blockchain contains only zero-knowledge proofs. This ensures privacy while enabling portability—students carry their credit history across institutions without exposing personal data.\n\n\n\n3. Dual-DID strategy: Our existing 640K QuarkID users provide the foundation. We're already working on implementing a migration path where each QuarkID identity receives a dual QuarkID/Identus DID. UAGro students (20K active, 100K target) become the first cohort generating critical mass for Identus adoption on Cardano. This bridges our proven infrastructure with Cardano's SSI ecosystem.\n\n\n\n4. Regulatory compliance via SOCAPs: We partner with Sociedades Cooperativas de Ahorro y Préstamo (SOCAPs)—regulated Mexican savings and loan cooperatives. This provides legal framework for credit operations while maintaining our technology's permissionless nature. Universities avoid direct financial service regulation; SOCAPs handle compliance.\n\n\n\n5. Transparent, improvable scoring: Students see exactly which factors affect their credit score (enrollment continuity, academic performance, scholarship status) and can improve their standing by presenting stronger credentials. This contrasts with fintech black boxes and traditional credit bureaus.\n\n\n\nNo other project combines institutional-scale SSI deployment, privacy-preserving on-chain credit verification, proven user base, regulatory compliance framework, and RealFI focus. We're not proposing RealFI; we're executing it.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"MVP Scope and Demonstration:\n\n\n\nOur MVP will demonstrate complete end-to-end microlending on Cardano mainnet:\n\n\n\nCredit Application Flow: Students with UAGro enrollment credentials stored in Micelya wallets will apply for loans directly in-app. The system will verify credentials via Verona Trust (multi-stack DID resolution), calculate credit scores using Plutus smart contracts, and present loan terms (amount, APR 10-18%, repayment schedule) with transparent factor breakdown showing how enrollment status, academic performance, and scholarship standing influence scoring.\n\n\n\nZero-Knowledge Proofs: Credit scores will be stored as verifiable credentials in student wallets. On-chain verification will use zero-knowledge proofs—blockchain validators can confirm score validity without accessing underlying personal data. This demonstrates privacy-preserving RealFI at scale.\n\n\n\nLoan Execution: Upon student acceptance, smart contracts will automatically disburse funds to Micelya wallets. Repayment schedules will be tracked on-chain with each payment updating the student's credit history credential in their wallet.\n\n\n\nDual-DID Migration: The MVP will demonstrate our QuarkID → Identus migration strategy. UAGro students (starting with 50-100 pilot cohort) will receive dual DIDs, proving the technical pathway for bringing our 640K existing QuarkID users into Cardano's Identus ecosystem.\n\n\n\nAccess: Post-launch (Month 7), we'll provide the Catalyst community with:\n\n\n\nPublic Cardano explorer links (mainnet transaction monitoring)\n\nMonthly progress dashboards (anonymized loan metrics)\n\nStudent testimonial videos (impact stories)\n\nOpen-source repository access (credit algorithm, smart contracts)\n\n\n\nTechnical reviewers can examine our current QuarkID infrastructure at [https://github\\.com/ssi\\-quarkid](https://github.com/ssi-quarkid) today.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"On-Chain Metrics (Transparent, Verifiable):\n\nCredit score verifications: 2,000+ zero-knowledge proof validations on Cardano mainnet over 10 months. Each verification proves a student's credit score without revealing personal data—publicly auditable via blockchain explorers while maintaining privacy.\n\nLoan originations: 500+ smart contract executions (one per loan disbursement). Transaction hashes provide immutable proof of volume and enable community monitoring of program growth.\n\nRepayment transactions: 1,500+ on-chain payments (assuming 3 repayments per loan average). Success rate &gt;85% target validates that verifiable credential-based credit scoring accurately assesses student creditworthiness.\n\nTotal on-chain activity: 5,000+ Cardano transactions (applications, disbursements, repayments, credential updates). Demonstrates sustained RealFI economic activity, not one-time pilots.\n\nIn-App Metrics (User Impact):\n\nPilot validation: 50-100 students in beta cohort (Month 7-8) test complete flow, provide UX feedback, demonstrate technical feasibility before full launch.\n\nScale achievement: 500+ total students served by Month 10, each gaining first formal credit access at 10-18% APR vs 48%+ fintech alternatives. Quantifiable economic benefit: $90-144 interest savings per $300 loan.\n\nPortfolio performance: Repayment rate &gt;85%, default rate &lt;10% (vs 15-20% traditional microlending baseline). Proves institutional environment + verifiable credentials reduce risk.\n\nDual-DID adoption: 100% of participating UAGro students receive QuarkID + Identus dual identities, demonstrating migration pathway for our 640K existing user base to Cardano's SSI ecosystem.\n\nExpansion Potential (Beyond Pilot):\n\nUniversity target: 60,000 students economically active within 18 months post-MVP.\n\nMexico pipeline: 500,000 students  within 18 months.\n\nLatin America vision: 1M+ students accessible as we replicate validated model across regional universities.\n\nThe 500-student pilot proves the model; the real success metric is demonstrating clear pathway to 100X scale.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The RealFI Bridge We're Building:\n\n\n\nCardano's RealFI vision addresses a fundamental global imbalance: regions with excess liquidity (Japan, Scandinavia, Gulf states with near-zero interest rates) need productive yield opportunities, while Latin America and Africa have massive productive potential but chronic credit scarcity. The bridge connecting these requires three elements: (1) blockchain infrastructure enabling capital flow across borders, (2) verifiable credentials reducing information asymmetry and risk premiums, (3) institutional trust anchors validating borrower legitimacy. We're operationalizing all three simultaneously.\n\n\n\nProblem Depth:\n\n\n\nLatin America's 210 million university students face systematic credit exclusion. Traditional banks require employment history (students don't have), collateral (students lack assets), or existing credit scores (students have none). This isn't risk-based exclusion—enrolled students with scholarship support are statistically reliable borrowers. It's information asymmetry: banks can't assess creditworthiness with available data, so they reject everyone or charge 48%+ APR to cover uncertainty.\n\n\n\nPredatory fintech lenders exploit this gap. Companies like Kueski and Monedo in Mexico charge 60-120% APR with opaque algorithms. Students accept these terms because no alternatives exist. The debt trap is predictable: a $300 textbook loan becomes $480+ in repayment, forcing students to borrow again to cover basic expenses.\n\n\n\nAt UAGro specifically, 100,000 students generate approximately $24 million in annual credit demand (conservative estimate: $20/month per student for textbooks, technology, food, transport). Currently, 65% lack bank accounts. Those with access pay premium rates. The economic cost of exclusion compounds: students delay graduation, drop out during financial crises, or forgo educational opportunities due to capital constraints.\n\n\n\nOur Approach:\n\n\n\nWe replace traditional credit signals (employment, assets, credit bureau history) with verifiable university credentials. Here's the operational flow:\n\n\n\nPhase 1 - Identity Foundation (Already Operational):\n\n\n\nUAGro issues student credentials via our existing QuarkID infrastructure—enrollment status, academic standing, scholarship awards, campus activity. These credentials live in students' Micelya wallets (20,000 students currently active). We're implementing a dual-DID strategy: each QuarkID identity receives a corresponding Identus DID. This creates a migration pathway bringing our 640K existing users into Cardano's SSI ecosystem, with UAGro students (20K active, 100K target) generating the first critical mass for Identus adoption.\n\n\n\nCredentials are cryptographically signed, tamper-proof, and student-controlled via selective disclosure (students choose what to share). This foundation is operational today—not theoretical.\n\n\n\nPhase 2 - Credit Scoring with Zero-Knowledge Proofs (Catalyst-Funded Development):\n\n\n\nWhen students apply for loans, Plutus smart contracts analyze presented credentials:\n\n\n\nEnrollment status (continuous enrollment = lower risk)\n\nAcademic performance (GPA, completion rate—student chooses to share)\n\nScholarship status (verified income proxy)\n\nPayment history (if previous Micelya loans exist)\n\nCampus activity (library usage, attendance—optional, privacy-preserving)\n\n\n\nCritical Innovation: Credit scores are stored as verifiable credentials in student wallets, not on-chain. Blockchain contains only zero-knowledge proofs validating score authenticity without exposing personal data. This ensures:\n\n\n\nPrivacy: Personal attributes never touch the blockchain\n\nPortability: Students carry scores across institutions via wallet\n\nVerifiability: Anyone can confirm score validity via ZK-proof\n\nStudent control: Scores live in user-controlled wallets, not institutional databases\n\n\n\nAlgorithm outputs: Credit score (0-1000), recommended loan amount ($100-600 range), interest rate (10-18% APR based on risk assessment), repayment schedule (typically 3-6 months).\n\n\n\nTransparency is critical: students see exactly which factors affect their score and how to improve it (maintain enrollment, share stronger academic credentials, build repayment history). This differs fundamentally from fintech black boxes.\n\n\n\nPhase 3 - Regulatory Compliance via SOCAPs:\n\n\n\nWe partner with Sociedades Cooperativas de Ahorro y Préstamo (SOCAPs)—regulated Mexican savings and loan cooperatives that provide inclusive financial services to their members. These partnerships allow Micelya to offer compliant credit products within our campus ecosystem while:\n\n\n\nUniversities avoid direct financial service regulation (SOCAPs handle compliance)\n\nStudents access regulated financial products (not unregulated fintech)\n\nCapital providers have legal framework for institutional lending\n\nTechnology remains permissionless (SOCAPs use our infrastructure, don't control it)\n\n\n\nThis regulatory strategy is critical for institutional adoption and scalability across Latin America's diverse regulatory environments.\n\n\n\nPhase 4 - Loan Execution:\n\n\n\nStudent accepts terms → Smart contract executes → Funds disburse to Micelya wallet (ADA or stablecoin). Repayment occurs via automatic deductions (if student opts in) or manual payments. Each repayment updates the credit score credential in student's wallet, improving future loan terms. Credit history is portable—if student transfers to UDG or UNAM, their wallet-based credit record follows them (unlike traditional credit bureaus limited to single countries or institutions).\n\n\n\nPhase 5 - Capital Efficiency:\n\n\n\nInitial seed capital ($30,000 from Catalyst budget) funds approximately 100 loans at $300 average. As students repay, capital revolves—each dollar funds 3-4 loans over 10 months. Pilot target: 500 students served with $150,000 total loan volume from $30K seed capital plus repayments.\n\n\n\nScale Potential Beyond Pilot:\n\n\n\nThis 500-student pilot validates the model for massive expansion:\n\n\n\nUAGro: 100K students, 60K economically active target within 18 months post-MVP\n\nUDG: 300K students (partnership discussions active)\n\nMexico national: 500K students across UNAM, TecNM, regional universities within 18 months\n\nLatin America: 1M+ students accessible as we replicate across region\n\n\n\nWhy Cardano Specifically:\n\n\n\nIdentus adoption strategy: Our dual-DID approach brings 640K existing QuarkID users into Cardano's SSI ecosystem. UAGro students become the first cohort generating Identus critical mass, demonstrating migration pathway for our entire user base.\n\n\n\nPlutus smart contracts: Enable complex credit scoring logic with deterministic execution. Transparent, auditable algorithms build trust with students and universities. Lower fees than Ethereum make microlending economics viable.\n\n\n\nZero-knowledge proofs: Cardano's roadmap for ZK-proof integration aligns perfectly with our privacy-preserving credit scoring architecture. We're building for Cardano's technical evolution.\n\n\n\nDifferentiation from DeFi:\n\n\n\nTraditional DeFi (Aave, Compound) requires crypto collateral exceeding 100% of loan value—students don't have this. Anonymous protocols can't verify student status. Variable APRs create budget uncertainty. Our model uses verified identity as collateral substitute, institutional trust for risk reduction, and fixed rates for student planning. This is RealFI, not DeFi speculation.\n\n\n\nThe Last-Mile Contribution:\n\n\n\nMost blockchain projects build infrastructure without demonstrating real-world value. Most microlending operates on traditional rails with traditional exclusions. We're the intersection: blockchain-native credit scoring + institutional partnerships + proven 640K-user deployment history + 20K operational baseline at UAGro. We don't theorize about RealFI; we execute it with measurable student impact.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Quantifiable Student Impact:\n\n\n\nPilot Validation (10 months): 500 students gain first formal credit access, proving the model works technically and economically. Each student receives average $300 loans at 10-18% APR instead of 48%+ fintech alternative. Economic benefit per student: $90-144 in interest savings on a $300 loan. Multiply across 500 students: $45,000-72,000 in aggregate interest cost avoided during pilot alone.\n\n\n\nScale Potential (Post-Pilot):\n\n\n\nThe real impact lies in demonstrated scalability:\n\n\n\nUAGro expansion: From 500 pilot students to 60,000 economically active within 18 months post-MVP. Total addressable credit demand: $14.4M annually at UAGro alone.\n\nMexico national network: 500,000 students across UDG (300K), UNAM (350K), TecNM (600K) within 18 months. Total addressable: $120M annual credit demand across Mexican university system.\n\nLatin America vision: 1M+ students accessible as validated model replicates across regional universities. We're not stopping at 500—we're proving the pathway to 1M+.\n\n\n\nDropout Prevention: Emergency credit access prevents financial crises that force student departures. Conservative estimate: 10% of pilot borrowers (50 students) would have dropped out without emergency loan access. UAGro graduation value: graduates earn $12,000+ more annually than non-graduates in Guerrero state (Mexican government data). 50 students retained = $600K in future annual earnings enabled.\n\n\n\nPortable Credit History Innovation: Credit scores live in student wallets as verifiable credentials, not institutional databases. Zero-knowledge proofs on Cardano validate score authenticity without exposing personal data. Result: Students transferring from UAGro to UDG or UNAM bring their credit history via wallet—no need to rebuild creditworthiness from zero at each institution. This creates network effects: each university joining expands the utility of existing students' credit profiles across the entire ecosystem.\n\n\n\nCardano Ecosystem Impact:\n\n\n\nRealFI Narrative Validation: Cardano's differentiation vs Ethereum depends on institutional RealFI adoption, not DeFi speculation. We provide concrete evidence: Initially 500 students, scaling to 60K at UAGro, then 500K across Mexico, ultimately 1M+ across Latin America—all using Cardano for real economic activity (credit access), not crypto trading. This narrative strengthens Cardano's positioning with institutional investors, governments, and universities globally.\n\n\n\nIdentus Critical Mass Generation: Our dual-DID strategy brings 640K existing QuarkID users into Cardano's SSI ecosystem. UAGro students (20K active, 100K target) become the first major cohort generating Identus adoption. Every student receiving credit creates an Identus DID, demonstrating Cardano's SSI capabilities at institutional scale. This addresses Identus's cold-start problem—we're bringing existing users, not hoping for organic adoption.\n\n\n\nHydra Synergy: Our payments proposal (Proposal B) creates transaction history that strengthens credit scoring. Students with 6 months of campus payment data (Hydra L2) demonstrate financial behavior patterns that improve credit risk assessment. Combined impact: 30,000 economically active students (Proposal B) become eligible for microlending (Proposal A) based on verifiable payment history. The proposals are mutually reinforcing.\n\n\n\nDeveloper Resources: Open-source credit algorithm, Verona Trust multi-stack DID resolver, and student credential schemas become reusable components. Other universities (Cardano or multi-chain) can fork our code, accelerating RealFI adoption beyond our direct deployments. Developer community gains institutional-grade reference implementations.\n\n\n\nGlobal Replication Pathway:\n\n\n\nOur phased expansion demonstrates clear scalability:\n\n\n\nPhase 1 (Catalyst-funded, 10 months): UAGro pilot—500 students, $150K volume, <10% default rate, open-source deliverables published.\n\n\n\nPhase 2 (Months 11-18): UAGro full deployment—60,000 students economically active, $14.4M annual credit volume, proven model at institutional scale.\n\n\n\nPhase 3 (Months 12-18, parallel): Mexico expansion—UDG (300K students), UNAM discussions, TecNM partnerships. Total target: 500,000 students, $120M annual credit demand.\n\n\n\nPhase 4 (Year 2-3): Latin American replication—28M university students across region. Institutional capital participation (impact funds, DeFi liquidity providers) at scale, connecting global excess liquidity with regional productive credit needs.\n\n\n\nBroader RealFI Implications:\n\n\n\nIf verifiable credentials enable fair credit access for students, the same model applies to:\n\n\n\nGig workers (Uber/Rappi drivers with verifiable income credentials)\n\nMicro-entrepreneurs (marketplace sellers with verifiable sales history)\n\nRefugees (portable identity enables credit access in new countries)\n\n\n\nWe're not just solving student credit exclusion; we're proving the RealFI model works for any population with institutional verification but lacking traditional credit signals. Cardano becomes the infrastructure for global financial inclusion—starting with 500 students, scaling to millions.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Proven Track Record at Institutional Scale:\n\n\n\nBuenos Aires Deployment (2022-Present): 620,000 citizens use QuarkID wallets (which we co-created) for government-issued digital credentials (ID cards, birth certificates, driver's licenses, social program verification). Sustained operation for 3+ years with 99.7% uptime. Zero major security incidents. Government partnership validates our ability to work with public institutions at population scale under regulatory scrutiny. This proves we can: (a) Deploy SSI at massive scale, (b) Maintain production systems reliably, (c) Navigate government compliance requirements, (d) Sustain operations beyond pilots.\n\n\n\nUAGro Deployment (2024-Present): 20,000 active students using Micelya wallets daily for campus activities (credentials, access, library services, benefits). Operational metrics: 8.5M+ credentials issued, 99.7% wallet uptime over 2-year operational period across all deployments. ANUIES-TIC 2025 Award (Mexico's national ICT innovation award for universities) provides independent third-party validation—not self-reported metrics, but competitive national recognition. This proves we can: (a) Deploy at university scale, (b) Achieve daily active usage (not download-and-abandon), (c) Gain institutional endorsement, (d) Win competitive recognition validating deployment excellence.\n\n\n\nCombined Evidence: We've operationalized SSI for 640,000 total users across government and university environments. This is not theoretical—we've solved real-world deployment challenges (institutional IT integration, regulatory compliance, user adoption, sustained operations) that most blockchain projects only theorize about.\n\n\n\nTechnical Expertise Demonstrated:\n\n\n\nBlockchain Development: 12 engineers with Cardano expertise (Plutus smart contracts, Identus protocol integration, Hydra L2 capabilities). Team members contributed to W3C DID/VC standards, participated in Trust Over IP Foundation working groups, and deployed production systems across multiple blockchains (Cardano, Ethereum, IOTA, Rootstock).\n\n\n\nSSI Protocol Co-Creation: We are co-creators of QuarkID protocol ([https://github\\.com/ssi\\-quarkid\\),](https://github.com/ssi-quarkid),) designated as UN Digital Public Good (2023). This recognizes our technical contribution to global SSI standards and open-source community. Multi-DID method support (did:quark, did:ethr, did:prism, did:key) demonstrates cross-chain interoperability expertise that will enable our dual-DID strategy (QuarkID + Identus).\n\n\n\nInstitutional Integration Experience: Successfully deployed at:\n\n\n\nGovernment scale (Buenos Aires 620K users)\n\nUniversity scale (UAGro 100K students, 20K active)\n\nInternational organizations (IDB supply chain project, INCUCAI healthcare credentials)\n\nMultinational contracts (Gibraltar government digital ID system design)\n\n\n\nEach deployment taught us critical lessons about institutional requirements: compliance (GDPR, Mexican data protection laws), reliability (99.7% uptime standard), user experience (students don't need to understand blockchain), and sustainability (beyond pilots to production systems).\n\n\n\n[https://docs\\.google\\.com/document/d/1Bm70Ec7z\\-knoKsoZrJbA7FVA\\-Bgi2S9RgRL35nyAwOU/edit?tab=t\\.0](https://docs.google.com/document/d/1Bm70Ec7z-knoKsoZrJbA7FVA-Bgi2S9RgRL35nyAwOU/edit?tab=t.0)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 1 (Months 1–2) – Credit Algorithm + Audit","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Credit scoring contract (0–1000) using 5 factors: enrollment (300), grades (200), scholarships (150), repayment history (200), campus activity (150).\n- Zero-knowledge proofs: scores stored in wallets; chain stores only ZK-proofs.\n- Loan origination contract (disbursement + repayment tracking).\n- Dual-DID support: QuarkID + Identus.\n- Independent Cardano smart contract security audit.\n- Testnet deployment + full technical documentatio","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Testnet contract live with source code.\n- ZK-proofs generated in test wallets and verified on-chain.\n- Sample QuarkID + Identus credentials processed with deterministic scores.\n- Loan flow fully executed on testnet.\n- Security audit completed with no critical issues.\n- Documentation (algorithm, ZK-proofs, APIs) published.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- GitHub repository: Plutus smart contract source code, ZK-proof schemas (public, Apache 2.0 license)\n- Testnet transaction hashes: Credit score ZK-proof verifications, loan disbursements (Cardano explorer links)\n- Security audit report: PDF from third-party auditor with findings and resolutions documented\n- Technical documentation: Published to project website and GitHub wiki with ZK-proof specifications\n- Video demonstration: Screencast showing dual-DID credential presentation → ZK-proof → scoring → loan execution on testnet","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 2 (Months 3–4) – Verona Trust + UAGro Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Verona Trust resolves did:quark, did:prism, did:ethr.\n- Credential engine validates credentials + revocation across all DID types.\n- Selective disclosure + ZK-proof generation implemented.\n- UAGro credential schemas created (enrollment, grades, scholarships, activity).\n- Registrar API triggers automatic credential issuance on each update.\n- Micelya wallet updated: loan flow, score breakdown, repayment dashboard, dual-DID UI.\n- Student onboarding: tutorial videos, FAQs, support materials.\n- UAGro staff training (10 people).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- All DID types resolve correctly on testnet.\n- 100% accuracy validating test UAGro credentials.\n- Dual-DID creation successful for test students.\n- Selective disclosure functional.\n- Registrar API working in test environment.\n- Wallet shows scores with factor breakdown.\n- UAGro approves student onboarding materials.\n- Staff training completed.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- All DID types resolve correctly on testnet.\n- 100% accuracy validating test UAGro credentials.\n- Dual-DID creation successful for test students.\n- Selective disclosure functional.\n- Registrar API working in test environment.\n- Wallet shows scores with factor breakdown.\n- UAGro approves student onboarding materials.\n- Staff training completed.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 3 (Months 5–6) – Mainnet + Regulatory Compliance","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Mainnet deployment of: credit scoring + ZK-proof verification + loan contracts + dual-DID support + Verona Trust verifier.\n- Legal review: Mexican fintech regulation + GDPR/MX data protection.\n- Student loan terms + ToS (Spanish) completed.\n- UAGro legal approval.\n- Risk management framework.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Mainnet contract addresses published with verified code.\n- Dual-DID accepted on-chain.\n- ZK-proof validation functional without revealing personal data.\n- UAGro approves ToS + operational model.\n- Compliance dashboard functional.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Mainnet transaction hashes: Initial smart contract deployments with dual-DID and ZK-proof capabilities (Cardano explorer links)\n- UAGro authorization: Signed letter from university legal/admin office approving credit program launch\n- Compliance report: Documentation of regulatory analysis, data protection measures (ZK-proofs), SOCAP framework, risk controls\n- Seed capital proof: Multi-sig wallet address with $15K ADA balance (publicly verifiable on-chain)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":42000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 4 (Months 7–8) – Pilot Launch (50–100 Students)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Recruit 50–100 UAGro students (various programs).\n- All receive dual-DID (QuarkID + Identus).\n- Students apply via wallet; ZK-proofs generated; scores calculated.\n- Disburse 10+ loans on mainnet\n- Repayment schedules established.\n- Helpdesk + student support running.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 50–100 successful applications.\n- 10+ on-chain loan disbursements.\n- ZK-proofs validate on-chain.\n- Dual-DID adoption 100%.\n- Zero critical failures in loan flow.\n- Repayment tracking functional; >10% students make first payment on time.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Mainnet transaction records: 10+ loan disbursements, ZK-proof verifications (Cardano explorer links)\n- Dual-DID metrics: 100% pilot students with QuarkID + Identus identities (anonymized dashboard data)\n- Pilot report: Analytics on credit score distributions, loan amounts, APR ranges, student demographics, dual-DID adoption rates\n- Algorithm updates: GitHub commit showing scoring weight adjustments with data-driven justification\n- Repayment data: Anonymized metrics on first-month payment performance (>85% target)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":48000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Esteban Musso — CEO\n\nEsteban serves as CEO, guiding the strategic direction, business vision, and overall execution of the initiative. With strong experience in leadership and innovation, he manages key partnerships, oversees growth strategies, and ensures the project delivers meaningful social and economic impact.\n\n\n\nGuillermo Villanueva — CTO\n\nGuillermo is the Chief Technology Officer and leads the technical architecture of the project. With extensive experience in software development and infrastructure design, he ensures the platform is secure, scalable, and efficient. His technical leadership drives the integration of identity, payments, and financial services into a robust, reliable system.\n\n\n\nFabio Budris — CBO\n\nFabio is responsible for business development, identifying market opportunities and building strategic alliances with universities, institutions, and partners. He develops sustainable business models and drives adoption, ensuring the solution reaches the communities that need it most.\n\n\n\nCelina Villanueva — Product Manager\n\nCelina leads product strategy and execution, ensuring the platform is user-centered, intuitive, and aligned with the project’s goals of identity-driven inclusion and financial access. She oversees product development end-to-end, combining strategic vision with a deep understanding of student and institutional needs.\n\n\n\nAnibal Jalaris — Technical Legal Consultant\n\nAnibal provides legal and regulatory guidance, ensuring compliance with data protection, digital identity, financial regulations, and institutional requirements. As both a lawyer and an IT leader, he brings a dual perspective that combines technical depth with legal rigor. His expertise strengthens trust, mitigates regulatory risks, and supports the legal structure essential for deploying payments and microcredit solutions.\n\n\n\nAilen Díaz — Technical Leader\n\nAilen is the Technical Leader overseeing backend development, security standards, and system integration. She coordinates the technical team and ensures every component—identity workflows, payments, data handling, and user authentication—meets high standards of reliability and performance.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Milestone 1 (Months 1–2): $45,000 – Credit scoring contract, ZK-proofs, dual-DID support, loan origination, security audit, testnet deployment.\n\nMilestone 2 (Months 3–4): $40,000 – Verona Trust multi-stack integration, credential validation, UAGro schemas + registrar automation, wallet updates, onboarding + staff training.\n\nMilestone 3 (Months 5–6): $42,000 – Mainnet deployment, dual-DID acceptance, ZK-verification, legal + regulatory review, compliance dashboard.\n\nMilestone 4 (Months 7–8): $48,000 – Pilot launch (50–100 students), dual-DID issuance, ZK-scoring, 10+ on-chain loans, repayment tracking, UX research.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Immediate Impact: 500+ students gaining formal credit access (first-ever for most), $150,000+ loan volume generating 5,000+ on-chain transactions, 2,000+ zero-knowledge proof validations demonstrating privacy-preserving RealFI.\n\n\n\nIdentus Ecosystem Growth: 100% of participating students (500+) receive dual-DIDs (QuarkID + Identus), proving migration pathway for our 640K existing QuarkID user base into Cardano's Identus ecosystem. This addresses Identus's cold-start problem—we're bringing existing users, not hoping for organic adoption.\n\n\n\nReusable Infrastructure: Open-source credit algorithm with ZK-proofs, Verona Trust multi-stack resolver with dual-DID support, loan contracts, credential schemas—all become public goods. Other universities can fork our code, reducing their development costs and accelerating Cardano RealFI adoption beyond our direct deployments.\n\n\n\nNarrative Validation: First institutional proof of RealFI at scale (vs Ethereum DeFi speculation). 500-student pilot proves model for expansion to UAGro's 60,000 students, then Mexico's 500,000-student pipeline, ultimately Latin America's 1M+ addressable market.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Financial Services","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1648}