{"pr_id":"019ab50d-aaa2-7b25-8edb-cd4d6eb604c8","title":"build.foundation","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Technology advances but current architectures remain extraction-orentied, seed-phrase-dependent, rigid, unscalable - forcing binary choices undermining both automated coordination and human autonomy","solution":"Technical substrate utilises lighter datum encoding, enabling coordination across increasing complexity—polymorphic state substrate, programmatic wallets addresses transactions, bridging bits to atoms","proposer_name":"Self Sovereign","proposer_relevant_experience":"# Contributor Approach\nCatalyst's historical funding delays created situations where promised contributor engagement could not be honored, damaging relationships despite good intentions.\n\nLearning from this, this proposer commits to onboarding computational commons contributors—workshop facilitators, schema architects, cultural consultants building on delegated representatives from over fifty-one countries, translators emphasizing subject-object-verb structures across eight languages, disaster specialists, rural revitalization experts, legal advisors across UK, Swiss, and Japanese contexts, technical writers, community coordinators, partnership liaisons, and video producers—only after funding receipt and stable currency conversion ensuring reliable compensation.\n\nThis milestone-threshold approach protects both contributor relationships and project reputation. Should early milestones not achieve objectives as community determines, funding firewall ensures remaining allocations stay secure rather than creating cascading failures. Given eight years visible participation, reputation preservation through honest execution carries paramount importance.\n\nThe approach provides latitude for adapting to emergent realities while maintaining accountability through deliverable-based evaluation, with transparent communication about challenges and good-faith efforts toward objectives.","url":null,"funds":123456,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"build.foundation","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Self Sovereign","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":123456,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Technology advances but current architectures remain extraction-orentied, seed-phrase-dependent, rigid, unscalable - forcing binary choices undermining both automated coordination and human autonomy","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Technical substrate utilises lighter datum encoding, enabling coordination across increasing complexity—polymorphic state substrate, programmatic wallets addresses transactions, bridging bits to atoms","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://sovereigns.institute","https://build.foundation","https://standards.agency"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"https://sovereigns.institute","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All technical outputs, like scripts and developer tools, will be released under Apache License 2.0, allowing commercial and private use with attribution. Legal frameworks will be under Creative Commons Attribution 4.0 International License for adaptation. Universal schemas will use open standards. Community materials will be under Creative Commons Attribution-ShareAlike 4.0 International License. Security audits will be transparently published. Governance inputs and outputs will be made public.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Governance","group":"Governance"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"We, our idea and approach are set apart in many a ways.  \n\n\n\nWe're setting out to attract people who recognize that bridging the world of bits to the world of atoms requires technical substrate that intentionally breaks compatibility with extraction-enabling architectures, even when that incompatibility makes conventional growth metrics impossible to achieve. \n\n\n\nWe reach them by creating infrastructure so fundamentally different from existing systems that it attracts those valuing autonomy over convenience, those willing to experiment with polymorphic resources and on-device sovereignty despite these approaches being unmarketable through traditional channels. \n\n\n\nThis matters for Cardano because counter-positioned technical architectures that genuinely protect users have never emerged from conventional product-market-fit thinking optimized for user acquisition funnels and engagement rates. \n\n\n\nConsider: did the cypherpunks who created the cryptographic foundations we all depend on measure their success through mailing list subscriber counts? \n\n\n\nThe work that matters happens in experimentation, creation, exploration driven by curiosity about what becomes possible when you sacrifice but refuse to compromise protective capabilities for compatibility with systems designed for extraction.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our prototype will demostrate technical architecture development implementing polymorphic resources through EXI encoding where depth of expressiveness matters more than feature count velocity.\n\nSecurity validation and operational testing under adversarial and degraded conditions where robustness under stress proves more valuable than performance benchmarks under optimal circumstances.\n\nReal-world application development demonstrating capabilities through these working prototypes (that will be accessible through [https://standards\\.agency](https://standards.agency)) addressing actual human needs rather than accumulating speculative use case documentation that never faces reality's constraints.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Working prototypes operating under real-world constraints including network degradation, resource limitation, and adversarial conditions rather than demonstrations that only function in laboratory environments. \n\n\n\nSecurity assessment outcomes showing architectural decisions successfully resist identified threat models rather than merely passing compliance checklists divorced from actual attack scenarios, vectors, surfaces. \n\n\n\nEvidence that technical capabilities enable sovereigns.institute governance objectives through concrete implementations rather than theoretical compatibility claims, demonstrating co-evolution between human governance and technical infrastructure through specific examples where each shaped the other's development. \n\n\n\nAttempting to place a number for chain activity (on-chain or off-chain) is an excercise in futility as the polymorhic paradigm levereges EXI as datum that could be many or few in a utxo or across semi-fungible tokens - which could have very varied volume or velocity depending on a multitude of possible scenarios.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**Problem Description**\n\nThe Extraction Architecture Pattern\n\nCurrent technology architectures replicate the mechanisms of surveillance capitalism through parallel frontend and backend vulnerabilities that disadvantage ordinary users. Frontend interfaces expose complete public histories to anyone who knows an address, allowing wallet tracking, highly targeted phishing, and social graph construction that analytics firms then monetise in the same way data brokers commoditise browsing behaviour. Backend infrastructure exposes transparent operational environments where sophisticated actors continually monitor pending activities, extracting value through positional advantage before execution completes. This dynamic arises because naïve openness triggers a tragedy-of-the-commons effect, where advanced actors over-exploit until ordinary users retain no surplus value.\n\n\n\nRecovery phrase models fundamentally cannot scale beyond early adopters. Expecting users to securely store and manage twelve- or twenty-four-word mnemonics imposes barriers insurmountable to billions already struggling with basic password management. The cognitive burden of understanding permanent, irreversible loss—combined with operational security requirements—renders current wallet architecture essentially unusable at population scale. This is not a failure of user education but a structural mismatch between technical requirements and realistic human capabilities.\n\n\n\nTLDR on Architectural Limitations\n\nDespite client diversity across programming languages, architectural homogeneity dominates, with all implementations handling data identically. Current systems enforce binary ownership models when modern realities require nuanced permissions reflecting complex stakeholder relationships. For example, land must be classified as property, habitat, sacred site, or economic asset, rather than simultaneously embodying multiple identities with different permissions for different stakeholders. Emergency supplies in disasters must be categorised as logistics, medical utility, or cultural resource, rather than evaluated across all dimensions at once. Personal data is either private or public, rather than governed by contextual permissions depending on who accesses it, for what purpose, and under what circumstances.\n\n\n\nToken-centric architectures using CBOR encoding optimise for operational efficiency but necessarily sacrifice hierarchical expressiveness. Without schema-governed validation, implementations store redundant information directly on-chain, creating unsustainable bloat. CBOR lacks the semantic richness required for sophisticated off-chain persistence while maintaining reliable on-chain verification. Consider autonomous systems with multimodal sensing: camera vision captures visual understanding, terahertz sensors analyse material composition, and spectrograms interpret acoustic signatures. Token architectures cannot adequately represent such dimensionally rich inputs in ways that remain reliably referenceable for other systems. This forces either storing everything on-chain—untenable over time—or moving trust off-chain, defeating the purpose of decentralisation.\n\n\n\nCentralised large language models incur disproportionate costs when handling high-context languages with complex grammatical structures. Subject–object–verb languages such as Japanese place crucial meaning-determining verbs at sentence endings, forcing models to sustain higher state ambiguity across long token sequences. This demands far greater computational resources, magnifying both the training overhead—trillions of parameters consuming immense energy and water—and the inference costs of continual high-load computation. Centralisation incentivises architectural homogenisation, which systematically eliminates diversity while increasing operational cost. At population scale, these pressures accelerate cultural extinction as algorithms prefer patterns that require less computational effort to process.\n\n\n\n**Solution Architecture**\n\nTLDR on Counter-Positioning\n\nBuild.foundation develops infrastructure as explicit counter-positioning against extractive incumbents. Genuine protection requires architectural incompatibility with surveillance systems, not carefully maintained interoperability that inevitably compromises security. This is a deliberate choice, treating incompatibility itself as a protective feature. The design follows Foundation’s vision of enabling coordination across increasing complexity and time scales. Like psychohistory’s equations functioning at civilisational scale while individual events remain unpredictable, these substrates enable reliable large-scale coordination while allowing local emergence and variation. A polymorphic approach is natively suited to this challenge because it accommodates multiple simultaneous interpretations that adaptive systems can navigate contextually, operating at the nuanced granularity and rapid velocity that complex systems demand.\n\n\n\nSwitching from CBOR to EXI (Efficient XML Interchange) as the primary data encoding provides concrete advantages. EXI achieves binary compactness—roughly ten-to-one compression over textual XML—while preserving hierarchical expressiveness and schema-governed validation. This combination enables polymorphic resource definitions where single identifiers simultaneously represent resources under multiple overlapping interpretations. Physical objects can be logistical assets, legal entities, cultural artefacts, and environmental resources at the same time, each with distinct, schema-validated permissions.\n\n\n\nAt the kilobyte and byte level, EXI proves lighter than CBOR yet supports dramatically richer semantics. The polymorphic approach enables healthier data persistence patterns where schema and data need not centralise on-chain, reducing bloat and enabling far greater expressiveness. This bridge between bits and atoms reflects physical reality’s inherently polymorphic nature: objects exist in multiple valid interpretive frameworks, each with its own rules and permissions.\n\n\n\n**Infrastructure Components**\n\nThe alternative wallet architecture rejects recovery phrases entirely, introducing programmatic wallet creation with social recovery mechanisms. Rather than burdening users with mnemonic management, the system automatically generates multiple wallets to establish security boundaries and enables social recovery using threshold cryptography. Trusted contacts each hold credential shares, with restoration requiring a threshold (for example, three-of-five). No single contact can restore access alone, mitigating social engineering risk, while thresholds tolerate some contact loss. This intentional incompatibility with legacy recovery phrase models is treated as a protective feature, not a limitation.\n\n\n\nA conversational interface allows users to issue natural language instructions without technical vocabulary. For example, “allocate ten percent to disaster relief while keeping half available for emergencies” prompts on-device AI to produce polymorphic resource definitions with precise constraints and validation logic. Using WebAssembly and GPU acceleration, inference runs entirely locally, avoiding remote queries that would otherwise expose user data to surveillance.\n\n\n\nLocal models leveraging retrieval-augmented generation exploit personal context efficiently, reducing the need for trillion-parameter centralised models and the associated environmental cost. Keeping high-value context on-device makes cultural diversity preservation economically feasible, inverting the value flow: rather than corporations extracting data, users retain sovereignty, and the models improve through local interactions.\n\n\n\nThe ecosystem develops through d-app.store integration, providing modular composability without the interoperability vulnerabilities of legacy architectures. Applications operate in secure abstraction layers with controlled interfaces to private context. All interactions follow schema that explicitly define access conditions, with polymorphic permissions guaranteeing enforcement. This allows diverse functionality while maintaining user sovereignty.\n\n\n\nInternationalisation schema establish universal reference structures that domain-specific schema invoke, rather than embedding cultural assumptions directly. For example, healthcare schema reference internationalisation schema for family relationships, acknowledging cultures define “family” differently, and for consent frameworks reflecting varied legal norms. Designing for internationalisation at the architectural level avoids embedding dominant cultural defaults that later require patchwork fixes.\n\n\n\n**Japanese Context Applications**\n\nPrototype deployments with Japanese public data showcase utility in disaster management and rural revitalisation. When earthquakes, tsunamis, typhoons, landslides, volcanic eruptions, or electromagnetic pulses occur, schema-governed coordination supports both human and autonomous responders under fragmented infrastructure.\n\n\n\nPolymorphic resource definitions allow emergency supplies to be simultaneously tracked for logistics, assessed for medical use, evaluated for cultural appropriateness, and allocated under prioritisation frameworks. Offline transaction capability is vital, enabling local mesh coordination with mainchain settlement when connectivity returns.\n\n\n\nRural revitalisation applications address depopulation, ageing demographics, agricultural sustainability, cultural heritage, and infrastructure strain. Schema coordinate heterogeneous resources—volunteer time, specialised skills, equipment, funding, and cultural expertise—without forcing conversion to monetary equivalents that distort true value. An elder’s agricultural knowledge, a remote worker’s technical skill, municipal equipment, and external finance all interoperate through polymorphic definitions.\n\n\n\nThese applications, developed via sovereigns.institute workshops, simultaneously test governance frameworks and build.foundation’s technical architecture under real-world conditions, ensuring neither evolves in isolation from practical constraints.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Build.foundation's impact on the Cardano ecosystem emerges from creating technical substrate that treats architectural incompatibility with extraction-enabling systems as essential protective feature rather than limitation requiring remediation. Every ecosystem claiming to value decentralization and user sovereignty eventually faces a choice: maintain compatibility with existing systems and inherit their extraction mechanisms, or accept incompatibility as necessary cost of genuine protection. Build.foundation resolves this tension by demonstrating that counter-positioned infrastructure using EXI encoding for polymorphic resources, programmatic wallet creation with social recovery, and on-device conversational processing creates capabilities that compatible architectures fundamentally cannot provide, making the incompatibility itself a competitive advantage for users who understand what they gain through this trade.\n\nThe polymorphic resource architecture using EXI encoding rather than CBOR creates technical foundation that all ecosystem participants can build upon when they need to represent complex real-world relationships that binary ownership models cannot express. Consider what becomes possible when land can simultaneously be property with legal ownership rights, habitat with ecological protection mandates, sacred site with ceremonial access permissions, and economic asset with sustainable harvest constraints, all coexisting through schema-governed validation. Developers building supply chain coordination, environmental monitoring, cultural preservation, healthcare privacy, or any domain where multiple stakeholders hold different legitimate interests in the same resources gain architectural patterns enabling nuanced representation. This matters enormously because forcing complex stakeholder relationships into binary ownership models either excludes legitimate interests entirely or creates fragile workarounds that collapse under real-world pressure.\n\nAt byte level, EXI proves lighter than CBOR while enabling vastly richer semantic expressiveness, meaning the polymorphic approach actually reduces on-chain storage requirements while increasing what can be represented. This architectural efficiency matters for long-term ecosystem sustainability because chain bloat constrains participation by increasing resource requirements for node operation. When different schema and associated data can persist off-chain through schema-governed validation while maintaining on-chain verification, the ecosystem gains healthier data persistence patterns that enable richer applications without unsustainable storage growth. The autonomous systems example using camera vision, terahertz sensors, and acoustic spectrograms demonstrates how polymorphic persistent state enables high-assurance coordination between human operators and automated systems, creating technical foundations for applications the ecosystem currently cannot support.\n\nThe wallet architecture eliminating recovery phrase dependency removes the single largest barrier preventing population-scale adoption. Requiring users to securely manage twelve or twenty-four word mnemonics with understanding that loss means permanent inability to access value creates cognitive and operational burdens that billions of people simply cannot meet regardless of educational efforts. The programmatic wallet creation with social recovery through threshold cryptography integrated with biometric authentication provides genuine alternative that maintains security without imposing impossible requirements. When users can designate trusted contacts who collaboratively restore access without any single contact having sufficient information to compromise security independently, wallet loss becomes recoverable problem rather than catastrophic permanent failure. This architectural shift enables the ecosystem serving populations that current recovery phrase models systematically exclude, expanding potential user base by orders of magnitude.\n\nThe conversational interface accepting natural language and automatically generating appropriate transaction structures democratizes access for users without technical literacy. When someone can state &quot;allocate ten percent to disaster relief while keeping half available for emergencies&quot; and have conversational AI running entirely on their device generate polymorphic resource definitions expressing these constraints as validated datum specifications, blockchain interaction becomes accessible to people who would never learn technical vocabulary or command-line interfaces. The on-device processing using WebAssembly with GPU acceleration means this sophisticated capability happens locally without sending queries to remote servers that would enable behavioral surveillance and data extraction. This reverses the extraction pattern where convenience requires sacrificing privacy, making privacy the default outcome while maintaining genuine utility.\n\nThe ecological impact from local inference versus centralized trillion-parameter models proves substantial at scale. Training centralized language models to handle all linguistic complexity and compensate for lack of personal context consumes immense energy and water resources while systematically eliminating diversity that increases operational costs. Local models keeping high-value context on device dramatically reduce both training and inference costs while preserving cultural and linguistic nuance that centralized systems economically cannot justify maintaining. For an ecosystem claiming environmental consciousness, demonstrating that decentralized architectures can simultaneously improve privacy and reduce ecological footprint while enabling richer functionality provides compelling counterargument to narratives suggesting blockchain technology inherently wastes resources.\n\n\n\n\n\nThe internationalization architecture separating cultural context into dedicated schema that domain-specific schema reference rather than embedding cultural assumptions directly creates foundation enabling genuine global accessibility. When healthcare schema can reference internationalization schema for family relationship concepts acknowledging different cultures define family quite differently, or for consent frameworks varying across legal systems, applications built on these foundations accommodate diversity architecturally rather than requiring endless patches accommodating each new cultural context discovered. The subject-object-verb language documentation for machine learning applications ensures conversational systems handle high-context linguistic structures from inception rather than optimizing for English then struggling to retrofit other languages. This architectural decision carries material consequences at population scale because systems designed without internationalization separation inevitably embed dominant culture assumptions as defaults.\n\n\n\n\n\nThe disaster management and rural revitalization applications using Japanese public data demonstrate technical capabilities serving urgent human needs rather than speculative use cases disconnected from reality. When schema-governed coordination enables effective response to earthquakes, tsunamis, typhoons, or infrastructure failures while keeping humans meaningfully in the loop, or when rural communities can coordinate heterogeneous resources addressing depopulation and cultural preservation without forcing everything through monetary equivalence, the ecosystem gains concrete demonstrations attracting institutional attention and population adoption that abstract capability claims never achieve. These applications validate that technical infrastructure operates under real-world constraints including network degradation, resource limitation, and adversarial conditions rather than only functioning in laboratory environments.\n\n\n\n\n\nThe security validation coordinated with sovereigns.institute regulatory exploration ensures technical security models align with legal compliance frameworks from inception rather than discovering incompatibilities after both solidify independently. This coordination creates enormous value because technical capabilities enabling regulatory compliance while genuinely preserving privacy prove far more valuable than capabilities requiring privacy compromise for compliance approval. The ecosystem gains proven approaches to institutional engagement that maintain protective commitments rather than sacrificing them.\n\nPerhaps most fundamentally, build.foundation demonstrates that technical substrate inspired by Foundation's vision of distributed knowledge preservation enabling civilizational resilience through coordination operating across increasing complexity and time scales can actually be built rather than remaining science fiction aspiration. \n\n\n\nThe polymorphic architecture operating at nuanced granularity and voracious velocity that Software 3.0 paradigms demand creates foundations that automated systems and human coordination will build upon as complexity grows and governance velocity increases beyond what traditional institutional forms accommodate. The synthesis with sovereigns.institute showing concrete examples where technical capability enabled governance objectives and governance frameworks shaped technical architecture provides the entire ecosystem with proof that co-evolution between human governance and technical infrastructure represents achievable reality rather than aspirational theory.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"# Proposer's Background\n\n\nI, The proposer bring eight years continuous ecosystem participation since 2017, including early London meetups with Michael Parsons, initial Cardano Foundation team, and Charles Hoskinson's team, participating from Catalyst's inaugural fund through present, attending summits from Lausanne to Dubai, governance workshops in Zug and Tokyo, EMURGO's RWA events, and community gatherings.\n\nProfessional background spans theatre and film production, architecture, design and technology integration, and public service, creating multidisciplinary perspective bridging creative practice, technical implementation, and institutional contexts.\n\nAs a Central Saint Martins alumnus, the proposer maintains active engagement with London arts institutions like their Alma mater as a trnsitive property or contrapositive conditional Tokyo University of the Arts and Institute of Science Tokyo, where pre-existing institutional relationships exist through Central Saint Martins' longstanding collaborations. Alumni networks enable organic relationship development through shared interests rather than bureaucratic constraints. Workshop partnership confirmations represent Milestone 1 deliverables establishing formal agreements once funding enables concrete planning.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 1: Core Infrastructure Development","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Core architectural components operational in testnet environments implementing polymorphic resource patterns emerging from sovereigns.institute workshop processes\n\nWallet infrastructure enabling programmatic approaches validated through sovereigns.institute governance framework discussions about accessibility and security\n\nDeveloper foundations established coordinated with sovereigns.institute community platform enabling integrated technical and governance conversations","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Testnet infrastructure demonstrably operational implementing schema patterns with clear lineage to sovereigns.institute workshop deliberations\n\nWallet approaches functional showing alignment with accessibility objectives sovereigns.institute governance discussions establish\n\nDeveloper resources published enabling participation coordinated with sovereigns.institute community engagement infrastructure","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Testnet deployments with documentation tracing implementation decisions to sovereigns.institute workshop outputs\n\nWallet infrastructure demonstrations showing functionality addressing accessibility concerns sovereigns.institute governance work identifies\n\nPublished developer resources integrated with sovereigns.institute community platform","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 2: Enhanced Capabilities Informed by Governance Processes","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Expanded schema implementations addressing domains sovereigns.institute workshops identify as priorities including healthcare privacy, property rights, and resource allocation\n\nConversational interface development incorporating linguistic and cultural insights from sovereigns.institute internationalization work\n\nPerformance characterization establishing baselines informing both technical optimization and sovereigns.institute governance discussions about accessibility requirements","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Schema implementations demonstrably addressing priority domains sovereigns.institute workshops identify through participatory processes\n\nConversational capabilities functional incorporating sovereigns.institute linguistic architecture work on subject-object-verb structures and cultural context\n\nPerformance documentation establishing characteristics relevant to sovereigns.institute governance discussions about device accessibility and resource requirements","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Published schema implementations with documentation connecting to sovereigns.institute workshop priorities\n\nConversational interface demonstrations showing incorporation of sovereigns.institute internationalization insights\n\nPerformance documentation informing sovereigns.institute governance considerations about accessibility","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":31728,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 3: Security Validation Coordinated with Governance Framework Development","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Security assessment conducted with findings addressed coordinated with sovereigns.institute regulatory exploration ensuring technical security models align with legal compliance frameworks\n\nProduction environment preparation timed with sovereigns.institute entity formation roadmap development ensuring synchronized readiness\n\nOperational validation including offline capabilities addressing resilience objectives sovereigns.institute governance work establishes","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Security assessment completed with remediation coordinated with sovereigns.institute regulatory framework development showing alignment between technical and legal security approaches\n\nProduction deployment preparation demonstrably coordinated with sovereigns.institute organizational readiness rather than premature independent launch\n\nOperational capabilities validated addressing resilience requirements sovereigns.institute governance discussions identify","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Security assessment documentation showing coordination with sovereigns.institute regulatory work on compliance frameworks\n\nProduction readiness documentation demonstrating coordination with sovereigns.institute entity formation timing\n\nOperational validation results addressing resilience objectives from sovereigns.institute governance processes","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":31728,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 4: Applied Demonstrations and Unified Vision","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Real-world applications demonstrating technical capabilities operating within governance frameworks sovereigns.institute workshops developed\n\nEcosystem enablement establishing processes for broader participation implementing governance mechanisms sovereigns.institute community work defines\n\nCoordinated synthesis with sovereigns.institute showing concrete examples where technical capability enabled governance objectives and governance frameworks shaped technical architecture throughout collaboration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Working applications demonstrably showing how technical infrastructure operates within governance frameworks sovereigns.institute created rather than abstract capability claims\n\nParticipation processes operational implementing governance approaches sovereigns.institute community processes established\n\nJoint documentation with sovereigns.institute demonstrating mutual influence between governance and technical decisions with specific examples rather than general assertions","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Published applications with documentation showing operation within sovereigns.institute governance frameworks\n\nParticipation processes documentation implementing sovereigns.institute governance mechanisms\n\nJoint synthesis with sovereigns.institute containing concrete examples of co-evolution between governance and technical work","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"# Contributor Approach\nCatalyst's historical funding delays created situations where promised contributor engagement could not be honored, damaging relationships despite good intentions.\n\nLearning from this, this proposer commits to onboarding computational commons contributors—workshop facilitators, schema architects, cultural consultants building on delegated representatives from over fifty-one countries, translators emphasizing subject-object-verb structures across eight languages, disaster specialists, rural revitalization experts, legal advisors across UK, Swiss, and Japanese contexts, technical writers, community coordinators, partnership liaisons, and video producers—only after funding receipt and stable currency conversion ensuring reliable compensation.\n\nThis milestone-threshold approach protects both contributor relationships and project reputation. Should early milestones not achieve objectives as community determines, funding firewall ensures remaining allocations stay secure rather than creating cascading failures. Given eight years visible participation, reputation preservation through honest execution carries paramount importance.\n\nThe approach provides latitude for adapting to emergent realities while maintaining accountability through deliverable-based evaluation, with transparent communication about challenges and good-faith efforts toward objectives.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Preface: Important Note on ADA Price Collapse **\n\n\n\n_When Fund 15 budget thresholds and category limits were being conceived and set \\(September–early October 2025\\), ADA was trading at approximately £0\\.60 GBP and ¥120 JPY per ₳1\\. All budgeting and scoping for this proposal \\(both the original milestone amounts and the detailed line items below\\) were prepared in good faith using those exchange rates\\._\n\n\n\n_In the roughly one to two months since then — from when the Fund 15 budget and thresholds were being set — ADA has halved to around £0\\.30 GBP and ¥60 \\(as of 27 November 2025\\)\\. This means the fixed\\-ADA budget presented here now delivers only about half the originally assumed fiat purchasing power for salaries, international travel \\(London & Tokyo\\), venue costs, regulatory work, and development hours\\._\n\n\n\n\n\n_The proposer remains fully committed to delivering every promised milestone and output, but voters should understand that the requested ADA amount now represents approximately double the real\\-world cost that was assumed when Fund 15 rules and expectations were established\\._\n\n\n\nMilestone 1 (Month 4, ₳45,000):\n\nCore architecture development (₳20,000), wallet infrastructure (₳10,000), developer resources &amp; setup (₳8,000), documentation &amp; traceability (₳5,000), testing &amp; validation (₳2,000).\n\nMilestone 2 (Month 6, ₳31,728):\n\nSchema expansion (₳12,000), conversational interface development (₳10,000), performance characterization (₳6,000), documentation &amp; connection (₳3,728).\n\nMilestone 3 (Month 8, ₳31,728):\n\nSecurity assessment &amp; remediation (₳12,000), production environment preparation (₳10,000), operational validation (₳6,000), coordination documentation (₳3,728).\n\nMilestone 4 (Month 12, ₳15,000):\n\nReal-world applications (₳6,000), ecosystem enablement (₳4,000), joint synthesis (₳3,000), documentation &amp; evidence (₳2,000).\n\nTotal: ₳123,456","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"**Build\\.foundation** creates value through technical infrastructure explicitly designed as alternative to extraction-based architectures, enabling applications that protect individual autonomy rather than optimizing surveillance capitalism efficiency. The polymorphic resource definitions using EXI datum enable nuanced real-world representation where resources can simultaneously be tangible and intangible, creating permission systems reflecting complex stakeholder relationships rather than forcing binary ownership. This capability proves essential for applications ranging from indigenous land rights respecting cultural claims alongside legal ownership, through healthcare data honoring patient sovereignty while enabling research, to supply chain tracking acknowledging multiple interpretive frames around single physical items.\n\n\n\nThe wallet architecture rejecting recovery phrases removes the scaling barrier that prevents mainstream adoption, enabling billions of people to use blockchain systems without requiring technical sophistication or operational security discipline beyond what smartphone usage already demands. The programmatic wallet creation and social recovery mechanisms provide security through distributed trust relationships that align with how people naturally think about protection, making blockchain genuinely accessible rather than remaining niche technology for early adopters willing to tolerate complexity.\n\nThe conversational interface eliminating technical jargon enables people to express intent naturally and have the system generate appropriate technical specifications automatically. This accessibility transformation means that blockchain's capabilities become available to populations currently excluded not by intent but by the cognitive burden that technical interfaces impose. The on-device processing ensuring privacy while providing sophisticated inference demonstrates that protection and capability need not trade off against each other, challenging the false dichotomy between convenience and sovereignty that surveillance capitalism depends upon.\n\n\n\nThe counter-positioning strategy explicitly rejecting interoperability with extractive dApps creates competitive differentiation attracting users who value autonomy over convenience, establishing a closed security model around individual value creation that prevents external exploitation. This strategic choice acknowledges that some forms of closure actually enhance freedom by protecting spaces where individuals control their participation terms rather than being subject to platform surveillance and extraction. The incompatibility with recovery phrase assumptions and transparent mempool architectures positions build.foundation not as better implementation of existing paradigms but as fundamentally different approach serving genuinely protective values.\n\nThe disaster management applications demonstrate that the infrastructure solves meaningful real-world problems rather than being impressive engineering without practical utility. The prototype implementations using Japanese public data show how schema-governed coordination could enhance emergency response when earthquakes, tsunamis, typhoons, landslides, volcanic eruptions, or electromagnetic pulses create cascading crises requiring coordination across humans and potentially autonomous systems despite infrastructure damage disrupting normal communications. These applications provide compelling evidence that the technical choices made for principled reasons also enable critical practical capabilities.\n\nThe internationalization framework ensuring linguistic and cultural diversity gets represented authentically creates global accessibility that goes beyond translation to acknowledge that different languages structure thought differently and different cultures organize concepts differently. The subject-object-verb processing for Japanese creates generalizable patterns applicable to other language families, while the polymorphic resource definitions enable cultural claims to coexist within unified frameworks without requiring homogenization into Western categories.\n\n\n\nThe enterprise foundation established through twelve months of development creates credibility for subsequent institutional-scale proposals by demonstrating working implementations, validated technical approaches, growing community adoption evidenced through contributed schemas, and clear pathways connecting current capabilities to transformative applications in disaster management, healthcare privacy, property rights, and financial inclusion. The foundation positions build.foundation not as speculative moonshot but as proven infrastructure ready for scaling.\n\nThe synergistic relationship with sovereigns.institute demonstrated through joint closeout reporting shows how technical infrastructure and human governance create coherent vision where workshop insights inform architecture, implementation constraints shape governance, cultural diversity drives internationalization, and privacy needs determine cryptographic choices. The unity of \"man side\" and \"machine side\" presents build.foundation as component of larger coordinated effort rather than isolated technical project, creating narrative depth that isolated proposals cannot achieve.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Governance","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1649}