{"pr_id":"019ac2bf-be42-727b-af00-07e62cd74635","title":"Keysphere: Reinventing Self-Custody","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Self-custody is unnecessarily complex and physically fragile, making it difficult to use Cardano for use cases that require self-custody from all members of society (payments, digital identity, etc.)","solution":"Keysphere solves the physical security of seed phrase backups via a novel use of OpenPGP on Yubikeys. It enables encrypted, non-custodial, fully self-sovereign backup using hardware backed keys.","proposer_name":"Peter Doyle","proposer_relevant_experience":"Pete Doyle - Founder and engineer\n\nPete is the founder and sole engineer for the Fund 15 phase of this project. He's been an engineer for over 15 years, mostly on Android, and has an affinity toward building beautiful products with a high degree of UX fit and finish.\n\nHe's followed Cardano closely since the 2017 bull market and has a high degree of respect for, and affinity toward, the engineering practices espoused in the Cardano project.\n\nHe's worked for well run San Francisco/Bay-area startups as well as the former Grand Challenge at Amazon, an incubator for moonshot ideas capable of scaling to 1% or more of the world's population (on the order of ~100 million people).\n\nResume: [https://www\\.keysphere\\.ai/catalyst/resume](https://www.keysphere.ai/catalyst/resume)\n\nLinkedIn: [https://www\\.linkedin\\.com/in/petedoyle/](https://www.linkedin.com/in/petedoyle/)","url":null,"funds":120000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Keysphere: Reinventing Self-Custody","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Peter Doyle","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":120000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":8,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Self-custody is unnecessarily complex and physically fragile, making it difficult to use Cardano for use cases that require self-custody from all members of society (payments, digital identity, etc.)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Keysphere solves the physical security of seed phrase backups via a novel use of OpenPGP on Yubikeys. It enables encrypted, non-custodial, fully self-sovereign backup using hardware backed keys.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.keysphere.ai/catalyst","https://www.keysphere.ai/catalyst/whitepaper","https://www.keysphere.ai/catalyst/prototype-mobile","https://www.keysphere.ai/catalyst/resume","https://github.com/petedoyle"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"We are committed to a \"Don't Trust, Verify\" model.\n\nThe mobile client code will be _open-source_ so the community can verify that encryption happens client-side and keys are handled securely, never leaving the device. License to be determined, likely Apache 2.0 or GPL.\n\nThe backend storage service will be _source-available_, possibly via BUSL or AGPL. This ensures the community can audit the backend code for security while preventing direct commercial clones of the service infrastructure.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Identity & Verification","group":"Identity & Security"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Keysphere simplifies self-custody, enabling on-chain participation at population scale.  It uses a multi-key scheme to encrypt seed phrases, protecting against a myriad of physical threats such as a roommate finding your written seed phrase, a fire destroying it, or simply misplacing it.\n\nAs use of Cardano and partner chains increase, and more assets are digitized, the loss of a seed phrase will be catastrophic both financially, and in it's impact on one's life. Keysphere's multi-key scheme provides a myriad of ways to recover in these situations, while always maintaining full self-sovereignty.\n\nFor a full technical overview, please see [https://keysphere\\.ai/catalyst](https://keysphere.ai/catalyst).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The Keysphere MVP will be a mobile app that interfaces with each Yubikey's OpenPGP functionality via NFC. Then, using BIP-85, new keys can be created for any wallet you want to manage. The core entropy, BIP-85 indexes, and helpful metadata (wallet name, etc.) are encrypted client-side, then replicated online (or to a file in local storage).\n\nAs we get closer to release, builds will be available at [https://keysphere\\.ai/catalyst\\.](https://keysphere.ai/catalyst.)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"For this phase, the most realistic measure of success is shipping the MVP, and validating the security model with early testers.\n\n**Future impact:**\n\nFor future funds, I hope to add functionality that allows other applications to generate keys with an easy dialog (e.g. the &quot;Sign in with Google&quot; dialog on Android, but for cryptographic keys). I would expect to see a huge reduction in time to onboard for any app that implemented a future Keysphere SDK- dropping from 10+ minutes (writing down seeds) to less than 20 seconds. This solves the &quot;onboarding cliff&quot; for the entire Cardano ecosystem, while allowing users to retain full self-sovereignty.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"# Big idea\nI want to make self-custody of private keys for cryptocurrencies and digital identities easier by making physical security of seed phrase backups easier. Users encrypt their backups using hardware-backed keys on three or more low-cost hardware security modules (for now: Yubikeys), then use multiple encryption (think Russian nested dolls...) to ensure only certain combinations can recover the original seed phrase. This allows a great deal of protection from losing your seed phrase over time, even if you lose one or more Yubikeys.\n\n\n\n**Proposed combinations:**\n\n\n\n- Any one Yubikey + passphrase\n- All Yubikeys + no passphrase (passphrase recovery)\n- (Future/TBD) Any one Yubikey + no passphrase (forgotten) + 2 of 3 centralized recovery services verifying your identity*\n- (Future/TBD) No Yubikeys (all lost) + Passphrase + 2 of 3 centralized recovery services (in separate legal jurisdictions) verifying your identity*\n- (Future/TBD) No Yubikeys (all lost) + No Passphrase (forgotten) + 3 of 5 centralized recovery services (in separate legal jurisdictions) verifying your identity*\n- By encrypting the seed phrase with keys held on Yubikeys, it reduces the amount of physical security required to secure seed phrases. For example, you could have a family member hold a copy for you without worrying that they could recover your seed phrase.\n\n\n\nThe combinations are highly adaptable. The centralized recovery options are not required, but I think there's a path to making that work with a reasonably low risk to self-sovereignty (for many people's needs, at least.) and also in a way that protects users from themselves (even if they lose one or more Yubikeys.)\n\n\n\nThe MVP is a mobile app, but long-term (not part of this initial proposal) I want to run this on secure hardware, possibly on a new generation of hardware wallets (made by us, or others, as an open standard.)\n\n\n\n**What I've built so far**\n\nThis idea hinges on giving users low-cost hardware security modules. To make the MVP easier, I'm starting by using the Yubikey 5 series' support for the OpenPGP card standard. This means I don't need to build new hardware.\n\n\n\nI've built the backend code to communicate with Yubikeys over NFC and talk to the OpenPGP card application. I can configure the Yubikey, generate keys (X25519 keys generated in hardware, unable to be exported), and use the public key to encrypt data only the Yubikey can decrypt. I can also decrypt the data with the Yubikey. To encrypt, I'm using X25519 and XChaCha20-Poly1305-IETF.\n\n\n\nThis was the largest technical hurdle to clear. It works end-to-end: I can communicate with Yubikeys, I can communicate with the Yubikey OpenPGP application, I can create hardware-backed public/private keypairs, I can encrypt data, then decrypt it with keys held in Yubikey hardware. Next, I can add support for multiple Yubikeys, then build out the rest of the app according to the prototype: [https://www\\.keysphere\\.ai/catalyst/prototype\\-mobile\\.](https://www.keysphere.ai/catalyst/prototype-mobile.)\n\n\n\n**Where you can find and play with it to verify**\n\nFor the latest dev build and instructions on how to test, please see [https://www\\.keysphere\\.ai/catalyst/app\\-instructions\\.](https://www.keysphere.ai/catalyst/app-instructions.)\n\n\n\n**What I intend to do as a result of this proposal**\n\nI'll be building an MVP capable of backing up seed phrases, encrypted with keys held on 3 (or more) Yubikeys. The initial designs can be seen in the Figma prototype here: [https://www\\.keysphere\\.ai/catalyst/prototype\\-mobile\\.](https://www.keysphere.ai/catalyst/prototype-mobile.)\n\n\n\n**In\\-depth**\n\nSometimes I think about a world where crypto wins. Where all value is tokenized on blockchains. What if my mom (not tech savvy) needed to secure her entire retirement savings? Would she be able to securely handle her seed phrase, when no one could help her if she lost it? What if someone broke in to her house and took her seed phrase? What if her house burned down? What if war erupted and she had to flee her home at a moment's notice, never to return (like in Ukraine or Gaza)? At such a difficult time, would she also lose access to communication apps and social media accounts attached to her digital identities/DIDs? The result would likely be permanent loss, with no recourse.\n\n\n\nAt global scale, all of these events happen every day. Without solving for them, self-sovereign key management (and decentralized identity) is incomplete and--in my opinion--unlikely to succeed.\n\n\n\nWhile some of these are preventable with steel/titanium backup plates, this is highly technical and still requires the user to properly conceal their backups. Even so, these do not protect in cases like Gaza where entire buildings are rubble. Even if you could return home, could you find your seed phrase in the rubble of a 10 story building? What are the odds someone else will come across them before you do? Will you rush back before it's safe in hopes no one will find it before you?\n\n\n\nKeySphere helps, even in extreme cases like Gaza:\n\n\n\nThe decryption keys are on secure hardware, so even if someone finds a Yubikey before you they can't access anything.\n\n\n\nSeed phrases are safely replicated geographically- they are not on the Yubikeys, so there's less need to return home\n\n\n\nBecause you're used to carrying one of your Yubikeys (as recommended by the app- on a keychain, etc.), you're likely to have one with you even if you fled quickly.\n\nEven if you didn't, the centralized recovery options (optional) can protect in some cases. KeySphere would be a great help in cases like these.\n\n\n\nSo now consider: in a future world where your entire life (medical records, house title, access to websites, communication platforms, etc.) and livelihood (savings, money, tokenized assets, etc.) depend on your ability to securely hold your keys, would you want to be protected in such cases? It seems worthwhile to explore the idea (and Catalyst seems like a great place to do so.)\n\n\n\nI strongly believe the lack of simpler and safer key management schemes will prevent mass adoption of crypto and decentralized identity. Solved well, it will enable them.\n\n\n\nThis project aims to:\n\n\n\n1. Make it safe to replicate seed phrases online by encrypting them with 256-bit keys containing their full entropy; as opposed to the reduced entropy of password-based key derivation.\n2. Solve the loss and disclosure of those keys by storing them on secure hardware and giving the user multiple copies that they can distribute among multiple physical locations.\n3. Solve extreme edge cases (displacement due to war, etc.) by creating a system that's configurable enough to support (some day, not part of this proposal) centralized recovery, social recovery, and inheritance planning, while keeping a high degree of self-sovereignty.\n\n\n\nThere is much renewed interest in this space recently, with varying degrees of self-sovereignty built into their designs. This proposal intends to build a solution that is maximally self-sovereign and useful in a multi-chain world, with no need to trust anyone, even family/friends/neighbors/banks/etc. who might physically store one of your Yubikeys for you.\n\n\n\nBy funding this proposal, the Catalyst project can enable this research into simplifying self-sovereign key management for millions of users in the future.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"If you're a voter or proposer in Catalyst, you know the pain of managing keys. For mass adoption, this friction must be removed.\n\nWith the MVP, it becomes possible to backup seed phrases in Keysphere, encrypted with hardware-backed keys **only you control**. This enables a future where creating a new wallet takes seconds, not minutes.\n\n\n\nBy solving the physical security of seed phrases, we remove a large barrier to entry for non-technical users entering the Cardano ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Capabilities**\n\n\n\nI have been a software engineer for about 15 years, working at a variety of startups as well as Amazon.\n\n\n\nAt Amazon, I led the core infrastructure team for the Amazon Care for Android app, a HIPAA-compliant healthcare service where privacy and security are critical. As part of that work, I designed and implemented on-device encrypted caching capable of securely caching protected health information (PHI). It passed security review on the first try, when common thought was that no such system could pass.\n\n\n\nI also created a scalable internal-facing Maven proxy service that helped Amazon's Android developers work more effectively. The service was built with minimal attack surface and has run reliably, and securely, for six years. It passed security review internally, as well as external vendor pen-testing, with zero findings.\n\n\n\nI also have a high bar for user experience, and a deep conviction around the importance of self-sovereignty.\n\n\n\nThe combination of these things lays a solid foundation for work on this project.\n\n\n\n**Feasibility**\n\n\n\nThe director of Google X, Astro Teller, is fond of telling people to work on the hardest part of breakthroughs first (video). This reduces the time to true breakthroughs by surfacing intractible problems more quickly. I've taken this to heart with Keysphere.\n\n\n\nI have already validated and built the hardest parts, specifically:\n\n\n\n1. Connectivity and Communication with Yubikeys over NFC.\n2. Communication with the Yubikey OpenPGP smartcard application.\n3. Initialization and secure configuration of multiple Yubikeys, including generation of hardware-backed X25519 keys (generated in hardware, unable to be exported, .\n4. Encryption / decryption based on hardware-backed keys in Yubikeys.\n5. Initial Rust-based backend that is privacy-preserving, holding no personal data about users (email, name, etc.)\n6. API authentication and authorization based on X25519 signatures (there are no usernames, or passwords)\n7. Account creation.\n8. Key generation for multiple wallets based on BIP-85.\n9. Kotlin Multiplatform codebase so we can deliver on Android, iOS, and Desktop.\n10. Rust integration with Kotlin Multiplatform for full access to robust cryptographic implementations that work cross-platform.\n11. Navigable implementation of all pages in the app in skeleton form.\n\n\n\nI am currently working on:\n\n\n\n1. Standardized file format for seed phrase backup that can be publicly documented, and implemented independently.\n2. Multi-layer encryption (simple, once file format design is complete.)\n\n\n\nBefore MVP, the remaining work is relatively easy (or, lower risk) in comparison:\n\n\n\n- Implement login based on X25519 signatures (API side already implemented, app-side signatures already work. Just tying them together...)\n- Implement high fidelity UX (currently implemented as wireframe level UX)\n- Harden and deploy backend service.\n- Harden and review mobile app.\n- General testing and stabilization.\n\n\n\n**_The hardest parts are done\\. The remaining work is low\\-risk\\._**","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Basic setup flow resulting in initialization of all three Yubikeys","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Preview build of Android app that allows:\n2. Walking through the setup process to initialize keys on each Yubikey.\n3. Encryption/decryption of simple text fields to show encryption and decryption work end-to-end.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The app build must allow:\n\n\n\n1. Setting up three Yubikeys and a recovery phrase\n2. Encrypting a message (of any sort, not necessarily a seed phrase)\n3. Using the recovery phrase and any 1 Yubikey to decrypt the message.\n4. It does not need to persist data locally at this stage. An in-memory test app is sufficient.\n5. The Yubikeys should be configured securely once setup is complete:\n6. PINs should be set so they're not using the default\n7. PINs should use the key derivation function (KDF) feature of the OpenPGP Card spec so they are not transferred as plain text over the air.\n8. Max PIN attempts should be set appropriately to prevent brute force attempts\n9. Curve25519 should be used on each Yubikey (X25519 / Ed25519)\n\n\n\nNot part of Acceptance Criteria:\n\n(Added for clarity)\n\n\n\n1. Entirety of setup flow, specifically not including:\n2. Account creation / syncing of data to a backend\n3. Extensive error handling for things like:\n4. A Yubikey is already initialized.\n5. Don't allow setup to continue if user does not have at least 3 uninitialized Yubikeys.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. A video of the setup flow being completed, and output from ykman and OpenPGP showing the Yubikeys (\"cards\") have been initialized.\n2. An Android .APK file that can be used to verify (verifiers must have three unused Yubikey 5 devices supporting NFC to use it. This is why the video is provided as well.)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"File format specification and near-complete setup flow","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. File format draft specification containing details of the file format.\n2. Preview build of Android app that allows for:\n3. Everything previously delivered, plus:\n4. Generating all the info that will be required to create an account (random account number, PINs for Yubikeys, etc.), even if it's not connected to a real API.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. There must be a document containing a draft specification of the file format.\n2. Even though we may not have an API yet, the app should do the following during setup to prepare for API support:\n3. Generate a random account number.\n4. Write that account number to each Yubikey during setup.\n5. Generate random PINs for each Yubikey\n6. At the end of setup, this app version should output (on screen) or log the account number and random PINs at the end of setup so it's easy to verify they were created during setup.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A document or web page containing the file format specification, with enough detail that a third party implementer could reasonably decrypt a test file with a given private key (test vectors).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Ability to create new seed phrases","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Preview build of Android app (an APK file) that allows for:\n\n\n\n1. Everything previously delivered, plus:\n2. Generation of many BIP-39 seed phrases using BIP-85.\n\n\n\nIdeally without needing any Yubikeys for testers to confirm.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. After setup is complete, it should be possible to create new (and multiple) BIP-39 seed phrases from the BIP-85 root seed.\n2. There must be test cases to confirm compliance with the BIP-85 test vectors.\n3. The test cases must run in CI, and should block PRs from being merged if the tests fail.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- A video showing the functionality.\n- An Android APK that can be installed to verify (Just a test build that bypasses any need for Yubikeys)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"App UI for all screens, persistence for seed phrases","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Preview build of Android app that allows for:\n2. Everything previously delivered, plus:\n3. UI for all screens shown in the Figma prototype, and the ability to navigate between them.\n4. Round-trip encrypted persistence in the draft file format (locally on the phone, or to an API).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. App should look like the Figma prototype.\n2. It should be possible to walk through setup to prepare the Yubikeys and generate account numbers/PINs/etc.\n3. It should be possible to generate BIP-39 seed phrases using BIP-85 and save the metadata required to generate each key in the file.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. A video showing the various screens in the app.\n2. An Android APK that can be installed to verify (with some functionality excluded so verifiers don't require Yubikeys to test.)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Alpha build released to private testers","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Alpha build of Android app. Nearly feature-complete, and ready for testing and early feedback.\n2. A video allowing for verification of app functionality, without requiring verifiers to buy Yubikeys.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. App should near feature complete with regard to the Figma prototype.\n2. Connects to and interacts with backend API for persistence.\n3. Delivery to a closed group of alpha testers for early feedback.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. A video allowing for verification of app functionality, without requiring verifiers to buy Yubikeys.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #6","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Launch of \"private beta\" to gather real customer feedback","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Launch in private beta to a small number of potential customers.\n2. Catalyst Project Close-out Report and Project Close-out Video\n3. App .apk file for side-loading, or a link / private beta invite to the Google Play Store.\n\n(Note: A wider public &quot;launch&quot; is not part of this Fund 15 work. We may wait to do a full public launch until we can properly fund security audits, etc. (not a part of this proposal.)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Above deliverables complete.\n2. App works end-to-end, including persistence to either a file (e.g. saved on a phone's cloud storage) or an API (or both).\n3. Launch materials available to beta participants:\n    - Website\n    - Blog post\n    - Technical documentation (a small amount to help customers understand the design)\n    - One or more means by which customers can give feedback (email, or in-app call-to-action, or surveys, or user interviews, etc.)\n\n\n\n**Uncommitted stretch goals:**\n\niOS support. The existing code uses Kotlin Multiplatform, and is close to having full iOS support. We hope to have this available by the final milestone, but it's an uncommitted stretch goal and not guaranteed as part of this proposal.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Launch materials complete and available to verifiers:\n\n\n\n1. Website\n2. Blog post\n3. Link to app (either a release APK or link to Play Store beta)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Pete Doyle - Founder and engineer\n\nPete is the founder and sole engineer for the Fund 15 phase of this project. He's been an engineer for over 15 years, mostly on Android, and has an affinity toward building beautiful products with a high degree of UX fit and finish.\n\nHe's followed Cardano closely since the 2017 bull market and has a high degree of respect for, and affinity toward, the engineering practices espoused in the Cardano project.\n\nHe's worked for well run San Francisco/Bay-area startups as well as the former Grand Challenge at Amazon, an incubator for moonshot ideas capable of scaling to 1% or more of the world's population (on the order of ~100 million people).\n\nResume: [https://www\\.keysphere\\.ai/catalyst/resume](https://www.keysphere.ai/catalyst/resume)\n\nLinkedIn: [https://www\\.linkedin\\.com/in/petedoyle/](https://www.linkedin.com/in/petedoyle/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**₳90,000 \\- Engineering and development**\n\nSoftware engineering and development work.\n\n**₳11,000 \\- Design**\n\nContract design help for UX and visual polish.\n\n**₳9,000 \\- Legal**\n\nBasic legal services to craft a privacy policy, terms of service, etc. These will require custom text to handle of our (near) zero knowledge design, which is rare.\n\n**₳5,000 \\- Marketing &amp; Community Engagement**\n\nBasic marketing materials to support communit engagement.\n\n**₳5,000 \\- Yubikeys for early testers**\n\nWe will purchase and drop-ship Yubikeys directly from Yubico to 10 selected early testers. Drop-shipping from Yubico helps ensure supply chain security for testers.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"It helps make key management easier for all users, enabling use of Cardano at a larger scale. It opens opportunities for applications that run at the society scale (government identity, e-voting, etc.) by making self-custody possible for a wider range of people, especially those who struggle with technology.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Identity & Verification","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1651}