{"pr_id":"019ac2c2-d423-7aa9-b63a-f93dcb2fa5fa","title":"Project Catalyst dRep Analysis Framework","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Low voter participation, quadratic voting without Sybil protection, and unclear Catalyst dRep guidance risk undermining Catalyst’s decentralization vision ","solution":"Build an open, reusable framework to guide voters and dReps in making informed, transparent, value-aligned decisions, strengthening decentralization and decision quality in Catalyst","proposer_name":"Rodrigo Pacini","proposer_relevant_experience":"**Rodrigo Pacini, Project Manager and Researcher **\n\nActively involved in Project Catalyst since Fund 2, working as a Veteran Community Advisor, Veteran Proposal Assessor (Level 2 Reviewer), Moderator, and Milestone Reviewer. Since Fund 11, as a Milestone Reviewer, reviewed over 30 funded proposals and more than 100 Proof of Achievement (PoA) and Statement of Milestones (SoM) submissions, contributing directly to the accountability and transparency of Catalyst-funded projects. Funded proposer in Fund 10 and hosted Twitter(X) Spaces for the Manifesto Cardano Brasil project. Project manager for “DReps LATAM – Brasil – Exploration &amp; Community Sensing.” proposal. Mentorship of proposers and contribution to the creation of quality assurance procedures for the review process. Co-creation of the “Red and Yellow Card Thing”, a set of review standards that was officially adopted and used across at least two Catalyst funds during the early moderation phases.\n\nPreviously, Cardano Ambassador Moderator. Research in economics, blockchain, and DeFi since 2018. BTech degree in Naval Construction.\n\n\n\nI served as one of the representatives responsible for proposal curation in the Distributed Decision-Making category within the Catalyst Representatives Pilot Program organized by the Cardano Foundation. This role allowed me to apply and refine governance-oriented evaluation criteria, engage in structured deliberation with other curators, and observe first-hand how decision-making frameworks impact proposal quality and prioritization. The experience produced a pilot/MVP of the analytical approach that is now being expanded, formalized, and deepened in this proposal.\n\nMy curated list related to FUnd 14 is avaikabkle below\n\n[https://forum\\.cardano\\.org/t/catalyst\\-representative\\-pilot\\-f14/149351/4](https://forum.cardano.org/t/catalyst-representative-pilot-f14/149351/4)\n\n[https://forum\\.cardano\\.org/t/distributed\\-decision\\-making\\-list\\-of\\-proposals\\-endorsed\\-by\\-rodrigo/149613](https://forum.cardano.org/t/distributed-decision-making-list-of-proposals-endorsed-by-rodrigo/149613)\n\n[https://x\\.com/RodrigoPacini/status/1973476574608474152](https://x.com/RodrigoPacini/status/1973476574608474152)\n\n🔗 Links:\n\n[https://linkedin\\.com/in/rodrigopacini](https://linkedin.com/in/rodrigopacini)\n\n[https://projectcatalyst\\.io/proposers/rodrigopacini](https://projectcatalyst.io/proposers/rodrigopacini)\n\n[https://github\\.com/Rodrigopacini/RodrigoPacini](https://github.com/Rodrigopacini/RodrigoPacini)\n\n\n\n\n\nEduardo Silka - Governance Researcher\n\nBlockchain Researcher focused on governance, public sector applications, and distributed systems. Master’s student in Public Governance and Planning, with research in blockchain governance, exploring how blockchain reshapes transparency, accountability, and decision-making in government. Architect and Urban Planner, with a thesis on blockchain as a technopolitical tool for smart cities. Associate researcher of iCoLab (Collaborative Institute of Blockchain) and former Intersect associate (Cardano).\n\n🔗 Links:\n\n[https://www\\.linkedin\\.com/in/eduardo\\-silka/](https://www.linkedin.com/in/eduardo-silka/)","url":null,"funds":59934,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Project Catalyst dRep Analysis Framework","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Rodrigo Pacini","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":59934,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Low voter participation, quadratic voting without Sybil protection, and unclear Catalyst dRep guidance risk undermining Catalyst’s decentralization vision ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Build an open, reusable framework to guide voters and dReps in making informed, transparent, value-aligned decisions, strengthening decentralization and decision quality in Catalyst","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://agora-cardano.carrd.co/","https://github.com/Agora-Cardano","https://manifestocardanobrasil.gitbook.io/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"The key dependency is the implementation of a vote delegation feature on Project Catalyst. According to the Project Catalyst Moderation Module, the next deliverables for the Catalyst Voices project also involves the voting delegation feature and recent updates from the Catalyst team suggest that the updates are close to happening in Fund 16. There is still a considerable amount of time between the time I am writing the proposal submission and the possible start of this work, so it is very likely that this feature will already be available when this proposal is approved.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All research documentation aassociated content will be made available in public repositories such as GitHub and Gitbook. All documentation will be dispatched under the license Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International.\n\n","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Governance","group":"Governance"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Targeting active and prospective Cardano voters, dReps, and governance contributors—addressing concentrated voting power and low unique wallet participation in Project Catalyst. We will reach them via open-access reports, multilingual threads on X, governance forums, and partnerships with community hubs, paving the way for dReps to develop methodologies, criteria, and strategies for proposal selection ahead of key shifts like quadratic voting and delegation—strengthening decentralization, voter confidence, and treasury efficiency.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"- Develop the Catalyst dRep Analysis Framework\n- Conduct multi-stage governance research\n- Host co-creation workshops with dReps and community\n- Create and analyze bilingual questionnaires\n- Produce bilingual research reports and educational videos\n- Publish content on GitBook, YouTube, and X\n- Implement AI-assisted translation and technical writing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"🎯 KPIs\n\n\n\n- 20 Catalyst dReps engaged with the framework\n- ₳50M delegated to dReps identified as framework users\n- 200 unique wallets delegating to Catalyst dReps\n- 80%+ approval rating (rated as good or excellent) in user satisfaction surveys about the framework\n- Average engagement rate above 4% on posts published on X\n\n\n\n📊 Metrics\n\n\n\n- Social media metrics: impressions, likes, comments, retweets, followers\n- Number of surveys completed\n- Number of unique wallets registered within this project voting on Catalyst\n- Number of Catalyst dReps and individual voters onboarded","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Addressing Systemic Governance Challenges\n\nThis proposal directly addresses two systemic challenges in Project Catalyst governance:\n\n\n\nConcentration of voting power among a small set of highly delegated dReps\n\nLow participation of unique wallets and informed voters in funding decisions\n\nAs Cardano scales to thousands—and potentially millions—of stakeholders, governance becomes increasingly complex. Perspectives, priorities, and socio-cultural realities differ widely across micro-communities: geographic (e.g., Japan, Africa, LATAM) and interest-based (e.g., DeFi, NFTs, governance). For Catalyst to remain plural, representative, and decentralized, both voters and dReps must have access to tools that enable structured, transparent, and value-aligned decisions.\n\n\n\nOur solution is to design, pilot, and disseminate a transparent, community-led governance framework that enables Catalyst voters and Catalyst dReps to filter, evaluate, and prioritize proposals in alignment with their delegators’ interests and the specific priorities of different micro-communities, with solid evaluation criteria, such as accountability, reputation, expertise and planning.\n\n\n\n\n\nTwo Core Purposes\n\nEmpower voters to analyze proposals, create informed voting lists, and cast intentional votes.\n\nGuide Catalyst dReps in responsibly assessing and prioritizing proposals to faithfully represent their delegators.\n\nThe approach is grounded in real-world community sensing we have already conducted in the Lusophone Cardano community, which led to the creation of the Manifesto Cardano Brasil — a set of community-guided principles now forming part of the foundation of this framework.\n\n\n\nProject Structure – Three Core Development Steps\n\nStep 1: Proposals Filtering Framework (PFF)\n\nWe will define categories and themes that reflect micro-community priorities and create methods for filtering proposals accordingly. Research will cover:\n\n\n\nStrategic relevance (alignment with Cardano’s roadmap and governance goals)\n\nLocal impact (regional or cultural significance)\n\nEquity of access (support for underserved communities)\n\nEcosystem synergy (integration with existing Cardano infrastructure)\n\nTeam delivery history (performance data from Milestone & Keychain records)\n\nWe will explore filtering strategies such as Catalyst’s native tags, keyword mapping, and AI-assisted classification.\n\n\n\nOutputs: methodological documentation and filtering guidelines, published openly on GitBook.\n\n\n\nStep 2: Proposals Analysis Framework (PAF)\n\nWe will develop structured methods for evaluating Catalyst proposals. Research will:\n\n\n\nCompare evaluation models from other ecosystems (e.g., Gitcoin, Optimism RetroPGF, Arbitrum Grants, Thrive Protocol)\n\nDefine criteria and weighting strategies\n\nExplore responsible AI integration for scalable, high-quality reviews\n\nDevelop reusabolle prompt libraries, review templates, and synthesis workflows\n\nTest low-code tools (e.g., n8n) for automating repetitive review and publication tasks\n\nGoal: a practical, adaptable open guide for Catalyst dReps and voters that leverages AI without compromising analytical depth or fairness.\n\n\n\nStep 3: Analysis Dissemination Framework (ADF)\n\nThis phase focuses on best practices for sharing proposal analyses, curated lists, and voting rationales in clear, accessible formats.\n\n\n\nChannels:\n\n\n\nGitBook documentation\n\nTwitter/X threads\n\nYouTube explainers\n\nMedium & forum posts\n\nTelegram updates\n\nPodcast-style recordings\n\nWe will also produce an onboarding and educational package:\n\n\n\n9 short tutorial videos\n\n7 written guides\n\n2 explanatory articles\n\nLanguages: English, Portuguese, Japanese.\n\n\n\nWhy This Solution Works\n\nThis project builds governance literacy, strengthens the link between delegators and dReps, and reduces reliance on voting driven by personal bias or by superficial convenience. By providing clear methodologies and transparent rationales, it increases voter confidence and ensures treasury funds are allocated to proposals that truly reflect community priorities.\n\n\n\nIt also addresses a key gap: most voters and many dReps lack standardized, scalable ways to assess hundreds of proposals in limited time. Through AI-assisted workflows—combined with human review—we reduce the time and cost per evaluation while maintaining quality and methodological integrity.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Impact and Benefits to the Cardano Community\n\n\n\nThis proposal delivers a direct and measurable impact on both voters and Catalyst dReps by providing a clear, transparent, multilingual, and reusable framework for proposal evaluation within Project Catalyst. It addresses the systemic challenges of lower leves of informed participation, concentration of voting power, and lack of standardized methodologies for decision-making—issues that become increasingly critical as Cardano governance scales.\n\n\n\nImpact on Voters\n\nFor voters, the framework promotes:\n\n\n\nInformed decision-making – By offering accessible guides, tutorials, and evaluation tools, voters will have the ability to filter and assess proposals against shared principles and micro-community priorities.\n\n\n\nGreater trust in governance – Transparent criteria and consistent methodologies help ensure that voting outcomes are representative and mission-aligned.\n\n\n\nLower participation barriers – The multilingual approach (English, Portuguese, Japanese) and simplified onboarding resources allow non-English speakers and new participants to engage effectively.\n\n\n\nBy making proposal evaluation simpler, clearer, and more transparent, the framework empowers individual voters to play an active role rather than defaulting to passive delegation.\n\n\n\nImpact on Catalyst dReps\n\nFor dReps, the framework provides:\n\n\n\nConsistent methodology for assessing proposals, ensuring accountability and transparency in representing delegators’ interests.\n\n\n\nAlignment with shared values and principles derived from community sensing and the Manifesto Cardano Brasil.\n\n\n\nScalable review capacity through responsible AI-assisted workflows that reduce time and cost per analysis without sacrificing quality.\n\n\n\nStronger communication with delegators via curated lists, documented rationales, and structured reports.\n\n\n\nThis increases the quality of representation while improving delegator confidence in how their voting power is being exercised.\n\n\n\nAlignment with Catalyst Voices and On-Chain Delegation\n\nThe framework will complement the Catalyst Voices initiative by providing a practical layer of transparent best practices for both voters and dReps. As Catalyst implements on-chain vote delegation, this framework ensures that delegation is not blind—it is guided by clear, public, and verifiable evaluation processes.\n\n\n\nDriving Decentralization and Inclusivity\n\nBy structuring and publishing community-driven methodologies, this proposal helps:\n\n\n\nDecentralize ADA voting power by making it easier for smaller, underrepresented dReps to demonstrate value and attract delegations.\n\n\n\nAmplify the voices of micro-communities (regional and interest-based) by integrating their priorities into the evaluation process.\n\n\n\nPrevent overconcentration of influence by empowering a broader range of governance actors with professional-grade tools.\n\n\n\nKPIs and Metrics for Measuring Impact\n\nThe project’s impact will be tracked through clear, quantifiable KPIs:\n\n\n\nEngage at least 20 Catalyst dReps with the framework.\n\n\n\nAchieve ₳50M in delegations to framework users.\n\n\n\nReach 200 unique wallets delegating to framework-aligned dReps.\n\n\n\nMaintain 80%+ satisfaction rate in user feedback surveys.\n\n\n\nAttain an average engagement rate above 4% on X posts (notably high for governance content under 10,000 followers).\n\n\n\nSecondary metrics include survey participation rates, growth in community channels, adoption of materials by other governance actors, and replication of the methodology by external groups.\n\n\n\nReturn on Investment for the Cardano Ecosystem\n\nThe ROI for this project is seen in:\n\n\n\nHigher legitimacy – More voters and dReps making decisions based on transparent, documented methods.\n\n\n\nBetter decision quality – Funding directed toward proposals that align with collective priorities and have been critically evaluated.\n\n\n\nBroader participation – Lowering entry barriers for non-English speakers and newcomers.\n\n\n\nLong-term reusability – Open-source materials and methodologies that can be adopted across multiple Catalyst rounds without additional cost.\n\n\n\nEducational and Onboarding Layer\n\nThe proposal includes a comprehensive educational package to extend its impact:\n\n\n\n9 short video tutorials\n\n\n\n7 written guides\n\n\n\n2 explanatory articles\n\n\n\nAll resources will cover topics such as how to vote, how to delegate, and how to apply the framework, and will be published in English, Portuguese, and Japanese. Materials will be reusable and accessible via GitBook, YouTube, Twitter/X, and Telegram.\n\n\n\nAlignment with the Cardano 2025 Product Roadmap\n\nSub-goal: Expand Cardano community participation\n\n\n\nThis project lowers participation barriers with localized content, inclusive workshops, and incentivized feedback forms, driving onboarding of voters and dReps in underrepresented regions.\n\n\n\nSub-goal: Stabilize Cardano governance post-bootstrapping\n\n\n\nThe framework creates a shared foundation for proposal evaluation, reducing ambiguity, ensuring methodological consistency, and strengthening governance resilience.\n\n\n\nSub-goal: Improve governance education and communication\n\n\n\nWe will deliver multimedia, multilingual content to clarify governance processes and encourage informed participation.\n\n\n\nSub-goal: Refine and expand core governance tools via open contribution\n\n\n\nAll outputs will be open-source and modular, encouraging community co-creation, adaptation, and integration with other governance initiatives.\n\n\n\nLong-Term Ecosystem Benefits\n\nBy combining open source frameworks, AI-driven efficiency, multilingual accessibility, and public transparency, the proposal creates a scalable governance infrastructure that can evolve alongside Catalyst and the broader Cardano governance landscape. The methodologies, content, and tools developed will remain freely accessible for future governance cycles, creating compounding value over time.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Leadership and Governance Track Record\n\n\n\nThe Catalyst dRep Analysis Framework project is led by Rodrigo Pacini, an experienced governance contributor in the Cardano ecosystem with an extensive track record of proposal review, proposals completed with success, challenge setting, and milestone validation. His work has directly shaped funding priorities, treasury oversight, and governance accountability within Project Catalyst since Fund 2.\n\nProven Delivery Experience\n\n\n\nSuccessfully delivered the Manifesto Cardano Brasil proposal in Fund 10, meeting all deliverables, publishing multilingual outputs, and fulfilling reporting requirements.\n\nFunded proposer for Fund 7 – Cardano Ambassadors & Latin America and Fund 10 – DReps LATAM – Brasil – Exploration & Community Sensing, producing research, workshops, and public engagement on governance (including CIP-1694).\n\nProject manager for DReps LATAM – Brasil, which laid the groundwork for governance research and community sensing in Latin America.\n\nExtensive Governance Roles\n\n\n\nGrant Reviewer (Community Reviewer – Level 1) – Reviewed over 1,000 proposals, assessing impact, feasibility, and value for money, providing voters with qualitative rationales to make informed decisions.\n\nQuality Assurance Analyst (Veteran Community Advisor – Level 2) – Moderated over 3,000 peer reviews, ensuring clarity, fairness, and accuracy, while flagging biased or low-quality assessments.\n\nModerator – Co-developed the widely adopted “Red and Yellow Card Thing” standard for review integrity, improving review quality across at least two Catalyst funds.\n\nMilestone Reviewer (since Fund 11) – Validated 100+ Proofs of Achievement (PoAs) and Statements of Milestones (SoMs) for funded projects, directly influencing treasury disbursements by enabling or blocking payments based on delivery evidence.\n\nChallenge Setting and Funding Impact\n\n\n\nAuthored/co-authored 9 approved Challenge Settings across multiple funds, collectively mobilizing nearly $3 million USD in Cardano Treasury funding.\n\nThese challenges seeded or scaled some of Cardano’s most impactful projects and infrastructure, including:Minswap, Liqwid, Spectrum Labs, Mlabs, Indigo, Charli3, Ledger Live Integration, Yoroi, TxPipe, Lucid, Ogmios, Cexplorer, Adapools, Socious, LATAM Town Hall, ALDEA DAO, Catalyst Swarm, Catalyst School, and many others.\n\nActive Governance Leadership\n\n\n\nActive dRep since early 2025 with over 40 on-chain votes cast and fully documented rationales published on GitHub for public accountability.\n\nLead of the Agora Research Bureau, producing governance action reviews, public rationales, and educational threads on governance, all on a voluntary basis prior to this proposal.\n\nFormer Cardano Ambassador Moderator with research experience in economics, blockchain, and DeFi since 2018.\n\nHolds a BTech degree in Naval Construction.\n\nRodrigo’s combination of funded delivery, governance process expertise, and direct influence over multi-million ADA funding priorities establishes a high level of credibility and execution capacity for this proposal. His hands-on involvement in reviewing, moderating, and validating both proposals and milestones ensures that the Catalyst dRep Analysis Framework will be executed with rigor, transparency, and measurable community impact.\n\n\n\nValidated Community-Driven Approach\n\n\n\nBefore submitting this proposal to create the Catalyst dRep Analysis Framework, we deliberately carried out a validation stage through the Manifesto Cardano Brasil initiative. The success of this initiative gave us the confidence to proceed with developing a structured, open-source framework.\n\n\n\nOver several months, more than 80 contributors shaped both the Manifesto and the Critical Missions for Brazilian and Lusophone dReps document through public debates on X, surveys, and collaborative writing. These initiatives produced distinct governance guidelines supported by the dozens of members of the Cardano community, advocating for multilingual education, proposal analysis tools, transparency in dRep activities, and culturally inclusive engagement.\n\n\n\nThe priorities identified in these grassroots processes are now transformed into a practical, open-source framework aimed at empowering both voters and Catalyst dReps. It seeks to onboard more community members into Catalyst, educate them on governance, and improve distributed decision-making—with more voting power exercised by both individual voters and dReps. This framework is not merely a personal concept, but the outcome of a structured, community-confirmed process, validated by active participation and public endorsement.\n\n\n\n🔗 [https://manifestocardanobrasil\\.gitbook\\.io](https://manifestocardanobrasil.gitbook.io)\n\n\n\nBeyond this foundation, this proposal directly addresses pressing governance gaps that have fueled visible community dissatisfaction. The concentration of voting power in a small number of actors has enabled highly centralized decision-making, often without publicly shared criteria, transparent rationale, or broad community input. This dynamic has raised concerns about the resilience, inclusiveness, and legitimacy of Catalyst’s governance model, underscoring the urgent need for community-vetted, value-aligned frameworks to guide voting behavior and strengthen trust in the decision-making process.\n\n\n\nAt the same time, the ongoing **budget proposal revision process and Governance Actions reviews, **under which this proposall was being prepared, has exposed another structural weakness: the scarcity of structured, coordinated, consistent, and publicly documented analysis from most dReps. Despite the critical nature of this moment for shaping Catalyst’s future, only a few dReps have engaged in transparent reviews grounded in shared values or established methodologies. This lack of diligence reveals a systemic gap that this framework is designed to fill.\n\n\n\nIn essence, this proposal is both a grassroots-driven response to long-standing community priorities and a practical solution to urgent governance shortcomings. Its development is rooted in authentic community voice, while its relevance is reinforced by real-world governance failures that demand immediate, value-aligned intervention.\n\n\n\nThe Manifesto Cardano Brasil initiative demonstrated strong demand for governance research, transparent methodologies, and multi-language educational outputs, especially in underrepresented communities.\n\n\n\nThe values embedded in this proposal — structured analysis, multilingual accessibility, open publication, and active governance participation — have already been validated through sustained community engagement and adoption.\n\n\n\nClear Milestone Planning\n\n\n\nThis proposal contains a Statement of Milestones with explicit deliverables, acceptance criteria, and evidence requirements for each phase:\n\n\n\nProposal Filtering Framework\n\n\n\nProposal Analysis Framework\n\n\n\nAnalysis Dissemination Framework\n\n\n\nThe structure mirrors Catalyst’s milestone validation standards, ensuring measurable progress and transparent tracking.\n\n\n\nFeasibility & Risk Mitigation\n\n\n\nOutputs are modular and adaptable, enabling use across Catalyst proposal reviews, and educational onboarding.\n\n\n\nPublic repositories on GitHub and GitBook will host all materials, ensuring verifiability, easy access, and open contribution.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Proposals Filtering Framework(PFF)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Team Meetings\n- PFF (Proposals Filtering Framework) Research\n- PFF (Proposals Filtering Framework) Online Workshop\n- PFF (Proposals Filtering Framework) Online Workshop Report\n- PFF (Proposals Filtering Framework) Questionnaire\n- PFF (Proposals Filtering Framework) Questionnaire Report\n- PFF (Proposals Filtering Framework) FInal Document","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Team Meetings reports containing date, names of participants, topics discussed and insights obtained;\n- PFF Research report indicating methodologies for filtering proposals;\n- PFF Online Workshop held in X Spaces, will be recorded and uploaded to YouTube;\n- PFF Online Workshop Report containing information on topics discussed, ideas, insights and suggestions;\n- PFF Questionnaire form containing all questions;\n- PFF Questionnaire Report containing data and insights from the questionnaires;\n- PFF Document containing guidelines for Catalyst dReps.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Meetings reports documented on Gitbook;\n- PFF Research report documented on Gitbook;- PFF Online Workshop held in X Spaces, will be recorded and uploaded to YouTube and will be documented on Gitbook;\n- PFF Online Workshop Report will be documented on Gitbook;\n- PFF Questionnaire form documented on Gitbook;\n- PFF Questionnaire Report documented on Gitbook;\n- PFF Document published on Gitbook.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":12000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Proposals Analysis Framework(PAF)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Team Meetings;\n- PAF (Proposals Analysis Framework) Research;\n- PAF (Proposals Analysis Framework) Online Workshop;\n- PAF (Proposals Analysis Framework) Online Workshop Report;\n- PAF (Proposals Analysis Framework) Questionnaire;\n- PAF (Proposals Analysis Framework) Questionnaire Report;\n- PAF (Proposals Analysis Framework) Document.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Team Meetings reports containing date, names of participants, topics discussed and insights obtained;\n- PAF Research report indicating methodologies for analysis of proposals;\n- PAF Online Workshop held in X Spaces, will be recorded and uploaded to YouTube;\n- PAF Online Workshop Report containing information on topics discussed, ideas, insights and suggestions;\n- PAF Questionnaire form containing all questions;\n- PAF Questionnaire Report containing data and insights from the questionnaires;\n- PAF Document containing guidelines for Catalyst dReps.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Team Meetings reports documented on Gitbook;\n- PAF Research report documented on Gitbook;\n- PAF Online Workshop held in X Spaces, will be recorded and uploaded to YouTube and will be documented on Gitbook;\n- PAF Online Workshop Report will be documented on Gitbook;\n- PAF Questionnaire form documented on Gitbook;\n- PAF Questionnaire Report documented on Gitbook;\n- PAF Document published on Gitbook","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":12000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Analysis Dissemination Framework(ADF)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Team Meetings;\n- ADF (Analysis Dissemination Framework) Research;\n- ADF (Analysis Dissemination Framework) Online Workshop;\n- ADF (Analysis Dissemination Framework) Online Workshop Report;\n- ADF (Analysis Dissemination Framework) Questionnaire;\n- ADF (Analysis Dissemination Framework) Questionnaire Report;\n- ADF (Analysis Dissemination Framework) Document.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Dissemination of proposal analysis;\n- ADF Online Workshop held in X Spaces, will be recorded and uploaded to YouTube;\n- ADF Online Workshop Report containing information on topics discussed, ideas, insights and suggestions;\n- ADF Questionnaire form containing all questions;\n- ADF Questionnaire Report containing data and insights from the questionnaires;\n- ADF Document containing guidelines for Catalyst dReps.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Team Meetings reports documented on Gitbook;\n- ADF Research report documented on Gitbook;\n- ADF Online Workshop held in X Spaces, will be recorded and uploaded to YouTube and will be documented on Gitbook;\n- ADF Online Workshop Report will be documented on Gitbook;\n- ADF Questionnaire form documented on Gitbook;\n- ADF Questionnaire Report documented on Gitbook;\n- ADF Document published on Gitbook.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":12000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Research Consolidation, Content creation & Dissemination","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Comprehensive Catalyst dRep Research Framework Document, integrating all three research phases, methods, findings, and design rationale, prepared for open publication and future reuse by other dReps and the community as a whole.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Publication of a comprehensive written document covering the 3 research stages, methodologies, key findings, and design rationale that informed the development of the Catalyst dRep Analysis Framework. The document includes a clear description of the research objectives, scope, methodologies, community insights, and key design decisions clearly explained.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Catalyst dRep Research Framework Document published on GitBook, fully accessible to the public with complete content and references.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":12000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Content creation & Dissemination and Project Close-Out","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- 9 Educational Video Tutorials;\n- 7 Written Tutorials;\n- 2 Educational/Explanatory Articles;\n- Social Media Management & Engagement (Telegram, X/Twitter, YouTube);\n- Translation of key educational content.\n- Project Close-Out Report\n- Project Close-Out Video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 9 video tutorials covering key Catalyst governance intro and Catalyst participation topics, published on social media and publicly available;\n- 7 written tutorials with formatting and visuals published and publicly available;\n- 2 educational articles with in-depth insights, published and publicly available;\n- Social media activity: weekly posts or threads during the dissemination phase, covering publication announcements, calls to action, community Q&A, and updates;\n- Translations of all written tutorials, articles, and the final Catalyst dRep Framework document completed and published\n- Video tutorials dubbed and publicly available in English, Portuguese and Japanese;\n- Translated GitBook UI text and structure adapted for English, Portuguese and Japanese;\n- Delivery of the Project Close-out Report (PCR) and Project Close-out Video (PCV), summarizing the full scope of work, key outcomes, and metrics achieved according to the Project Catalyst guidelines.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Links to 9 video tutorials published on YouTube and embedded in GitBook;\n\nWritten versions of all tutorials and articles published and available on GitBook;\n\nScreenshots and links of social media engagement metrics available on Gitbook;\n\nGitBook sections displaying all content available;\n\nLinks of the Project Close-out Report (PDF) and Project Close-out Video publicly available on Github.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":11920,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Rodrigo Pacini, Project Manager and Researcher **\n\nActively involved in Project Catalyst since Fund 2, working as a Veteran Community Advisor, Veteran Proposal Assessor (Level 2 Reviewer), Moderator, and Milestone Reviewer. Since Fund 11, as a Milestone Reviewer, reviewed over 30 funded proposals and more than 100 Proof of Achievement (PoA) and Statement of Milestones (SoM) submissions, contributing directly to the accountability and transparency of Catalyst-funded projects. Funded proposer in Fund 10 and hosted Twitter(X) Spaces for the Manifesto Cardano Brasil project. Project manager for “DReps LATAM – Brasil – Exploration &amp; Community Sensing.” proposal. Mentorship of proposers and contribution to the creation of quality assurance procedures for the review process. Co-creation of the “Red and Yellow Card Thing”, a set of review standards that was officially adopted and used across at least two Catalyst funds during the early moderation phases.\n\nPreviously, Cardano Ambassador Moderator. Research in economics, blockchain, and DeFi since 2018. BTech degree in Naval Construction.\n\n\n\nI served as one of the representatives responsible for proposal curation in the Distributed Decision-Making category within the Catalyst Representatives Pilot Program organized by the Cardano Foundation. This role allowed me to apply and refine governance-oriented evaluation criteria, engage in structured deliberation with other curators, and observe first-hand how decision-making frameworks impact proposal quality and prioritization. The experience produced a pilot/MVP of the analytical approach that is now being expanded, formalized, and deepened in this proposal.\n\nMy curated list related to FUnd 14 is avaikabkle below\n\n[https://forum\\.cardano\\.org/t/catalyst\\-representative\\-pilot\\-f14/149351/4](https://forum.cardano.org/t/catalyst-representative-pilot-f14/149351/4)\n\n[https://forum\\.cardano\\.org/t/distributed\\-decision\\-making\\-list\\-of\\-proposals\\-endorsed\\-by\\-rodrigo/149613](https://forum.cardano.org/t/distributed-decision-making-list-of-proposals-endorsed-by-rodrigo/149613)\n\n[https://x\\.com/RodrigoPacini/status/1973476574608474152](https://x.com/RodrigoPacini/status/1973476574608474152)\n\n🔗 Links:\n\n[https://linkedin\\.com/in/rodrigopacini](https://linkedin.com/in/rodrigopacini)\n\n[https://projectcatalyst\\.io/proposers/rodrigopacini](https://projectcatalyst.io/proposers/rodrigopacini)\n\n[https://github\\.com/Rodrigopacini/RodrigoPacini](https://github.com/Rodrigopacini/RodrigoPacini)\n\n\n\n\n\nEduardo Silka - Governance Researcher\n\nBlockchain Researcher focused on governance, public sector applications, and distributed systems. Master’s student in Public Governance and Planning, with research in blockchain governance, exploring how blockchain reshapes transparency, accountability, and decision-making in government. Architect and Urban Planner, with a thesis on blockchain as a technopolitical tool for smart cities. Associate researcher of iCoLab (Collaborative Institute of Blockchain) and former Intersect associate (Cardano).\n\n🔗 Links:\n\n[https://www\\.linkedin\\.com/in/eduardo\\-silka/](https://www.linkedin.com/in/eduardo-silka/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"1. RESEARCH – $16,470 USD / ₳27,450\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| Co-Creation Workshop Hosting | 2h × 2 facilitators × $20/h × 3 workshops | $240 | ₳400 |\n\n| Workshop Preparation | 2h × 2 facilitators × $20/h × 3 workshops | $240 | ₳400 |\n\n| Workshop Report Writing | 3 reports × 4h × $20/h | $240 | ₳400 |\n\n| Framework Research (Filtering / Reviewing / Voting Models) | 240h × $30/h | $7,200 | ₳12,000 |\n\n| Research Report Documentation | 3 reports × 10h × $30/h | $900 | ₳1,500 |\n\n| Team Coordination &amp; Internal Summaries | 30h × $30/h | $900 | ₳1,500 |\n\n| Questionnaire Creation | 3 forms × $300 | $900 | ₳1,500 |\n\n| Questionnaire Report Writing | 3 reports × $350 | $1,050 | ₳1,750|\n\n| Final Framework Documentation | 160h × $30/h | $4,800 | ₳8,000 |\n\nThis item of the budget covers the costs associated with the research, workshops, questionnaires, coordination meetings, reports and documentation. The breakdown illustrates the hours assigned to each task for clarity:\n\n\n\n2 CONTENT PUBLISHING &amp; CONTENT MANAGEMENT – $4,650 USD / ₳7,750\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| GitBook Creation Setup | 6h × $25/h | $150 | ₳250 |\n\n| GitBook Publishing &amp; Content Maintenance | 60h × $25/h | $1,500 | ₳2,500 |\n\nThis item covers the effort required to publish, format, and maintain written content in the project’s GitBook space. At least 30 documents are expected to be uploaded over the course of the project, including research outputs, educational tutorials, workshop reports, questionnaires, internal documentation, and the reward program ruleset. Additional entries may be included as the project evolves.\n\n| Video Publishing &amp; Content Maintenance | 66h × $25/h | $1,650 | ₳2,750 |\n\nThis sub-item covers the effort required to publish and maintain video content across the project’s key platforms—YouTube and X (Twitter). Tasks include uploading finalized videos, creating thumbnails, configuring publishing settings, optimizing metadata (SEO), and embedding or linking content in the project documentation.\n\n| Social Media Channels/Profiles Initial Setup &amp; SEO | 6h × $25/h | $150 | ₳250 |\n\nConfiguration of the channel’s structure, branding elements (banner, logo, etc.), basic SEO optimization (channel description, tags, metadata), and setup of relevant sections to ensure discoverability and alignment with Cardano-related content.\n\n| YouTube and X Upload &amp; Maintenance | 4h × 12 videos × $25/h | $1,200 | ₳2,000 |\n\nFor each video: upload to YouTube and X, thumbnail creation, SEO (titles, descriptions, tags), playlist setup (YouTube), tagging and formatting (X), and integration into Gitbook documentation.\n\n\n\n3 CONTENT CREATION – $2,625 USD / ₳4,375\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| Educational Video Production &amp; Content Development | 65h × $25/h | $1,625 | ₳2,708 |\n\nThis time allocation covers the end-to-end production of nine short, high-quality tutorial videos to support Catalyst onboarding and governance participation. It includes:\n\nContent Preparation: Outlining video structure and gathering relevant examples and materials.\n\nScriptwriting: Writing concise and clear scripts tailored for educational narration.\n\nScreen Recording &amp; Visual Design: Capturing PC/mobile walkthroughs and adding visual markers (e.g., arrows, highlights).\n\nVideo Editing: Applying transitions, music, sound effects, and pacing adjustments.\n\nAI Narration &amp; Avatar Integration: Using Heygen to generate voiceovers and display an avatar for a more engaging viewer experience.\n\n| Catalyst Educational Content – Writing &amp; Editing | (28h + 12h) × $25/h | $1,000 | ₳1,666 |\n\nThis item covers the production of 7 educational tutorials and 2 complementary explanatory articles to support the Catalyst dRep Analysis Framework. A professional copywriter will assist in drafting and refining the content using AI tools. Tasks include writing, editing, formatting, and adding visuals when needed.\n\nEach of the 7 tutorials require 4 hours of work, totaling 28 hours for creation.\n\nEach of the complementary explanatory articles will require 6 hours of work, amounting to 12 hours in total.\n\nRate: $25/hour\n\n\n\n4 SOCIAL MEDIA MANAGEMENT – $1,020 USD / ₳1,700\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| Stage 1 (Months 1–11) | 48h × $15/h | $720 | ₳1,200 |\n\n| Stage 2 (Month 12) | 20h × $15/h | $300 | ₳500 |\n\nThis item covers the planning and execution of social media activities to maintain community engagement and promote project deliverables across both phases of the proposal. Platforms managed will be at least X (Twitter), Telegram, and YouTube, with tailored copywriting and post formatting to suit each channel’s audience and style.\n\nThe scope is divided as follows:\n\nStage 1 (Months 1–11): Light-touch community interaction during the research and framework development stage. Includes weekly updates, announcements and community support across 48 weeks. We intend to allocate 1 hour of work to manage social media per week, amounting to 48 hours.\n\nStage 2 (Month 12): Active outreach during the educational content launch, including content promotion, user engagement strategies, announcements, community support and governance activation support across 4 weeks. In this stage we intend to allocate 5 hours of social media management per week, so 20 hours in total.\n\n\n\n5 TOOLS &amp; SUBSCRIPTIONS – $800 USD / ₳1,333\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| Essential software (X Premium, Canva, CapCut Pro, HeyGen, DeepL, Claude, ChatGPT) | $80/month × 10 months | $800 | ₳1,333 |\n\nEssential software tools for content creation, publishing, and AI-based translation and workflows, including X Premium, Canva, CapCut Pro, HeyGen, DeepL, Claude, and ChatGPT.\n\n\n\n6 EQUIPMENT – $400 USD / ₳666\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| One-time purchase to ensure professional audio and video quality for meetings, workshops, content production, and video report recordings. Equipment will be reused for future Cardano-related projects. | Fixed amount | $500 | ₳606.06 |\n\n\n\n7 COMMUNITY BOUNTIES – $600 USD / ₳1,000\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| Incentives for surveys and workshops | Fixed amount | $600 | ₳1,000 |\n\nThis budget item covers rewards to encourage meaningful community engagement through structured questionnaires, feedback forms, and participation in workshops. The initiative aims to generate at least 50 completed qualified survey responses across different engagement stages, helping validate the project’s impact and gather actionable insights.\n\n\n\n8 TRANSLATION – $5,000 USD / ₳8,333\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| Translation EN → PT/JP (MTPE) of documents, tutorials, and scripts | Fixed amount | $5,000 | ₳8,333 |\n\nThis budget item covers the translation of key project deliverables from English into Portuguese and Japanese, using a hybrid approach: machine translation with expert human post-editing (MTPE). This method ensures both affordability and quality for governance-related and educational materials.\n\nThe estimated total volume is approximately 58,320 words per language, distributed as follows:\n\n3 Research Reports (10 pages each, 500 words/page): 15,000 words\n\nFinal dRep Analysis Framework Document (30 pages): 15,000 words\n\n7 Written Tutorials (800 words each): 5,600 words\n\n2 Articles (1,200 words each): 2,400 words\n\n9 Video Narration Scripts (Heygen, 1,000 words each): 9,000 words\n\nGitBook Interface &amp; UI Text: 1,320 words\n\nThese materials will be translated into both target languages, resulting in an estimated total of 116,640 translated words. At an average rate of $0.04 USD/word, the total cost is $4,665.6 USD, rounded to $5,000 USD to accommodate minor revisions or additional localization needs.\n\n\n\n9 - PROJECT MANAGEMENT – $3,000 USD / ₳5,000\n\n| Subitem | Calculation | Total (USD) | Total (ADA) |\n\n|---------|-------------|-------------|-------------|\n\n| Creation of Milestone Statement (SoM) document | Fixed amount | $300 | ₳500 |\n\n| Proof of Achievement (PoA) | 5 × 8h/PoA × $30/h | $1,200 | ₳2,000 |\n\n| Project close-out report (PCR) | 30h × $30/h | $900 | ₳1,500 |\n\n| Project close-out video (PCV) | 20h × $30/h | $600 | ₳1,000 |\n\nDescription:\n\nFunds core management tasks such as Milestones documentation, Proof of Life and Proof of Achievement submissions, and final reporting and close-out video production. These activities ensure transparent delivery tracking, accountability, and alignment with Catalyst’s reporting standards.\n\n\n\n10 CONTINGENCY (3.5%) – $4,494 USD / ₳5,447.27\n\nA contingency allocation of 10% is below the average adopted across technology and R&amp;D projects to cover unforeseen adjustments, minor scope shifts or operational inefficiencies that may arise during execution. It aligns with industry standards (such as PMI and academic research projects), where 5–10% is typically reserved for general uncertainty without inflating the budget unnecessarily.\n\nShould this workload not be demanded, the contingency budget will be redirected to enhance the research component of the project, allowing for deeper analysis, more robust validation, or additional community engagement activities.\n\n\n\n💰 Total Overall (with contingency): $35,960 USD / ₳59,934","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This proposal offers exceptional value for the Cardano ecosystem by combining cost-efficient design, measurable outcomes, and innovative methods—especially through the strategic and responsible use of AI. In addition to delivering a complete research and governance framework, the budget is directly tied to outputs that will remain accessible and reusable for future governance cycles, ensuring that the benefits of this investment extend far beyond the project’s 12-month execution.\n\n\n\nThe project sets clear KPIs & Impact Goals:\n\nEngage at least 20 Catalyst dReps with the framework.\n\nAchieve ₳50M in delegations to framework users, compared to the pre-project baseline.\n\nReach 200 unique wallets delegating to those dReps.\n\nMaintain 80%+ approval in user satisfaction surveys.\n\nAttain an average engagement rate above 4% on X posts (which is considered a high rate for profiles under 10,000 followers covering governance and blockchain topic).\n\nCost Structure & International Benchmarking\n\nHourly rates for team members and freelancers were established using reliable global benchmarks from platforms such as Upwork, ZipRecruiter, and Glassdoor. We deliberately set compensation within or below average market rates for the expertise required, ensuring fair payment while maximizing cost-efficiency.\n\n\n\nBudget activities and costs are defined with a high level of granularity, underscoring transparent and disciplined resource planning.\n\n\n\nLeveraging AI for Efficiency\n\nWe incorporate AI-assisted translation (e.g., DeepL) followed by human post-editing. Professional human translation typically costs $0.10–$0.15 per word. Using AI (e.g., DeepL) with human review will reduce the cost to around $0.05 per word—roughly a 50% saving with comparable quality.\n\n\n\nWe also use AI to accelerate technical writing and research activities, with all outputs reviewed and refined by our team. This integration of AI reduces labor hours while maintaining high standards, producing a measurable cost-per-output efficiency gain and freeing resources for higher-value analysis and community engagement.\n\n\n\nDeliverables vs. Cost\n\nOur Statement of Milestones clearly outlines deliverables, criteria, and evidence for each research output, educational content piece, awareness activity, and project management task, enabling predictable, verifiable, and responsible budget tracking.\n\n\n\nLong-Term Ecosystem Value\n\nThe Research Framework we create offers a replicable methodology for transparent Catalyst proposals filtering and evaluation, adoptable by future Catalyst dReps or individual voters. Delegators gain access to clear, structured, and comparable proposal evaluations, improving decision quality and reducing the risk of uninformed voting.\n\n\n\nInfrastructure produced (e.g., documentation, framework, translation libraries) remains open-source, allowing other teams to build upon the outputs without duplicating costs—creating long-term value that compounds over time.\n\n\n\nIn summary, this proposal ensures excellent value for money by aligning global-standard compensation, AI-driven efficiency, proven methodology, and public transparency to yield governance outcomes that are informed, decentralized, and sustainable. The combination of competitive rates, KPI-driven targets, scalable deliverables, and reusable governance tools results in a tangible and measurable return on investment for the Cardano ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Governance","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1652}