{"pr_id":"019ac24d-da37-7d09-8f66-54b0f1e15db1","title":"Cardano Argentina: Legal VASP Infrastructure","event_id":15,"objective":37,"objective_title":"Cardano Partners: Tier-1 Enterprise Integrations","summary":"Regulatory barriers in Argentina block institutional access, preventing a top global crypto market from legally adopting Cardano and its Smart Contracts.","solution":"We will create the first regulated VASP in Argentina, providing the legal infrastructure for institutions to adopt ADA and execute compliant Smart Contracts.","proposer_name":"Money Life SRL (Gustavo Mansilla)","proposer_relevant_experience":"Our team is composed of senior professionals with a proven track record in the Argentine financial sector, specifically in navigating the regulatory frameworks of the National Securities Commission (CNV), the Financial Information Unit (UIF), and the Central Bank of Argentina (BCRA).\n\n\n\nThe executive core of this team serves at Moli, a fintech company that already holds three (3) PSPCP (Payment Service Provider) licenses, demonstrating our capability to deliver regulated financial infrastructure with high levels of trust and accountability.\n\n\n\n_Core Leadership Team_\n\n\n\n**Gustavo Mansilla – Chief Compliance Officer \\(CCO\\) & Regulatory Lead**\n\n\n\nBackground: Dual-qualified as a Lawyer and Accountant, Gustavo is also the Founder of Moli Pay.\n\n\n\nRole & Impact: He serves as the primary liaison with regulators. His unique profile combines deep legal knowledge with practical fintech operational experience. He is directly responsible for the VASP registration strategy and leading the negotiations with the CNV and UIF to ensure the approval of the AML/CTF Prevention Manual.\n\n\n\n**Federico Vázquez – Chief Technology Officer \\(CTO\\)**\n\n\n\nBackground: Systems Engineer with specialized expertise in banking core architecture.\n\n\n\nRole & Impact: Federico is an expert in presenting and auditing PSP cores before the Central Bank of Argentina (BCRA). With over 5 successful fintech implementations in his portfolio, he guarantees that the VASP’s technical infrastructure will meet the rigorous cybersecurity and data reporting standards required by regulators.\n\n\n\n**María Gabriela Mansilla – Project Director \\(PJM\\) & Operational Strategy**\n\n\n\nRole & Impact: She acts as the strategic bridge between the project's regulatory milestones, operational deployment, and community engagement. Her role is to ensure that the project stays on its critical path, aligning the legal requirements with the technical roadmap and managing communication with key institutional partners.\n\n\n\n_Specialized Advisors & Technical Leads_\n\n\n\n**Elvio Ramón Espínola – Financial Legal Advisor & Structuring**\n\n\n\nBackground: Experienced Investment Funds Attorney, currently associated with Banco Santander.\n\n\n\nRole & Impact: Elvio brings institutional banking knowledge that is critical for the project's long-term vision. He is in charge of structuring the VASP legally to ensure it is robust enough to attract and manage institutional capital, funds, and corporate portfolios.\n\n\n\n**Albertina Delvechio – Product Development & UX/UI Lead**\n\n\n\nBackground: IT Project Manager with a background at Coelsa (the electronic clearing house that underpins the entire Argentine national payments system).\n\n\n\nRole & Impact: Her experience at Coelsa is invaluable for this project. She leads the product design and the technical integration of the FIAT ramps, ensuring that the user experience for converting ARS to ADA is seamless, intuitive, and fully compliant with local banking standards.\n\n\n\n**Francisco Bruno – Institutional Communications Specialist**\n\n\n\nBackground: Expert in Regulatory Operations and Project Structuring.\n\n\n\nRole & Impact: Francisco manages the complex stakeholder map involved in this project. His focus is on institutional communications, ensuring that the project's narrative and reporting satisfy the formal requirements of regulatory authorities and build trust with the broader financial ecosystem.\n\n\n\n**Rubén Espínola – Chief Financial Officer \\(CFO\\)**\n\n\n\nBackground: Accountant and Commercial Director.\n\n\n\nRole & Impact: Rubén is responsible for the financial health of the VASP entity. His duties include strict fiscal compliance, accounting planning, and, most importantly, ensuring the maintenance of the minimum net capital requirements mandated by the CNV for regulated crypto-asset service providers.","url":null,"funds":600000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Cardano Argentina: Legal VASP Infrastructure","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Money Life SRL (Gustavo Mansilla)","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an Incorporated entity or a Consortium?","description":"Are you submitting this proposal as an Incorporated entity or a Consortium?","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 250,000 and $ADA 750,000","format":null,"answer":600000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null},{"ref":"#/definitions/singleLineHttpsURLEntry","title":"Original Document Link","description":"Provide a link to the original proposal document in its original language","format":null,"answer":"https://docs.google.com/document/d/15NfSNVsn8H34hoNfEsSxJyTDk2ux__HEkoF6oId6-UU/edit?usp=sharing","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Regulatory barriers in Argentina block institutional access, preventing a top global crypto market from legally adopting Cardano and its Smart Contracts.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will create the first regulated VASP in Argentina, providing the legal infrastructure for institutions to adopt ADA and execute compliant Smart Contracts.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.argentina.gob.ar/noticias/regulacion-de-los-proveedores-de-servicios-de-activos-virtuales-psav","https://www.argentina.gob.ar/noticias/nuevo-regimen-de-tokenizacion","https://www.argentina.gob.ar/noticias/ampliacion-del-regimen-de-tokenizacion-para-emisiones-bajo-oferta-publica-automatica-de"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies. The team possesses the full legal, compliance, and technical expertise required to execute the project internally. While the project involves interaction with regulatory bodies (CNV/UIF) as part of its scheduled milestones, the team does not rely on external third-party organizations or partnerships to deliver the proposed infrastructure.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","description":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","format":null,"answer":"The Layer-2 compliance architecture (the API middleware), the KYC/AML verification modules, and the operational logic of the Travel Rule will be published under open-source licenses. This allows any Cardano DApp to integrate regulatory-compliant functionality permissionlessly.\n","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Tokenization","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your established collaborations.","description":"Please provide your rationale for your established collaborations.","format":null,"answer":"The project is executed by the executive team of Moli, an Argentine fintech that already holds three (3) PSPCP licenses from the Central Bank. The team leverages established professional relationships with key financial players, including legal advisors from the banking sector (Banco Santander) and technical experts from the national payment clearing house (Coelsa).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe funding commitments.","description":"Please provide your rationale for your funding commitments.","format":null,"answer":"We are requesting 600,000 ADA from Project Catalyst to fully fund the legal registration, technical development, and initial operations of the VASP over a 12-month period. This funding covers all costs related to CNV/UIF registration, compliance middleware development, and the FIAT ramp integration. The Moli team contributes its existing regulatory infrastructure, PSPCP licensing know-how, and operational framework as in-kind value to ensure the project's feasibility and rapid execution.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your key performance metrics.","description":"Please provide your rationale for your key performance metrics.","format":null,"answer":"Our success is measured by the following KPIs by Month 12:\n\n\n\n- Legal: Official VASP registration obtained from CNV and AML Manual approved by UIF.\n- Adoption: Over 1,000 KYC-verified users and a monthly transaction volume exceeding USD 1,000,000 (ARS ↔ ADA).\n- Ecosystem: At least 3 Cardano DApps integrated via our compliance API and USD 1,000,000 in TVL injected into the ecosystem.\n- Performance: 99.5% system uptime, <15 min fiat settlement, and 100% Travel Rule compliance.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"This project will enable, for the first time in Argentina, institutional, corporate, and large-scale adoption of the Cardano ecosystem by establishing the regulatory and technical conditions required for banks, investment funds, cooperatives, companies, and individual users to legally operate with ADA and all Cardano Native Assets. This includes the issuance of regulated tokens, the execution of compliant smart contracts, and the integration of Cardano with traditional financial systems and capital markets under local supervision.\n\n\n\nWe will create and register the first regulated Virtual Asset Service Provider (VASP) dedicated exclusively to the Cardano ecosystem in Argentina, fully aligned with UIF Resolution No. 49/2024 and CNV Regulation No. 1058. This infrastructure will provide legal, auditable, and secure access to ARS ↔ ADA conversion, regulated custody, tokenization, and compliance middleware for DApps.\n\n\n\nAdditionally, we will develop a plug-and-play compliance middleware—integrated through standard APIs—that will allow any Cardano DApp to automatically comply with KYC/AML requirements, the Travel Rule, and CNV/UIF reporting obligations. This makes Cardano the first blockchain in Argentina with native regulatory-grade compliance, eliminating the main barrier that has historically prevented institutional adoption in corporate and high-demand environments.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The impact is designed to be structural and long-term, transforming Argentina into a fully regulated hub for institutional and mass adoption.\n\n\n\n1. Strategic & Institutional Impact\n\n\tFirst Regulated Gateway: The project will establish the first Virtual Asset Service Provider (VASP) dedicated exclusively to Cardano in Argentina, fully compliant with CNV and UIF regulations. This eliminates the legal barrier that currently prevents banks, investment funds, and corporations from holding ADA or using Cardano smart contracts.\n\n\n\n\tRegulatory Leadership: It positions Cardano as the first blockchain in the region with native, regulatory-grade compliance, offering a competitive advantage over other chains by enabling \"formal economy\" use cases like Real-World Asset (RWA) tokenization.\n\n\n\n2. Ecosystem & Developer Benefits\n\n\tOpen-Source Compliance Layer: A key benefit for the community is the development of a \"plug-and-play\" compliance middleware. This tool will be released as a public digital good (open source), allowing any Cardano DApp to easily integrate KYC/AML and Travel Rule checks without building their own legal infrastructure.\n\n\n\n3. Liquidity & Economic Growth\n\n\tFiat Liquidity Injection: By creating a regulated ARS ↔ ADA ramp, the project aims to inject over USD 1,000,000 per month in transaction volume and generate USD 1,000,000 in Total Value Locked (TVL) from Argentine capital into the Cardano DeFi ecosystem within the first year.\n\n\n\nMass User Onboarding: The project targets verifying over 1,500 Argentine users (KYC) in the first year, providing them with a secure and legal bridge to the ecosystem.\n\n\n\n4. Decentralized Governance (Voltaire Alignment)\n\nCommunity Oversight: To ensure the VASP remains aligned with Cardano's principles, an On-Chain Governance Committee (supervised by founding entities like IOG/Cardano Foundation/Emurgo) will have the power to approve operational guidelines, token onboarding criteria, and compliance parameters.\n\n\n\nTransparency: All progress, including legal audits and budget execution, will be reported publicly to the community.\n\n\n\n5. Regional Scalability\n\nExpansion Model: The legal and technical framework built for Argentina is intended to serve as a pilot, with a goal to replicate the VASP model in at least one other LATAM or Middle Eastern country within 12 months of operation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"1. Capability to Deliver with High Levels of Trust and Accountability\n\n\tOur capability to deliver this project is anchored in a proven track record of regulatory compliance and fintech execution in Argentina. The Moli executive team already holds three (3) PSPCP (Payment Service Provider with Payment Accounts) licenses granted by the Central Bank of Argentina (BCRA). This unique status demonstrates our ability to navigate complex financial regulations and operate under strict governmental supervision, ensuring the highest level of trust and accountability for the Cardano ecosystem.\n\n\n\nOur team combines deep institutional knowledge with technical expertise, structured across key roles to ensure successful delivery:\n\n\n\n- Gustavo Mansilla (Chief Compliance Officer & Regulatory Lead): A Lawyer and Accountant, and Founder of Moli Pay. He brings the critical capability to lead negotiations with the CNV and UIF, combining legal expertise with practical fintech experience.\n\n\n\n- Federico Vázquez (Chief Technology Officer): A Systems Engineer and expert in presenting PSP cores to the Central Bank (BCRA). He has successfully led over 5 fintech implementations, ensuring that our technical infrastructure meets the rigorous standards of financial regulators.\n\n\n\n- María Gabriela Mansilla (Project Director & Operational Strategy): Responsible for aligning regulatory, operational, and community goals, and managing communication with key partners to ensure project coherence.\n\n\n\n- Elvio Ramón Espínola (Financial Legal Advisor & Structuring): An Investment Funds Attorney (Banco Santander) who brings vital institutional banking knowledge, essential for structuring the VASP to attract institutional capital.\n\n\n\n- Francisco Bruno (Institutional Communications Specialist): An expert in Regulatory Operations and Project Structuring, specialized in managing complex projects involving regulatory authorities.\n\n\n\n- Albertina Delvechio (Product Development & UX/UI Lead): Former IT Project Manager at Coelsa (the clearing house for the Argentine financial system). She provides critical expertise for integrating FIAT ramps in regulated environments.\n\n\n\n- Rubén Espínola (Chief Financial Officer): Accountant and Commercial Director responsible for fiscal compliance and maintaining the VASP’s required net capital.\n\n\n\nThis multidisciplinary team covers every \"box\" required for a regulated VASP: Legal/Compliance, Core Banking Tech, Institutional Finance, Operations, and User Experience.\n\n\n\n2. Feasibility Validation Approach\n\n\tWe intend to validate the feasibility of our approach through a strictly phased execution plan that prioritizes regulatory milestones before technical expansion. Our validation strategy includes:\n\n\n\n\tRegulatory First: Feasibility is validated at Milestone 1 by formally submitting the registration request to the CNV and filing the AML/CTF Manual with the UIF. Official approval is the primary \"go/no-go\" validation for the project.\n\n\n\n\tExternal Audits: Trust is not just claimed but verified. We have allocated budget for an external cybersecurity audit and penetration testing (Milestone 4) to validate our custody protocols against CNV standards.\n\n\n\n\tPhased Technical Rollout: We will validate technical feasibility through a pilot launch (Milestone 5) with controlled testing before a full public release, ensuring system stability (99.5% uptime target) and UX refinement.\n\n\n\n\tTransparent Metrics: Accountability is enforced by our commitment to public reporting. We will track and publish granular KPIs, including user KYC verifications (Target: 1,500 users), transaction volume (Target: >$1M USD/month), and compliance rates (Target: 100% Travel Rule compliance).\n\n\n\n\tBy leveraging our existing PSPCP licenses and following this rigorous validation framework, we ensure that the Cardano Argentina VASP is not just a concept, but a viable, compliant, and executable infrastructure project.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"M1: Legal Framework & Registration (CNV/UIF)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Legal Incorporation: Formal incorporation of the company in Argentina, including the drafting and signing of VASP-specific bylaws. \n\n\n\n- CNV Registration Submission: Completion and formal submission of the VASP registration request to the National Securities Commission (CNV) under Regulation No. 1058. \n\n\n\n- AML/CTF Framework: Creation and filing of the Anti-Money Laundering and Counter-Terrorism Financing (AML/CTF) Manual with the Financial Information Unit (UIF), aligned with Resolution No. 49/2024. \n\n\n\n- Capital Compliance: Structure and verification of the initial capital requirement necessary for the license.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The legal entity must be fully registered with the IGJ (General Inspection of Justice) and possess a valid CUIT (Tax ID). \n\n\n\n- The VASP registration dossier must be officially received by the CNV, evidenced by a file number or official entry receipt. \n\n\n\n- The AML/CTF Manual must be completed and formally submitted to the UIF. \n\n\n\n- The initial capital integration must be legally documented and compliant with VASP requirements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Official Company Documents: PDF of the registered bylaws and the tax registration (CUIT) of the new entity. \n\n\n\n- CNV Filing Receipt: Official document or digital receipt confirming the submission of the VASP registration request to the CNV. \n\n\n\n- AML Manual: A copy of the drafted AML/CTF Prevention Manual. \n\n\n\n- UIF Submission Proof: Evidence (screenshot or official acknowledgment) of the AML manual filing with the UIF.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":170000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"M2: Compliance Infrastructure","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- KYC/AML Module: Development and deployment of the identity verification system and anti-money laundering monitoring engine.\n- Travel Rule Integration: Implementation of the protocol to comply with FATF/UIF requirements for asset transfers.\n- Reporting Middleware: Construction of the automated reporting system for CNV and UIF obligations.\n- API Development: Creation of standard APIs to allow DApps to integrate the compliance stack.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The system must successfully verify a user identity (KYC) and assign a risk profile.\n- The Travel Rule mechanism must correctly identify and transmit originator/beneficiary data for transactions.\n- The middleware must be capable of generating the specific reports required by Argentine regulators.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Technical Documentation: API documentation for the compliance middleware.\n- Demo/Video: A video walkthrough showing the KYC process and the admin panel flagging a test AML alert.\n- GitHub Repository: Link to the open-source components of the compliance architecture.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":140000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"M3: Fiat Ramp Development (ARS ↔ Crypto)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Banking Integration: Development of APIs to connect with the local banking system (CBU/CVU) for ARS deposits and withdrawals.\n- Cardano Connectivity: Secure backend integration to manage on-chain transactions (minting/burning or locking/unlocking).\n- Wallet Management: Implementation of the internal ledger and balance management system for users.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Successful execution of an ARS deposit and conversion to ADA (and vice versa) in a test environment.\n- The system must accurately reflect balances in real-time after a transaction.\n- Secure connectivity between the bank interface and the Cardano node must be verified.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Transaction Logs: System logs showing successful ingress and egress of fiat and crypto.\n- Test Report: A report detailing the functional testing of the ramp APIs.\n- Video Evidence: A recorded end-to-end transaction from a bank account to a Cardano wallet.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":150000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"M4: Security & Technical Audit","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Cybersecurity Audit: External audit of the platform's infrastructure and code.\n- Penetration Testing: Execution of stress tests and vulnerability scanning.\n- Custody Protocol Review: Audit of the key management and fund segregation procedures.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Completion of the external audit by a qualified firm.\n- Resolution of any \"Critical\" or \"High\" severity vulnerabilities identified during testing.\n- Validation of the custody scheme against CNV security requirements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Audit Report: The final cybersecurity audit report (summary or redacted version for security).\n- Penetration Test Certificate: Proof of completion and remediation of critical bugs.\n- Security Statement: A formal statement confirming the platform meets CNV security standards.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":80000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"M5: Operations & Launch","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Pilot Phase: Controlled launch with a limited group of users to test UX/UI.\n- Public Launch: Full deployment of the VASP platform for general public access.\n- Operational Setup: Final configuration of hosting, licenses, and support channels.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The platform is live and accessible to the public via a web URL web-app.\n- Real users are able to register, pass KYC, and perform transactions.\n- Support systems are active and responding to user queries.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Live URL: Link to the live platform.\n- Press Release: Public announcement of the launch.\n- User Metrics: Report showing the first batch of verified users and transaction volume.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":60000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Our team is composed of senior professionals with a proven track record in the Argentine financial sector, specifically in navigating the regulatory frameworks of the National Securities Commission (CNV), the Financial Information Unit (UIF), and the Central Bank of Argentina (BCRA).\n\n\n\nThe executive core of this team serves at Moli, a fintech company that already holds three (3) PSPCP (Payment Service Provider) licenses, demonstrating our capability to deliver regulated financial infrastructure with high levels of trust and accountability.\n\n\n\n_Core Leadership Team_\n\n\n\n**Gustavo Mansilla – Chief Compliance Officer \\(CCO\\) & Regulatory Lead**\n\n\n\nBackground: Dual-qualified as a Lawyer and Accountant, Gustavo is also the Founder of Moli Pay.\n\n\n\nRole & Impact: He serves as the primary liaison with regulators. His unique profile combines deep legal knowledge with practical fintech operational experience. He is directly responsible for the VASP registration strategy and leading the negotiations with the CNV and UIF to ensure the approval of the AML/CTF Prevention Manual.\n\n\n\n**Federico Vázquez – Chief Technology Officer \\(CTO\\)**\n\n\n\nBackground: Systems Engineer with specialized expertise in banking core architecture.\n\n\n\nRole & Impact: Federico is an expert in presenting and auditing PSP cores before the Central Bank of Argentina (BCRA). With over 5 successful fintech implementations in his portfolio, he guarantees that the VASP’s technical infrastructure will meet the rigorous cybersecurity and data reporting standards required by regulators.\n\n\n\n**María Gabriela Mansilla – Project Director \\(PJM\\) & Operational Strategy**\n\n\n\nRole & Impact: She acts as the strategic bridge between the project's regulatory milestones, operational deployment, and community engagement. Her role is to ensure that the project stays on its critical path, aligning the legal requirements with the technical roadmap and managing communication with key institutional partners.\n\n\n\n_Specialized Advisors & Technical Leads_\n\n\n\n**Elvio Ramón Espínola – Financial Legal Advisor & Structuring**\n\n\n\nBackground: Experienced Investment Funds Attorney, currently associated with Banco Santander.\n\n\n\nRole & Impact: Elvio brings institutional banking knowledge that is critical for the project's long-term vision. He is in charge of structuring the VASP legally to ensure it is robust enough to attract and manage institutional capital, funds, and corporate portfolios.\n\n\n\n**Albertina Delvechio – Product Development & UX/UI Lead**\n\n\n\nBackground: IT Project Manager with a background at Coelsa (the electronic clearing house that underpins the entire Argentine national payments system).\n\n\n\nRole & Impact: Her experience at Coelsa is invaluable for this project. She leads the product design and the technical integration of the FIAT ramps, ensuring that the user experience for converting ARS to ADA is seamless, intuitive, and fully compliant with local banking standards.\n\n\n\n**Francisco Bruno – Institutional Communications Specialist**\n\n\n\nBackground: Expert in Regulatory Operations and Project Structuring.\n\n\n\nRole & Impact: Francisco manages the complex stakeholder map involved in this project. His focus is on institutional communications, ensuring that the project's narrative and reporting satisfy the formal requirements of regulatory authorities and build trust with the broader financial ecosystem.\n\n\n\n**Rubén Espínola – Chief Financial Officer \\(CFO\\)**\n\n\n\nBackground: Accountant and Commercial Director.\n\n\n\nRole & Impact: Rubén is responsible for the financial health of the VASP entity. His duties include strict fiscal compliance, accounting planning, and, most importantly, ensuring the maintenance of the minimum net capital requirements mandated by the CNV for regulated crypto-asset service providers.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"We are requesting a total of 600,000 ADA to cover legal, technical, and operational costs over the 12-month execution period.\n\n\n\nM1: Legal Framework & Registration (170,000 ADA) Specialized legal fees (incorporation, CNV registration, AML/CTF Manual), regulatory fees, and initial capital requirement compliance.\n\n\n\nM2: Compliance Infrastructure (140,000 ADA) Development and implementation of KYC/AML system, Travel Rule integration, and regulatory reporting middleware.\n\n\n\nM3: Fiat Ramp Development (150,000 ADA) Development of ARS/Crypto conversion APIs, local banking integration, and secure wallet-management backend systems.\n\n\n\nM4: Security & Technical Audit (80,000 ADA) Cybersecurity audit, penetration testing, and external review of custody protocols.\n\n\n\nM5: Operations & Launch (60,000 ADA) Initial operational expenses, hosting, software licenses, and pilot testing.\n\n\n\n\n\nTotal Project Cost: 600,000 ADA.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The requested budget of 600,000 ADA represents exceptional value for the Cardano ecosystem by funding a structural solution that removes the primary legal barrier to institutional adoption in a top global crypto market. This project does not just build a product; it establishes permanent legal and technical infrastructure that multiplies value across the entire network.\n\n\n\n1. High Return on Investment (ROI) & Perpetual Asset For a one-time investment of 600,000 ADA, the project secures a permanent regulatory asset. Once obtained and managed correctly, the VASP license has no time or usage limits. This means the initial funding creates an indefinite regulatory gateway that does not require re-registration, aiming to generate a monthly transaction volume of over USD 1,000,000 and inject liquidity into the ecosystem for years to come.\n\n\n\n2. Cost Savings for Developers via Open-Source Public Goods A significant portion of the budget is allocated to developing a \"plug-and-play\" compliance middleware. We are releasing the API middleware, KYC/AML verification modules, and Travel Rule logic as open-source. This provides immense value by allowing any Cardano DApp to integrate regulatory compliance without incurring the high costs of building their own legal infrastructure.\n\n\n\n3. Unlocking Institutional Capital Currently, banks and corporations cannot legally touch ADA due to regulatory voids. This project funds the specialized legal and technical work required to register the first VASP compliant with CNV and UIF regulations. This unlocks the \"forbidden\" market of corporate and institutional investors, enabling the issuance of regulated tokens and Real-World Assets (RWA) on Cardano.\n\n\n\n4. Regional Scalability & Strategic Precedence The project delivers the first regulatory-grade gateway for Cardano in Argentina, positioning the blockchain as a leader in compliance. The value extends beyond Argentina, as the VASP model is designed to be replicated in other LATAM or Middle Eastern countries, serving as a blueprint for global expansion.\n\n\n\n5. Risk Mitigation through Proven Expertise The value is secured by a team with proven capability, including members who already hold fintech licenses and have successfully implemented banking cores for the Central Bank. This expertise minimizes execution risk and ensures that the funds are managed by professionals with a track record of delivering regulated financial systems.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead applicant is a verified legal business entity.","description":"Legal Entity:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead org has a ≥2-year track record, and the consortium collectively has ≥$5M in verifiable annual revenue.","description":"Track Record & Revenue:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of collaboration with a qualified Tier-1 enterprise is provided.","description":" Tier-1 Collaboration:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is for mature R&D or integration, not an early-stage concept or core infrastructure.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of a mature product is provided, with a clear integration plan if not already on Cardano.","description":"Mature Product & Path:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that all key partners, including the Tier-1 collaborator, are clearly identified.","description":"Partner Identification:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that a clear statement of the partner's in-kind or financial contributions is included.","description":"Partner Commitment:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable references (e.g., LinkedIn, portfolio) for key team members.","description":"Verifiable Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear KPIs for adoption (e.g., transaction volume, user growth). Forecast for projected on-chain transaction volume is provided with adequate justification.","description":"Measurable Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that delivery is ≤ 12 months with clear milestones.","description":"Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a co-marketing or community engagement plan to amplify Cardano's visibility.","description":"Visibility & Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal budget is for future work only, not for completed tasks. No incentives, giveaways, private treasuries and regranting are included in the budget.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Tokenization","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1654}