{"pr_id":"019ac39e-b1ee-7955-8472-a20d2f051975","title":"CardanoScale: SPO-Powered RPC Gateway for Cardano","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano lacks a standardised, SPO-aligned RPC gateway. Teams must cut bespoke deals with individual SPOs or run their own nodes, with pricing driven more by marketing than measurable QoS.","solution":"CardanoScale is an SPO-powered gateway for dapps looking to scale: one subscription and dedicated endpoints for RPC, routing between multiple providers with value flowing back to the SPO ecosystem.","proposer_name":"Lava Network","proposer_relevant_experience":"CardanoScale is delivered by a combined team from Lava Foundation (governance and ecosystem), MagmaDevs (infrastructure engineering) and the Wizard team (Cardano-native trading infra), working together with Cardano SPOs and ecosystem contributors.\n\n- **Nimrod Knoller \\- Head of Lava Foundation** - [https://www\\.linkedin\\.com/in/nimrod\\-knoller/](https://www.linkedin.com/in/nimrod-knoller/)\n    - Overall project sponsor and point of contact. Responsible for strategy, alignment with Cardano ecosystem stakeholders, and ensuring that value flows back to SPOs and builders.\n- **Yair Cleper \\- Co\\-Founder, MagmaDevs / Lava Contributor** - [https://www\\.linkedin\\.com/in/cleper/](https://www.linkedin.com/in/cleper/) - [https://x\\.com/yaircleper](https://x.com/yaircleper)\n    - Contributor or the gateway. Oversees architecture, integration of Cardano into Lava’s routing stack, performance optimisation and coordination of the engineering team working on routing, monitoring and QoS logic.\n- **Justina Petraitytė \\- Developer Relations** - Lava Foundation - [https://www\\.linkedin\\.com/in/justina\\-petraityte/](https://www.linkedin.com/in/justina-petraityte/)\n    - Responsible for developer experience, SPO and builder onboarding, documentation, tutorials and community-facing technical content. Works directly with Cardano teams to make integration with CardanoScale straightforward.\n- **Ignacio Rodríguez Serpa \\- Project Manager and Operations** - Lava Foundation [https://www\\.linkedin\\.com/in/ignaciorsg/](https://www.linkedin.com/in/ignaciorsg/)\n    - Coordinates day-to-day delivery: milestone planning, risk tracking, SPO engagement, cross-team communication (Lava, Wizard, SPOs, Cardano stakeholders) and reporting back to the community and Catalyst.\n- **Tommy Dowson \\- Marketing Operations** - Lava Foundation [https://www\\.linkedin\\.com/in/tomdowson/](https://www.linkedin.com/in/tomdowson/)\n    - Supports ecosystem communications, announcement planning and case study production. Ensures that SPOs and Cardano builders understand how to access the gateway and how rewards and subsidised subscriptions work.\n- **Toni Lukic \\- Growth &amp; Comms Lead** - Lava Foundation [https://www\\.linkedin\\.com/in/tonilukic/](https://www.linkedin.com/in/tonilukic/)\n    - Leads narrative, positioning and growth strategy for CardanoScale within the wider Lava ecosystem. Works with Cardano Foundation contacts, Wizard and other ecosystem teams to align messaging and identify high-impact projects to onboard.\n- Wizard’s contribution as a supporting partner. Provides requirements, feedback and validation from high-intensity trading workloads, and supports integration between Wizard’s orderbook/indexer infrastructure and CardanoScale’s RPC gateway.\n- MagmaDevs Engineering Team – Infrastructure Contributors\n    - MagmaDevs is a team of 13 senior engineers (including 5 ex-founders / CTOs) contributing to Lava Network. They are responsible for implementing and hardening the gateway routing, monitoring, billing hooks and SPO integration, drawing on experience running production RPC for projects such as Hypernative, Mintscan, Tres, SweatEconomy, HOT Wallet and Fireblocks.\n\nAll team members have verifiable public profiles (LinkedIn, GitHub, X) and a track record of delivering production-grade infrastructure. The same core group is also involved in the Cardano Community API / RPC Pool proposal, ensuring tight coordination between the SPO pool and the gateway so that value and traffic flow coherently across both initiatives.","url":null,"funds":185000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"CardanoScale: SPO-Powered RPC Gateway for Cardano","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Lava Network","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":185000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano lacks a standardised, SPO-aligned RPC gateway. Teams must cut bespoke deals with individual SPOs or run their own nodes, with pricing driven more by marketing than measurable QoS.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"CardanoScale is an SPO-powered gateway for dapps looking to scale: one subscription and dedicated endpoints for RPC, routing between multiple providers with value flowing back to the SPO ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://lavanet.xyz","https://www.lavanet.xyz/lava-rpc-api-gateway","https://github.com/lavanet/lava","https://x.com/WizardCardano"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"CardanoScale has several key, but manageable, dependencies that are tightly aligned with the Cardano ecosystem. First and foremost, it relies on Stake Pool Operators (SPOs). The gateway is explicitly designed to use SPO-run RPC infrastructure as its primary upstream provider set, with a particular focus on SPOs participating in the companion Cardano API / RPC Pool proposal. As more high-quality SPOs join, the value of the gateway increases, and rewards can be more clearly aligned with measured service quality rather than sales or branding.  On the infrastructure side, CardanoScale depends on Lava Network’s open protocol and routing stack to coordinate multiple providers, run health checks, manage failover and avoid single points of failure. This is the same stack already used to support production-grade RPC/API traffic for cross-ecosystem projects such as Hypernative, Mintscan, Tres, SweatEconomy, HOT Wallet and institutional clients like Fireblocks, providing a strong foundation for reliability and scale.  The Wizard team is a key supporting partner. Wizard is a global orderbook and liquidity project built by long-time Cardano contributors working closely with TXPipe Labs. The team has already designed a high-performance DEX/orderbook indexer that unifies peer-to-peer trades, DEX events and aggregator routing into a single canonical event model. This makes Wizard a particularly valuable gateway partner: they deeply understand Cardano infrastructure, can both consume and provide reliable RPC optimised for real trading workloads, and will strengthen Lava’s network with one of the most data-intensive use cases on Cardano.  CardanoScale also depends on the Cardano testnet and mainnet themselves, which are essential for deploying and validating the gateway, stress-testing routing and SLAs, and ensuring that traffic and billing are accurately measured. In addition, the project will engage with the Cardano Foundation and the broader builder ecosystem for technical advice on Cardano-specific infrastructure, alignment with network-wide best practices, and to ensure CardanoScale complements rather than duplicates existing initiatives.  Taken together, these dependencies are positive for the ecosystem. The design deliberately reduces reliance on any single SPO or vendor and instead channels demand across multiple Cardano operators, with quality and rewards tied to actual service performance rather than marketing muscle.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"CardanoScale combines open-source protocol components with some staged or closed-source gateway logic. Core Lava routing and coordination code plus docs and integration guides are openly licensed and publicly available. Wizard and certain operational modules (e.g. billing, dashboards) will be opened in phases, keeping security-sensitive parts closed until they are hardened.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Infrastructure","group":"Development & Tools"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"CardanoScale is not just another RPC endpoint; it is an **SPO\\-powered RPC gateway** that:\n\n\n\n- Aggregates multiple SPO-run RPC providers behind a single subscription and dedicated endpoint for builders,\n\n\n\n- Routes traffic between them based on **measured QoS** rather than brand recognition,\n\n\n\n- Provides redundancy and optimisation by default, and\n\n\n\n- Explicitly channels value back to the **Cardano and SPO ecosystem**.\n\n\n\n\n\nToday, teams must either negotiate bespoke deals with individual SPOs or run their own nodes. There is no standardised, Cardano-aligned gateway that allows “one subscription to many providers” with transparent performance-based routing.\n\n\n\nCardanoScale is also designed to work **hand\\-in\\-hand** with the c**ompanion proposal for Cardano API / RPC Pool**:\n\n\n\n- The pool funds and incentivises SPOs to provide high-quality API/RPC services.\n\n\n\n- The gateway packages that supply into usable **paid subscriptions**, creating a full path from SPO to enterprise-grade consumer.\n\n\n\n\n\nLava’s protocol stack already powers production RPC/API for multi-chain projects such as Hypernative, Mintscan, Tres, SweatEconomy and HOT Wallet, and institutional clients like Fireblocks. CardanoScale brings that robustness into Cardano, while structurally centring **SPOs as the primary providers**, not sidelining them.\n\n\n\nThis combination – SPO-centred supply, a protocol-driven multi-provider backend and a Cardano-native gateway interface shaped by partners like Wizard – is new within the Cardano ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The MVP will demonstrate a live **CardanoScale portal** supported by Wizzard, integrated with Lava Network’s backend and ready to tap into the SPO-powered Cardano API/RPC pool as that network comes online.\n\n\n\nIn practical terms, the MVP will show:\n\n\n\n- A **Cardano\\-branded web interface** where teams can see available RPC subscription options (off-the-shelf tiers and bespoke paths), submit their requirements and start onboarding.\n\n\n\n- A working integration between the CardanoScale front end and Lava Network’s infrastructure, so that test customers can be provisioned, Cardano RPC endpoints can be issued, and real traffic from pilot projects can be routed and monitored.\n\n\n\n- Initial tests of **multi\\-provider routing**: CardanoScale will be able to route requests through multiple upstream providers, and, where the SPO pool is available, use SPO-operated nodes as part of that provider set to demonstrate SPoF avoidance in practice.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"We will measure success across adoption, quality and ecosystem value:\n\n- **Adoption by Cardano teams**\n    - Number of dapps, wallets and enterprises that onboard to CardanoScale as pilot or paying users.\n    - Growth in Cardano RPC traffic (requests per month) handled through the gateway, measured via Lava’s infrastructure metrics.\n- **Quality and resilience**\n    - Uptime and latency for gateway-issued endpoints relative to SLAs.\n    - Demonstrated cases where failover between providers occurs automatically when a provider is unhealthy, reducing the risk of outages due to a single SPO failure.\n- **SPO ecosystem integration**\n    - Number of SPOs participating as gateway providers (with preference for those also active in the companion API / RPC Pool).\n    - Share of gateway traffic served by SPO-run nodes, as opposed to any non-SPO backup providers, demonstrating that value is flowing back to Cardano’s operator community.\n\n\n\n- **Value back to Cardano builders**\n    - Number of teams receiving subsidised subscriptions during the early rollout period.\n    - Qualitative feedback from those teams about how the gateway changed their infra and cost profile.\n\n\n\nWhere possible, we will publish aggregated metrics and case studies – for example charts of traffic growth, SPO participation and uptime – so the Cardano community can see how the gateway is performing and how value flows back to operators and builders.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"CardanoScale is an **SPO\\-powered RPC gateway for Cardano** that addresses today’s fragmented, marketing-driven RPC landscape by:\n\n- Giving dapps and enterprises a **single place** to get reliable Cardano RPC subscriptions, and\n- Structurally aligning **fees and rewards** with **measured quality of service** rather than sales ability.\n\n**Core elements:**\n\n**1\\. One subscription, one endpoint, many SPOs behind it**\n\n\n\n- Teams integrate once, with one endpoint and one commercial touchpoint.\n- Behind the scenes, the gateway routes traffic across multiple SPO-run RPC providers.\t\t\t\t\n\n**2\\. Routing based on QoS, not marketing**\n\n- Providers are selected and weighted based on uptime, latency and correctness.\n- An SPO that delivers excellent service can receive more traffic and rewards, even if they do little marketing.\n\n**3\\. Redundancy and single\\-point\\-of\\-failure \\(SPoF\\) avoidance**\n\n- If one provider degrades or fails, traffic is automatically shifted to others.\n- This reduces the need for each dapp to build its own complex failover logic.\n\n**4\\. Tight link to the Cardano API / RPC Pool**\n\n- The companion pool proposal incentivises SPOs to provide high-quality RPC.\n- The gateway creates paid demand for that capacity, so more mature teams can step up from public RPC to subscription services without leaving the SPO ecosystem.\n\n**5\\. Support from Wizard and Lava**\n\n- Wizard brings deep Cardano context and one of the most data-intensive workloads (global orderbook and DEX indexing).\n- Lava brings a production-tested multi-provider RPC protocol already trusted by projects across multiple ecosystems.\n\nIn short, CardanoScale turns the current patchwork of ad hoc SPO deals into a coherent, **SPO\\-aligned, quality\\-driven gateway** that serves both builders and operators.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**For Cardano builders \\(dapps, wallets, enterprises\\)**\n\n- A clear, Cardano-aligned answer to the question: “Who can help us with RPC as we scale?”\n- Access to multi-provider, SPO-backed RPC through a single integration, reducing downtime risk and internal infra overhead.\n- Early teams can benefit from subsidised subscriptions, lowering infra costs for serious Cardano projects during the initial phase.\n\n\n\n\n\n**For SPOs and infra providers**\n\n- A concrete way to monetise high-quality service, not just block production or marketing ability.\n- Direct value flow from gateway traffic and subscriptions into SPO rewards (55% of the budget is dedicated to SPO-side value).\n- For those in the companion API / RPC Pool, an additional demand-side channel that can be layered on top of existing incentives.\n\n\n\n\n\n**For Cardano’s infrastructure story**\n\n- A stronger narrative: Cardano’s RPC is backed by SPOs + open protocol, not just a single vendor.\n- A visible example of how Cardano can connect institutional-grade infra (Lava Network) with community-run operators (SPOs) in a way that keeps value inside the ecosystem.\n\n\n\n\n\n**For Catalyst and long\\-term sustainability**\n\n- A reusable model: fund the SPO pool to bring supply online, fund the gateway to turn that supply into a service for serious builders.\n- The learnings (SLAs, typical usage, pricing feedback, SPO performance data) can inform future infra and ecosystem proposals.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Lava Network’s infrastructure track record**\n\n- Lava Neawork lready powers RPC/API for multiple ecosystems and is used by projects including Hypernative, Mintscan, Tres, SweatEconomy, HOT Wallet and institutional clients such as Fireblocks.\n- This demonstrates that the underlying routing and infra stack behind CardanoScale can operate in high-volume, production environments.\n\n**Wizard’s Cardano\\-native experience**\n\n- Wizard is built by long-time Cardano contributors who work closely with TXPipe Labs, and are already shipping a global orderbook / liquidity layer on Cardano.\n- The team has architected a high-performance DEX/orderbook indexer that unifies peer-to-peer trades, DEX events and aggregator routing into a single canonical event model.\n- This gives Wizard deep, hands-on experience with one of the most data-intensive, latency-sensitive workloads on Cardano. As a result, they are well placed both to consume CardanoScale (as a demanding user) and to provide reliable RPC infrastructure optimised for real trading and liquidity workloads, making them a particularly strong design and infra partner for the gateway.\n\n\n\n\n\n**Joint delivery model**\n\n- Lava leads on:\n    - Protocol integration, routing, monitoring and SLAs.\n    - Exposing Cardano RPC through the gateway in a robust, multi-provider way.\n- Wizard and other Cardano collaborators support by:\n    - Providing requirements from real Cardano workflows (trading, liquidity, etc.).\n    - Acting as early gateway users and helping refine product-market fit within Cardano.\n\n\n\n\n\n**Feasibility and validation**\n\n- Feasibility is validated by delivering a live MVP gateway, onboarding pilot projects, and tracking real usage and incidents.\n- The project will track:\n    - Onboarding friction,\n    - Incident frequency and severity,\n    - SPO participation and performance, and\n    - Customer satisfaction from Cardano teams.\n\n\n\nThe combination of proven infra (Lava), Cardano-native partners (Wizard) and SPOs already skilled in running core infrastructure gives strong confidence that CardanoScale is both deliverable and useful.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Design, Architecture & Partnerships for CardanoScale","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A jointly agreed design for CardanoScale, covering routing architecture, SPO integration, billing and rewards flows, and the relationship with the companion Cardano API / RPC Pool.\n2. Confirmed collaboration with Wizard and an initial cohort of interested SPOs and pilot dapps.\n3. A delivery roadmap for MVP, pilot and broader rollout, including how subsidised subscriptions will be applied to early adopters.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Public or signed partnership acknowledgements (Lava + Wizard), a written architecture document, and a list of SPOs and Cardano projects expressing intent to participate in the pilot.\n- Clear description of how SPO rewards and subsidised subscriptions will be implemented without double-counting against the API Pool proposal, and how value flows back to Cardano and the SPO ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Links to non-confidential architecture documents, redacted partnership summaries, and a short report summarising SPO and pilot project interest.\n- This milestone should demonstrate that the project is organised, realistic and aligned with key ecosystem stakeholders, including Wizard, selected SPOs and the relevant Cardano infrastructure teams.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"MVP Gateway on Cardano Testnet","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A working MVP of CardanoScale running on Cardano testnet, with a basic web interface, integration with Lava’s routing stack and at least 2–3 SPOs serving as upstream providers.\n2. Initial pilot projects (including Wizard where appropriate) can obtain testnet endpoints and send real requests. Basic health checks, metrics and failover behaviour are implemented and observed under realistic testnet load.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Testnet endpoint(s) demonstrably route traffic through multiple SPO providers. At least one real Cardano project is sending meaningful testnet traffic via the gateway.\n- Logs and dashboards show provider performance, request counts and at least one successful failover scenario where traffic is shifted away from an unhealthy provider to healthy ones, validating the SPoF-avoidance design.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Screenshots, a short video walkthrough and anonymised logs showing multi-provider routing on testnet.\n- A brief pilot report from one or more early users describing their experience integrating with the gateway, including feedback on latency, reliability and ease of use.\n- Any issues discovered and fixes applied will be documented to inform the mainnet launch.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mainnet Launch & Early Subscribers","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. CardanoScale is promoted from testnet-only to a limited production launch on mainnet, with a small set of early subscribers (some subsidised) sending sustained traffic.\n2. Mainnet SPOs receive rewards from the SPO budget based on QoS metrics. Subsidised subscriptions are in place for selected Cardano teams, reducing their initial RPC cost and helping them transition from ad hoc infrastructure to the gateway.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- At least 3–5 Cardano projects active on mainnet via the gateway.\n- SLA-level monitoring is in place and shows acceptable uptime and latency. SPO rewards are being calculated and distributed according to defined QoS metrics, with SPOs able to verify that rewards match their performance.\n- The subsidised subscription mechanism is functioning for early adopters, with at least one documented case study showing how it supported a team’s growth.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Aggregated usage statistics (traffic, uptime, latency) for mainnet, plus anonymised examples of SPO reward distribution for this phase.\n- A short write-up on how subsidised subscriptions were allocated, which types of projects were prioritised and early feedback from teams that benefited, including Wizard if applicable. \n- Any adjustments planned for the next phase based on this data will also be documented.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":60000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Scale-Up, Outreach & Optimisation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. An expanded set of SPOs and Cardano projects using the gateway.\n2. Outreach activities (AMAs, joint spaces, documentation, tutorials) help more teams understand how to onboard and how value flows back to SPOs.\n3. Routing policies and QoS metrics are refined based on real-world data. Further subsidised subscriptions are issued strategically to promising Cardano projects whose infra needs align with the gateway and contribute to meaningful on-chain activity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Evidence of growth in both the number of participating SPOs and the number of subscribing projects.\n- At least 2–3 ecosystem-facing outreach activities delivered and visible in public channels.\n- Clear improvements in routing policies or QoS metrics definitions based on observed performance and SPO feedback.\n- SPO earnings and gateway adoption are perceived as fair and transparent by participants, evidenced through qualitative feedback and participation retention.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Updated metrics (usage, SPO count, subscriber count), links to outreach materials (blog posts, recordings, X/Discord announcements) and a short optimisation report summarising changes made based on data and feedback from SPOs and builders.\n- The report should show how the gateway evolved over time and how decisions were taken to maximise value for Cardano and the SPO ecosystem.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":55000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Close-Out Report, Metrics & Community Video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A public written report summarising results: SPO rewards, subscriber adoption, impact on infrastructure resilience and lessons learned linking the gateway and the SPO ecosystem.\n2. A short, accessible video explaining what CardanoScale is, how it uses SPOs, how value flows back to Cardano and how teams can engage.\n3. A final community update inviting ongoing feedback and collaboration beyond the grant period.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The written report and video are publicly available and easy to find.\n- They clearly explain what Catalyst funded, what was delivered, how SPOs and builders benefited and how the gateway can continue operating or evolving.\n- The broader Cardano community can see how the 185,000 ADA was used, how much reached SPOs and builders, and what the proposed next steps are, if any.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- URLs to the report and video, plus links or screenshots of the final community update (forum, Discord, X, etc.).\n- Together, these provide a clear record of impact and a baseline for any follow-on proposals or community-driven extensions.\n- This milestone has no extra cost, as the work is covered within earlier allocations.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"CardanoScale is delivered by a combined team from Lava Foundation (governance and ecosystem), MagmaDevs (infrastructure engineering) and the Wizard team (Cardano-native trading infra), working together with Cardano SPOs and ecosystem contributors.\n\n- **Nimrod Knoller \\- Head of Lava Foundation** - [https://www\\.linkedin\\.com/in/nimrod\\-knoller/](https://www.linkedin.com/in/nimrod-knoller/)\n    - Overall project sponsor and point of contact. Responsible for strategy, alignment with Cardano ecosystem stakeholders, and ensuring that value flows back to SPOs and builders.\n- **Yair Cleper \\- Co\\-Founder, MagmaDevs / Lava Contributor** - [https://www\\.linkedin\\.com/in/cleper/](https://www.linkedin.com/in/cleper/) - [https://x\\.com/yaircleper](https://x.com/yaircleper)\n    - Contributor or the gateway. Oversees architecture, integration of Cardano into Lava’s routing stack, performance optimisation and coordination of the engineering team working on routing, monitoring and QoS logic.\n- **Justina Petraitytė \\- Developer Relations** - Lava Foundation - [https://www\\.linkedin\\.com/in/justina\\-petraityte/](https://www.linkedin.com/in/justina-petraityte/)\n    - Responsible for developer experience, SPO and builder onboarding, documentation, tutorials and community-facing technical content. Works directly with Cardano teams to make integration with CardanoScale straightforward.\n- **Ignacio Rodríguez Serpa \\- Project Manager and Operations** - Lava Foundation [https://www\\.linkedin\\.com/in/ignaciorsg/](https://www.linkedin.com/in/ignaciorsg/)\n    - Coordinates day-to-day delivery: milestone planning, risk tracking, SPO engagement, cross-team communication (Lava, Wizard, SPOs, Cardano stakeholders) and reporting back to the community and Catalyst.\n- **Tommy Dowson \\- Marketing Operations** - Lava Foundation [https://www\\.linkedin\\.com/in/tomdowson/](https://www.linkedin.com/in/tomdowson/)\n    - Supports ecosystem communications, announcement planning and case study production. Ensures that SPOs and Cardano builders understand how to access the gateway and how rewards and subsidised subscriptions work.\n- **Toni Lukic \\- Growth &amp; Comms Lead** - Lava Foundation [https://www\\.linkedin\\.com/in/tonilukic/](https://www.linkedin.com/in/tonilukic/)\n    - Leads narrative, positioning and growth strategy for CardanoScale within the wider Lava ecosystem. Works with Cardano Foundation contacts, Wizard and other ecosystem teams to align messaging and identify high-impact projects to onboard.\n- Wizard’s contribution as a supporting partner. Provides requirements, feedback and validation from high-intensity trading workloads, and supports integration between Wizard’s orderbook/indexer infrastructure and CardanoScale’s RPC gateway.\n- MagmaDevs Engineering Team – Infrastructure Contributors\n    - MagmaDevs is a team of 13 senior engineers (including 5 ex-founders / CTOs) contributing to Lava Network. They are responsible for implementing and hardening the gateway routing, monitoring, billing hooks and SPO integration, drawing on experience running production RPC for projects such as Hypernative, Mintscan, Tres, SweatEconomy, HOT Wallet and Fireblocks.\n\nAll team members have verifiable public profiles (LinkedIn, GitHub, X) and a track record of delivering production-grade infrastructure. The same core group is also involved in the Cardano Community API / RPC Pool proposal, ensuring tight coordination between the SPO pool and the gateway so that value and traffic flow coherently across both initiatives.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The total budget requested is 185,000 ADA, allocated as follows:\n\n\n\n**1\\. SPO Rewards – 101,750 ADA \\(55%\\)**\n\n101,750 ADA (55%) is allocated to Stake Pool Operator (SPO) rewards for providing dedicated Cardano RPC/API capacity that backs the gateway’s paid subscriptions.\n\n\n\nThese funds are directed straight back into the Cardano operator ecosystem as transparent, performance-linked payments.\n\n\n\n- **The SPO budget will be used to:**\n    - Reward SPOs who meet agreed quality-of-service targets (uptime, latency, correctness) for gateway traffic.\n    - Encourage SPOs from the companion Cardano API / RPC Pool proposal to participate, so that expertise and infrastructure can be reused across both public and paid endpoints.\n    - Ensure that as the gateway scales, a meaningful share of revenue and funding flows back to the operator community, not just to a single vendor.\n\n\n\n\n\nEven if the companion API Pool proposal is not funded, this allocation remains fully usable: CardanoScale will still recruit a set of qualified SPOs and pay them from this budget for providing the RPC capacity behind the gateway. If both proposals are funded, we will coordinate to avoid duplication and maximise value to SPOs.\n\n\n\n**2\\. Gateway Runner – 83,250 ADA \\(45%\\)**\n\n83,250 ADA (45%) is allocated to the gateway runner (Lava, with support from Wizard and SPO operators) and is broken down as:\n\n\n\n- **37,000 ADA \\(20%\\) – Subsidised subscriptions for Cardano teams**\n    - Used to subsidise early RPC subscriptions for Cardano dapps and enterprises, lowering the cost of onboarding to the gateway in the first months. This effectively reallocates part of the grant directly to builders in the form of discounted or partially covered RPC plans, helping serious teams adopt CardanoScale without prohibitive upfront cost.\n\n\n\n- **27,750 ADA \\(15%\\) – Gateway setup & operations**\n    - Covers design, engineering and operational work to build and run the gateway: integrating Cardano into the routing stack, setting up monitoring, billing hooks, dashboards, security and internal tooling. Includes the effort to integrate SPO-run RPC nodes as first-class upstream providers and to align configuration with Cardano best practices.\n\n\n\n- **18,500 ADA \\(10%\\) – Partnership & ecosystem marketing**\n    - Funds collaboration with the Wizard team and other Cardano contributors, joint ecosystem outreach, documentation, developer support and coordination with Cardano Foundation and builder communities. The focus is not generic advertising, but targeted communication so Cardano projects understand how to use the gateway and how the model benefits SPOs.\n\n\n\n**3\\. Alignment with milestones**\n\nThese amounts are distributed across the milestones as follows:\n\n\n\n- Milestone 1 – Design, Architecture & Partnerships: 30,000 ADA\n- Milestone 2 – MVP Gateway on Testnet: 40,000 ADA\n- Milestone 3 – Mainnet Launch & Early Subscribers: 60,000 ADA\n- Milestone 4 – Scale-Up, Outreach & Optimisation: 55,000 ADA\n- Milestone 5 – Close-Out, Reporting & Community Video: 0 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Overall, this structure ensures that:\n\n- 55% of the budget flows directly to SPOs as infrastructure rewards.\n- 20% is used to reduce the cost of RPC for Cardano dapps and enterprises via subsidised subscriptions.\n- Only 25% of the budget is retained for core setup, operations, partnership work and ecosystem outreach.\n\n\n\n\n\nIn practice, this means the majority of the funds either:\n\n- go directly to Cardano infrastructure operators (SPOs), or\n- are used to lower costs for Cardano builders integrating with the gateway.\n\n\n\n\n\nNo part of this budget is used for speculation, token purchases or generic giveaways. The focus is on establishing a sustainable, SPO-powered RPC gateway that keeps value and decision-making inside the Cardano ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Infrastructure","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1655}