{"pr_id":"019ac05d-6316-7d42-a115-26bb3950e823","title":"Advanced Cardano Smart Contract Analytics & Dashboard","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Current Cardano explorers lack detailed smart contract analytics, making it difficult for developers and users to easily track performance, optimize execution, and deeply analyze contract behavior.","solution":"We will develop a dedicated comprehensive smart contract analytics with real-time dashboards, execution metrics, and in-depth contract behavior analysis tools for developers and users.\n\n","proposer_name":"Leykun Ejigu","proposer_relevant_experience":"1: Sibhat Teshome - Blockchain Developer,Web Developer and Project Manager\n\n\n\nFullstack developer | Node.js | React | svelte | Next.js | sveltekit | Postgress | Typescript | Docker\n\n\n\nLinkedIn Profile:[https://www\\.linkedin\\.com/in/sibhat\\-teshome\\-9a972b221/](https://www.linkedin.com/in/sibhat-teshome-9a972b221/)\n\n\n\nRole: Responsible for web development, focusing on Web-development, UI/UX design and implementation of Dashboards and Analytics. Dawit brings expertise in creating an intuitive and engaging user interface.\n\n\n\n2: Leykun Ejigu - Blockchain Developer, AI Engineer, Backend and Devops | Top Talent Freelancer\n\n\n\nBack-end development.\n\n\n\nAI engineer\n\n\n\nLinkedIn Profile:\n\n\n\n[https://www\\.linkedin\\.com/in/leykun\\-ejigu/](https://www.linkedin.com/in/leykun-ejigu/)\n\n\n\nUpwork account\n\n\n\n[https://www\\.upwork\\.com/freelancers/~016c2f33559643beeb/](https://www.upwork.com/freelancers/~016c2f33559643beeb/)\n\n\n\nGithub account:\n\n\n\n[https://github\\.com/leykun10](https://github.com/leykun10)\n\n\n\nCardano Blockchain Certified Associate (CBCA)\n\n\n\n[https://drive\\.google\\.com/file/d/1W90TYaWdBu2\\-2LdvgoLYhVPZnHg0L\\-cp/view](https://drive.google.com/file/d/1W90TYaWdBu2-2LdvgoLYhVPZnHg0L-cp/view)\n\n\n\nRole: Leykun is responsible for the Backend Infrastructure, DevOps aspects within the project.\n\n\n\n3: Rufael Fekade - Machine Learning Researcher and Engineer with Machine Learning Major at MBZUAI\n\n\n\nRole: Rufael is responsible for the Real time data processing and Analytics aspect of the project, AI powered search functionality.\n\n\n\n4: Yeabesera Derese - Web developer, Developer Advocate\n\n\n\nRole: Responsible for preparing tutorials, documentations and developer community engagement.\n\n\n\n5. Michael Hailu - Management and Operations\n\nRole: Responsible for Managing day to day operations, and scope out project plans","url":null,"funds":96000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Advanced Cardano Smart Contract Analytics & Dashboard","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Leykun Ejigu","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":96000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":8,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Current Cardano explorers lack detailed smart contract analytics, making it difficult for developers and users to easily track performance, optimize execution, and deeply analyze contract behavior.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will develop a dedicated comprehensive smart contract analytics with real-time dashboards, execution metrics, and in-depth contract behavior analysis tools for developers and users.\n\n","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://explorer.cardano.org/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependecies ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All outputs of the Cardano Smart Contract Analytics & Dashboard Engine will be fully open source and released under the MIT License. This includes:\n\nCodebase: The entire codebase for the analytics dashboard, including the frontend, backend, and data processing engine, will be open to the public. This allows developers to contribute, modify, and extend the functionalities to meet specific needs.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Analytics","group":"Development & Tools"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Most Cardano explorers show “what happened” (transactions, addresses, basic script views) but not “how contracts behave” at a developer level. Our prototype focuses on smart-contract performance analytics: success/failure patterns, execution/cost signals, contract interaction trends, and comparable time-series views—packaged as a dedicated analytics dashboard with APIs and exportable datasets for optimization and monitoring","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"A working pipeline that indexes contract interactions from Cardano testnet (and/or mainnet where feasible), computes contract-level metrics, and displays them in a live dashboard (global overview + per-contract pages with drill-down charts and filters). It will be accessible as a public beta web dashboard, plus an open GitHub repo containing the indexer/analytics API, frontend code, and documentation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Index and label N distinct scripts/contracts (target: 500+) and 30–90 days of interactions\n\n\n\nTrack tx success rate vs failures per contract and overall; publish distributions and trends\n\n\n\nAggregate contract interaction counts, unique interacting addresses, peak activity windows, and top contracts/dApps by usage\n\n\n\nBeta adoption: 200+ dashboard users, 50+ developer feedback submissions, and 10+ teams using exports/APIs\n\n\n\nPublic metrics snapshot showing: total indexed txs, indexed scripts, median API latency, and weekly active users, with reproducible queries and links to on-chain references used for verification","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Our advanced Cardano explorer will revolutionize smart contract analytics on the Cardano blockchain, addressing the critical need for in-depth contract analysis and performance optimization tools. We perceive the current lack of detailed smart contract analytics as a significant barrier to Cardano's growth and adoption, particularly among developers and power users who require granular insights into contract behavior and performance.\n\n\n\nKey features of our solution include:\n\n\n\nReal-time Smart Contract Dashboard:\n\n\n\nLive execution metrics\n\n\n\nGas usage analysis\n\n\n\nTransaction volume and value flows\n\n\n\nInteraction patterns between contracts\n\n\n\nContract Performance Optimizer:\n\n\n\nIdentifies inefficiencies in contract execution\n\n\n\nSuggests optimizations for gas usage and execution speed\n\n\n\nComparative analysis with similar contracts\n\n\n\nVisual Contract Flow Analyzer:\n\n\n\nInteractive visualizations of contract logic and execution paths\n\n\n\nHelps in understanding complex contract interactions\n\n\n\nHistorical Data Analysis:\n\n\n\nTrend analysis of contract usage and performance over time\n\n\n\nAnomaly detection in contract behavior\n\n\n\nDeveloper-friendly API:\n\n\n\nAllows integration of analytics into development environments\n\n\n\nSupports custom queries for specialized analysis\n\n\n\nOur approach is unique in its focus on developer experience and deep contract analysis. By providing these tools, we aim to:\n\n\n\nEmpower developers to create more efficient and robust smart contracts\n\n\n\nEnhance transparency for users interacting with smart contracts\n\n\n\nFacilitate easier auditing and bug detection in contracts\n\n\n\nThe project will engage:\n\n\n\nSmart contract developers\n\n\n\nDApp creators\n\n\n\nBlockchain analysts and researchers\n\n\n\nCardano community members and stakeholders\n\n\n\nTo demonstrate our impact, we will:\n\n\n\nTrack the number of developers and projects using our explorer\n\n\n\nMeasure improvements in contract efficiency for projects using our tools\n\n\n\nCollect user feedback and case studies\n\n\n\nMonitor the growth of smart contract deployment and usage on Cardano\n\n\n\nThis solution is crucial for Cardano as it will significantly enhance the platform's smart contract capabilities, making it more attractive for developers and potentially accelerating the growth of the Cardano DeFi ecosystem. By providing superior analytics and optimization tools, we aim to position Cardano as the blockchain of choice for sophisticated smart contract development and deployment.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Our project will significantly enhance the Cardano community by providing a robust smart contract analytics and dashboard tool that empowers developers, investors, and stakeholders with actionable insights. This enhancement will lead to improved smart contract performance, increased security, and more informed investment decisions, thereby fostering a more vibrant and trustworthy Cardano ecosystem.\n\n\n\nValue to the Cardano Community:\n\n\n\nEnhanced Developer Capabilities: Developers will have access to detailed metrics and analytics, enabling them to optimize smart contract performance, identify and resolve issues promptly, and implement best practices more effectively.\n\n\n\nInformed Investment Decisions: Investors will benefit from comprehensive data on smart contract performance and security, allowing them to assess risks and opportunities with greater precision, thereby attracting more investment into the Cardano ecosystem.\n\n\n\nImproved Security and Trust: By providing real-time security alerts and comprehensive monitoring tools, our dashboard will help in early detection of vulnerabilities and potential threats, increasing overall trust in Cardano’s smart contracts.\n\n\n\nIncreased Transparency: The dashboard will offer transparent insights into smart contract activities, promoting accountability and fostering a more open and collaborative community environment.\n\n\n\nCommunity Engagement: By making complex analytics accessible and user-friendly, we will engage a broader segment of the community, including non-technical members, thereby driving wider adoption and participation in Cardano’s growth.\n\n\n\nMeasuring Impact:\n\n\n\nWe will implement a combination of quantitative and qualitative metrics to assess the impact of our project:\n\n\n\nUser Adoption Rates: Tracking the number of active users, including developers, investors, and other stakeholders utilizing the dashboard.\n\n\n\nSmart Contracts Monitored: Measuring the total number of smart contracts being tracked and analyzed through our platform.\n\n\n\nSecurity Alerts Issued: Monitoring the frequency and effectiveness of security alerts and how they contribute to mitigating vulnerabilities.\n\n\n\nUser Satisfaction Scores: Collecting feedback through surveys and user interviews to gauge satisfaction and identify areas for improvement.\n\n\n\nPerformance Improvements: Assessing the optimization of smart contracts by analyzing performance metrics before and after using the dashboard.\n\n\n\nInvestment Growth: Monitoring any increase in investments into Cardano projects that utilize our analytics tool, indicating greater investor confidence.\n\n\n\nSharing Outputs and Opportunities:\n\n\n\nPublic Dashboard Access: The analytics dashboard will be accessible to all Cardano community members through a web-based platform, ensuring widespread availability and ease of use.\n\n\n\nRegular Reports and Insights: We will publish monthly and quarterly reports highlighting key metrics, trends, and insights derived from the dashboard, sharing these with the community via the Cardano forums, social media channels, and newsletters.\n\n\n\nOpen Source Contributions: Where applicable, we will contribute components of our dashboard to the open-source community, encouraging collaboration and continuous improvement.\n\n\n\nWorkshops and Webinars: Hosting educational sessions to demonstrate the dashboard’s features, best practices for utilizing analytics, and how to interpret key metrics effectively.\n\n\n\nPartnerships with Development Teams: Collaborating with Cardano development teams and projects to integrate our analytics tool into their workflows, providing tailored support and maximizing the tool’s utility.\n\n\n\nCommunity Feedback Loops: Establishing channels for ongoing feedback and suggestions from users, ensuring that the dashboard evolves in alignment with community needs and preferences.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our team possesses a unique blend of skills and experience that makes us exceptionally well-suited to deliver this advanced Cardano explorer with smart contract analytics:\n\n\n\nTeam Composition:\n\n\n\nBlockchain Development:\n\n\n\nTeam members with 3+ years of experience in blockchain development, with a strong focus on Cardano.\n\n\n\nDeep understanding of Cardano's architecture, smart contract functionality, and the intricacies of its transaction model.\n\n\n\nData Analytics and Visualization:\n\n\n\nSpecialists with 3-4 years of experience in big data analytics, real-time data processing, and creating interactive dashboards.\n\n\n\nFull Stack Development:\n\n\n\nSeasoned full stack developers with 4+ years of experience in building robust, scalable web applications with business and personal analytics dashboard.\n\n\n\nExpertise in developing high-performance, user-friendly blockchain dapps.\n\n\n\nSmart Contract Optimization:\n\n\n\nExperts in smart contract development and optimization, with a deep understanding of execution metrics and gas efficiency.\n\n\n\nProject Management:\n\n\n\nExperienced project managers well-versed in agile methodologies and project lifecycles.\n\n\n\nTrack record of delivering complex technical projects on time and within budget.\n\n\n\nProject Delivery Approach:\n\n\n\nTo ensure trust and accountability, we will implement the following strategies:\n\n\n\nTransparent Progress Tracking:Utilize a public GitHub repository for code development and issue tracking.\n\n\n\nRegular updates to the Cardano community through blog posts and social media.\n\n\n\nCommunity Engagement:Regular feedback sessions with developers and users to refine the explorer based on real-world needs.\n\n\n\nOpen channels for feature requests and bug reports.\n\n\n\nFund Management Approach:\n\n\n\nStructured Planning and Milestones:Detailed project roadmap with defined timelines and deliverables.\n\n\n\nRegular financial reports to ensure transparency in fund allocation.\n\n\n\nResource Allocation:Clear budget breakdown for each project phase.\n\n\n\nContinuous monitoring of expenses against project progress.\n\n\n\nFeasibility Validation:\n\n\n\nTo validate our approach, we will focus on:\n\n\n\nPrototype Development: Create a minimum viable product (MVP) of the explorer with basic smart contract analytics to validate our technical approach and user interface design.\n\n\n\nPerformance Testing: Conduct rigorous testing to ensure the explorer can handle real-time data processing for the Cardano network.\n\n\n\nCommunity Beta Testing: Engage a select group of Cardano developers and power users for early access and feedback, allowing us to refine our approach based on real user needs.\n\n\n\nIterative Development: Implement an agile development process with regular sprints and demos, allowing for continuous improvement and adaptation.\n\n\n\nScalability Assessment: Continuously evaluate the scalability of our solution as we add more advanced features, ensuring it can grow with the Cardano ecosystem.\n\n\n\nCompliance and Security Audits: Conduct regular security audits and ensure compliance with best practices for blockchain data handling and visualization.\n\n\n\nOur structured approach, combined with our team's deep expertise in Cardano development and blockchain analytics, ensures that we can deliver this next-generation explorer with the highest standards of trust, accountability, and technical excellence.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Planning, Technical Design, and UI/UX Design","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Project Planning**: A complete roadmap with milestones, timelines, and dependencies; defined team roles and responsibilities; and a clear scope for “prototype launch” (what’s in/out). A metrics plan defining what “smart contract analytics” means in this project (execution cost signals, failure rates, throughput, script usage trends, contract interaction patterns, per-dApp views).\n\n\n\n**Technical Design**: Architecture for ingesting Cardano on-chain data and turning it into analytics (indexer choice, data pipeline, storage strategy, caching, API). Includes data flow diagrams, threat model, privacy assumptions, and a scalable database schema for contract-level/time-series analytics.\n\n\n\n**UI/UX**: Wireframes + high-fidelity mockups for the dashboard (contract overview pages, trends, filters, drill-downs, alerts, export). Final clickable prototype covering the user journey for developers and general users.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A roadmap exists that is specific enough to implement without rework (deliverables and dates are unambiguous). Technical design documentation includes architecture diagrams, data flows, database schema, and chosen stack with rationale. UI/UX prototypes cover at least the top 5 screens and key flows (search contract → view metrics → drill-down → compare → export/share) and are validated internally against the metrics plan.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public repository contains: planning PDF(s), technical design spec, architecture diagrams, database schema files, and UI/UX wireframes + clickable prototype link (Figma or equivalent). A short “Design Review” note in the repo summarizes decisions (indexing approach, analytics definitions, and what can be validated by month 4).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":22000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Backend Indexing, Data Pipeline, and Analytics API (Prototype-Ready)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A working backend that can continuously ingest transactions related to smart contracts (scripts) from Cardano testnet and/or mainnet (depending on feasibility and cost), normalize them into an analytics-friendly model, and expose them through API endpoints. Includes: ingestion/indexer service, processing jobs for computed metrics, database implementation optimized for queries, and an API layer for the dashboard. Also includes monitoring/logging, rate limiting, and documented security measures for API keys and access.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Backend can index contract interactions over a defined time window (e.g., last 30–90 days) and compute agreed “v1 metrics” (contract interaction count, tx success/failure rate, basic execution/cost indicators available from indexed data, top interacting addresses count, peak activity times, script usage trends). API endpoints must reliably return data for dashboard charts within acceptable latency for a prototype. Integration tests demonstrate correct ingestion, processing, and API responses under repeated runs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Repo contains backend source code with commit history, API documentation (OpenAPI/Swagger or equivalent), architecture/data flow updates, and integration test logs. A short demo clip shows API endpoints returning real indexed results for at least 3 example contracts/scripts plus a “how to run locally” guide (Docker compose or scripted setup).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":34000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Frontend Dashboard + Core Analytics Views (End-to-End Prototype)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A functional web dashboard connected to the backend APIs, providing real-time (or near real-time) visibility into smart contract activity. Includes core pages: global overview, contract/profile page, time-series charts, error/failure breakdowns, top contracts/dApps, searchable explorer-like lookup, and drill-down views. Implements key visual components (charts/tables), filtering (time range, contract/dApp, status), and export/share basics (CSV export or shareable links). Includes accessibility/responsive behavior for typical devices.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A functional web dashboard connected to the backend APIs, providing real-time (or near real-time) visibility into smart contract activity. Includes core pages: global overview, contract/profile page, time-series charts, error/failure breakdowns, top contracts/dApps, searchable explorer-like lookup, and drill-down views. Implements key visual components (charts/tables), filtering (time range, contract/dApp, status), and export/share basics (CSV export or shareable links). Includes accessibility/responsive behavior for typical devices.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Live demo link (staging) and recorded walkthrough showing the full dashboard flow. Repo includes frontend source code, build instructions, screenshots of key views, and integration test notes showing successful frontend↔backend connectivity. A “Known Limitations” section is included so the community understands prototype scope.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":26000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Public Beta Launch, Community Engagement & Close-Out","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A public beta launch of the prototype (testnet or mainnet environment) accessible to the Cardano community for feedback. Includes a community engagement plan executed: announcements across Cardano channels, a feedback collection form, an issue tracker workflow, and at least one live demo/AMA or recorded workshop. Includes performance tuning based on beta findings and a “beta iteration” release.  Finally, deliver Catalyst close-out package: Completion Report PDF + 2–3 minute summary video and a repository index linking all artifacts.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Prototype is publicly accessible with clear onboarding instructions and stable uptime appropriate for beta testing. Community engagement is demonstrated through multiple public touchpoints (at least 2 announcements + 1 demo/workshop). Feedback is collected and triaged publicly, and at least one iteration release addresses top issues. Close-out report includes results vs KPIs, what was learned, and the recommended next steps for a production-grade version.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Links to the live beta dashboard, public announcements, and demo/AMA recording. Public docs (how to use, glossary of metrics, FAQs) and issue tracker showing feedback intake and resolutions. PDF close-out report in repo plus final summary video link. A “Close-Out Index” section links: code releases, docs, engagement posts, metrics snapshots, and budget reconciliation summary.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":14000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"1: Sibhat Teshome - Blockchain Developer,Web Developer and Project Manager\n\n\n\nFullstack developer | Node.js | React | svelte | Next.js | sveltekit | Postgress | Typescript | Docker\n\n\n\nLinkedIn Profile:[https://www\\.linkedin\\.com/in/sibhat\\-teshome\\-9a972b221/](https://www.linkedin.com/in/sibhat-teshome-9a972b221/)\n\n\n\nRole: Responsible for web development, focusing on Web-development, UI/UX design and implementation of Dashboards and Analytics. Dawit brings expertise in creating an intuitive and engaging user interface.\n\n\n\n2: Leykun Ejigu - Blockchain Developer, AI Engineer, Backend and Devops | Top Talent Freelancer\n\n\n\nBack-end development.\n\n\n\nAI engineer\n\n\n\nLinkedIn Profile:\n\n\n\n[https://www\\.linkedin\\.com/in/leykun\\-ejigu/](https://www.linkedin.com/in/leykun-ejigu/)\n\n\n\nUpwork account\n\n\n\n[https://www\\.upwork\\.com/freelancers/~016c2f33559643beeb/](https://www.upwork.com/freelancers/~016c2f33559643beeb/)\n\n\n\nGithub account:\n\n\n\n[https://github\\.com/leykun10](https://github.com/leykun10)\n\n\n\nCardano Blockchain Certified Associate (CBCA)\n\n\n\n[https://drive\\.google\\.com/file/d/1W90TYaWdBu2\\-2LdvgoLYhVPZnHg0L\\-cp/view](https://drive.google.com/file/d/1W90TYaWdBu2-2LdvgoLYhVPZnHg0L-cp/view)\n\n\n\nRole: Leykun is responsible for the Backend Infrastructure, DevOps aspects within the project.\n\n\n\n3: Rufael Fekade - Machine Learning Researcher and Engineer with Machine Learning Major at MBZUAI\n\n\n\nRole: Rufael is responsible for the Real time data processing and Analytics aspect of the project, AI powered search functionality.\n\n\n\n4: Yeabesera Derese - Web developer, Developer Advocate\n\n\n\nRole: Responsible for preparing tutorials, documentations and developer community engagement.\n\n\n\n5. Michael Hailu - Management and Operations\n\nRole: Responsible for Managing day to day operations, and scope out project plans","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"96,000 ADA is our requested funding budget. It covers research and technical design, backend indexing and analytics development, dashboard UI implementation, testing/QA, a public beta launch for community feedback, documentation, and the required Catalyst close-out deliverables. The goal is a publicly accessible prototype on Cardano testnet (and/or mainnet where feasible) for testing and feedback—not a full commercial analytics product.\n\n\n\nMilestone 1 — Planning, Metrics Definition & UI/UX Design (22,000 ADA)\n\n\n\nProject Management & Coordination (4,000 ADA): sprint planning, roadmap, milestone evidence plan, risk tracking, and aligning analytics definitions with build scope.\n\nResearch & Metrics Definition (5,000 ADA): define the “v1 contract analytics” set (success/failure rates, interaction counts, trend windows, top contracts/dApps, unique interactors), validation approach, and KPI framework.\n\nTechnical Architecture & Data Model (7,000 ADA): end-to-end design for indexing/pipeline/API, storage strategy, schema design, caching approach, security model, diagrams and specs.\n\nUI/UX Design (5,000 ADA): wireframes + high-fidelity dashboard prototype (global overview, contract page, drill-downs, filters, comparisons, export).\n\nTools/Infra (1,000 ADA): design tools, research references, early API access, and repository setup.\n\n\n\nMilestone 2 — Backend Indexing, Data Pipeline & Analytics API (34,000 ADA)\n\n\n\nBackend/Blockchain Data Engineering (18,000 ADA): build ingestion/indexing integration, normalize on-chain data into analytics-friendly records, compute v1 metrics, and implement the processing jobs (batch/near-real-time).\n\nAPI Engineering (7,000 ADA): analytics API endpoints, query optimization, pagination, caching, rate limiting, and OpenAPI docs.\n\nDatabase & Storage (4,000 ADA): schema implementation, performance tuning (indexes/partitions), retention strategy, and backup approach.\n\nTesting & Security Hardening (3,000 ADA): integration tests, replay reliability tests, basic threat model controls, secret handling, and audit-ready logs.\n\nInfrastructure & Tooling (2,000 ADA): hosted backend environment, monitoring/logging, and indexing/API credits for consistent testnet ingestion.\n\n\n\nMilestone 3 — Frontend Dashboard Development (26,000 ADA)\n\n\n\nFrontend Engineering (15,000 ADA): build the dashboard app, routing, state management, charts/tables, filters, comparisons, and contract profile pages.\n\nData Visualization & UX Implementation (5,000 ADA): implement readable, actionable views (success/failure breakdowns, time-series trends, top contracts/dApps, interactors), and responsive design.\n\nBackend Integration (3,000 ADA): connect to analytics APIs, handle loading/empty/error states, caching on the client, and export/share flows.\n\nQA & Validation (2,000 ADA): verify chart accuracy vs API responses, usability checks, and cross-browser tests.\n\nInfra (1,000 ADA): staging deployment for the dashboard and basic uptime monitoring.\n\n\n\nMilestone 4 — Public Beta Launch, Community Engagement & Close-Out (14,000 ADA)\n\n\n\nBeta Launch & Operations (4,000 ADA): deploy public beta environment, uptime monitoring, incident response plan, and iterative patching.\n\nCommunity Engagement & Feedback Loop (3,000 ADA): announcements, onboarding guide, feedback form, issue triage workflow, and at least one demo/AMA or recorded walkthrough.\n\nIteration Release from Beta Feedback (2,000 ADA): deliver fixes/improvements based on community testing and prioritized issues.\n\nDocumentation & Tutorials (2,000 ADA): user docs, metric glossary, FAQs, and short how-to guides linked from the app.\n\nClose-out Report & Summary Video (3,000 ADA): completion report (PDF), artifact index, budget reconciliation, and 2–3 minute project summary/demo video.\n\n\n\nWe’ll attach each milestone cost summary to the corresponding delivery (tagged releases, demo links, docs, beta engagement links, and metrics artifacts) for transparency and accountability.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Our 96,000 ADA budget represents strong value for the Cardano ecosystem because it funds a public-good analytics prototype that improves how developers, users, and researchers understand real on-chain smart contract activity—something the ecosystem currently lacks at depth.\n\n\n\nWhy the spend is good value\n\n\n\nDirectly tied to deliverables: Most funds go to building the core infrastructure (indexing → processing → analytics API → dashboard). Each milestone produces verifiable outputs (code, live demo, docs, beta engagement, metrics, close-out), reducing waste and ensuring accountable execution.\n\n\n\nSpecialized work, high leverage: Smart contract analytics requires blockchain data engineering, backend/API design, and high-quality visualization. Funding experienced builders reduces rework and ensures the prototype is accurate, performant, and trusted.\n\n\n\nMinimal “fluff” costs: We prioritize engineering, QA, and documentation over heavy marketing. “Community engagement” is scoped as practical adoption work—beta onboarding, demos, and feedback loops—to ensure the tool is actually used and improved.\n\n\n\nReusable ecosystem asset: The indexing patterns, analytics definitions, and APIs become building blocks for other Cardano tools (explorers, wallets, dApp monitoring). This multiplies the return on treasury spend beyond a single dashboard.\n\n\n\nOn-chain measurable impact: Value can be verified through indexed contracts, transaction volume analyzed, failure-rate insights surfaced, and community usage of exports/APIs—making results auditable rather than subjective.\n\n\n\nLong-term ecosystem benefits (ROI)\n\n\n\nBetter developer decisions: Visibility into failures, trends, and activity patterns helps teams optimize contracts, reduce failed transactions, and improve user experience across dApps.\n\n\n\nBetter transparency for users: Clear contract behavior and activity dashboards increase trust and reduce information gaps that slow adoption.\n\n\n\nScalable foundation: Investing early in a clean data model and pipelines means future expansions (alerts, risk flags, DeFi/dApp segments, mainnet scaling) can happen with significantly lower marginal cost.\n\n\n\nAccountability\n\nWe will run the project milestone-gated, publish open-source code, ship a public beta, document everything, and provide a close-out report with evidence and budget reconciliation—so the community can verify exactly what was delivered for each ADA spent.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Analytics","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1658}