{"pr_id":"019ac32e-b8b8-76ff-b738-d623c00fd74a","title":"Paper Thoughts — Read, Write, Chain (Tales to Tokens)","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Lores and local myths are disappearing. Cardano struggles with non-technical onboarding. We solve both by documenting folklore while guiding book club members through meaningful first wallet actions.","solution":"Book club preserves oral histories through salons and writing cohorts. 30 elder interviews become micro-journals and comics. 200 members create wallets, mint NFTs, stake ADA—stories become tokens.","proposer_name":"Morgan Ufuoma","proposer_relevant_experience":"Project Lead — Morgan Ufuoma Project coordinator\n\nOverall project management, Catalyst reporting, partner relations, supervision of day-to-day operations, and final deliverable sign-off.\n\n[https://www\\.linkedin\\.com/in/morgan\\-ufuoma/](https://www.linkedin.com/in/morgan-ufuoma/)\n\n[https://www\\.instagram\\.com/sixth\\_sage/](https://www.instagram.com/sixth_sage/)\n\n\n\nGabriel Oguche — Cultural Lead / Storyteller\n\nLead oral-history collection, curate poetic and narrative content, run creative workshops with elders and cultural stewards, and co-lead the comic contest.\n\n[https://www\\.instagram\\.com/jibothewordsmith/](https://www.instagram.com/jibothewordsmith/)\n\n[https://www\\.linkedin\\.com/in/gabriel\\-oguche\\-086626216/](https://www.linkedin.com/in/gabriel-oguche-086626216/)\n\n\n\nDr. Abdulhamid Liman Gambo (Grand Patron)\n\nInstitutional liaison with ABU and libraries; endorses project publicly; helps secure venues and institutional support; provides credibility for grant reviewers.\n\n\n\nDr. Alim Sabur (Advisor)\n\nStrategic advisor: research, evaluation design, quality assurance of documentation and academic partnerships.\n\n\n\nAisha Muhammad — Community Engagement Lead (d3rdspace community)\n\nRecruit participants, manage community outreach, run on-the-ground minting clinics and wallet onboarding.\n\n[https://www\\.instagram\\.com/d3rdspace/](https://www.instagram.com/d3rdspace/)\n\n\n\nAmina Ismail — Communications Lead\n\nPress, social media, design and distribution of micro-journals, and promotional strategy for animations and events.\n\n\n\n\n\nOmolola Lawson — Poet / Community Manager\n\nLocal engagement with creative communities, host readings, and manage the creatives hangouts.\n\n\n\nAyodeji Owolabi Prince — Events & Partnership Lead (Creative Connect)\n\nEvent logistics, co-hosting with Creative Connect, venue management, and festival programming support.\n\n[https://www\\.instagram\\.com/thecreativeskonnect/](https://www.instagram.com/thecreativeskonnect/)\n\n[https://www\\.instagram\\.com/dejii\\_prince/](https://www.instagram.com/dejii_prince/)\n\n\n\nBanjamin Gambo — Creative Director\n\nVisual direction for comics, animated shorts, micro-journals, and packaging of the oral-history archive. Oversees illustrators and animation vendors.\n\n\n\nAdditional roles (paid/volunteer): local facilitators for minting clinics, audio/recording technician, animator(s), illustrator(s), printing & distribution coordinator, admin/bookkeeper.","url":null,"funds":40000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Paper Thoughts — Read, Write, Chain (Tales to Tokens)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Morgan Ufuoma","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":40000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Lores and local myths are disappearing. Cardano struggles with non-technical onboarding. We solve both by documenting folklore while guiding book club members through meaningful first wallet actions.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Book club preserves oral histories through salons and writing cohorts. 30 elder interviews become micro-journals and comics. 200 members create wallets, mint NFTs, stake ADA—stories become tokens.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":{"links":[]},"sub_fields":null},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Open source","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Connected Community","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Our project targets three interconnected audiences that Cardano currently struggles to reach:\n\n\n\nPrimary: Locals and everyday readers (Age 25-65)\n\nThese are our 576 existing book club members and similar communities—people who value stories, heritage, and craft but have zero blockchain experience. They're literate, civic-minded, and care deeply about preserving community memory. They don't respond to technical tutorials about DeFi or development tools, but they will engage with meaningful cultural projects. When we frame Cardano as a tool to make their grandmother's stories permanent and accessible, suddenly blockchain becomes relevant to their lives.\n\n\n\nSecondary: Elders and tradition-bearers (Age 60+)\n\nCommunity elders hold irreplaceable oral histories, proverbs, folklore, and local knowledge. They're often excluded from technology conversations entirely. We're creating a bridge where their participation is honored (through stipends and respectful documentation) and their stories become permanent digital artifacts. Many have grandchildren who might help them understand \"their story is now on the blockchain forever\"—creating intergenerational Cardano awareness.\n\n\n\nTertiary: Young creatives and animators (Age 18-35)\n\nThrough our comic contest, we engage artists, illustrators, and animators who work in visual storytelling. This demographic is digitally fluent but may see Cardano as \"just another crypto project.\" By inviting them to transform elders' stories into art that gets minted as NFTs, we show them Cardano's cultural utility—not just financial speculation.\n\n\n\nWhy this matters:\n\n\n\n1. Solves the \"cold start\" problem for non-technical adoption\n\n\n\nCardano's current onboarding materials overwhelmingly target developers, DeFi users, or people already crypto-curious. The average person sees wallets, seed phrases, and staking rewards—abstract concepts that feel risky and irrelevant. Our project creates a warm doorway: \"Come record your grandmother's recipe, and we'll show you how to make it permanent on Cardano.\" The blockchain action becomes secondary to the cultural value, removing psychological barriers.\n\n\n\nWe're not asking people to \"buy crypto\"—we're inviting them to preserve heritage, then gently showing them: \"Here's how Cardano helps make this permanent.\" This reframes the entire value proposition.\n\n\n\n2. Demonstrates real-world utility beyond finance\n\n\n\nEvery mainstream criticism of blockchain asks: \"But what's it actually FOR?\" Cultural preservation is a clear, emotionally resonant answer. When someone can point to their grandfather's story minted as an NFT and say, \"This can never be lost now, and anyone can access it for free,\" that's tangible utility. It's not speculative—it's immediate and meaningful.\n\n\n\nThis project produces artifacts (oral histories, micro-journals, comics) that live beyond the grant period and demonstrate Cardano's capability to preserve cultural memory permanently and transparently.\n\n\n\n3. Creates long-term, values-aligned community members\n\n\n\nPeople who enter Cardano through cultural preservation aren't looking for quick profits—they're mission-driven. They care about decentralization, permanence, and public goods. These are exactly the kinds of long-term community members Cardano needs: people who will stake responsibly, participate in governance thoughtfully, and evangelize Cardano to others with similar values.\n\n\n\nOur 200-wallet target isn't just about numbers—it's about bringing in 200 people who understand why decentralization matters because they've seen how centralized platforms can disappear and take cultural memory with them.\n\n\n\n4. Generates compelling ecosystem narratives\n\n\n\nCardano needs stories that inspire non-technical audiences. \"We preserved 30 elder interviews on Cardano\" is a story that resonates with journalists, educators, policymakers, and everyday people. It's shareable content that humanizes the technology.\n\n\n\nEach animated comic we produce becomes a mini-documentary about Cardano's cultural impact. Each micro-journal minted becomes a proof point. These narratives attract other cultural organizations, universities, and NGOs who might consider Cardano for their own heritage projects.\n\n\n\n5. Validates Cardano's sustainability and permanence claims\n\n\n\nCardano positions itself as the sustainable, long-term blockchain. What better validation than cultural preservation? We're literally saying: \"We trust Cardano to hold our ancestors' stories forever.\" That endorsement—from everyday people, not crypto influencers—carries weight.\n\n\n\n6. Unlocks partnership opportunities with institutions\n\n\n\nOur library partnerships demonstrate how Cardano can integrate with trusted community institutions. When local libraries host \"Cardano minting clinics,\" that's mainstream legitimacy. It opens doors for other public institutions (schools, museums, community centers) to explore Cardano without feeling like they're endorsing speculation.\n\n\n\n7. Strategic Timing:\n\n\n\nRight now, Cardano is investing in governance, sustainability, and real-world impact. Our project aligns perfectly with these priorities. While other chains focus on financial products, Cardano can lead on cultural and social applications. This is competitive differentiation that matters to regulators, institutions, and the broader public.\n\n\n\n8. Scale Potential:\n\n\n\nIf successful, this model is replicable across thousands of communities globally. Every town, diaspora group, indigenous community, and cultural organization faces the same challenge: preserving disappearing oral traditions. We're creating an open-source playbook (all materials CC-licensed) that others can adapt. One successful 9-month pilot can inspire 100 similar projects—each bringing hundreds of new users to Cardano through culture rather than speculation.\n\n\n\nIn summary: We're targeting the vast majority of humanity that blockchain has failed to reach—people who care about stories, not staking yields—and we're showing them why Cardano matters to the things they already love. That's how you build a billion-user blockchain: one grandmother's story at a time.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"ACTIVITY 1: MONTHLY READING SALONS (9 sessions)\n\n\n\nWhat: Moderated online discussions featuring authors, historians, cultural guests, or themed readings from our community. Each 90-minute session is recorded and published with transcripts.\n\n\n\nRationale: Reading salons are the consistent heartbeat of the project, they keep our community engaged monthly and create regular touchpoints for recruitment into deeper activities (cohorts, minting clinics). Unlike one-off events, monthly rhythm builds habit and trust. Salons also produce low-effort content (recordings) that extend reach beyond live attendees. Each salon ends with a 10-minute \"Cardano moment\"—a soft introduction to wallets or upcoming minting opportunities—normalizing blockchain conversation in a cultural context rather than a technical one.\n\n\n\nCardano connection: Salons create the awareness funnel. Attendees who enjoy the cultural content become candidates for wallet creation. The recurring format means we get multiple chances to convert interested participants rather than relying on a single event.\n\n\n\nDeliverable: 9 recorded sessions, transcripts, 1,500+ total attendee hours across the project.\n\n\n\n\n\nACTIVITY 2: CULTURAL PRESERVATION WRITING COHORTS (3 cohorts, ~15 participants each)\n\n\n\nWhat: Three quarterly cohorts where participants learn oral-history interviewing techniques, conduct and transcribe elder interviews, and receive editorial mentorship to turn raw recordings into polished written pieces. Each cohort culminates in a published micro-journal issue.\n\n\n\nRationale: This is the project's core value creation. Cohorts give participants structured learning, accountability, and community while producing tangible cultural preservation outputs. The 6-8 week cohort model creates intimacy—participants bond over shared purpose, making them more likely to support each other through \"scary\" first blockchain experiences.\n\n\n\nBy focusing on elders specifically, we're capturing knowledge at risk of disappearing. Each interview preserved is irreplaceable cultural data. By publishing it (print + digital + blockchain), we maximize accessibility while demonstrating Cardano's permanence.\n\n\n\nCardano connection: Cohort completion = eligibility to mint the micro-journal NFT as a contributor. This creates earned achievement—people mint with pride because they helped create the content. It's far more meaningful than minting a random NFT for a tutorial.\n\n\n\nDeliverable: 3 micro-journals (30 contributors total, 30 elder interviews documented).\n\n\n\n\n\nACTIVITY 3: LIBRARY PARTNERSHIPS & \"PAPER THOUGHTS CORNERS\"\n\n\n\nWhat: Formal partnerships with 3 local libraries/community centers. Each partner hosts physical \"Paper Thoughts Corners\" with printed micro-journals, oral-history guides, and Cardano beginner materials. Libraries host in-person reading circles and offer \"blockchain help desk\" hours where staff assist with wallet setup and minting.\n\n\n\nRationale: Libraries are trusted, neutral community institutions—perfect for legitimizing blockchain activities for people who distrust tech companies. By anchoring our project in physical spaces, we reach people who don't engage with online-only content (especially elders). Libraries also provide free, accessible venues for in-person support, which is critical for onboarding non-technical users.\n\n\n\nPhysical presence creates permanence beyond the 9-month grant. Even after funding ends, materials remain in libraries, and trained staff can continue basic support.\n\n\n\nCardano connection: Library-hosted minting clinics remove the \"I'm doing something risky online alone\" fear. Having a librarian say, \"Yes, this is legitimate, let me help you\" is powerful social proof. Libraries can also host ongoing staking information sessions after the grant ends.\n\n\n\nDeliverable: 3 partner libraries with physical corners, 6 in-person events, 300 printed guides distributed.\n\n\n\n\n\nACTIVITY 4: ORAL-HISTORY DIGITAL ARCHIVE\n\n\n\nWhat: Professional recording, transcription, and metadata tagging of 30 select elder interviews. Published as a searchable, open-access digital archive with proper consent, attribution, and accessibility features (audio + text).\n\n\n\nRationale: The archive is our most enduring public good—it's useful to researchers, educators, families, and future generations regardless of blockchain adoption. By creating something with clear immediate value, we earn trust to introduce Cardano concepts later.\n\n\n\nMetadata and searchability make the archive actually usable (many oral history projects fail because they're just unlabeled audio files). Professional quality signals respect for elders' contributions.\n\n\n\nCardano connection: Archive metadata references where each story's commemorative NFT lives on Cardano, creating a bridge between traditional web archive and blockchain verification. People searching the archive learn, \"Oh, this story is also permanently recorded on Cardano\"—educational exposure without forcing participation.\n\n\n\nDeliverable: 30 interviews (15+ hours of audio), transcripts, public archive website.\n\n\n\n\n\nACTIVITY 5: COMIC CONTEST & ANIMATION\n\n\n\nWhat: Open call for comics/illustrations based on collected oral histories. Expected 30 submissions, 4 finalists selected by community vote, 2 winners professionally animated into 2-5 minute shorts. Final screening event with community and libraries.\n\n\n\nRationale: Comics and animation attract a younger, more diverse creative demographic than traditional writing. The contest generates excitement, social sharing, and cross-promotion. By requiring submissions to be based on collected stories, we ensure fidelity to source material while allowing creative interpretation.\n\n\n\nAnimation is highly shareable—a 3-minute animated folk tale travels much further on social media than a written micro-journal. It becomes a marketing asset for Cardano's cultural impact that lasts beyond the project.\n\n\n\nCardano connection: Contest finalists and winners receive commemorative NFT badges minted on Cardano—their first blockchain credential. Winners' animations are also minted, creating on-chain provenance for the art. Animators can showcase \"I created NFT artwork on Cardano\" in portfolios, seeding awareness in creative industries.\n\n\n\nDeliverable: 30 submissions, 4 finalists, 2 animated shorts, community screening, all minted as NFTs.\n\n\n\n\n\nACTIVITY 6: GUIDED MINTING CLINICS & WALLET WORKSHOPS\n\n\n\nWhat: Step-by-step technical support sessions timed after major milestones (cohort completions, salon highlights, contest results). Clinics walk participants through downloading a wallet, securing seed phrases, receiving test ADA, and minting their first NFT (micro-journal or participation badge). Follow-up workshops introduce staking basics.\n\n\n\nRationale: This is where cultural interest converts to actual adoption. Without hands-on support, most non-technical people abandon wallet setup at the first confusing step. Clinics provide live troubleshooting, reassurance, and community accountability (\"everyone's doing it together, I'm not alone\").\n\n\n\nTiming clinics after milestones means people have earned something they care about (contributor credit, contest entry) before attempting technical steps—motivation is high.\n\n\n\nCardano connection: This activity IS the Cardano adoption. 200 wallets created, 300 NFTs minted, 100 staking wallets—these are our core metrics. Every person who successfully mints becomes living proof that \"regular people can do this.\"\n\n\n\nDeliverable: 6 guided clinics (3 post-cohort, 2 post-salons, 1 final), wallet setup guides, video tutorials.\n\n\n\n\n\nACTIVITY 7: PUBLIC DOCUMENTATION & FINAL IMPACT REPORT\n\n\n\nWhat: Transparent, ongoing documentation of all activities, metrics, challenges, and learnings. Final comprehensive impact report published openly with replication toolkit for other communities.\n\n\n\nRationale: Accountability builds trust with funders and community. Real-time documentation also creates content for social media and progress updates, maintaining engagement throughout 9 months.\n\n\n\nThe replication toolkit is critical—our success only scales if others can copy it. By open-sourcing all materials, guides, and workflows (CC-licensed), we maximize the project's long-term impact beyond our community.\n\n\n\nCardano connection: The report becomes a case study Cardano Foundation can point to: \"Here's proof that cultural onboarding works, here's the playbook.\" Other Catalyst proposers can adapt our model for their regions/cultures.\n\n\n\nDeliverable: Monthly progress updates, final 50-page impact report, replication toolkit with all templates and guides.\n\n\n\n\n\nRATIONALE SUMMARY:\n\n\n\nEvery activity balances cultural value (immediate, tangible benefit to participants) with blockchain adoption (gentle, supported onboarding). We never lead with Cardano—we lead with stories, then show how Cardano enhances preservation. This sequencing is critical for reaching non-technical audiences who would flee from a \"blockchain project\" but embrace a \"cultural preservation project that happens to use blockchain.\"","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"We measure success across three dimensions: Cultural Impact (did we preserve heritage?), Community Engagement (did we build something sustainable?), and Cardano Adoption (did we onboard new users?). Each metric is SMART (Specific, Measurable, Achievable, Relevant, Time-bound) and tied to project activities.\n\n\n\n\n\nDIMENSION 1: CULTURAL PRESERVATION OUTPUTS\n\n\n\nMetric 1.1: 30 oral-history interviews recorded, transcribed, and published\n\n\n\nTarget: 30 completed interviews (10 per cohort)  \n\nMeasurement: Count of published interviews in digital archive  \n\nRationale: This is our core cultural deliverable—the irreplaceable knowledge we're preserving. 30 is ambitious but achievable with 3 cohorts of ~15 participants (not all will complete interviews, but cohort structure provides accountability). Each interview represents 1-2 hours of elder storytelling captured forever.\n\n\n\nSuccess criteria:\n\n- Excellent: 30+ interviews, diverse topics (folklore, recipes, historical events, proverbs)\n\n- Good: 25-29 interviews with high audio quality\n\n- Acceptable: 20-24 interviews (indicates recruitment challenges)\n\n\n\n\n\nMetric 1.2: 3 published micro-journal issues (print + PDF + minted as NFTs)\n\n\n\nTarget: 3 journals, 24-32 pages each, featuring curated interview excerpts, essays, and community reflections  \n\nMeasurement: Published journals (300 printed copies, PDF downloads, NFT mint count)  \n\nRationale: Micro-journals transform raw interviews into accessible, beautifully designed cultural artifacts. They're shareable, collectible, and serve as tangible proof of project output. Minting them as limited NFTs creates scarcity and collectibility while introducing participants to blockchain.\n\n\n\nSuccess criteria:\n\n- 3 journals published on schedule (months 3, 5, 8)\n\n- Each includes 8-12 documented stories\n\n- Distributed to libraries and community hubs\n\n\n\n\n\nMetric 1.3: 2 animated oral-history shorts produced and screened\n\n\n\nTarget: Two 2-5 minute professionally animated shorts based on contest-winning comics  \n\nMeasurement: Video files published, screening attendance, online views  \n\nRationale: Animation creates the most shareable, emotionally engaging output. A 3-minute animated folk tale can reach thousands on social media, attracting people who wouldn't read a journal. This extends project impact far beyond immediate participants.\n\n\n\nSuccess criteria:\n\n- 2 high-quality animations completed\n\n- Screened at community event (50+ attendees)\n\n- 2,000+ combined views online within 3 months\n\n\n\n\n\nDIMENSION 2: COMMUNITY ENGAGEMENT & SUSTAINABILITY\n\n\n\nMetric 2.1: 4,000 cumulative attendee-hours across all activities\n\n\n\nTarget: 4,000 total participant-hours (salons, cohorts, events, clinics)  \n\nMeasurement: Attendance tracking (sign-ins, video analytics for recordings, event attendance)  \n\nRationale: This measures total community engagement—not just unique individuals but sustained involvement. We calculate:\n\n- 9 salons × 60 avg live attendees × 1.5 hours = 810 hours\n\n- 9 salon recordings × 150 views × 1 hour = 1,350 hours\n\n- 3 cohorts × 15 people × 40 hours each = 1,800 hours\n\n- Events, clinics, screenings = ~240 hours\n\nTotal: ~4,200 hours (target 4,000 to be conservative)\n\n\n\nSuccess criteria:\n\n- Exceeds 4,000 hours (strong engagement)\n\n- 3,000-4,000 hours (acceptable)\n\n- Below 3,000 hours (indicates need to improve marketing/accessibility)\n\n\n\n\n\nMetric 2.2: 120 repeat participants from 576-member community\n\n\n\nTarget: 120 community members attend 2+ activities  \n\nMeasurement: Participant tracking across activities (with privacy protection—using anonymized IDs)  \n\nRationale: Repeat participation indicates we're building genuine community, not just one-off attendance. 120 represents ~21% of our existing 576 members deeply engaging—a healthy conversion for sustained involvement.\n\n\n\nSuccess criteria:\n\n-  120+ repeat participants (building core community)\n\n-  At least 30 participants complete full cohort + attend salons + mint NFTs (super-engaged members)\n\n\n\n\n\nMetric 2.3: 3 library partnerships with trained staff\n\n\n\nTarget: 3 libraries with active \"Paper Thoughts Corners\" and at least 1 trained staff member each  \n\nMeasurement: MOUs signed, training completion certificates, active corners photographed  \n\nRationale: Library partnerships ensure project longevity beyond the grant. Trained staff can continue facilitating reading circles and basic blockchain support after funding ends. Physical presence in trusted institutions legitimizes the project.\n\n\n\nSuccess criteria:\n\n-  3 libraries with signed MOUs and active corners\n\n-  3 trained staff members (completed 4-hour training)\n\n-  Each library hosts at least 2 events during project period\n\n\n\n\n\nDIMENSION 3: CARDANO ADOPTION\n\n\n\nMetric 3.1: 200 new Cardano wallets created via project CTAs\n\n\n\nTarget: 200 first-time Cardano wallets created by project participants  \n\nMeasurement: Tracked through dedicated project landing pages with opt-in forms (privacy-respecting)  \n\nRationale: Wallet creation is the critical first step. 200 represents ~35% of our 576-member community taking action—an ambitious but realistic conversion rate given hands-on support. We'll instrument this through:\n\n- Dedicated wallet setup landing pages with unique UTM codes\n\n- Opt-in form asking \"Did you create your first Cardano wallet through Paper Thoughts?\" (voluntary)\n\n- In-person clinic tracking (staff-assisted setups counted)\n\n\n\nSuccess criteria:\n\n-  200+ wallets (exceeds target)\n\n-  150-199 wallets (strong performance)\n\n-  100-149 wallets (indicates support gaps, but still valuable)\n\n\n\nPrivacy note: All tracking is voluntary opt-in; we never require wallet addresses or personal data.\n\n\n\n\n\nMetric 3.2: 300 NFTs minted total (micro-journals + badges + comics)\n\n\n\nTarget: 300 total mints across all NFT offerings  \n\nMeasurement: On-chain data (public mint counts)  \n\nBreakdown:\n\n- Micro-journal NFTs (3 editions × 50 mints each) = 150\n\n- Participation badges (cohort completions, contest entries) = 100\n\n- Comic finalist/winner NFTs = 50\n\n\n\nRationale: Minting is participants' first active on-chain transaction—the moment blockchain becomes real. 300 mints from 200 wallets (1.5 mints per wallet average) is realistic given some participants will mint multiple items.\n\n\n\nSuccess criteria:\n\n-  300+ mints (people are collecting multiple items—strong engagement)\n\n-  200-299 mints (solid first-time experience)\n\n-  150-199 mints (technical barriers likely present)\n\n\n\n\n\nMetric 3.3: 100 wallets stake ADA within 2 months of creation\n\n\n\nTarget: 100 of the 200 new wallets successfully delegate to a stake pool  \n\nMeasurement: Self-reported via follow-up survey + encouraged screenshots (voluntary)  \n\nRationale: Staking demonstrates commitment beyond curiosity—participants understand Cardano's governance/rewards model and are taking a second on-chain action. 50% conversion (from wallet creation to staking) is ambitious, reflecting our follow-up support workshops.\n\n\n\nSuccess criteria:\n\n-  100+ staking wallets (exceptional follow-through)\n\n-  75-99 staking wallets (strong outcome)\n\n-  50-74 staking wallets (people minted but didn't continue—need better staking education)\n\n\n\nTracking method: Post-wallet-creation email sequence (with opt-in) asking \"Have you staked yet?\" with link to staking guide. Incentivize reporting with entry into final raffle (small book prizes).","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"THE PROBLEM (Restated for clarity):  \n\n\n\nTwo parallel crises exist:   (A)   Communities worldwide are losing irreplaceable cultural knowledge as elders pass away and oral traditions fade, with few accessible tools for respectful preservation.   (B)   Cardano needs to reach everyday, non-technical people but lacks culturally meaningful entry points—current onboarding is abstract, technical, and unappealing to people whose interests lie in heritage, storytelling, and community rather than finance or development.\n\n\n\n  OUR SOLUTION:  \n\n\n\nPaper Thoughts — Read, Write, Chain creates a 9-month cultural program that solves both problems simultaneously by making cultural preservation the  reason  people encounter Cardano, not an afterthought. We design activities that have intrinsic value (preserving elders' stories) and gently introduce blockchain as a tool that enhances that preservation—permanence, accessibility, verification—without requiring technical expertise.\n\n\n\n  HOW THE SOLUTION WORKS: THE JOURNEY  \n\n\n\n  PHASE 1: AWARENESS & TRUST-BUILDING (Months 1-2)  \n\n\n\nWe begin with  familiar, low-risk activities  that establish credibility and community trust:\n\n\n\n  Monthly Reading Salons (ongoing):   We host moderated online discussions about storytelling, memory, and heritage—topics our 576-member book club already loves. Early salons feature guest authors or historians discussing oral tradition preservation. No blockchain mentioned yet. We're simply doing what book clubs do: reading, discussing, connecting.\n\n\n\n  Library partnerships launch:   We approach 3 local libraries with a compelling pitch: \"We want to help your community preserve local stories and activate your space with reading circles.\" Libraries love community programming, and we offer free labor and materials. We establish \"Paper Thoughts Corners\" with printed reading guides and oral-history how-tos. This creates physical presence and institutional credibility.\n\n\n\n  First cohort recruitment:   Toward the end of month 2, salon attendees and community members receive an invitation: \"Want to go deeper? Join our Cultural Preservation Writing Cohort—learn to interview elders and document their stories for publication.\" We emphasize: no experience needed, full support provided, your work will be published.\n\n\n\n Problem addressed:  People distrust \"blockchain projects\" but trust cultural/educational initiatives backed by libraries. We build legitimacy first, create value first, earn the right to introduce Cardano later.\n\n\n\n  PHASE 2: SKILL-BUILDING & PRODUCTION (Months 3-5)  \n\n\n\n  Cultural Preservation Writing Cohorts (3 over 9 months):   This is the heart of our solution. Each 6-week cohort trains 12-15 participants in:\n\n- Oral-history interviewing ethics and techniques\n\n- Recording and transcribing audio\n\n- Writing/editing for publication\n\n- Copyright, consent, and cultural sensitivity\n\n\n\nParticipants identify elders in their lives or communities (grandparents, longtime neighbors, community leaders) and conduct recorded interviews. Weekly Zoom workshops provide peer feedback and editorial guidance. A professional editor mentors participants to polish their transcripts into readable narratives.\n\n\n\n  Why this works:   Cohorts create accountability, community, and genuine skill development. Participants aren't just attending a one-off event—they're completing a structured learning experience and producing something they're proud of. The cultural preservation work is  real  and  valuable , independent of any blockchain component.\n\n\n\n  Micro-journal production:   At the end of each cohort (months 3, 5, 8), we publish a beautifully designed micro-journal featuring the best documented stories. Each contributor receives print copies and a PDF. Journals are distributed to partner libraries and made freely downloadable online.\n\n\n\n Problem addressed:  Communities lose oral knowledge because there's no clear pathway from \"I should record Grandma's stories\" to \"I've published Grandma's stories in a real publication.\" We provide that pathway with training, support, and a professional output. Elders feel honored; families feel proud; communities have new cultural resources.\n\n\n\n---\n\n\n\n  PHASE 3: GENTLE BLOCKCHAIN INTRODUCTION (Months 3-9, overlapping)  \n\n\n\nHere's where Cardano enters—but critically, it enters as an  enhancement , not a requirement.\n\n\n\n  Post-cohort completion celebration:   When a cohort publishes its micro-journal, we host a celebration event (online + library screenings). We present contributors with their publication and then say:\n\n\n\n \"You've created something permanent and valuable. We're going to do one more thing to make it even more lasting: we're going to mint a limited commemorative edition on Cardano, a blockchain that can preserve this forever. Think of it like a digital certificate that says, 'I contributed to this cultural preservation work,' and it can never be faked or lost. Would you like to learn how to claim yours?\" \n\n\n\n  Guided minting clinics:   Immediately following each cohort, we run a hands-on minting clinic. Participants join a Zoom call (or meet in person at a library) where staff walk them step-by-step through:\n\n1. Downloading a Cardano wallet (we recommend Lace or Eternl—user-friendly options)\n\n2. Securing their seed phrase (we emphasize safety, provide printable templates)\n\n3. Receiving a small amount of test ADA (we send ~3 ADA to cover minting fees)\n\n4. Navigating to our custom minting page\n\n5. Clicking \"mint\" and watching their NFT appear in their wallet\n\n\n\n  Critical design decision:   We make this  optional . Some elders or technophobic participants may say, \"I just want the printed journal, thank you.\" That's fine—they've still contributed to cultural preservation. But for curious participants, we provide real-time troubleshooting, encouragement, and community support. \"Everyone's doing it together; we've got your back.\"\n\n\n\n  Why this works:   The blockchain action has  meaning —it's not minting a random Bored Ape; it's claiming credit for cultural work they personally did. The timing is perfect—motivation is high right after seeing their name in print. And crucially, they're not alone—live support removes fear.\n\n\n\n Problem addressed:  Cardano onboarding fails when it's abstract (\"set up a wallet to try staking\") or risky-feeling (\"buy crypto\"). We make it concrete (\"mint a token representing your real cultural contribution\") and safe (guided, live support in a trusted context).\n\n\n\n  PHASE 4: DEEPENING ENGAGEMENT (Months 6-9)  \n\n\n\n  Staking workshops:   For participants who successfully minted, we run follow-up workshops introducing staking. We frame it as:  \"That small amount of ADA we sent you? You can actually put it to work supporting the Cardano network and earn rewards. Let us show you how.\" \n\n\n\nWe demonstrate stake pool selection (emphasizing mission-driven pools), walk through delegation, and explain rewards. Target: 50% of wallet-creators also stake.\n\n\n\n  Comic contest:   Midway through the project, we announce an open call for comics/illustrations based on collected oral histories. Artists (from our community or beyond) submit visual interpretations of elders' stories. This serves multiple purposes:\n\n- Engages a younger, visual-arts demographic\n\n- Creates additional shareable content\n\n- Generates excitement and cross-promotion\n\n\n\nContest finalists receive NFT badges; winners get their comics professionally animated and minted. This introduces a new cohort (artists) to Cardano through creative work rather than technical onboarding.\n\n\n\n  Library help-desk hours:   Throughout months 6-9, partner libraries host weekly \"blockchain help hours\" where trained staff or volunteers answer questions, assist with wallet recovery, or help people mint additional items. This creates sustained support infrastructure.\n\n\n\n Problem addressed:  One-time onboarding isn't enough—people need ongoing support to become confident blockchain users. By embedding support in libraries (trusted, free, accessible), we reduce abandonment and build genuine capability.\n\n\n\n  PHASE 5: CELEBRATION & SUSTAINABILITY (Month 9)  \n\n\n\n  Community screening event:   We host a culminating event showcasing:\n\n- All three micro-journals (physical display)\n\n- The oral-history digital archive (live demo)\n\n- Animated comic winners (premiere screening)\n\n- \"Blockchain 101\" info table for newcomers\n\n\n\nThis event celebrates cultural outputs first, Cardano second—but attendees learn, \"Oh, all of this is preserved on Cardano forever.\"\n\n\n\n  Final impact report & replication toolkit:   We publish a comprehensive open-source guide: \"How to run a cultural preservation + Cardano onboarding program in your community.\" Every template, script, lesson plan, and tech walkthrough is CC-licensed for replication.\n\n\n\n  Library partnerships continue:   Trained library staff can continue hosting reading circles and basic blockchain support after our grant ends—sustainability built in.\n\n\n\n Problem addressed:  Grant-funded projects often die after funding. By open-sourcing everything and building institutional partnerships, we create lasting infrastructure.\n\n\n\n\n\n  HOW THIS SOLUTION ADDRESSES BOTH PROBLEMS:  \n\n\n\n  Problem A (Cultural preservation):  \n\n- ✅ 30 elder interviews recorded = irreplaceable knowledge saved\n\n- ✅ 3 published micro-journals = accessible cultural resources\n\n- ✅ Digital archive = searchable, permanent, free\n\n- ✅ Training provided = community capacity-building\n\n- ✅ Respectful process = elders honored, consent-centered\n\n\n\n  Problem B (Cardano adoption):  \n\n- ✅ 200 new wallets = non-technical people successfully onboarded\n\n- ✅ 300 NFTs minted = meaningful first on-chain transactions\n\n- ✅ 100 staking wallets = deeper ecosystem participation\n\n- ✅ Library legitimacy = institutional validation of Cardano\n\n- ✅ Replicable model = scalable blueprint for other communities","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Our project creates impact across multiple layers of the Cardano ecosystem, from individual users to global narrative positioning. Here's how Paper Thoughts influences the wider community:\n\n\n\nIMPACT LAYER 1: USER BASE EXPANSION (New demographics)\n\n\n\nBringing in underserved audiences:\n\n\n\nCardano's current user base skews toward tech-savvy, financially motivated individuals. Our project specifically targets three demographics Cardano struggles to reach:\n\n\n\n(A) Cultural stewards and heritage enthusiasts: People aged 35-65 who care deeply about preserving community memory but have zero crypto experience. These are educators, librarians, retired teachers, community historians—literate, civic-minded people who would enthusiastically embrace Cardano if they understood its cultural utility. We bring 200 of these people on-chain.\n\n\n\n(B) Elders (60+): Often excluded from blockchain conversations entirely. By honoring their knowledge and showing how Cardano preserves their stories, we create intergenerational awareness. When a 75-year-old grandmother proudly tells her grandchildren, \"My recipes are on the blockchain forever,\" that's powerful cultural marketing.\n\n\n\n(C) Young creatives: Through our comic contest, we engage artists, illustrators, and animators who see Cardano as a platform for cultural expression, not just financial transactions. This seeds awareness in creative industries that could drive future NFT/cultural projects.\n\n\n\n Why this matters to wider Cardano community: A blockchain is only as strong as its user diversity. Monocultural communities (all DeFi traders, all developers) are fragile. By bringing in culture-focused users, we:\n\n- Increase governance participation diversity (different values, priorities)\n\n- Reduce price-speculation volatility (mission-driven users hold longer)\n\n- Create network effects (cultural users invite other cultural users)\n\n\n\nTarget: 200 new wallets is small in absolute terms but represents a proof of concept that this demographic can be reached at scale.\n\n\n\n\n\nIMPACT LAYER 2: NARRATIVE & POSITIONING (What Cardano is \"for\")\n\n\n\nAnswering the \"So what?\" question:\n\n\n\nMainstream skepticism of blockchain centers on: \"But what's it actually FOR beyond speculation?\" Cultural preservation is an unimpeachable answer. When journalists, policymakers, or everyday people ask, \"Why does Cardano matter?\", our project provides a story:\n\n\n\n \"In Nigeria, a community book club used Cardano to permanently preserve 30 elders' oral histories before they were lost forever. Families can now access their ancestors' stories, researchers can study local folklore, and artists are transforming these stories into animated films—all verifiable and permanent on-chain.\" \n\n\n\n  This narrative shifts Cardano's positioning from:  \n\n- ❌ \"A cryptocurrency\" → ✅ \"A cultural preservation infrastructure\"\n\n- ❌ \"A DeFi platform\" → ✅ \"A public good permanence layer\"\n\n- ❌ \"For traders/developers\" → ✅ \"For communities and families\"\n\n\n\n  Why this matters:   Cardano competes with Ethereum, Solana, and others on technical specs. But on  purpose and values , Cardano can differentiate. Cultural projects like ours become proof points that Cardano is the blockchain for long-term, meaningful applications—not just fast transactions or DeFi yields.\n\n\n\n  Expected reach:   Each animated comic we produce (2 total) could reach 5,000-10,000 views online. Every time someone shares it with \"This was preserved on Cardano,\" that's brand awareness in non-crypto spaces (education, cultural, arts communities).\n\n\n\n  IMPACT LAYER 3: ECOSYSTEM TOOLING & BEST PRACTICES (Replicability)  \n\n\n\n  Creating an open-source blueprint:  \n\n\n\nWe're not just running one project—we're building a model  that others can copy. Our final deliverable includes a comprehensive replication toolkit:\n\n- All workshop templates (oral-history training, wallet setup guides)\n\n- Minting clinic scripts and troubleshooting FAQs\n\n- Library partnership MOUs and pitch decks\n\n- Marketing materials and social media templates\n\n- Lessons learned and failure analysis\n\n\n\nAll materials are CC-licensed (Creative Commons Attribution-ShareAlike), meaning anyone globally can adapt them.\n\n\n\n  Why this matters:   If our model works, it can scale exponentially:\n\n-   100 similar projects   worldwide (different regions, cultures, languages) could onboard   20,000 new users   using our playbook\n\n- Each project generates culturally specific content (Japanese folklore, Kenyan oral histories, Appalachian storytelling) that attracts diverse audiences\n\n- Cardano becomes known as  the  blockchain for cultural preservation—a unique, defensible market position\n\n\n\n  We're not just bringing 200 users—we're creating a bridge that could eventually bring 200,000.  \n\n\n\n  Expected impact:   Realistically, 5-10 communities will attempt to replicate within the first year post-project. If even 3 succeed, that's 600 additional wallets from our work.\n\n\n\n  IMPACT LAYER 4: INSTITUTIONAL PARTNERSHIPS (Legitimacy)  \n\n\n\n  Mainstreaming Cardano through libraries:  \n\n\n\nOur 3 library partnerships are small but symbolically significant. Libraries are trusted civic institutions—when they endorse something, mainstream communities listen. By hosting \"Cardano minting clinics\" and \"blockchain help hours\" in libraries, we:\n\n- Legitimize Cardano as a public good (not a speculative scheme)\n\n- Create precedent for other institutions (schools, museums, community centers)\n\n- Demonstrate regulatory-friendly use cases (cultural, educational, non-financial)\n\n\n\n  Why this matters:   Cardano's long-term success depends on institutional adoption—governments, universities, NGOs. But institutions are risk-averse and need proof that blockchain has non-financial applications. Our library partnerships are small-scale pilots that prove the concept.\n\n\n\n  Future potential:   If successful, we can pitch to:\n\n- National library systems (scale to 100+ branches)\n\n- University archives (student projects documenting campus oral histories)\n\n- Museums (provenance tracking for cultural artifacts)\n\n- UNESCO (cultural heritage preservation grants)\n\n\n\n  One successful library partnership today = blueprint for 1,000 partnerships tomorrow.  \n\n\n\n  IMPACT LAYER 5: COMMUNITY CULTURE & VALUES (Who Cardano is \"for\")  \n\n\n\n  Shaping ecosystem culture:  \n\n\n\nEvery new user brings values and norms. By intentionally onboarding culture-focused, mission-driven people, we influence Cardano's community culture in positive ways:\n\n\n\n  (A) Governance participation:   Cultural stewards care about long-term ecosystem health (preserving public goods, funding education). They're likely to participate in Catalyst voting and Project Catalyst proposals—deepening decentralized governance.\n\n\n\n  (B) Reduced toxicity:   People who join through cultural preservation are less likely to engage in \"wen moon\" speculation or tribal maximalism. They elevate discourse toward utility and impact.\n\n\n\n  (C) Mission alignment:   Cardano positions itself as the \"sustainable, research-driven, long-term\" blockchain. Cultural preservationists align perfectly with this ethos—they're patient, methodical, and focused on legacy.\n\n\n\n  Why this matters:   Blockchain communities often become echo chambers dominated by a narrow set of voices (traders, developers). Diversifying who participates improves decision-making, reduces groupthink, and makes Cardano more resilient.\n\n\n\n  Target: 120 repeat participants become active community members   who might later propose their own Catalyst projects, support others' proposals, or evangelize Cardano in cultural spaces.\n\n\n\n  IMPACT LAYER 6: CONTENT & MEDIA (Shareable stories)  \n\n\n\n  Creating Cardano content that non-crypto people want to engage with:  \n\n\n\nMost Cardano content is technical (developer tutorials, DeFi explainers) or financial (price analysis, staking guides). This content doesn't travel outside crypto circles. Our project produces:\n\n-   2 animated shorts (2-5 min each):   Beautiful, emotionally resonant films about oral traditions—shareable on Instagram, Twitter, TikTok, YouTube. People who would never watch \"Cardano Explained\" will watch a 3-minute animated folktale.\n\n-   3 micro-journals:   Designed, printed artifacts that feel like indie literary magazines—appealing to readers, writers, and cultural enthusiasts.\n\n-   Oral-history archive:   A searchable digital resource useful to researchers, educators, families—driving organic traffic to a Cardano-adjacent project.\n\n\n\n  Why this matters:   Cardano needs content that attracts  inbound interest  from non-crypto audiences. Every animated comic that goes semi-viral (even just 10,000 views) is 10,000 people learning \"Cardano preserves culture\"—free brand awareness in spaces Cardano marketing rarely reaches.\n\n\n\n  Expected reach:   Conservatively, our outputs could generate 50,000 impressions across social media and educational channels over 12 months post-project.\n\n\n\n  IMPACT LAYER 7: ECOSYSTEM FUNDING STRATEGY (Proof of concept for Catalyst)  \n\n\n\n  Demonstrating that non-technical projects can onboard users effectively:  \n\n\n\nProject Catalyst overwhelmingly funds technical development, infrastructure, and DeFi tools—necessary, but insufficient for mass adoption. Our project proves that  cultural projects can deliver meaningful Cardano adoption metrics (wallets, minting, staking) while producing intrinsic value.\n\n\n\n  Why this matters for Catalyst reviewers:  \n\n- Sets precedent for funding more cultural/social projects\n\n- Shows that \"soft\" activities (book clubs, storytelling) can achieve \"hard\" metrics (wallet creation, on-chain transactions)\n\n- Encourages other proposers to think creatively about non-technical onboarding\n\n\n\n  If our project succeeds, future Catalyst rounds might see proposals for:  \n\n- Music preservation projects (blues archives, indigenous songs)\n\n- Culinary heritage documentation (family recipes minted as NFTs)\n\n- Language revitalization (endangered languages preserved on-chain)\n\n- Oral history projects in refugee camps, diaspora communities, rural areas\n\n\n\n  We're not just proposing one project—we're opening a new category of Catalyst funding: \"Cultural Onboarding.\"","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Core strengths\n\n\n\nCommunity-building track record. Paper Thoughts has run 3 in-house writing contests, 2 book fairs, a Book & Arts Festival with the Faculty of Art (ABU), and regular creatives’ hangouts with Creative Connect. That experience proves we can design events, recruit participants, and follow through on public deliverables.\n\n\n\nInstitutional credibility. Dr. Abdulhamid Liman Gambo (ABU University Librarian) is our Grand Patron and the Faculty of Art is hosting our festival — both lend institutional legitimacy that reduces perceived risk and increases uptake among non-crypto communities.\n\n\n\nCultural & creative leadership. Team members include recognised poets, a creative director, and community managers who speak directly to the target audiences (elders, cultural stewards, creatives).\n\n\n\nPractical operations capability. You (project lead) have event coordination and community management experience; we have local partners (Creative Connect) and volunteers who can run workshops, minting clinics, and community outreach.\n\n\n\nAccountability systems we will use\n\n\n\nTransparent budgeting & reporting: monthly budget updates and a final audited spend report, shared publicly and with Catalyst reviewers. All expenditures logged and summarized in milestone reports.\n\n\n\nOn-chain proofs: where possible, minting, publication or grant disbursements will include on-chain receipts so results (e.g., wallets minted, artworks recorded) are verifiable.\n\n\n\nInstitutional MOUs: signed MOUs with host libraries and the Faculty of Art define responsibilities, venues, and deliverables — these formalize expectations and provide third-party validation.\n\n\n\nOpen-source deliverables: replication toolkit, templates, and lessons learned will be CC-BY-SA and published openly so reviewers can verify outputs.\n\n\n\nMilestone-based governance: clear milestones with acceptance criteria, monthly progress notes, and a final project sign-off from the Grand Patron and Advisor.\n\n\n\nCommunity feedback loops: post-event surveys, participant lists, and public archive access ensure community validation of impact.\n\n\n\nRisk & mitigation plan: contingency funds, backup venues, and simple escalation procedures for logistics or partner issues.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Setup & Institutional Partnership Formalisation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Establish a robust institutional and governance foundation that enables low-risk, accountable delivery. This milestone secures formal endorsements, clarifies team responsibilities, and creates transparent financial and communications channels so partners, participants, and reviewers can verify commitments. With MOUs, signed role agreements, a public project page and basic accounting in place, Paper Thoughts will be positioned as a credible, auditable project able to engage non-crypto communities confidently and manage risk from day one.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Signed MOUs with Faculty of Art (ABU) and 3 library partners (or written commitments).\n\n\n\nProject team contracts / role confirmations for core leads (Project Lead, Cultural Lead, Creative Director, Community Lead).\n\n\n\nPublic project page skeleton + basic project accounting spreadsheet created.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"PDFs of MOUs and partnership emails; scanned signatures.\n\n\n\nTeam roster with role descriptions and signed engagement letters.\n\n\n\nLink or screenshot of the public project page and uploaded accounting spreadsheet.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":5000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Training, Oral-history Collection & Content Production (Phase I)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Build local capacity and produce the primary cultural assets through a structured training and production phase. This milestone trains facilitators in wallet onboarding, consent protocols and oral-history methodology, collects a substantial, well-indexed body of recorded memories, and develops approved creative briefs and storyboards so animation and publishing can proceed without delay. The result is a validated content pipeline — ethically sourced, high-quality audio and creative assets with metadata and consent that are ready for narrative development and on-chain publication.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"≥10 trained facilitators (wallet onboarding + oral-history collection protocols) with attendance logs.\n\n\n\n≥30 recorded oral-history sessions (audio files with metadata: date, location, contributor consent forms).\n\n\n\nApproved creative briefs, storyboards, and scripts for 2 animated shorts and layout proofs for 3 micro-journals.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Facilitator attendance sheet and training materials (PDFs).\n\n\n\nAudio files stored with an index (filename, contributor name/consent).\n\n\n\nSigned creative approval documents (storyboard PDFs) and a short creative director sign-off note.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":18000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Events, Wallet Onboarding & Public Launch","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Deliver a high-visibility public launch that converts community engagement into verifiable on-chain activity and cultural visibility. This milestone stages the Book & Arts festival and library minting clinics, premieres the first animated short, distributes printed material, and achieves first-wave onboarding targets. The emphasis is on inclusive, consent-driven wallet creation, demonstrable minting/recording activity, and a documented public launch that yields measurable social reach, community stories, and on-chain evidence for Catalyst reviewers.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Successful Book & Arts Festival executed (event report, program, attendee list).\n\n\n\nAt least 200 new wallets created tied to participants from target demographics (librarians, elders, creatives) — wallet addresses + opt-in consent recorded.\n\n\n\nPublic premiere of 1 animated short and distribution of 1 micro-journal at event.\n\n\n\nAt least 100 on-chain records/transactions connected to project activities (minting, deposits to archive).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Event report + photo gallery + attendance roster.\n\n\n\nCSV of participant wallet addresses (with consent), and corresponding on-chain transaction IDs (tx hashes) proving minting/interaction.\n\n\n\nPublished video (platform screenshot) and printed micro-journal sample scans.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Amplify, Toolkit Release & Final Reporting (Replication Ready)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Package and publish a complete replication toolkit and evidence package so other communities and institutions can reproduce the model with confidence. This milestone finalizes the second animation and the full oral-history archive, publishes a CC-BY-SA toolkit (templates, MOUs, minting scripts and workshop modules), and produces an audited impact report with on-chain proof. The deliverable demonstrates replicability, documents lessons learned, and generates outreach momentum that converts pilot success into documented interest from other institutions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Public release of replication toolkit (templates, workshop guides, MOUs, minting scripts) under CC-BY-SA on a public repo or website.\n\n\n\nRelease of 2nd animated short, full oral-history archive searchable via published index (IPFS hash or archive link).\n\n\n\nFinal audited financial report and milestone-by-milestone impact dashboard (wallets onboarded, impressions, partner commitments, replication enquiries).\n\n\n\nAt least 3 replication inquiries / expressions of interest from other institutions or communities (documented).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Repo link or downloadable package for the toolkit and license statement.\n\n\n\nIPFS hashes / tx IDs for published archive + video links.\n\n\n\nPDF of audited financials and final narrative report; screenshots of analytics and outreach responses.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":7000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Project Lead — Morgan Ufuoma Project coordinator\n\nOverall project management, Catalyst reporting, partner relations, supervision of day-to-day operations, and final deliverable sign-off.\n\n[https://www\\.linkedin\\.com/in/morgan\\-ufuoma/](https://www.linkedin.com/in/morgan-ufuoma/)\n\n[https://www\\.instagram\\.com/sixth\\_sage/](https://www.instagram.com/sixth_sage/)\n\n\n\nGabriel Oguche — Cultural Lead / Storyteller\n\nLead oral-history collection, curate poetic and narrative content, run creative workshops with elders and cultural stewards, and co-lead the comic contest.\n\n[https://www\\.instagram\\.com/jibothewordsmith/](https://www.instagram.com/jibothewordsmith/)\n\n[https://www\\.linkedin\\.com/in/gabriel\\-oguche\\-086626216/](https://www.linkedin.com/in/gabriel-oguche-086626216/)\n\n\n\nDr. Abdulhamid Liman Gambo (Grand Patron)\n\nInstitutional liaison with ABU and libraries; endorses project publicly; helps secure venues and institutional support; provides credibility for grant reviewers.\n\n\n\nDr. Alim Sabur (Advisor)\n\nStrategic advisor: research, evaluation design, quality assurance of documentation and academic partnerships.\n\n\n\nAisha Muhammad — Community Engagement Lead (d3rdspace community)\n\nRecruit participants, manage community outreach, run on-the-ground minting clinics and wallet onboarding.\n\n[https://www\\.instagram\\.com/d3rdspace/](https://www.instagram.com/d3rdspace/)\n\n\n\nAmina Ismail — Communications Lead\n\nPress, social media, design and distribution of micro-journals, and promotional strategy for animations and events.\n\n\n\n\n\nOmolola Lawson — Poet / Community Manager\n\nLocal engagement with creative communities, host readings, and manage the creatives hangouts.\n\n\n\nAyodeji Owolabi Prince — Events & Partnership Lead (Creative Connect)\n\nEvent logistics, co-hosting with Creative Connect, venue management, and festival programming support.\n\n[https://www\\.instagram\\.com/thecreativeskonnect/](https://www.instagram.com/thecreativeskonnect/)\n\n[https://www\\.instagram\\.com/dejii\\_prince/](https://www.instagram.com/dejii_prince/)\n\n\n\nBanjamin Gambo — Creative Director\n\nVisual direction for comics, animated shorts, micro-journals, and packaging of the oral-history archive. Oversees illustrators and animation vendors.\n\n\n\nAdditional roles (paid/volunteer): local facilitators for minting clinics, audio/recording technician, animator(s), illustrator(s), printing & distribution coordinator, admin/bookkeeper.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"All numbers in ADA. Total = 40,000 ADA\n\n\n\nPersonnel & stipends — 10,000 ADA\n\n(Project lead, community managers, facilitator stipends across events; honoraria for elders and story contributors where appropriate.)\n\n\n\nContent production — 12,000 ADA\n\n\n\n2 animated shorts (script, illustrator, animator, voice recording, editing)\n\n\n\nDesign and printing of 3 micro-journals\n\n\n\nCreative director fees and artwork licensing\n\n\n\nWorkshops & Events — 6,000 ADA\n\n\n\nLibrary minting clinics, book fairs, festival logistics, venue costs, refreshments, materials, on-site recording.\n\n\n\nTraining & Onboarding — 3,000 ADA\n\n\n\nWallet setup clinics, trainer fees, printed guides, hands-on sessions for elders & cultural stewards.\n\n\n\nMarketing & Outreach — 2,500 ADA\n\n\n\nPromotion, targeted social media boosts, community outreach materials, small paid ads to reach creative and cultural audiences.\n\n\n\nTechnical & Platform Costs — 2,500 ADA\n\n\n\nMinting fees, small developer support to set up minting procedures, IPFS or decentralized storage provisioning, basic website/archive hosting.\n\n\n\nInstitutional partnership support & travel — 1,500 ADA\n\n\n\nTravel stipends, partner coordination expenses, token support to host libraries (e.g., materials or printing costs).\n\n\n\nContingency & admin (≈ 3.75%) — 1,500 ADA\n\n\n\nAdministrative overheads, banking fees, minor legal, or unanticipated costs.\n\n\n\nCommunity grants & incentives — 500 ADA\n\n\n\nContest prizes, micro-grants to participants for follow-up projects or replication pilots.\n\n\n\nNotes / Justification\n\n\n\nProduction-heavy line (animation + design) receives priority because shareable creative outputs drive the widest non-crypto reach per ADA.\n\n\n\nPersonnel funds are lean and targeted to compensate key implementers and ensure continuity.\n\n\n\nTechnical costs are conservative; most minting will use low-fee mint techniques and batch minting to minimize ADA burn.\n\n\n\nContingency kept modest but present to absorb minor shocks.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Direct onboarding & measurable outcomes\n\n\n\nTarget onboarding: 200 new wallets from cultural audiences (elders, librarians, cultural stewards, creatives).\n\n\n\nCost per wallet ≈ 200 ADA (40,000 ADA / 200 wallets). This is a defensible acquisition cost for long-term, mission-driven users who are likely to hold, engage in governance, and seed future cultural projects.\n\n\n\nRepeat engagement target: 120 repeat participants who become active community members (workshop leaders, local advocates).\n\n\n\nHigh-leverage, low-risk investments\n\n\n\nInstitutional adoption lever: Library partnerships and ABU involvement reduce adoption friction among mainstream audiences and create templates for scaling to school systems, national library networks, and museums.\n\n\n\nContent that travels: Two animated shorts + micro-journals function as shareable cultural assets that explain Cardano’s value in human terms; these are high ROI for brand positioning (educational and cultural channels where crypto messaging rarely reaches).\n\n\n\nReplication potential: The CC-BY-SA toolkit allows easy replication; if replicated by 100 communities, the same model could bring 20,000+ wallets with relatively low marginal cost — multiplying the initial investment.\n\n\n\nSystem-level benefits for Cardano\n\n\n\nNarrative diversification: Moves Cardano’s public image from “trading/DeFi” to “cultural preservation and public goods,” making the ecosystem attractive to institutions and mainstream audiences. That reputational gain is hard to buy with ads but highly valuable for sustainable adoption and regulation-friendly positioning.\n\n\n\nCatalyst multiplier effect: Successful delivery sets precedence and evidence that cultural/non-technical proposals can produce on-chain adoption; this can unlock more diverse Catalyst funding in future rounds.\n\n\n\nGovernance quality uplift: Culture-focused users and institutional partners typically vote for long-term, public-good priorities — improving proposal quality and reducing short-term speculation-driven governance pressure.\n\n\n\nConcrete value metrics we will report\n\n\n\nWallets created and number of on-chain transactions tied to the project\n\n\n\nNumber of oral histories archived (target: 30+ elders recorded) and accessible via the public archive\n\n\n\nViews / impressions of animated shorts and social share metrics (target conservative reach: 5k–10k per animation)\n\n\n\nNumber of partner institutions engaged (target: 3 library partners + Faculty of Art)\n\n\n\nToolkit downloads & replication enquiries within 9 months","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Connected Community","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1659}