{"pr_id":"019ac3af-53d1-7e90-8e33-14bf2a3b284e","title":"Smart Contract Development in Lean4","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Despite ongoing work on Cardano-focused formal verification tools in Lean4, there is still no framework that enables writing and compiling smart contracts directly within Lean4.","solution":"Build a Lean4-native framework that provides macros, DSLs, and UPLC tooling for writing, optimizing, and verifying Cardano smart contracts directly within Lean4.","proposer_name":"Seungheon Oh","proposer_relevant_experience":"Seungheon is the only participant who will develop, produce documents, create tests, and write examples.\n\n\n\ngithub.com/SeungheonOh","url":null,"funds":189000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Smart Contract Development in Lean4","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Seungheon Oh","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":189000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Despite ongoing work on Cardano-focused formal verification tools in Lean4, there is still no framework that enables writing and compiling smart contracts directly within Lean4.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Build a Lean4-native framework that provides macros, DSLs, and UPLC tooling for writing, optimizing, and verifying Cardano smart contracts directly within Lean4.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://iohk.io/en/blog/posts/2025/07/17/a-new-era-of-smart-contract-verification-on-cardano/","https://leanprover-community.github.io/lean4-metaprogramming-book/main/01_intro.html"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Cardano suite necessary for developing smart contract will be bootstrapped from scratch in Lean4.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Project will be fully opensourced. It will be published on github under BSD-Clause3 license","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Developer Tools","group":"Development & Tools"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"We have similar eDSLs implemented in Haskell, like Plutarch, and full languages such as Plinth. However, there is no smart contract framework that is integrated into a general-purpose theorem prover like Lean4. This integration is fundamentally innovative because it unifies contract authoring, code generation, and formal verification in a single environment. Developers can define high-level logic, inspect the generated UPLC, prove properties about their contracts, and maintain correctness as the code evolves—all within Lean’s interactive proof and metaprogramming ecosystem. This approach brings the rigor of formal methods directly into everyday smart contract engineering, enabling safer, more transparent, and more reliable Cardano applications than what is possible with existing toolchains","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"[https://github\\.com/SeungheonOh/Moist](https://github.com/SeungheonOh/Moist)\n\n\n\nI've created a very simple prototype for creating UPLC program in Lean4. This demonstrates how Lean4's amazing LSP can help achieve interactive development experience for Cardano smart contract.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"By the last milestone, I will have a fully functional smart contract written in the Lean4 framework deployed on the Cardano mainnet to demonstrate end-to-end correctness, compatibility, and real-world usability. Additional success metrics include the generation of valid UPLC artifacts, reproducible builds via the Lean4 pipeline, verified contract serialization matching ledger standards, and community developers successfully using the framework to compile and deploy their own example scripts.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"This proposal introduces a Lean4-native smart contract framework that exploits Lean’s macro system, elaborator extensions, partial evaluation engine, and reflection APIs to create a fully programmable pipeline from high-level DSL constructs to raw UPLC. The framework enables fine-grained manipulation of UPLC terms, symbolic execution for correctness, customizable domain-specific syntax via macro_rules, automated property-based test generation, and predictable compilation pathways. By embedding Cardano smart contract development directly into Lean4’s metaprogramming ecosystem, the system delivers both low-level control and high-level expressiveness, filling a critical gap in the current Cardano tooling landscape and enabling developers to reason about contracts using the same mechanisms that produce their executable UPLC.\n\n\n\nBecause all smart contract development occurs within Lean4, developers can implement, test, optimize, and formally verify contracts using a unified environment and shared semantics. This tight integration eliminates the friction between code and proofs, enabling seamless refinement, interactive theorem proving, symbolic reasoning, and correctness-by-construction workflows. As a result, contract development becomes more rigorous, repeatable, and auditable, with a drastically reduced risk of divergence between specification and implementation.\n\n\n\nMoreover, Lean4’s rich development environment—including its powerful LSP features, real-time type and value introspection, interactive reduction displays, and immediate feedback loops—provides an exceptionally smooth and enjoyable developer experience. These capabilities allow smart contract developers to explore contract behavior live, inspect generated UPLC, debug transformations, and rapidly iterate on DSL extensions with full visibility into the compilation process. The combination of Lean4’s ergonomics and Cardano-specific infrastructure dramatically enhances productivity and lowers the barrier to building safe, high-assurance smart contracts.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project will meaningfully expand Cardano’s developer ecosystem by introducing the first smart contract framework fully integrated into Lean4, a modern proof assistant and metaprogramming environment. By unifying contract implementation, testing, symbolic execution, and formal verification within a single toolchain, the framework dramatically lowers the barrier to producing high-assurance Cardano smart contracts.\n\n\n\nDevelopers will gain access to powerful capabilities that are currently unavailable in any Cardano-native tooling: interactive theorem proving tied directly to executable UPLC, automated correctness checks, predictable compilation pipelines, customizable DSLs, and deep introspection of generated code. This empowers teams building financial, governance, DeFi, and infrastructure applications to achieve higher security guarantees with less friction and fewer external tools.\n\n\n\nThe Lean4-based workflow also encourages best practices across the ecosystem. New developers can learn smart contract development through a guided, interactive environment with instant feedback. Experienced developers can build reusable verified libraries, contribute new DSL extensions, and collaborate more effectively via Lean’s structured proof ecosystem.\n\n\n\nBy bridging the gap between formal methods research and practical Cardano engineering, this project strengthens the reliability, auditability, and long-term sustainability of Cardano’s smart contract ecosystem. It positions Cardano as the leading platform for rigorously verified decentralized applications and opens the door for academic, industrial, and open-source communities to converge around a shared, formally grounded development experience.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Seungheon is an experienced developer specializing in Cardano smart contracts and smart contract framework design. He previously maintained Plutarch, a Haskell eDSL for Cardano smart contract development, and now works on the Plutus Core team at IOG, where he contributes new features to Plinth and leads maintenance and optimization of the Haskell implementation of the CEK machine.\n\n\n\nHis deep background in strongly typed functional programming, compiler construction, and UPLC semantics provides a natural foundation for work in Lean4, whose dependent type theory and metaprogramming model share conceptual parallels with advanced Haskell techniques. This familiarity positions him well to build a Lean4-based smart contract framework informed by both practical Cardano engineering and modern proof-oriented tooling.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Core UPLC Representation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Implement core UPLC AST types in Lean4 (DeBruijn, AST nodes, builtins).\n\n\n\nDefine serialization/deserialization (CBOR-compatible) for UPLC terms.\n\n\n\nBuild foundational macro utilities for constructing UPLC-safe Lean syntax.\n\n\n\nSet up project scaffolding, CI, documentation, test suite, and code quality tools.\n\n\n\nValidate correctness by round-trip tests and equivalence tests with Plutus Core reference implementation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"UPLC AST in Lean4 matches Plutus Core specification.\n\n\n\nCBOR round-trip (serialize to deserialize to serialize) is identical to reference implementation.\n\n\n\nBasic macro constructors produce syntactically valid UPLC","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public GitHub repo with AST modules, macro utilities, and CBOR codec\n\n\n\nTest logs comparing Lean4 UPLC encoding with Plutus Core reference","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":37000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"High-Level eDSL Construction","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Design user-friendly syntax for building UPLC terms.\n\n\n\nImplement high-level eDSL primitives (lam, app, arithmetic, lists, bytearrays, etc.).\n\n\n\nAdd elaborator extensions to enforce scoping and structural correctness.\n\n\n\nProvide initial example scripts written in Lean4.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Users can write UPLC expressions in Lean using idiomatic syntax.\n\n\n\nExample eDSL contracts transforms cleanly into raw UPLC encoded in specified flat encoding.\n\n\n\nAt least 5 example contracts compile to valid UPLC.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Example directory with scripts and CI-verified compiled UPLC artifacts.\n\n\n\nDocumentation describing syntax rules and macros.\n\n\n\nGolden tests demonstrating correct elaboration into UPLC.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":38000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Builtin Functions, Data Encoding, and Golden-File Testing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Implement the full suite of UPLC builtin functions in Lean4, mirroring the Plutus Core specification (arithmetic, bytestring ops, hashing, crypto, list utilities, etc.).\n\n\n\nDefine Lean4-side encoders for Cardano Data (constructors, integers, bytestrings, lists, maps).\n\n\n\nBuild data schemas for datum, redeemer, and script context structures.\n\n\n\nCreate golden-file testing infrastructure:\n\n\n\n- snapshot UPLC output\n\n\n\n- snapshot serialized bytes\n\n\n\n- detect regressions automatically\n\n\n\nAdd compatibility tests by comparing serialized outputs with reference files from Plutus Core tooling","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All relevant UPLC builtins are represented correctly in Lean4 and serialize to valid UPLC.\n\n\n\nGolden tests run in CI and detect changes in structure or serialization.\n\n\n\nReference tests confirm compatibility with Plutus Core serialization.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Lean modules defining all supported builtins and data constructors.\n\n\n\nGolden test outputs stored under version control.\n\n\n\nCI logs showing stable snapshots and regression detection.\n\n\n\nDocumentation describing builtin semantics and encoding layer.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":38000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Contract Compilation Layer, Optimization Passes, and Cardano Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Provide structural correctness checks (scope correctness, well-formedness).\n\n\n\nImplement basic syntactic optimization passes\n\n\n\nDefine reusable contract templates: spending validator, minting policy, staking script\n\n\n\nImplement strong typing for datum/redeemer/context bindings based on Milestone 3 encoders.\n\n\n\nIntegrate output with Plinth, Cardano CLI, and text-envelope format.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Users can write full Cardano contracts in Lean4 and generate valid UPLC.\n\n\n\nOptimization produces structurally smaller UPLC terms.\n\n\n\nGenerated scripts serialize to text envelopes compatible with other Cardano projects.\n\n\n\nAll contract templates compile without errors and produce correct serialized artifacts.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Example contracts in repo (validator, minting policy, staking script).\n\n\n\nGolden test fixtures for post-optimization UPLC and envelope bytes.\n\n\n\nDocs explaining the compilation pipeline and optimization passes.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":38000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Developer Experience, Documentation, and v1 Public Release","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Write full documentation:\n\n- eDSL reference\n\n- builtin function reference\n\n- data encoding cookbook\n\n- contract templates\n\n\n\nAdd developer tooling:\n\n- UPLC pretty-print preview panel\n\n- debugging helpers for DSL expansion\n\n\n\nProduce onboarding materials for Haskell/Plutus developers transitioning to Lean4.\n\n\n\nPublish a v1 “starter kit” (example repo, templates, scaffolding project).\n\n\n\nPrepare the v1 stable release.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Documentation is fully sufficient for a new user to write a contract and compile it to UPLC.\n\n\n\nAt least three complete example contracts included and verified to serialize correctly.\n\n\n\nv1 is released publicly and includes stable APIs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public documentation site (GitHub Pages or equivalent).\n\nExample repositories demonstrating end-to-end workflows.\n\nGitHub v1.0 release tag with binaries, docs, release notes, and templates.\n\nClose out report and video demo for community.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":38000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Seungheon is the only participant who will develop, produce documents, create tests, and write examples.\n\n\n\ngithub.com/SeungheonOh","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The budget primarily supports developer labor, intensive DSL design work, builtin implementation, data encoding research, documentation, tooling integration, and comprehensive testing infrastructure .","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The proposed budget delivers exceptional value by producing foundational infrastructure that dramatically improves the safety, reliability, and accessibility of Cardano smart contract development. A Lean4-based UPLC eDSL becomes a long-lived asset for the ecosystem: it enables high-assurance contract development, lowers audit and debugging costs, and bridges formal verification research directly into real-world Cardano engineering. By investing once in this framework, the community gains reusable tooling, safer contract patterns, better developer onboarding, and a modern, verifiable development pipeline that will serve teams across DeFi, governance, and infrastructure for years. The cost reflects the highly specialized engineering effort required, yet the resulting platform reduces future development overheads ecosystem-wide, making it a high-leverage, high-impact investment for Cardano.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400053","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Developer Tools","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1661}