{"pr_id":"019ac201-7005-73ad-aa69-9ab070ee0954","title":"Credence","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"People are forced to repeat KYC on every platform, creating slow onboarding, high costs, and weak fraud prevention. There’s no reusable, trusted digital identity users can carry across apps.","solution":"We will build an AI-powered reusable identity system that lets users verify once and use that trusted credential across apps, removing repeated KYC, speeding onboarding, and reducing fraud.","proposer_name":"Kamal Aliyu","proposer_relevant_experience":"Our project team brings together all the skills needed to design, build, and launch Credence. Each member covers an essential part of the identity verification stack, from AI and blockchain to frontend development, community validation, and business adoption.\n\n\n\nKamal Aliyu — AI/ML Engineer (Project Lead) – [https://www\\.linkedin\\.com/in/alkamal/](https://www.linkedin.com/in/alkamal/)\n\nLeads the design and development of the AI verification layer, including OCR, face matching, liveness detection, and fraud checks. Oversees system architecture, technical decisions, and milestone coordination across the team.\n\n\n\nMubarak Abdullateef — Blockchain Developer – [https://www\\.linkedin\\.com/in/mubarak\\-abdullateef/](https://www.linkedin.com/in/mubarak-abdullateef/)\n\nResponsible for building and deploying the smart contracts for credential issuance, revocation, and verification. Ensures secure interaction between the on-chain components and the SDK, and handles testnet deployment and contract integration.\n\n\n\nTosin Rotimidokun — Frontend Engineer – [https://www\\.linkedin\\.com/in/tosin\\-rotimidokun/](https://www.linkedin.com/in/tosin-rotimidokun/)\n\nBuilds the user dashboard, verifier portal, and all user-facing interfaces for Credence. Focuses on usability, accessibility, and smooth interaction between the AI layer, backend, and blockchain components.\n\n\n\nKabirat kabiru —  Community Engagement Lead – [https://www\\.linkedin\\.com/in/kabiru\\-kabirat\\-437b3b291/](https://www.linkedin.com/in/kabiru-kabirat-437b3b291/)\n\nManages pilot testing, user onboarding, and collection of community feedback. Oversees engagement with early adopters, coordinates test groups, and ensures the MVP reflects real user needs inside and outside the ecosystem.\n\n\n\nMubarak Aminu — Business Developer – [https://www\\.linkedin\\.com/in/mubarak\\-aminu\\-3087b3222/](https://www.linkedin.com/in/mubarak-aminu-3087b3222/)\n\nLeads partnerships, adoption strategy, and long-term sustainability. Works with ecosystem developers and organizations to drive integration, support go-to-market plans, and help position Credence as a trusted identity layer.\n\n\n\nTogether, our team combines strong technical expertise with real-world user insight and ecosystem awareness, ensuring Credence is practical, secure, and ready for adoption.","url":null,"funds":150000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Credence","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Kamal Aliyu","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":150000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"People are forced to repeat KYC on every platform, creating slow onboarding, high costs, and weak fraud prevention. There’s no reusable, trusted digital identity users can carry across apps.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will build an AI-powered reusable identity system that lets users verify once and use that trusted credential across apps, removing repeated KYC, speeding onboarding, and reducing fraud.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://credenceee.vercel.app/","https://github.com/Alkamal01/Credence-cadano","https://docs.google.com/document/d/1v3c5NRZm0VSfwd_XozpXkbKt3MiKvDercQttNaMYH1k/edit?usp=sharing","https://docs.google.com/spreadsheets/d/1P-PUPwT7usGks2M0AxHelc7e71v2gp3PrXQk_lu2Dt0/edit?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Our project has a few external dependencies that support accurate AI verification and secure credential issuance. We rely on open-source AI libraries such as TensorFlow or OpenCV for OCR, face matching, and liveness detection, all of which are licensed for commercial use. We also depend on cloud infrastructure to host the verification API during development and testing, along with publicly available, privacy-safe datasets for evaluating document and biometric accuracy. For the on-chain components, we use standard smart contract testing tools that are openly accessible. All these dependencies are permitted and essential for delivering a reliable prototype without introducing unnecessary delays or risks.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Our project will not be fully open source because the core AI verification models and fraud-detection logic must remain protected to prevent misuse and adversarial attacks. However, all integration components will be open and accessible. The smart contract interfaces, JavaScript SDK, and developer documentation will be released under an MIT License so builders can freely integrate Credence while we maintain security for sensitive identity processes.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Identity & Verification","group":"Identity & Security"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"**Credence** is innovative because it brings something that doesn’t exist yet in Cardano: AI-verified identity that users can reuse across multiple apps without repeating KYC. Here’s what makes it unique:\n\n\n\n- **AI\\-powered verification instead of manual checks: **Most identity systems still rely on slow document uploads and human review. Credence uses OCR, face matching, liveness checks, and fraud detection to verify identity quickly and accurately.\n- **Reusable credentials instead of repeating KYC everywhere: **Today, users must verify themselves again on every exchange, wallet, marketplace, or dApp. Credence turns identity into a reusable credential that can be shared across apps with one click.\n- **Privacy by design: **No raw documents or photos ever go on-chain. Only proofs and hashed records are stored, so users keep control of their personal data.\n- **A bridge between real identity and Web3: **Existing Web3 identity tools focus on wallet activity, reputation, or social login. They don’t verify real people. Credence adds a strong, AI-validated identity layer that works across decentralized applications.\n- **Instant verification for builders: **dApps can verify a user without handling documents, reducing cost, complexity, and risk. This is a big step forward for developers who don’t want to manage sensitive data.\n- **Not just a KYC service, but an ecosystem trust layer: **Because the credentials are portable, the more projects adopt it, the stronger the shared identity network becomes.\n\n\n\n**Why this is new to Cardano**\n\n\n\nCardano has no reusable, AI-verified identity credential.\n\nNo project currently combines machine-learning verification with decentralized, user-controlled credentials.\n\nCredence fills the gap between pure decentralized identifiers (which don’t verify real-world identity) and traditional KYC (which is slow, repetitive, and centralized).\n\n\n\n**In simple terms**\n\n\n\nCredence lets users prove who they are once, and take that proof anywhere.\n\n\n\n- No app needs to rebuild KYC.\n- No user needs to repeat it.\n- And no one exposes personal data on-chain.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our MVP will demonstrate the full journey of reusable identity on testnet. It will show how a user verifies themselves once and then uses that credential across apps. Specifically, the prototype will demonstrate:\n\n\n\n- **AI\\-powered verification: **Users can upload an ID and selfie to see how document checks, face matching, and fraud detection work.\n\n\n\n- **Creation of a reusable credential: **After verification, the system issues a testnet credential whose proof is stored on-chain.\n\n\n\n- **User dashboard: **Users can view their credential status, expiration, and verification history.\n\n\n\n- **Verifier portal: **Apps and dApps can verify a user’s credential instantly using only a proof, without handling personal documents.\n\n\n\n- **Developer SDK demo: **A simple JavaScript example will show how builders can plug verification into their own apps.\n\n\n\n**Where it can be accessed**\n\n\n\n- A hosted web link to the Credence Testnet MVP\n- A public testnet smart contract address\n- A GitHub repo with the SDK, docs, and demo verifier app\n\n\n\n**How the community can help**\n\n\n\n- Test the verification flow\n- Use the verifier portal\n- Integrate the SDK into small demo projects\n- Provide usability and reliability feedback\n\n\n\nThis ensures the MVP is testable on-chain, open to the community, and ready for refinement before mainnet launch.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Our measures of success focus on real usage and verifiable on-chain activity. A successful MVP should show that users can complete verification, receive a credential, and have that credential validated by different apps on testnet. We expect modest but meaningful numbers that match an early prototype rather than a full commercial rollout.\n\n\n\n**On\\-chain success indicators**\n\n\n\n- 1,000–1,500 identity credentials issued on testnet during the pilot phase.\n- 3,000–5,000 smart contract calls, including credential issuance, revocation checks, and verifier lookups.\n- Three or more dApps or developer teams integrating the verification SDK into their testnet applications.\n\n\n\n**User and adoption indicators**\n\n\n\n- At least 500 real pilot testers completing end-to-end verification using the MVP.\n- Completion rate above 70% for the verification process, showing that the onboarding flow works smoothly.\n- Feedback from pilot partners confirming that using a reusable credential reduces the need for repeated KYC.\n\n\n\n**Performance indicators**\n\n\n\n- Verification time under 10 seconds for users with an existing credential.\n- No critical issues found in contract audits or community testing.\n\n\n\nThese targets are achievable within the scope of a prototype and reflect activity levels seen in similar decentralized identity pilots. They give us clear signals that the system works, that developers can integrate it, and that users are willing to adopt reusable identity credentials.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The problem we are solving is simple: people are forced to repeat KYC and identity checks every time they join a new platform. This slows everything down, increases onboarding costs, and creates frustration for both users and developers. On Cardano, this challenge limits adoption because many dApps need identity verification but do not want to handle documents, personal data, or build KYC systems from scratch. Our solution addresses this by letting users verify themselves once and then reuse that verified credential across multiple applications.\n\n\n\nCredence takes a practical approach by combining AI verification with on-chain credential proofs. The AI layer handles document checks, face matching, and fraud detection. Once a user is verified, they receive a reusable credential whose proof is stored on-chain. Any platform can verify this credential instantly without accessing personal documents. This approach keeps user data private while giving developers a reliable way to know that a user is real and unique. We chose this method because it avoids complicated, paperwork-heavy KYC flows and gives users full control of their own identity.\n\n\n\nOur project will engage everyday users who want faster onboarding and developers who want a secure verification layer without managing sensitive data. We will demonstrate impact through measurable on-chain activity: number of credentials issued, verification calls from partner dApps, and usage metrics collected during the pilot. We will also track user feedback and completion rates to show that the onboarding experience is genuinely improving.\n\n\n\nWhat makes Credence unique is the combination of AI-driven verification, reusable credentials, and a privacy-first design. It removes unnecessary friction from onboarding, reduces fraud risk, and gives builders a reusable identity tool that benefits the whole ecosystem. For Cardano, this is important because it unlocks safer dApps, lowers barriers for new users, and provides the foundation for identity-driven applications such as compliant DeFi, marketplaces, lending, and community governance. The project doesn’t just solve one problem, it creates long-term value by giving the ecosystem a trusted identity layer that can be reused over and over.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Credence strengthens the wider Cardano ecosystem by giving users and developers access to a reusable, AI-verified identity layer. This reduces onboarding friction across dApps, prevents repeated KYC checks, and lowers the cost and risk for builders who don’t want to handle sensitive documents. A shared identity credential also makes the ecosystem safer by reducing fraud and helping new users join applications more easily.\n\n\n\nWe’ll measure impact using both quantitative and qualitative indicators. On-chain metrics will track the number of credentials issued, verification calls made by partner dApps, and interactions with the smart contracts. Off-chain metrics will include user feedback from pilot groups, verification completion rates, and adoption by developers who integrate the SDK. We will also gather comments from partners to understand how reusable identity affects their onboarding speed and operational costs.\n\n\n\nAll outputs will be shared openly with the community. The SDK, documentation site, demos, and testnet deployment will be publicly accessible for anyone to use or test. We will provide progress updates, pilot reports, and final results on GitHub, in Catalyst channels, and through community calls. By sharing both the tools and the lessons learned, we hope to support other teams building identity-aware applications and encourage more projects to adopt reusable credentials across the Cardano ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our team has the skills and experience needed to deliver Credence with a high level of trust and accountability. We cover AI/ML engineering, blockchain development, frontend development, community engagement, and business strategy, which allows us to build every part of the system in-house. Each team member has worked on technical projects that required careful planning, documentation, and secure handling of data, which is crucial for an identity-focused product like this.\n\n\n\nTo ensure feasibility, we designed our approach around proven technologies: open-source AI libraries for verification, well-established smart contract patterns, and a lightweight credential model that avoids storing personal data on-chain. Before building the MVP, we prepared a clear architecture and workflow that shows exactly how AI and on-chain proofs interact. We will validate feasibility through testnet deployments, pilot testing, and measurable usage from real users and partner dApps.\n\n\n\nWe also have processes in place to manage funds responsibly. Every milestone has specific outputs, acceptance criteria, and documentation requirements. Progress will be tracked publicly through GitHub, where code, updates, and reports will be visible to the community. We will share monthly updates, publish our deliverables openly, and use the budget only for planned development, testing, and deployment tasks. By keeping our work transparent and milestone-driven, we ensure the community can trust both our process and our final results.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Planning, Architecture & Research","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will produce the full system architecture for Credence, including the AI verification pipeline, credential schema, data flow structure, and smart contract logic. This milestone also delivers a complete requirements document, a privacy and compliance review, and internal documentation that guides development. These outputs give the team and community a clear blueprint that describes how the AI layer, smart contracts, and SDK will work together. It establishes the foundation for all future work and ensures that decisions are well-informed, technically sound, and aligned with identity standards.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- A complete architecture document covering AI, backend, and on-chain components.\n- A requirements document describing each feature of the MVP in detail.\n- A privacy and compliance review confirming that no personal data will be stored on-chain.\n- Internal documentation that can be shared publicly for transparency.\n- All documents reviewed and approved by the core team.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- A complete architecture document covering AI, backend, and on-chain components.\n- A requirements document describing each feature of the MVP in detail.\n- A privacy and compliance review confirming that no personal data will be stored on-chain.\n- Internal documentation that can be shared publicly for transparency.\n- All documents reviewed and approved by the core team.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":17000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"AI Verification Engine Development","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will deliver the core AI verification engine that processes identity documents, performs OCR, conducts face matching, and runs basic fraud-detection checks. A working API endpoint will allow the frontend and SDK to trigger verification. A small non-sensitive dataset will be assembled for evaluating model accuracy. This milestone also includes internal QA, performance tuning, and documentation explaining how the verification process works.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- OCR model capable of extracting key fields from common identity documents.\n- Face match and liveness detection functional with >90% test accuracy.\n- Fraud detection heuristics detecting duplicates or tampering cases in test samples.\n- An API endpoint that handles verification calls and returns structured results.\n- QA tests confirming reliability and consistent performance.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- API endpoints deployed on a test environment.\n- Sample verification logs showing successful OCR, face match, and fraud checks.\n- Model evaluation report shared through GitHub or documentation site.\n- QA checklist and test cases uploaded to the repository.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Smart Contract Layer","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers the smart contracts that issue and manage reusable identity credentials. This includes the credential issuance contract, a revocation registry, and a verification proof checker that ensures a verifier can confirm the status of a credential without accessing any personal data. Integration functions for the JavaScript SDK will also be added, along with documentation explaining contract structures and usage.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Credential issuance contract deployed on Cardano testnet.\n- Revocation registry functional, with ability to revoke or update credential status.\n- Verification contract capable of checking proofs reliably.\n- SDK functions for reading contract state and validating proofs.\n- Successful internal audit with no critical issues.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Smart contract addresses published on the testnet network.\n- Contract code available publicly in GitHub.\n- Simple demo transactions proving issuance, verification, and revocation.\n- Internal audit report uploaded as documentation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Frontend, SDK & Integration Toolkit","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will build the user dashboard for identity management, a verifier portal for partner applications, and the full JavaScript SDK that developers can use to integrate Credence. This milestone also includes an API gateway for partners, the complete documentation site, and a short demonstration video. UX testing and adjustments ensure the system is easy to use.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Fully functional user dashboard showing credential status and history.\n- Verifier portal capable of checking credentials instantly through testnet.\n- SDK offering plug-and-play verification methods for developers.\n- Documentation website published with integration guides and examples.\n- Demo video accessible to Catalyst community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Live testnet deployment link for the dashboard and verifier portal.\n- Public GitHub release of the SDK.\n- Documentation URL accessible without login.\n- Demo video uploaded to YouTube or similar platform.\n- UX testing notes and improvements logged on GitHub.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":32000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Pilot Testing, Community Validation & Final Deployment","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The MVP will be tested with real users and partner projects. At least 500 test users will complete verification, and multiple dApps will integrate the SDK in a pilot setup. Feedback collected during this period will guide final improvements. The milestone ends with a testnet deployment, updated documentation, bug fixes, and mainnet readiness.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Successful onboarding of 500 users on testnet.\n- At least 2–3 partner platforms integrating the SDK in pilot mode.\n- Verification times below 10 seconds for credential holders.\n- Community feedback collected and documented.\n- No unresolved critical issues in smart contracts or frontend flows.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- On-chain testnet analytics showing credential issuance and verification counts.\n- Written reports from partner integrations.\n- User feedback summary with identified improvements.\n- Final documentation and release notes published publicly.\n- Testnet contract addresses and deployment logs.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":26000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Our project team brings together all the skills needed to design, build, and launch Credence. Each member covers an essential part of the identity verification stack, from AI and blockchain to frontend development, community validation, and business adoption.\n\n\n\nKamal Aliyu — AI/ML Engineer (Project Lead) – [https://www\\.linkedin\\.com/in/alkamal/](https://www.linkedin.com/in/alkamal/)\n\nLeads the design and development of the AI verification layer, including OCR, face matching, liveness detection, and fraud checks. Oversees system architecture, technical decisions, and milestone coordination across the team.\n\n\n\nMubarak Abdullateef — Blockchain Developer – [https://www\\.linkedin\\.com/in/mubarak\\-abdullateef/](https://www.linkedin.com/in/mubarak-abdullateef/)\n\nResponsible for building and deploying the smart contracts for credential issuance, revocation, and verification. Ensures secure interaction between the on-chain components and the SDK, and handles testnet deployment and contract integration.\n\n\n\nTosin Rotimidokun — Frontend Engineer – [https://www\\.linkedin\\.com/in/tosin\\-rotimidokun/](https://www.linkedin.com/in/tosin-rotimidokun/)\n\nBuilds the user dashboard, verifier portal, and all user-facing interfaces for Credence. Focuses on usability, accessibility, and smooth interaction between the AI layer, backend, and blockchain components.\n\n\n\nKabirat kabiru —  Community Engagement Lead – [https://www\\.linkedin\\.com/in/kabiru\\-kabirat\\-437b3b291/](https://www.linkedin.com/in/kabiru-kabirat-437b3b291/)\n\nManages pilot testing, user onboarding, and collection of community feedback. Oversees engagement with early adopters, coordinates test groups, and ensures the MVP reflects real user needs inside and outside the ecosystem.\n\n\n\nMubarak Aminu — Business Developer – [https://www\\.linkedin\\.com/in/mubarak\\-aminu\\-3087b3222/](https://www.linkedin.com/in/mubarak-aminu-3087b3222/)\n\nLeads partnerships, adoption strategy, and long-term sustainability. Works with ecosystem developers and organizations to drive integration, support go-to-market plans, and help position Credence as a trusted identity layer.\n\n\n\nTogether, our team combines strong technical expertise with real-world user insight and ecosystem awareness, ensuring Credence is practical, secure, and ready for adoption.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"# Cost Breakdown\nOur total funding request is ₳116,000, aligned directly with the five milestones in our development plan. Each milestone has its own resource needs, including engineering, infrastructure, documentation, project management, community testing, and audit requirements. All costs reflect future work only.\n\n\n\n**1\\. Planning, Architecture &amp; Research — ₳17,000**\n\n**Resources needed:**\n\n- AI/ML design work\n- System architecture\n- Credential schema design\n- Compliance and privacy review\n- Project management\n\nThis phase establishes the foundation for the entire project. Most of the cost covers the time required to produce detailed technical documentation, map verification flows, and prepare a clear plan for all components.\n\n\n\n**2\\. AI Verification Engine Development — ₳40,000**\n\n**Resources needed:**\n\n- OCR model development\n- Face match + liveness algorithms\n- Fraud detection heuristics\n- API engineering\n- Internal QA and evaluation\n- Cloud compute for model testing\n\nThis is the most resource-intensive stage. It requires sustained engineering effort, experimentation, and cloud infrastructure to build the AI pipeline. We are using open-source tools (TensorFlow, OpenCV), so no license costs are required. Cloud costs include GPU/CPU compute for model runs during development.\n\n\n\n**3\\. Smart Contract Layer — ₳35,000**\n\n**Resources needed:**\n\n- Smart contract development\n- Testnet deployment\n- Contract testing\n- SDK bindings\n- Internal audit + external review\n- Documentation\n\nThis phase includes the credential issuance logic, revocation registry, and verification proof checker. A portion of the budget covers a lightweight third-party code review to ensure security and correctness before public testing.\n\n\n\n**4\\. Frontend, SDK, Documentation &amp; Integration Toolkit — ₳32,000**\n\n**Resources needed:**\n\n- Identity dashboard\n- Verifier portal\n- JavaScript SDK\n- API gateway\n- Documentation website\n- Demo video\n- UX testing\n\nThis milestone covers everything needed for the community to interact with the MVP, including a full SDK and clear onboarding materials. The demo video supports community testing and transparency.\n\n\n\n**5\\. Pilot Testing, Community Validation &amp; Final Deployment — ₳26,000**\n\n**Resources needed:**\n\n- Pilot testing with 500 users\n- Integration with 2–3 partner dApps\n- Community engagement sessions\n- Bug fixes and optimization\n- Reporting and documentation\n- Testnet → mainnet preparation\n\nThis cost includes community engagement, pilot management, data collection, and final reporting. We also budgeted for minor infrastructure costs needed during the pilot period.\n\n\n\n**Third\\-Party Services Used**\n\n- Cloud compute (AI model training &amp; API hosting): Standard cloud infrastructure for development and testing.\n- Contract audit: A lightweight external review for contract security.\n- Documentation hosting: Low-cost web hosting for docs (or GitHub Pages).\n\nNo proprietary software licenses are required. All AI frameworks and tools used are open-source.\n\n\n\n**Publicity, Community Engagement &amp; Reporting**\n\n- We allocated part of Milestone 5 for:\n- Community testing coordination\n- Feedback collection\n- Pilot partner support\n- Final reporting back to the Catalyst community\n\nThis ensures transparency and proper communication during the project.\n\n\n\n**Project Management &amp; Documentation Costs**\n\nEach milestone includes dedicated PM hours for:\n\n- Weekly sync meetings\n- Documentation updates\n- Coordination between engineering tracks\n- Maintaining the project board and reporting\n\n\n\nThis avoids common budgeting gaps and reflects real workload needs.\n\nThe current proposal fully covers MVP design, development, testing, and deployment.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The cost of this project represents strong value for the Cardano ecosystem because it delivers a reusable identity infrastructure that many dApps, fintech platforms, and marketplaces can rely on. Instead of each project building its own KYC or verification system, Credence provides a shared, AI-powered identity layer that reduces onboarding friction, cuts development costs, and increases safety across the ecosystem. This makes the investment beneficial not only for our team, but for every builder who wants to integrate secure identity features without managing sensitive data.\n\n\n\nThe budget is proportional to the amount of engineering effort required. AI verification, smart contract development, and SDK creation each require specialized skills with rates comparable to standard freelance and professional engineering work. For example, typical software engineering and AI development rates in our region range between $15–$30/hour, and blockchain specialists often charge higher due to the required security and audit expectations. The milestones and costs reflect realistic labor hours for building a working MVP, not inflated numbers. We also budgeted carefully for testing, documentation, pilot support, and community engagement, which are commonly overlooked but essential for a successful launch.\n\n\n\nBecause Credence can be reused by multiple projects, the ecosystem gains more value than the cost of building it. Every dApp that adopts the system saves money, avoids repeated KYC processes, and benefits from faster onboarding for their users. By funding this project once, Catalyst supports a long-term identity solution that strengthens trust, reduces fraud, and improves user experience across the entire network.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Identity & Verification","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1662}