{"pr_id":"019ac3cf-bd68-7570-b32a-a0a4c7779c0f","title":"MYTHRIL CODEX Lightweight Browser RPG + NFT  on Cardano","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Web3 gaming lacks simple, low-friction entry points with verifiable character ownership. Cardano requires a lightweight, browser-native gateway to onboard new users using TTRPG mechanics.","solution":"MYTHRIL CODEX delivers a deterministic RPG adventure via the browser. The compact MVP utilizes a full CIP-30 mint pipeline to validate character ownership as a scalable entry point for Cardano gaming.","proposer_name":"Astel Lee","proposer_relevant_experience":"Astel Lee\n\nRole: Project Creator & Designer\n\nExperience:\n\n•\tVisual Designer: Professional background in UI/UX and Art Direction. I ensure the game is not just functional, but visually polished and intuitive for players.\n\n•\tStorywriter: Creator of the entire MYTHRIL CODEX universe, narrative branches, and game mechanics.\n\n•\tTechnical Implementation: A hands-on builder bridging design and code. Instead of complex custom engineering, I utilize standard open-source libraries and official developer documentation to implement the game logic. I have already built the initial playable prototype by strictly following established development patterns.","url":null,"funds":90000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"MYTHRIL CODEX Lightweight Browser RPG + NFT  on Cardano","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Astel Lee","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":90000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":7,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Web3 gaming lacks simple, low-friction entry points with verifiable character ownership. Cardano requires a lightweight, browser-native gateway to onboard new users using TTRPG mechanics.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"MYTHRIL CODEX delivers a deterministic RPG adventure via the browser. The compact MVP utilizes a full CIP-30 mint pipeline to validate character ownership as a scalable entry point for Cardano gaming.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://drive.google.com/drive/folders/1MrHvCUxeD_CQsuknUy7aAohxdMBMhcQ1?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No, except standard Cardano tools (CIP-30 wallets, testnet, Plutus/Aiken contracts).","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"We adopt a Hybrid Open-Source Strategy. We protect the core creative IP (narrative, game logic, UI) for commercial sustainability. However, the technical infrastructure will be released under the MIT License to boost ecosystem development. This includes: Smart Contracts (Plutus/Aiken) for trust, the Wallet Integration Module (CIP-30), and the Metadata Builder logic (CIP-68/25), forming a reusable \"Cardano Game Connector Kit.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"GameFi","group":"GameFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"●\tFirst Lightweight TTRPG-Style Adventure on Cardano: Designed for 5–10 minute sessions, fitting perfectly into users' fragmented time. It lowers the barrier to entry while offering deep, strategic gameplay unlike simple clickers.\n\n●\tTrue Asset Utility: Playable, Not Just Collectible: We bridge the gap between \"Free-to-Play\" and \"Own-to-Play.\" Unminted characters are temporary; minting transforms them into permanent, usable assets. These NFTs are not just static collectibles—they are required to save progress, carry over stats, and unlock future content.\n\n●\tRetro Terminal UI for Instant Onboarding: No complex art assets to load, no downloads required. It works instantly on any browser (mobile/desktop), focusing on imagination over graphics.\n\n●\tRust/WASM Deterministic Engine: Every adventure outcome is determined by verifiable Dice-Rolling Mechanics (non-black-box), ensuring fairness and reproducibility.\n\n●\tDesigned for Measurable On-Chain Activity: The game design drives conversion. Users start for free, but the desire to keep their character drives the minting transaction, creating a sustainable loop of on-chain activity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"MVP Contents:\n\n●\tCore Engine: A deterministic Rust/WASM Battle & Decision Engine (Ensuring fair, verifiable dice-rolling mechanics).\n\n●2 Playable Classes: Knight,  Mage. Each class features unique attribute scaling and skill trees.\n\n●\tStoryline: A 5–8 node adventure storyline featuring dynamic Attribute-Check Gameplay.\n\n●\tInterface: Retro CRT-style terminal UI (Immersive fantasy console style).\n\n●\tBlockchain Integration: Full CIP-30 wallet connection.\n\n●\tAsset Pipeline: Character Minting → Metadata Generation → On-Chain Storage.\n\n●\tDeployment: Mainnet launch.\n\nDelivery Platform\n\n●\tWeb Browser Game (desktop & mobile)\n\n●\tUser Experience Flow\n\n●\tConnect CIP-30 wallet\n\n●\tGenerate a free character\n\n●\tPlay a short adventure (3-8 nodes)\n\n●\tView outcome\n\n●\tMint character on Cardano mainnet\n\n●\tCharacter becomes a reusable asset for future adventures","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"On-chain Metrics\n\n•\t≥ 800 On-chain interactions: Cumulative interactions including character mints, metadata updates, and validation checks.\n\n•\t≥ 98% Mint Success Rate: Ensuring technical stability during the launch phase.\n\n•\tMainnet Deployment: Smart contracts deployed and verified on Cardano mainnet.\n\n\n\nUser Metrics\n\n•\t500+ Total Unique Users: Cumulative distinct wallet connections during the public testing phase.\n\n•\t≥ 20% Mint Conversion Rate: Proving that the game loop is engaging enough to drive on-chain action.\n\n•\t≥ 50 Community Members: Early adopters gathered in Discord/Twitter to provide feedback.\n\n•\t≥ 70–80% Adventure Completion Rate: Validating that the core engine functions correctly without crashes.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"1. Build the Deterministic Core Game Engine, enabling fast, reproducible text-based gameplay.\n2. Implement 4 unique character classes (Knight, Paladin, Mage, Dark Mage), each with dynamic attribute-based outcomes.\n3. Create a retro CRT UI optimized for minimal friction and maximum readability.\n4. Integrate CIP-30 wallets for secure identity and payments.\n5. Deploy NFT minting contracts on Cardano using Aiken.\n6. Run adventure sessions, letting users experience TTRPG-style dice mechanics in minutes.\n7. Mint characters on-chain, proving &quot;lightweight dungeon crawler → real asset ownership&quot; works.\n\n\n\nWhy Blockchain Is Required: MYTHRIL CODEX requires blockchain because the core game mechanic—minting characters as persistent, ownable, verifiable game assets—cannot be achieved with a Web2 database without sacrificing fairness or ownership.\n\n\n\nBlockchain guarantees:\n\n●\tVerifiable NFT ownership for characters.\n\n●\tImmutable metadata (stats, adventure outcomes).\n\n●\tTransparent rarity distribution.\n\n●\tTamper-proof adventure history.\n\n●\tCross-game interoperability.\n\nWithout blockchain, characters become merely account-bound data. With blockchain, characters become player-owned assets that can be traded, reused, or integrated into future games.\n\nWhy Cardano?\n\n●\tLow fees: Ideal for high-frequency microtransactions and mass minting.\n\n●\tUTxO deterministic model: Perfect for reproducible game logic.\n\n●\tStrong NFT culture: Provides an existing collector ecosystem.\n\n●\tCIP-30 wallet standard: Instant browser integration, no app required. Cardano enables the vision of \"true ownership for lightweight games\" better than any other chain.\n\nRisks & Mitigation:\n\n●\tSmart Contract Verification Delays: Minimized by using Aiken (which is safer by design) and implementing a rigorous automated testing suite instead of relying solely on slow external audits.\n\n●\tLow Early User Adoption: Addressed with a \"Free-to-Play, Own-to-Mint\" model and frictionless browser onboarding.\n\n●\tEngine Logic Issues: Covered through deterministic engine unit tests and a closed user playtest (Beta).\n\n●\tNFT Metadata Compatibility: Avoided by strictly following CIP-68 / CIP-25 standards.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"MYTHRIL CODEX strengthens the Cardano ecosystem by:\n\n●\tIntroducing a New Gateway Genre: It launches the first lightweight TTRPG-style text adventure on Cardano. This low-friction genre acts as a perfect funnel to onboard non-crypto gamers who are intimidated by complex DeFi or heavy 3D games.\n\n●\tDriving On-Chain Activity: Every user journey culminates in a transaction. By turning game characters into NFTs, we generate consistent on-chain activity (minting and metadata updates) from real utility, not just speculation.\n\n●\tReleasing Reusable Infrastructure (Open Source): While the game content is proprietary, we will open-source the \"Cardano Game Connector\" modules (Wallet integration + Minting logic). This reduces the technical barrier for the next wave of indie developers entering the ecosystem.\n\n●\tGrowing the NFT User Base: We provide a use case where NFTs are functional assets, not just JPEGs. This educates users on the true value of digital ownership and expands the active NFT collector base on Cardano.\n\nValue to the Community: The project delivers immediate playable content for users and long-term technical building blocks for developers, ensuring ROI for the ecosystem beyond just the game itself.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Capability to Deliver: Focused Scope & Design-Led Execution I am a professional Designer and Storyteller stepping into development. My capability to deliver rests on Scope Control and Product Clarity:\n\n•\tSimple Technology Stack: The project is intentionally designed as a lightweight text adventure. It does not require complex graphics rendering or high-performance physics, making it fully achievable for a single developer using standard web tools.\n\n•\tClear Roadmap: I have already finalized the game logic, UI design, and storyline scripts. The development phase is purely execution, not exploration.\n\n•\tStandard Implementation: For the blockchain components, I strictly follow official Cardano developer guides and standard templates (CIP-30/CIP-25), avoiding experimental or overly complex smart contracts.\n\nFeasibility Validation:\n\n1.\tLogic Verification: Since the game relies on text and math (dice rolls), the logic is easy to test and verify without expensive infrastructure.\n\n2.\tPilot Testing: I will run a closed beta with a small group of users to ensure the \"Connect Wallet -> Play -> Mint\" flow works smoothly before public launch.\n\n3.\tStep-by-Step Delivery: The project is broken down into small, manageable milestones to ensure steady progress.\n\nNo outsourcing is required. By keeping the scope realistic and the technology standard, I can personally guarantee delivery and accountability.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Core Engine & Architecture","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"●\tDeterministic Core Game Engine: The foundational logic handling dice rolls, combat math, and attribute checks.\n\n●\tAdventure Parser System: The module that reads story scripts and converts them into playable nodes.\n\n●\tCore Character Generator: Logic for generating base stats for the 2 base classes (Knight & Mage).\n\n●\tBackend Architecture: Database schema design for off-chain user progress.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"●\tEngine executes ≥ 20 automated unit tests successfully (validating combat math and attribute checks).\n\n●\tJSON adventure files render correctly in a local test environment.\n\n●\tCharacter generator produces valid stat blocks for both classes.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"●\tVideo Demo: Screen recording showing the engine executing logic and tests.\n\n●\tArchitecture Documentation: System design document.\n\n●\tGitHub Repository: Link to the open-source infrastructure modules.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Playable Interface & Roguelite Logic","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"●\tImplementation of 2 Classes: Knight and Mage with distinct starting attributes (replacing \"skill trees\").\n\n●\tRoguelite Mechanics System: Logic for acquiring temporary items/skills during the adventure run.\n\n●\tFully functional Retro CRT-style User Interface.\n\n●\tCharacter sheet display & scrolling adventure log.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"●\tDynamic Stat Modification: Verifying that acquiring a temporary item/skill correctly boosts attributes/dice rolls in the current session.\n\n●\tClass Differentiation: Knight and Mage start with different base stats in the interface.\n\n●\t≥ 8 adventure nodes are fully playable with random loot/event drops.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"●\tLive Web Demo: A private or public link to play the alpha version.\n\n●\tUI Screenshots: Showing the inventory/status screen with temporary items.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"CIP-30 Wallet & NFT Minting Pipeline","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"●\tWallet Connection: Module handling interaction with CIP-30 wallets (Lace, Eternl, etc.).\n\n●\tSmart Contracts: Aiken minting contracts deployed to Cardano Testnet.\n\n●\tMint Pipeline: Logic to convert game state into CIP-68/25 compliant NFT metadata.\n\n●\tSecurity Verification: Contracts verified via rigorous automated unit tests (instead of external audit).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"●\t≥ 98% Mint Success Rate achieved in testnet trials.\n\n●\tMetadata Verification: Character stats and class data are correctly viewable on a testnet explorer.\n\n●\tState Persistence: Game correctly recognizes the minted NFT after the transaction.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"●\tTestnet Explorer Links: Proof of valid transactions on Cardano Preprod/Preview chain.\n\n●\tDemo Video: Showing the full \"Connect -> Play -> Mint\" flow.\n\n●\tGitHub Repository: Link to the open-source wallet/minting connector code.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Public Launch & Community Testing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"•\tCommunity Pilot Test: Launching the game to initial testers (Targeting 500+ unique users).\n\n•\tFinal Polish: Bug fixes and UI improvements based on beta feedback.\n\n•\tMainnet Launch: Deployment of the stable version to Cardano Mainnet.\n\n•\tOpen Source Release: Publishing the \"Cardano Game Connector\" modules to GitHub.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"•\t≥ 800 On-chain interactions logged (Mints + Updates).\n\n•\t≥ 20% Mint Conversion Rate achieved during the pilot.\n\n•\t≥ 70% Adventure Completion Rate (validating game stability).\n\n•\tFinal Project Report & Video submitted.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"•\tMainnet Explorer Links: Showing real user activity and contract interactions.\n\n•\tAnalytics Dashboard: Screenshots showing user retention and completion stats.\n\n•\tGitHub Repository: Public release of the open-source infrastructure.\n\n•\tProject Closing Report: PDF document summarizing the project outcomes.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Astel Lee\n\nRole: Project Creator & Designer\n\nExperience:\n\n•\tVisual Designer: Professional background in UI/UX and Art Direction. I ensure the game is not just functional, but visually polished and intuitive for players.\n\n•\tStorywriter: Creator of the entire MYTHRIL CODEX universe, narrative branches, and game mechanics.\n\n•\tTechnical Implementation: A hands-on builder bridging design and code. Instead of complex custom engineering, I utilize standard open-source libraries and official developer documentation to implement the game logic. I have already built the initial playable prototype by strictly following established development patterns.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Module\t%\tCost\n\nArchitecture & Engineering\t40%\t₳ 36,000\n\nFrontend Development\t20%\t₳ 18,000\n\nBackend & Smart Contracts\t20%\t₳ 18,000\n\nTesting & Community Acquisition\t10%\t₳ 9,000\n\nArt, UI, Misc\t10%\t₳ 9,000\n\nTotal\t100%\t₳ 90,000","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"1.High output, cost-efficient: Delivering a complete game MVP + mint pipeline in 7 months (not 3) by leveraging an AI-first, human-backed workflow. This ensures high velocity without the overhead of a large engineering team.\n\n2. Strategic Resource Allocation: We adopt a lean, single-developer workflow to maximize capital efficiency, avoiding the high burn rate of large teams. Crucially, the budget includes a safety buffer to hire external technical consultants for specific roadblocks if necessary, ensuring delivery is never compromised.\n\n3.Reusable Open Source Infrastructure: While the game IP is proprietary, the Wallet Connector and Minting Modules will be open-sourced, allowing other Cardano developers to adopt these tools.\n\n4.Long-term value: MYTHRIL CODEX becomes a low-friction gateway for onboarding non-crypto users into Cardano through accessible TTRPG-style gaming.\n\n5.Measurable On-Chain Activity: The \"Play-to-Mint\" design ensures utility: every character creation and update results in a real on-chain transaction, directly increasing network usage.\n\n6.Ecosystem Growth: Fund 15 invests in a Designer-Led project that prioritizes UX and storytelling, creating a new, sustainable genre for the Cardano gaming ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"GameFi","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1663}