{"pr_id":"019ac141-cee2-7a5d-a6ae-c003d9a494fc","title":"Cardano Governance & DAO Analytics Engine","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"DAO data on Cardano is scattered across multiple platforms, making it difficult to track participation, treasury activity, and overall DAO health. A unified, open-source analytics tool is missing.","solution":"We will build an open-source platform that aggregates DAO data across Cardano, providing unified on participation, governance activity, and treasury movements through a publicly accessible interface.","proposer_name":"Christoffer Raun","proposer_relevant_experience":"My name is Christoffer, and I have worked on various Cardano projects. I hold a master’s degree in computer science and am dedicated to helping shape the DAO landscape on Cardano. I have extensive experience building software projects and delivering high-quality code on time. I am super excited to contribute to the growth of the Cardano ecosystem with this project proposal. Please see my GitHub link for the first MVP of this project. Here my github with my MVP code for demonstration purposes: [https://github\\.com/chris\\-r\\-99/cardano\\-dao\\-engine\\.](https://github.com/chris-r-99/cardano-dao-engine.) My linked in profile: [https://www\\.linkedin\\.com/in/christoffer\\-r\\-59a8aa1bb/](https://www.linkedin.com/in/christoffer-r-59a8aa1bb/)","url":null,"funds":84000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Cardano Governance & DAO Analytics Engine","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Christoffer Raun","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":84000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":7,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"DAO data on Cardano is scattered across multiple platforms, making it difficult to track participation, treasury activity, and overall DAO health. A unified, open-source analytics tool is missing.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will build an open-source platform that aggregates DAO data across Cardano, providing unified on participation, governance activity, and treasury movements through a publicly accessible interface.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://github.com/chris-r-99/cardano-dao-engine"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"MIT License","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"DAO","group":"Governance"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"This project is innovative because it introduces the first ecosystem-wide, open-source analytics layer designed specifically for Cardano’s diverse and rapidly expanding DAO landscape. While some tools focus on individual DAOs or single governance frameworks, no existing solution unifies data across multiple DAO platforms, voting models, and treasury systems. Our approach standardizes how DAO metrics are collected, interpreted, and accessed, creating a shared foundation for transparency and comparison that has not previously existed.\n\n\n\nThe platform goes beyond simple dashboards by offering a fully open and extensible API, enabling developers, researchers, and community tools to build on a common data layer. This transforms fragmented DAO information into a coherent, comparable dataset accessible to everyone. By combining cross-DAO aggregation, normalized governance metrics, and open-source infrastructure, the project provides an innovative leap forward in how Cardano DAOs can be understood, evaluated, and improved.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our prototype (MVP) will demonstrate the core functionality of the platform by aggregating real DAO data from an initial set of Cardano DAOs beginning with the MinSwap DAO and expanding to others. It will showcase the ability to fetch, process, and display key governance metrics such as participation rates, proposal activity, and treasury movements in a unified format.\n\n\n\nThe MVP will also include the first version of our public API, allowing developers to access these metrics directly and test integrations with their own tools or dashboards. This early version will validate our data model, performance, and cross-DAO compatibility before expanding to more governance frameworks.\n\n\n\nThe prototype will be fully accessible through a public web endpoint and hosted API, with all source code available on our GitHub repository from day one. This ensures transparency, community feedback, and the ability for others to test and build on top of the platform immediately.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"**Platform adoption metrics:**\n\n- API usage: A measurable number of external calls \n- Repository engagement: Stars, forks, and issue activity on GitHub indicating real community use.\n- DAO feedback: Direct requests from DAOs to expand coverage or add analytics features.\n\n\n\n**Ecosystem impact metrics:**\n\n- Improved participation insight: Demonstrated ability for DAOs to identify participation trends and treasury behavior using the tool.\n- Transparency increase: Multiple DAOs referencing the analytics in governance discussions or reports.\n- Research utility: Use of the dataset in community research, governance analysis, or Catalyst proposals.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We will develop a unified, open-source analytics platform that aggregates and standardizes DAO data across the Cardano ecosystem. The platform will collect key governance and treasury metrics - such as participation rates, proposal activity, voting patterns, community engagement, and on-chain treasury movements - from all major DAO frameworks on Cardano.\n\n\n\nThis data will be processed, normalized, and presented through a consistent interface, allowing users to easily compare DAO performance, understand governance trends, and monitor treasury health. Alongside the dashboard, we will provide a fully documented public API so developers, researchers, and DAO teams can integrate these insights directly into their own tools and workflows.\n\n\n\nBy consolidating fragmented DAO data into a single transparent and accessible platform, our solution directly addresses the current lack of visibility across Cardano’s growing DAO landscape. It empowers community members to make informed decisions, improves accountability within DAOs, and gives the ecosystem a shared foundation for analyzing and strengthening decentralized governance.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project strengthens the wider Cardano community by making DAO activity transparent, accessible, and easy to understand. By unifying governance and treasury data into a single open-source platform, it enables community members to stay informed, participate more effectively, and hold DAOs accountable.\n\n\n\nDevelopers and researchers gain a reliable data foundation for building tools, dashboards, and analysis, reducing duplicated effort across the ecosystem. DAOs benefit from clearer insights into participation trends, treasury flows, and governance health—leading to better decision-making and stronger community trust.\n\n\n\nUltimately, the platform helps Cardano’s decentralized communities operate more efficiently, engage more meaningfully, and grow more sustainably, improving the entire ecosystem’s governance maturity.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"I have a proven track record of delivering high-quality software within the Cardano ecosystem and across multiple professional projects. With a master’s degree in computer science and years of experience building scalable systems, I bring both the technical ability and discipline required to deliver this project reliably and on time.\n\n\n\nI have already produced an initial MVP for this platform, demonstrating my ability to execute and validate the core concepts early. My development process is fully transparent: all code will be published on GitHub from day one, with continuous updates, clear documentation, and open issue tracking so the community can follow progress in real time.\n\n\n\nI am committed to open-source principles, reproducible builds, and publicly verifiable development. By sharing progress openly, engaging with feedback, and adhering to Catalyst reporting standards, I ensure high accountability throughout the entire project. This combination of technical expertise, transparency, and previous delivery experience provides a strong foundation of trust for completing this project successfully.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"DAO Research & Metrics Defintion","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Short report to understand the current DAO forms on Cardano\n- Identify relevant parameters to track key DAO metrics (e.g. participation numbers, treasury activity, proposal histories)\n- First technical plan to understand how these metrics will be implemented in our platform","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The report defines which DAO metrics we have indentified and how we can include them on our platform \n- The technical plan outlines the tech stack we are planning to use for this project and how the different components we identified will be implemented","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to Research Report to understand current Cardano DAO landscape\n- Link to technical plan outlining tech tool stack and architecture of first conponents (can be either in PDF form or README in the GitHub repository)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":21000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Development of Backend Infrastructure","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Data crawler to fetch different DAO sources and bring them into a unified database format\n- Backend systen analysing the different databases and serving them through different APIs\n- Uniform API including endpoint documentation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Integrating at least 2 different DAOs and bring them into a unified format \n- Test-framework to validate API values and validate that the correct schema is returned \n- Detailed documentation of available API endpoints","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Open-Source Code available on GitHub with clear README documentation for reproducability\n- Link to documentation of API endpoints and deployed API","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":23000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Frontend Development","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Develop a React Frontend that visualizes the key DAO metrics we defined in mileston 1\n- Documentation for the DAO frontend and its development (for both developers and end users)\n- Publicly Acceesible DAO frontend","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Open-source code for the DAO frontend should be released under MIT license\n- DAO frontend should at least visualizes 4 key metrics we have identified \n- Documentation should include instructions for developers to reproduce the frontend and define clear contributiosn guidelines","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to the frontend project source code released on Github\n- Documentation for the frontend (either as PDF or Github readme)\n- Link to the publicly accessible DAO frontend","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Milestone","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Project Close-Out Report accoring to Project Catalyst Guidelines\n- Project Close-Out Video according to Project Catalyst Gudelines\n- API Documentation for Ecosystem Projects \n- Example demonstration to show end-to-end flow of API and Frontend","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Project Close-Out Report follows Catalyst guidelnes\n- Project Close-Out Video follow Catalyt guidelines\n- API Documentation such that ecosystem projects can include the DAO AP in their interfaces\n- Example demonstation should clearly demonstrate how changes in a Cardano DAO update our internal metric tools and hence frontend/API results -> example can either be provided as video or text","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to Project Close-Out Report\n- Link to Project Close-Out Video\n- Link to API documentations\n- Link to Example end-to-end flow of how our API tracks DAO decisions across Cardano","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"My name is Christoffer, and I have worked on various Cardano projects. I hold a master’s degree in computer science and am dedicated to helping shape the DAO landscape on Cardano. I have extensive experience building software projects and delivering high-quality code on time. I am super excited to contribute to the growth of the Cardano ecosystem with this project proposal. Please see my GitHub link for the first MVP of this project. Here my github with my MVP code for demonstration purposes: [https://github\\.com/chris\\-r\\-99/cardano\\-dao\\-engine\\.](https://github.com/chris-r-99/cardano-dao-engine.) My linked in profile: [https://www\\.linkedin\\.com/in/christoffer\\-r\\-59a8aa1bb/](https://www.linkedin.com/in/christoffer-r-59a8aa1bb/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Calculation: 1 ADA ≈ 0\\.40 USD**\n\n**Total funding requested: 33,600 USD**\n\nThe project is expected to require approximately 8-9 weeks of full-time work, covering milestones 1 through 4. With an hourly rate of roughly 90 USD, the total work effort aligns with the requested budget of 32,600 USD.\n\nThis estimate does not include the additional time required for Catalyst administrative tasks such as milestone submissions, the close-out video, and the final report, which I expect will add approximately 50 hours of work.\n\nNo extra licensing or software expenses are anticipated, as the project will primarily use free tools and open-source technologies.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project offers strong value for money by creating an open-source analytics platform that any Cardano DAO can use at no cost. Instead of each DAO building its own tools, the ecosystem gains a shared data infrastructure that improves transparency, participation, and treasury oversight. Because better governance strengthens many communities at once, the impact of this project extends far beyond its development cost and becomes a long-term public good.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"DAO","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1664}