{"pr_id":"019abaa6-acd6-7ac8-858b-7162742e4e38","title":"GAIA: Turn local shopping into a movement","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Small businesses lack visibility and access to innovative tools, while consumers face privacy risks and struggle to make sustainable choices in their everyday shopping.","solution":"Gaia is the first platform that turns your shopping habits into a game, empowering local businesses and rewarding your sustainable choices.","proposer_name":"Álvaro Liébana Carrascosa","proposer_relevant_experience":"Álvaro Liébana Carrascosa (CEO and Blockchain architect)\n\nMainly focus on the blockchain and data encryption side, designing its architecture and implementing the system’s core logic.\n\nAs CEO, I am also responsible for shaping the company’s strategy, defining its vision and goals, and leading business development and partnerships.\n\n[https://www\\.linkedin\\.com/in/alvaro\\-liebana\\-carrascosa\\-898a67254/](https://www.linkedin.com/in/alvaro-liebana-carrascosa-898a67254/)\n\nDavid Hostalrich Jato (CTO)\n\nPrimarily focused on off-chain development, including the mobile application, its architecture, and integrations with external services. UX/UI Design.\n\n[https://www\\.linkedin\\.com/in/david\\-hostalrich\\-jato\\-2abaaa209/](https://www.linkedin.com/in/david-hostalrich-jato-2abaaa209/)\n\nHere is our CVs, where you can see our experience with other projects.\n\n[https://www\\.dropbox\\.com/scl/fo/6ri5ohu24u99z3wf61o9b/AJeHmYtavQO4xVUjmTOExUI?rlkey=bp97d0z0n6audftqy67gyiix2&amp;st=nmxl4vq8&amp;dl=0](https://www.dropbox.com/scl/fo/6ri5ohu24u99z3wf61o9b/AJeHmYtavQO4xVUjmTOExUI?rlkey=bp97d0z0n6audftqy67gyiix2&st=nmxl4vq8&dl=0)","url":null,"funds":100000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"GAIA: Turn local shopping into a movement","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Álvaro Liébana Carrascosa","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":100000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Please indicate if your proposal has been auto-translated","description":"Indicate if your proposal has been auto-translated into English from another language","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"es","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Small businesses lack visibility and access to innovative tools, while consumers face privacy risks and struggle to make sustainable choices in their everyday shopping.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Gaia is the first platform that turns your shopping habits into a game, empowering local businesses and rewarding your sustainable choices.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://tricubo.tech/gaia","https://www.linkedin.com/company/tricubo-technologies/?view","https://www.dropbox.com/scl/fi/z5wmklntsxl56wbiz5559/Gaia-Pitch-deck-for-Cardano-Catalyst.pdf?rlkey=bu1ejb06xgki15ksnn2iahr20&st=z9vzzn0o&dl=0"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"We intend to make public the parts of the code related to the blockchain, including smart contracts and transaction handling, to increase transparency and trust.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"E-commerce","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"GAIA is fundamentally different from existing solutions. It is not just a digital receipt wallet or another reward platform, it is a visibility engine for local commerce, transforming everyday purchases into an interactive and gamified experience. Through a Season Pass, small shops can showcase products, stories, and promotions, turning physical shopping into a rewarding journey that builds lasting, healthy habits rather than speculation.\n\nWeb3-focused alternatives like VeChain’s GreenCart, NanoAct, or Scannit target mostly crypto-native users and rely heavily on token incentives, with blockchain used primarily for simple airdrop or reward mechanics.\n\nMeanwhile, Web2 competitors struggle with poor technology, low data accuracy, and intrusive data collection models.\n\nGAIA bridges these two worlds with a frictionless, Web2-friendly experience that fully embraces core blockchain principles:\n\n-End-to-end encryption, powered by a Diffie-Hellman–based architecture\n\n\n\n-True data sovereignty, decentralizing access to purchase information\n\n\n\n-Zero-knowledge proofs enabling private, verifiable returns and compliance workflows\n\n\n\n-No personal data required, and no added friction for everyday users\n\n\n\nGAIA brings blockchain to ordinary people through meaningful, daily interactions, not speculation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our prototype will demonstrate that blockchain can be part of everyday life, even for people with no technical background. It shows that its value goes far beyond DeFi or tokenization, proving that blockchain can improve simple, practical routines.\n\n\n\nThrough a simple mobile app, users will experience private, verifiable and gamified digital receipts, ownership of data, automatic reminders for return and warranty periods, a personal history of purchases, and access to a new, privacy preserving rewards system designed to support local businesses.\n\n\n\nAll core features will be available to everyone who downloads the app. In our initial city, users will also enjoy the full set of local interactions: personalized offers, participation in the Season Pass gamification, and partner shop rewards. These location based features will be progressively rolled out to new regions and countries as we expand.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Measuring our success with on-chain metrics is straightforward. In GAIA, every purchase has the potential to generate a blockchain transaction, a powerful indicator of real world adoption. While this represents a huge long term opportunity, we remain realistic about the early stages.\n\n\n\nOver the estimated 9 month pilot period, we expect to achieve 50,000 on-chain mainnet transactions, driven by receipt registrations, merchant-issued receipt events, and verifiable proofs for returns and guarantees.\n\n\n\nWe also track unique and active users. To validate GAIA as a real use case, our goal is to reach 1,000 active users during the pilot, with a clear path toward 10,000 users as the project expands. For a controlled launch environment, these are realistic numbers that can demonstrate strong traction and set the foundation for something bigger.\n\n\n\nThese metrics will give us a precise, transparent view of the project’s growth and real world impact..","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Our solution brings a new approach to strengthening local commerce: we gamify the shopping experience to encourage more sustainable consumer habits while giving small businesses a powerful new visibility channel.\n\n\n\nTo put it in context, we address the problem from two angles, consumers and local merchants.\n\n\n\nFor consumers, we introduce a Season Pass, similar to those found in popular video games, with levels from 0 to 100. Users earn points based on the sustainability of their purchases, measured through eight KPIs such as product proximity, sustainable production, and energy-efficient operations. The more sustainable their choices, the faster they progress through the Season Pass and earn better rewards.\n\n\n\nFor merchants, the current marketing reality is simple: visibility ends at the corner of their street. Our system changes that.\n\nThe Season Pass becomes a large, dynamic showcase where shops can present their products, stories, and promotions to a much wider audience. This gives local businesses a new discovery channel that normally would not be accessible to them, helping them compete with large digital platforms in a fair and meaningful way.\n\n\n\nBy aligning consumer incentives with merchant visibility, our solution directly tackles the core problem for everyone.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"We understand that within the Cardano ecosystem, governance is a central pillar.\n\n\n\nThat's why our approach places the Cardano community at the heart of the project. We will offer exclusive discounts and benefits for Cardano users, and we will integrate a governance layer where the community will have real influence over key decisions of our project. Our goal is to make Cardano members active stakeholders, not passive observers, something we wish more projects would embrace.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our team is highly qualified  to deliver this project with high levels of trust and accountability. Both of us are telecommunications engineers with extensive experience in development and product design, which gives us the technical and practical expertise to execute this project reliably.\n\n\n\nThis idea has been carefully matured over time; we are not starting from scratch. We have already developed key components of the system and a solid architecture, demonstrating our ability to plan and execute complex solutions. Our long standing passion for blockchain is supported by 4-5 years of studying and piloting projects across Ethereum, IOTA, and Algorand.\n\n\n\nTo ensure feasibility and accountability, we follow structured processes: defining clear milestones, maintaining transparent development documentation, and testing each component in real-world conditions.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Private and Decentralized Receipt Management","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone lays the foundation of the project. We will develop a mobile app that scans purchase receipts, digitizes them with AI, and handles privately encrypted receipts secured through Diffie‑Hellman, enabling decentralized access via the Cardano blockchain.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Success for this milestone is defined by the launch of the application, enabling users to upload purchase receipts to our decentralized platform. Receipts are securely encrypted and can only be decrypted by their owners through their wallet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will be the application itself, which anyone can install on their mobile device (Android and IOS), along with the first transactions decentralized purchase receipts generated through our app!","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"POS Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"It is important that merchants can issue receipts directly from their terminals. To enable this, we will develop integrations with two of the most popular commerce platforms, Shopify and Odoo, allowing merchants to start sending purchase receipts. Additionally, we will enable them to send discounts to potential customers through our app.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"With merchants able to issue receipts to consumers through GAIA, we expect hundreds of users at this stage, who can securely receive, view, and redeem discounts via the app, experiencing decentralized and private transactions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The way to demonstrate this is simple. We would consider this metric successful with around 100 active users, 1,000 receipts, and tracking metrics such as returns, discounts redeemed, and receipts issued directly by merchants.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Gamification System and Seasonal Pass","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"In this stage, we will develop the core of the project: the gamification system. This includes designing the system architecture, implementing the smart contract logic, and integrating KPIs to evaluate the sustainability of each receipt. Merchants will begin advertising their products or promotions through the new seasonal pass, which will be created during this stage.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Success is defined by being able to see a well-designed seasonal pass featuring local neighborhood merchants advertising their products or discounts. These will be available in the region of the initial pilot, and later more regions will be added with new merchant connections and additional discounts.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Deployment of the smart contract, tokenization of sustainability points for each purchase to prevent hacks, and transactions derived from the levels achieved in the seasonal pass, all managed by the smart contract.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Álvaro Liébana Carrascosa (CEO and Blockchain architect)\n\nMainly focus on the blockchain and data encryption side, designing its architecture and implementing the system’s core logic.\n\nAs CEO, I am also responsible for shaping the company’s strategy, defining its vision and goals, and leading business development and partnerships.\n\n[https://www\\.linkedin\\.com/in/alvaro\\-liebana\\-carrascosa\\-898a67254/](https://www.linkedin.com/in/alvaro-liebana-carrascosa-898a67254/)\n\nDavid Hostalrich Jato (CTO)\n\nPrimarily focused on off-chain development, including the mobile application, its architecture, and integrations with external services. UX/UI Design.\n\n[https://www\\.linkedin\\.com/in/david\\-hostalrich\\-jato\\-2abaaa209/](https://www.linkedin.com/in/david-hostalrich-jato-2abaaa209/)\n\nHere is our CVs, where you can see our experience with other projects.\n\n[https://www\\.dropbox\\.com/scl/fo/6ri5ohu24u99z3wf61o9b/AJeHmYtavQO4xVUjmTOExUI?rlkey=bp97d0z0n6audftqy67gyiix2&amp;st=nmxl4vq8&amp;dl=0](https://www.dropbox.com/scl/fo/6ri5ohu24u99z3wf61o9b/AJeHmYtavQO4xVUjmTOExUI?rlkey=bp97d0z0n6audftqy67gyiix2&st=nmxl4vq8&dl=0)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Core Development & Engineering: Full stack design (server design, commerce integration, POS, and mobile app design).\n\n40,000 ADA\n\n\n\nSmart Contract Design: Development and design of the smart contract logic.\n\n25,000 ADA\n\n\n\nUX/UI Design\n\n10,000 ADA\n\n\n\nAudits: Security and code audits for smart contracts and the platform.\n\n15,000 ADA\n\n\n\nTesting & Infrastructure: Testnet/mainnet deployment, hosting, server setup, and comprehensive testing.\n\n10,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Very few projects today truly push the technical capabilities of the Cardano blockchain. Our goal is to take those capabilities to their limits, significantly increasing TPS and demonstrating that Cardano can power highly scalable, everyday applications. This is essential for attracting Web2 users into Web3 and showing them how governance, smart contracts, and decentralized infrastructure can be used seamlessly and without friction.\n\n\n\nIn our model, every purchase can become an on-chain transaction. This means our project has the potential to increase network usage, which directly benefits the ecosystem by strengthening its utility, visibility, and economic activity.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"E-commerce","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1665}