{"pr_id":"019abe06-f532-7264-a814-e225d885bd21","title":"[B-REC]: Trusted IoT Edge Oracle (Industrial DePIN)","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano's RWA future is at risk. It's built on untrusted API data, vulnerable to 'Garbage In, Garbage Out' fraud. We lack an open, industrial-grade hardware 'Root of Trust' to secure the source.","solution":"We build an Industrial IoT Oracle using a Hardware Secure Element (HSM) and Rust. It signs energy data at the source, creating a tamper-proof 'Proof of Source' stream for any RWA protocol.","proposer_name":"BREC Team","proposer_relevant_experience":"This project is driven by a leadership focused on hyper-scaling physical networks, backed by a specialized industrial engineering unit.\n\n\n\n1. Duc Le – Project Lead & Operations Strategy\n\n\n\nRole: Overall Project Management, Go-to-Market Strategy, and Network Operations.\n\n\n\nTrack Record: Co-founded and successfully scaled the Big Family Pharmacy franchise to over 1,000 stores nationwide in just 3 years.\n\n\n\nWhy this matters for DePIN: This achievement demonstrates an exceptional ability to build, operate, and expand complex, trust-based physical networks. Duc brings the \"Zero-to-One\" operational playbook required to deploy and manage thousands of IoT devices globally, moving beyond theory to real-world execution.\n\n\n\nSocial Facebook: [https://www\\.facebook\\.com/LeDucOpus/](https://www.facebook.com/LeDucOpus/)\n\nTelegram: @duclv_10m\n\n\n\n2. The Engineering Core (Technical Execution)\n\nBehind the leadership stands a senior engineering team bridging Operational Technology (OT) and Blockchain. Detailed profiles and portfolios are constantly updated at: [https://docs\\.brec\\.io/meet\\-our\\-team](https://docs.brec.io/meet-our-team)\n\n\n\nLead IoT Architect: Embedded Systems Engineer with 10+ years in Industrial Automation (SCADA/PLC). Expert in implementing 'Root of Trust' on Industrial Gateways using TPM 2.0/HSM. Proven track record of deploying remote monitoring systems across Southeast Asia.\n\n\n\nSenior Rust Developer: A specialist in embedded Rust, focusing on no_std environments and async runtimes. This expertise ensures firmware stability and memory safety—critical for remote devices that cannot be easily rebooted.\n\n\n\nBackend Systems Architect: Senior Engineer experienced in building high-throughput ingestion pipelines (MQTT/Kafka) capable of handling concurrent data streams from thousands of IoT devices.\n\n\n\nWhy trust this structure?\n\nDePIN projects often fail not because of code, but because of Logistics and Operations.\n\n\n\nDuc Le provides the operational backbone: He knows how to manage supply chains, distribute hardware, and scale a physical network to 1,000+ nodes.\n\n\n\nThe Engineering Core provides the industrial-grade technology: Ensuring the hardware works reliably in harsh environments.","url":null,"funds":135000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"[B-REC]: Trusted IoT Edge Oracle (Industrial DePIN)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"BREC Team","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":135000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano's RWA future is at risk. It's built on untrusted API data, vulnerable to 'Garbage In, Garbage Out' fraud. We lack an open, industrial-grade hardware 'Root of Trust' to secure the source.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We build an Industrial IoT Oracle using a Hardware Secure Element (HSM) and Rust. It signs energy data at the source, creating a tamper-proof 'Proof of Source' stream for any RWA protocol.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://docs.brec.io","https://docs.brec.io/market-insight","https://docs.brec.io/b-rec-trusted-iot-edge-oracle-industrial-depin","https://github.com/BREC-App"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"To foster a truly decentralized DePIN, we will open-source the complete blueprint for our hardware oracle. This includes all software (Rust Firmware, Oracle Backend) under the Apache 2.0 license, and all hardware specifications (Bill of Materials, wiring schematics). This empowers anyone in the community to independently build, audit, and deploy their own nodes, preventing vendor lock-in and ensuring true network resilience.\n","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"RWA","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"We are pioneering the Physical Trust Layer for Energy on Cardano. While most projects rely on flimsy hobbyist hardware (Raspberry Pis) or closed proprietary systems, our innovation lies in three industrial-grade differentiators:\n\n1. **Industrial\\-Grade Resilience**: We utilize off-the-shelf Industrial Gateways (e.g., Teltonika RUTX series) designed to survive harsh solar farm environments (dust, 75°C heat). We avoid custom PCB manufacturing risks by focusing on advanced firmware development for proven hardware.\n2. Hardware-Rooted Trust (The \"Secure Element\"): We integrate Industrial USB Security Dongles (e.g., YubiHSM/Nitrokey) or leverage onboard TPM 2.0. Private keys are generated inside this secure element and never leave it. This ensures Non-repudiation—once data is signed, it is mathematically proven to come from that specific physical device. This makes spoofing impossible even if the host Operating System is compromised.\n3. **Universal Data Oracle Strategy:** This device is Protocol Agnostic. It acts as a \"Universal Oracle\" that can feed verified data to any consumer—whether it is our own B-REC Protocol, external Carbon Auditors, Legacy Registries (I-REC), or other dApps. This creates a \"Data-as-a-Service\" revenue model that is robust and independent of any specific token's price action..","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"By the end of 6 months, we will have a deployment-ready Industrial IoT Oracle and Management System:\n\n- **The Hardware:** A ruggedized gateway running our custom Rust Firmware, connected to a real solar inverter via Modbus RS485 and securing keys via HSM.\n- **The Trust Chain:** Demonstration of the Secure Boott and Hardware Signing process.\n- **The Universal API:** A public API endpoint where anyone can query the signed energy data JSONs from our pilot device.\n- **The Pilot:** A 30-day continuous run at a partner solar farm, showcasing stability and data integrity under real-world conditions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"- **Hardware Reliability:** The device achieves 99.9% uptime during the 30-day industrial pilot without manual reboot.\n- **Security Integrity:** Penetration testing confirms that Private Keys cannot be extracted from the Secure Element/HSM.\n- **Interoperability:** The Universal Data API successfully serves data to at least two different simulated consumers (e.g., B-REC Protocol and a mock Auditor Dashboard).\n- Operational Viability: Successful execution of the \"On-site Commissioning\" procedure, creating an immutable link between the Physical Device ID, the GPS location, and the Digital Identity (DID).","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The Vision: A Decentralized Energy Network on Cardano\n\nB-REC is engineering a decentralized, tiered, and data-agnostic energy network on the Cardano blockchain. Our vision is to establish a foundational protocol for the digitization and trading of Real World Assets (RWA) within the renewable energy sector. By standardizing the validation and tokenization process of energy yield data, B-REC unlocks a liquid, transparent, and efficient marketplace for Renewable Energy Certificates (RECs) and Carbon Credits.\n\nThe Innovation: The Hybrid Trust Model\n\nThe core innovation of B-REC lies in the Hybrid Trust Model, a dual-tier architecture designed to solve the &quot;Energy RWA Trilemma&quot;: Accessibility vs. Security vs. Scalability. We recognize that forcing producers to replace existing infrastructure (the &quot;Hardware Wall&quot;) is a major barrier to widespread adoption. Simultaneously, relying solely on API data without verification mechanisms creates vulnerabilities for fraud and &quot;Greenwashing.&quot;\n\nB-REC solves this by deploying a two-tiered system that accepts both data types while transparently classifying them:\n\nTier 1 (The Gold Standard): Cryptographically Trusted Data. This data originates from B-REC Trusted Edge devices—industrial IoT gateways equipped with Hardware Security Modules (HSM). Data is cryptographically signed at the source using the Ed25519 algorithm, ensuring data integrity and non-repudiation. This represents the highest level of trust.\n\nTier 2 (The Silver Standard): Algorithmically Trusted Data. To break the accessibility barrier, B-REC supports data from legacy API systems of leading inverter manufacturers (e.g., Huawei, SolarEdge). While accessible, this data carries spoofing risks. We mitigate this by routing data through a Satellite Cross-Check Engine, which compares reported output against historical solar irradiance data at the asset's specific GPS coordinates to flag anomalies.\n\nBy combining Hardware Trust and Algorithmic Trust, B-REC creates a flexible protocol that welcomes gigawatts of existing energy capacity onto Cardano while providing a clear pathway to upgrade to the highest security standards.\n\nThe Problem Landscape: The Hardware Wall &amp; The Trust Gap\n\nThe current Energy RWA market is trapped between two extremes, creating inefficiencies and massive barriers to entry.\n\n- The Hardware Wall (CAPEX Barrier)\n\nThe majority of current blockchain solutions require energy producers to install expensive, dedicated Smart Meters to join the network.\n\nCost: An industrial-grade smart meter costs between $500 - $1,000, excluding installation and maintenance.\n\nConsequence: This disqualifies 95% of small and medium-scale solar projects (SME/Rooftop). These producers already possess smart inverters but are unwilling to incur additional capital expenditure (CAPEX). Consequently, RWA market liquidity is strangled at the source.\n\n- The Trust Gap (Greenwashing Risk)\n\nConversely, solutions that do not require hardware (relying on manual reporting or Excel files) face severe data integrity issues.\n\nGreenwashing: Self-reported data is easily manipulated to exaggerate green output.\n\nDouble Counting: A single MWh of electricity can be sold as a REC to multiple buyers because there is no public ledger to track the &quot;retired&quot; status.\n\nLack of Verification: Data from Inverter APIs (Legacy APIs), while convenient, is fundamentally Web2 data. It can be intercepted or altered at the intermediate server level before reaching the user.\n\nThe market demands a protocol capable of lowering entry barriers (like Web2) while elevating security standards (like Web3). This is the mandate of B-REC.\n\n\n\nWe are building an Industrial IoT Edge Oracle powered by custom Rust Firmware and Hardware Security Modules (HSM/TPM). This device reads data directly from solar inverters via Modbus, cryptographically signs it at the hardware level (ensuring Non-repudiation), and streams it via a Universal API, serving as the &quot;Guardian of Truth&quot; for the entire ecosystem.\n\n**B\\-REC IoT Edge: The Guardian of Truth\\.**\n\nWe are building the physical foundation for the Energy RWA ecosystem on Cardano. Our solution attacks the &quot;Garbage In, Garbage Out&quot; problem at its root: the physical data source.\n\nThe Hardware-First Architecture:\n\n- The Edge (Industrial Gateway): We select battle-tested industrial hardware (like Teltonika RUT series) that supports Modbus/RS485 natively.\n- The Security (HSM/TPM): We employ a hardware-based &amp; Root of Trust&amp; (using USB HSM or TPM) to store private keys, ensuring military-grade security.\n- The Firmware (Rust): We write the logic in Rust for memory safety. This firmware polls the inverter, buffers data offline if the internet cuts out (preventing data loss), and signs payloads using the HSM.\n- The Oracle (Universal Verification): A backend server that receives the stream, verifies the Ed25519 signatures, checks for anomalies (e.g., generation at night), and exposes the clean data via a standard API.\n\n**Value Proposition for Users \\(Why buy this?\\):**\n\nWe position this device as a 2-in-1 Solution:\n\nOperational Monitoring: It replaces expensive legacy SCADA systems, giving farm owners free, granular, real-time monitoring dashboards to track their plant's health.\n\nAsset Tokenization: It enables them to mint high-value &quot;Gold Tier&quot; RWA tokens (via the B-REC Protocol).\n\nThis ROI model ensures adoption is driven by utility, not just speculative token incentives.\n\n**Strategic Independence and Synergy:**\n\nWhile this B-REC Edge device is designed to be the &quot;Gold Standard&quot; data source for our complementary software proposal, the B-REC Protocol (a system for minting RWA tokens from various data sources), it is engineered to be fully independent and commercially valuable on its own.\n\nSynergy Scenario (Both proposals funded): The B-REC Edge device feeds its cryptographically signed data directly to the B-REC Protocol to automatically mint the highest-quality &quot;Tier 1&quot; RWA tokens. This creates a seamless, end-to-end trusted ecosystem.\n\nIndependent Scenario (Only this proposal funded): The B-REC Edge functions as a standalone &quot;Data Oracle.&quot; We can sell this verified data stream as a service to traditional I-REC registries, carbon auditors, or other blockchain projects (like Midnight or IOTA) that need trusted real-world inputs. The value lies in the Data Quality and the Hardware Trust, which exists regardless of the token protocol.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"- Infrastructure for DePIN: We provide the open hardware specs and firmware that any developer can use to build their own Energy DePIN nodes on Cardano.\n- Solving the &quot;Garbage In&quot; Problem: By signing data at the hardware level, we eliminate the risk of manual data tampering at the source, increasing the value of any RWA minted downstream.\n- Data-as-a-Service: We create a new business model for the ecosystem where high-quality, verifiable energy data becomes a tradable commodity itself, useful for AI modeling, grid optimization, and auditing.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Team Capabilities:\n\n- IoT Lead: Embedded Systems Engineer with 10 years of experience in Industrial Automation (SCADA/PLC). Expert in the Modbus protocol and implementing 'Root of Trust' on Industrial Gateways using TPM 2.0/HSM. Proven track record of deploying remote monitoring systems in Southeast Asia.\n- Rust Developer: Specialist in embedded Rust, focusing on no_std environments and async runtimes. This expertise ensures firmware stability and memory safety, which is critical for remote devices that cannot be easily rebooted.\n- Backend Architect: Experience building high-throughput ingestion pipelines (MQTT/Kafka) capable of handling concurrent data streams from thousands of IoT devices.\n\nFeasibility Strategy:\n\n- Off-the-shelf Hardware: We are not manufacturing custom PCBs (high risk). We are writing software for existing, proven Industrial Gateways. This reduces hardware manufacturing risk to near zero.\n- Hardware Abstraction Layer (HAL): Our firmware uses a HAL design. While we target Teltonika, we can quickly port to other Linux-based industrial gateways (e.g., Advantech, Moxa) if supply chain issues arise.\n- Lab Simulation: We develop a &quot;Modbus Simulator&quot; in Milestone 2 to test the firmware rigorously before going to the physical site.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Hardware & Security Architecture","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Industrial BOM Selection: Finalize the Bill of Materials (BOM), selecting the specific Industrial Gateway model (e.g., Teltonika RUTX) and the USB Hardware Security Module (e.g., YubiKey/Nitrokey). Procurement of initial dev units.\n2. Security Architecture Design: A comprehensive technical document designing the \"Trusted Boot\" process, Key Generation Ceremony, and Key Storage architecture. It must detail how keys are kept isolated within the Secure Element.\n3. Modbus Register Map: Define the specific data points (Voltage, Current, Active Power, Frequency, Total Energy) for the selected pilot inverter brand (e.g., Huawei) to standardize data collection.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- BOM verified for global availability and technical compatibility (ports, OS support).\n- Security Design Document covers threat modeling (physical attacks, side-channel attacks).\n- Register Map JSON definition is published and verified against the Inverter's official manual.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- A finalized BOM list with vendor quotes.\n- The Security Architecture Whitepaper (PDF).\n- The Modbus Register Map JSON file on GitHub.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Develop Industrial Firmware (Modbus & Signing)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Modbus Polling Driver: A Rust-based driver to stably read data from the inverter via RS485/TCP.\n2. Hardware-based Signing: Integration logic to offload cryptographic signing (Ed25519) to the connected HSM/TPM module.\n3. Offline Buffer Logic: A local storage mechanism (SQLite/Flash) to buffer data when internet connectivity is lost and resync automatically when restored (Zero Data Loss guarantee).\n4. Simulator Tool: A software tool to simulate inverter signals for CI/CD pipeline testing.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Firmware compiles successfully for the target gateway architecture (e.g., ARMv7).\n- The Simulator feeds dummy data; firmware successfully signs it using the HSM and outputs valid JSON.\n- The Offline Buffer retains at least 7 days of data during a simulated network outage and uploads it upon reconnection.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to the Firmware GitHub Repository.\n- A Video Demo showing the Simulator feeding data and the Signing process occurring in the Lab environment.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Develop Universal Verification Oracle","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Ingestion API: A scalable MQTT/HTTP server designed to receive data streams from edge devices.\n2. Verification Logic: Backend logic to verify Ed25519 signatures against the device's public key and detect data anomalies (e.g., generation > capacity).\n3. Universal Data API: A standardized, documented REST API for external consumers (Auditors, Protocols) to query verified data.\n4. Device Management UI (Basic): A simple dashboard for admins to view device status (Online/Offline), firmware version, and last seen timestamp.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The Server correctly verifies valid signed packets and rejects invalid ones.\n- The Universal API returns valid, standard JSON data to a test client (e.g., Postman).\n- The Management UI correctly updates the device status in real-time.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public API Documentation (Swagger/OpenAPI).\n- A Postman Collection for testing the API.\n- Screenshots/Video of the Device Management UI in action.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Real-world Industrial Pilot & Open Specs","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Field Deployment: Physical installation of the device at a real solar farm partner for a 30-day continuous test. Includes \"On-site Commissioning\" (binding Device ID to GPS/Serial).\n2. Open Hardware Release: Publication of the full \"Hardware Blueprint,\" including wiring diagrams, final BOM, and Firmware source code.\n3. Integration Guide: Comprehensive documentation for 3rd parties on how to build their own node or consume the Universal API.\n4. Close-out Video: A high-quality video filmed on-site at the solar farm demonstrating the installation and data flow.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The device operates with >99% uptime for the 30-day period.\n- Real-world data matches the inverter's local display and is visible via the Universal API.\n- All repositories and documentation are public and accessible.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- A \"Pilot Performance Report\" containing 30 days of data logs.\n- Link to the GitHub Release.\n- The On-site Video and Final Project Report submitted to Catalyst.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"This project is driven by a leadership focused on hyper-scaling physical networks, backed by a specialized industrial engineering unit.\n\n\n\n1. Duc Le – Project Lead & Operations Strategy\n\n\n\nRole: Overall Project Management, Go-to-Market Strategy, and Network Operations.\n\n\n\nTrack Record: Co-founded and successfully scaled the Big Family Pharmacy franchise to over 1,000 stores nationwide in just 3 years.\n\n\n\nWhy this matters for DePIN: This achievement demonstrates an exceptional ability to build, operate, and expand complex, trust-based physical networks. Duc brings the \"Zero-to-One\" operational playbook required to deploy and manage thousands of IoT devices globally, moving beyond theory to real-world execution.\n\n\n\nSocial Facebook: [https://www\\.facebook\\.com/LeDucOpus/](https://www.facebook.com/LeDucOpus/)\n\nTelegram: @duclv_10m\n\n\n\n2. The Engineering Core (Technical Execution)\n\nBehind the leadership stands a senior engineering team bridging Operational Technology (OT) and Blockchain. Detailed profiles and portfolios are constantly updated at: [https://docs\\.brec\\.io/meet\\-our\\-team](https://docs.brec.io/meet-our-team)\n\n\n\nLead IoT Architect: Embedded Systems Engineer with 10+ years in Industrial Automation (SCADA/PLC). Expert in implementing 'Root of Trust' on Industrial Gateways using TPM 2.0/HSM. Proven track record of deploying remote monitoring systems across Southeast Asia.\n\n\n\nSenior Rust Developer: A specialist in embedded Rust, focusing on no_std environments and async runtimes. This expertise ensures firmware stability and memory safety—critical for remote devices that cannot be easily rebooted.\n\n\n\nBackend Systems Architect: Senior Engineer experienced in building high-throughput ingestion pipelines (MQTT/Kafka) capable of handling concurrent data streams from thousands of IoT devices.\n\n\n\nWhy trust this structure?\n\nDePIN projects often fail not because of code, but because of Logistics and Operations.\n\n\n\nDuc Le provides the operational backbone: He knows how to manage supply chains, distribute hardware, and scale a physical network to 1,000+ nodes.\n\n\n\nThe Engineering Core provides the industrial-grade technology: Ensuring the hardware works reliably in harsh environments.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Total Request: 135,000 ADA\n\n1. Hardware Engineering & Firmware (45% - 60,750 ADA):\n\nRole: Senior Embedded Engineer (Rust) & IoT Architect.\n\nDetails: Development of the core IP: the secure Rust firmware. This involves complex low-level programming to interface with Modbus industrial protocols and integrating the HSM/TPM drivers. This line item also covers the purchase of development hardware (Multiple Industrial Gateways, various HSM chips) for the lab.\n\nRate Estimation: A blended rate for two specialists working over 4 months.\n\nIoT Architect: ~300 hours @ $45/hr (~13,500 USD).\n\nSenior Rust Dev: ~480 hours @ $35/hr (~16,800 USD).\n\nNote: Rate converted to ADA at conservative estimate to buffer volatility.\n\n\n\n2. Backend Oracle & Universal API (30% - 40,500 ADA):\n\nRole: Senior Backend Developer.\n\nDetails: Building the scalable Ingestion Engine, the Verification Logic, and the critical \"Universal Data API\". This ensures the data is usable by anyone, maximizing the project's value. Includes cloud server costs (AWS/DigitalOcean) for hosting the Oracle during development and pilot.\n\nRate Estimation: ~580 hours @ $35/hr (~20,300 USD).\n\n\n\n3. Field Pilot & Operations (15% - 20,250 ADA):\n\nDetails: All costs associated with the physical deployment and real-world testing.\n\nHardware Procurement for Pilot: 2x Industrial Gateways, HSMs, Industrial Enclosures, DIN Rails, Cabling (Est. 5,000 ADA).\n\nTravel & Install Labor: 2 engineers on-site for 3 days for installation and commissioning (Travel + Per Diem + Labor) (Est. 7,000 ADA).\n\nConnectivity: Industrial IoT 4G/5G Data Plans for 1 year (Est. 3,000 ADA).\n\nContingency: Buffer for site-specific electrical adaptations (Est. 5,250 ADA).\n\nRate Estimation: Based on current market prices for industrial hardware and standard travel/labor costs in the deployment region.\n\n\n\n4. Security & Project Management (10% - 13,500 ADA):\n\nDetails: Conducting internal security assessments (Vulnerability checks), writing technical documentation (Integration Guides), and overall project coordination/reporting.\n\nRate Estimation: ~150 hours @ $45/hr for a part-time Project Manager/Security Lead.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"1. Building the \"Physical Layer\" for Cardano:\n\nCardano excels in software protocols but currently lacks trusted hardware integration. This project provides the Open Source Blueprint for Industrial DePIN. The firmware and architecture we develop can be forked and reused for other IoT verticals (e.g., Water Quality Monitoring, Weather Stations, Supply Chain Tracking), multiplying the ROI of this single grant.\n\n2. Data as a Sovereign Asset:\n\nBy creating a \"Universal Data API,\" we turn energy data into a valuable asset that exists independently of any single DApp. This \"Data-as-a-Service\" model opens up new revenue streams and use cases for the Cardano ecosystem (e.g., selling trusted data to AI models, Grid Operators, or traditional auditors), bringing external liquidity into the network.\n\n3. Industrial Grade = Real Adoption:\n\nWe aren't building toys; we are building industrial tools. By using ruggedized hardware and Rust firmware, we create a solution that real-world energy companies can actually trust and deploy. This moves Cardano from an \"experimental\" blockchain to an \"enterprise utility\" capable of handling critical infrastructure data. The device's \"2-in-1\" value proposition (Free Monitoring + Token Mining) ensures commercial viability beyond the crypto niche.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"RWA","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1669}