{"pr_id":"019ac3cd-4015-79cd-acdd-52d16e071ad4","title":"Cardano Vietnam Builder Bootcamp: From Zero to Mainnet","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Vietnam presents strong potential for the Web3 market, but Cardano still needs more practical campaigns to support builder growth.","solution":"A 7-day tech & business bootcamp with 1:1 mentoring. We help 10 teams build products, supporting at least 5 projects to deploy successfully on Mainnet.","proposer_name":"Blockchain Pioneer Student Club","proposer_relevant_experience":"FOur club has more than 50 members in many different departments and areas of expertise. We are a trusted partner of the entire network of students and programmers in Vietnam, a pioneer club in the field of blockchain in the student community in Vietnam. Here are our social media pages:Our club has more than 50 members in many different departments and areas of expertise. We are a trusted partner of the entire network of students and programmers in Vietnam, a pioneer club in the field of blockchain in the student community in Vietnam. Here are our social media pages:\n\nFacebook: [https://www\\.facebook\\.com/bpsclub\\.utc](https://www.facebook.com/bpsclub.utc)\n\nLinkedIn: [https://www\\.linkedin\\.com/company/bpsclub](https://www.linkedin.com/company/bpsclub)\n\nX:  [https://x\\.com/bps\\_club](https://x.com/bps_club)\n\nEmail: blockchainut@gmail.com\n\nThe event management team includes:\n\n**Thanh Khuat Dinh \\- President**\n\nExperiences:\n\nExperienced leading and managing the operations of the projects, organizations, and club.\n\nProject funded at fund 10, 11, 12, 13, 14 in Project Catalyst.\n\nProject Manager at DEMARKET.\n\nExperienced 3 years of building an operating on the Cardano Blockchain.\n\nBlockchain &amp; Sustainability Researcher\n\nContact:\n\nEmail: khuatthanh45@gmail.com\n\nLinkedIn: [https://www\\.linkedin\\.com/in/thanhkhuatdinh/](https://www.linkedin.com/in/thanhkhuatdinh/)\n\nGithub: github.com/thanh2k3zz\n\n**Trung Do \\- Head of Foreign Affairs**\n\nExperiences:\n\nParticipate in organizing the events &quot;Cardano Blockchain Hackathon 2025&quot; and &quot;Vietnam University Cardano Workshop &amp; Onboarding Series&quot;\n\nExperienced 2 years of building an operating on the Cardano Blockchain.\n\nBlockchain &amp; Sustainability Researcher.\n\nContact:\n\nX: [https://x\\.com/DonielDo\\_VN](https://x.com/DanielDo_VNonielDo_VN)\n\n**Thuong Pham \\- Head of Communications**\n\nExperiences:\n\nParticipate in organizing the events &quot;Cardano Blockchain Hackathon 2025&quot; and &quot;Vietnam University Cardano Workshop &amp; Onboarding Series&quot;\n\nBlockchain &amp; Sustainability Researcher\n\nContact:\n\nTelegram:  @ptmthuong18\n\n**Vy Chu \\- Deputy Head of Communications**\n\nExperiences:\n\nParticipate in organizing the events &quot;Cardano Blockchain Hackathon 2025&quot; and &quot;Vietnam University Cardano Workshop &amp; Onboarding Series&quot;\n\nBlockchain &amp; Sustainability Researcher.\n\nContact:\n\nTelegram:  @Vuynuch","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Cardano Vietnam Builder Bootcamp: From Zero to Mainnet","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Blockchain Pioneer Student Club","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":4,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Vietnam presents strong potential for the Web3 market, but Cardano still needs more practical campaigns to support builder growth.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A 7-day tech & business bootcamp with 1:1 mentoring. We help 10 teams build products, supporting at least 5 projects to deploy successfully on Mainnet.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.facebook.com/share/p/1A6j2UCpTi/","https://www.bpsclub.com/","https://x.com/bps_club"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Fully open source","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Community","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We will target builders and capable teams creating real products, including blockchain-interested students, builders wanting to migrate to the Cardano ecosystem, and Hackathon teams that have products but face difficulties deploying to Mainnet.\n\nWe will reach them by opening registration within the Cardano Vietnam community and conducting communication campaigns on social media platforms such as Facebook, X, and Telegram.\n\nThis is crucial for Cardano because, despite numerous hackathons and workshops, the number of projects actually deployed on Cardano remains limited. The Bootcamp focuses on creating products with real value, capable of running on Mainnet, supported by intensive mentoring. This contributes to improving project quality and expanding the pool of high-quality developers in Vietnam.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"Our project will revolve around the following key activities:\n\n- Open Registration: Registration will be open for 1 month to select the top 10 teams.\n- Mentoring: Daily 1:1 support on technical issues and business strategy for each team during the Bootcamp.\n- Coding Time: Teams will work centrally in the same space, combining with mentors to finalize products, including smart contracts built on Cardano, frontend, backend, video, and product pitch decks.\n- Workshops: Organized in parallel with Coding Time, covering the following topics:\n- Business Model: Building sustainable business strategies and revenue models.\n- Marketing in Web3: User acquisition strategies and community development.\n- Product-Market Fit: Identifying needs and adjusting products for users.\n- Web3 Legal: Understanding laws, tokenomics, legal risks, and blockchain compliance.\n- Pitching: Teams demo their products, and the 3 best projects will be selected.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"- All activities aim to improve project quality, enhance builder capacity, and foster tighter links between teams and mentors.\n- Reach: ≥ 30% of projects participating in Bootcamp selected from 150 registered builders.\n- Completion Rate: ≥ 80% of teams complete the final Bootcamp milestone.\n- Product Quality: &gt;50% of projects deliver a functional MVP (Testnet/Mainnet).\n- Engagement: ≥ 90% of teams participate fully in meetings, workshops, and mentoring sessions.\n- Media Impact: Program recap video reaches ≥ 3,000 views on social media platforms.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**Problem Perception:**\n\nCurrently, the number of developers in Vietnam participating in the Cardano ecosystem remains limited. While other ecosystems like Polkadot or Solana continuously organize academic bootcamps not only in the community but also at top universities in Vietnam, Cardano lacks these community resources, especially students who can contribute directly.\n\n**Solution:**\n\nTo address these issues, we are building an intensive 7-day Bootcamp, consisting of 6 days of project development and 1 pitching day to identify 3 projects capable of going to Mainnet.\n\nWorkshops will cover:\n\n- Business Model: Building sustainable business models.\n- Marketing in Web3: User acquisition strategies and community development.\n- Product-Market Fit: Identifying needs and adjusting products for users.\n- Web3 Legal: Understanding laws, tokenomics, legal risks, and compliance.\n\nWe focus on quality over quantity, aiming for real projects that can run on Cardano Mainnet. The program is designed in 3 tight phases, ensuring teams are supported from startup to product deployment.\n\nThe project targets tech students, developers, builders migrating to Cardano, Hackathon teams needing further development, and small startups in the Vietnamese Cardano community lacking mentors and a combat environment to reach Mainnet.\n\n\n\n**_Screening Phase_**\n\nGoal: Find the 10 most potential teams capable of finishing the product in 7 days and deploying to Cardano Mainnet.\n\nKey Activities:\n\nOpen registration 1 month in advance via media channels, Cardano community groups, and Web3 developer groups.\n\nCampaign reaching over 150 builders and 40 projects.\n\nAssess technical capacity and commitment to select the top 10 teams.\n\n**Combat Phase \\(Bootcamp\\)**\n\nGoal: Help teams finalize an MVP with all key features functional, along with a demo video and pitch deck.\n\nKey Activities:\n\n- Monday to Saturday: Teams work centrally in a co-working space. Mentors provide 1:1 technical support daily to finalize smart contracts (Cardano), frontend, backend, video, and pitch decks.\n- Workshops: Intensive workshops held during development, focusing on Business Model Canvas for Web3, Product-Market Fit &amp; Go-to-Market Strategy, and Web3 Legal.\n- Sunday - Pitching Day: Teams demo products before a jury and mentors to find 3 winning projects, receiving direct feedback on technology, business models, and feasibility.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project will deliver measurable positive impact to the Cardano ecosystem by:\n\nIncreasing visibility and elevating Cardano's position in Vietnam: \n\n- Contributing to attracting more projects and ideas built on Cardano. The event expands beyond developers to the wider community through diverse workshop topics, helping Cardano reach investors and tech supporters.\n- Developing quality builder resources: Screening over 150 builders to find the best talent. A playground for teams to find success via Bootcamp, where mentors provide useful advice and essential knowledge.\n- Minimizing failure and orienting projects: Providing projects with a holistic view and a clearly oriented review process. Ensuring ideas go beyond MVPs to become useful, real-world products serving the community.\n- Scalability and creating a sustainable playground: Launching 3 complete &quot;start-ups&quot; running on Mainnet with long-term roadmaps. These projects are equipped to acquire their own users, directly increasing wallet addresses and participants on Cardano.\n\n**Measurable KPIs:**\n\nTo ensure impact is transparent and trackable:\n\n- Scale: ≥200 attendees via workshop series. Reach 150+ builders, with at least 40 registered teams.\n- Training Quality: 10 teams in the intensive Bootcamp.\n- Output: 10 projects with MVPs and clear roadmaps built on Cardano.\n- Real Impact: Create 5 new, quality projects on Cardano Mainnet (acting as 5 self-expanding startups).\n- Satisfaction: Positive community feedback &gt; 80%.\n- Media Efficiency: High engagement regarding Cardano via workshops.\n\n**How will you share the outputs and opportunities that result from your project?**\n\nThe project directly contributes 03 applications on Mainnet, generating real transactions and new users. It fosters a new generation of builders with sustainable business mindsets and affirms Cardano's tech position in the strategic Vietnam market.\n\nTo ensure transparency and long-term access, all resources will be public on the official GitHub:\n\n- Quantitative: Lecture slides, mentor videos, workshop documents, and 10 MVP versions.\n- Reporting: Monthly Reports and Milestone Videos on Catalyst.\n- Qualitative: Feedback from attendees (surveys/interviews) and impact stories from participants.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"1, Expertise and Experience:\n\nOur team consists of experienced developers and blockchain educators with a strong background in Cardano and decentralized technologies. We will validate feasibility through hands-on workshops, participant feedback, and collaboration with industry professionals. Transparent reporting and open-source contributions will ensure trust and accountability throughout the project.\n\nAs proof of knowledge and research skills, some of our current proposals funded are attached:\n\nThe project has been funded by fund 10:\n\nProposal funded 1: “🇻🇳 Vietnam Cardano Catalyst - NFT Exchange testing and development environment helps young people approach with the Web3.0 platform”\n\nProposal funded 2: \"Study guide for Marlow\"\n\n\n\n\n\nThe project has been funded by fund 11:\n\nProposal funded 3: “Dualtarget for ADA-Holders (Staking and increasing assets) with a decentralized automated trading bot”\n\nProposal funded 4: “🇻🇳 The Complete Aiken Course Cardano: From Zero to Expert!”\n\n\n\n\n\nThe project has been funded by fund 12:\n\nProposal funded 1: \"Open source dynamic assets (Token/NFT) generator (CIP68)\"\n\n\n\n\n\nOther activities\n\nArticle 1: \"Students Scientific Research with Cardano Blockchain\"\n\nArticle 2: \"Students Scientific Research with Cardano Blockchain\"\n\nArticle 3: \"Scientific research results of students of the University of Transport and Communications 2024\"\n\n2, Accountability\n\nTransparent Governance and Communication: We believe in maintaining transparency throughout the project lifecycle. We will establish clear communication channels to inform stakeholders about project updates, progress, and challenges. Regular reports and updates will be shared to ensure transparency and accountability.   \n\nFinancial Management: Effective fund management is crucial. To demonstrate responsible fund management for a project, we will follow these steps and processes:   \n\nBudget Planning: We will develop a detailed budget plan outlining the allocation of funds for each project milestone and activity. This plan will be shared with stakeholders for review and approval.\n\nFinancial Control: We will establish strict financial controls to ensure that funds are used in accordance with the approved budget. This includes maintaining accurate records, implementing cost monitoring mechanisms, and conducting regular audits.   \n\nTransparent Reporting: Regular financial reports will be prepared and shared with stakeholders, providing detailed information on the project's financial status. These reports will include detailed information on costs, income, and any variances from the budget.\n\nBy combining expertise, transparent management practices, financial controls, and a commitment to open communication, we are confident in our ability to deliver the project with a high degree of trust and accountability.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Planning and Implementation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Make a Master Plan includes concept, timeline, agenda, marketing, and operation overview.\n- Completed Marketing Plan includes personal info, basic project info, ...\n- Completed Submission Form\n- Completed Designs\n- Completed Operation Plan","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Master plan includes: Concept, timeline, agenda, marketing and operation overview.\n\nSubmission form includes: Personal info, basic project info, and preliminary pitch deck.\n\nMarketing plan includes: Content plan, seeding plan, media partner list.\n\nDesign list includes: Key visual, social media templates, media publications.\n\nOperation plan includes: Run-of-show script, printing list.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Google Sheet link to the finalized Master Plan.\n\nGoogle Sheet link to the finalized Marketing Plan.\n\nLink to the finalized Submission Form.\n\nLink to the Design folder containing all listed items.\n\nGoogle Sheet link to the finalized Operation Plan.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":" Execution & Bootcamp Delivery","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Open Submission Form to collect team registrations.\n- Select 10 projects to participate in the Bootcamp based on initial criteria.\n- Execute the event (Host the bootcamp)\n- Provide Technical Support to the teams.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Open Submission Form: The form is open for 20 days and receives at least 40 team registrations.\n\nSelection: 10 projects are selected based on criteria regarding product maturity/completeness and idea quality.\n\nSchedule: All activities are completed according to the schedule outlined in the Master Plan.\n\nQuality: The event quality rating is evaluated at above 80%.\n\nTechnical Support: Any technical issues must be resolved within 15 minutes, ensuring no critical technical failures negatively impact the event quality.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Link to the list of Bootcamp registration projects.\n\nLink to the list of the 10 selected Bootcamp participants with preliminary pitch decks.\n\nLink to the event feedback form.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Close-out & Reporting","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Collect feedback from participants, judges, and stakeholders that can be used to improve future events.\n\nAnnounce the results of the project\n\nFinalize the Report and Close-out Video (PCV, PCR) highlighting the successes, challenges, and impact of the event are created and shared with all stakeholders.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Collect Feedback: Gather useful feedback from participants, judges, and stakeholders that can be used to improve future events. Achieve a response rate of at least 80% from distributed surveys.\n\nAnnounce Results: Ensure winners are announced and results are shared widely in the community. Target engagement metrics (e.g., reaching at least 5,000 views and 500 interactions across platforms).\n\nFinal Report and Video: A comprehensive close-out report and a video highlighting the successes, challenges, and impact of the event are created and shared with all stakeholders.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Link to feedback survey forms (e.g., Google Drive, Dropbox) containing responses from participants, judges, and stakeholders.\n\nLink to announced results, such as posts on the event website or social media channels (e.g., Facebook, LinkedIn, Twitter), listing winners and top projects.\n\nLink to the Final Report and Close-out Video.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"FOur club has more than 50 members in many different departments and areas of expertise. We are a trusted partner of the entire network of students and programmers in Vietnam, a pioneer club in the field of blockchain in the student community in Vietnam. Here are our social media pages:Our club has more than 50 members in many different departments and areas of expertise. We are a trusted partner of the entire network of students and programmers in Vietnam, a pioneer club in the field of blockchain in the student community in Vietnam. Here are our social media pages:\n\nFacebook: [https://www\\.facebook\\.com/bpsclub\\.utc](https://www.facebook.com/bpsclub.utc)\n\nLinkedIn: [https://www\\.linkedin\\.com/company/bpsclub](https://www.linkedin.com/company/bpsclub)\n\nX:  [https://x\\.com/bps\\_club](https://x.com/bps_club)\n\nEmail: blockchainut@gmail.com\n\nThe event management team includes:\n\n**Thanh Khuat Dinh \\- President**\n\nExperiences:\n\nExperienced leading and managing the operations of the projects, organizations, and club.\n\nProject funded at fund 10, 11, 12, 13, 14 in Project Catalyst.\n\nProject Manager at DEMARKET.\n\nExperienced 3 years of building an operating on the Cardano Blockchain.\n\nBlockchain &amp; Sustainability Researcher\n\nContact:\n\nEmail: khuatthanh45@gmail.com\n\nLinkedIn: [https://www\\.linkedin\\.com/in/thanhkhuatdinh/](https://www.linkedin.com/in/thanhkhuatdinh/)\n\nGithub: github.com/thanh2k3zz\n\n**Trung Do \\- Head of Foreign Affairs**\n\nExperiences:\n\nParticipate in organizing the events &quot;Cardano Blockchain Hackathon 2025&quot; and &quot;Vietnam University Cardano Workshop &amp; Onboarding Series&quot;\n\nExperienced 2 years of building an operating on the Cardano Blockchain.\n\nBlockchain &amp; Sustainability Researcher.\n\nContact:\n\nX: [https://x\\.com/DonielDo\\_VN](https://x.com/DanielDo_VNonielDo_VN)\n\n**Thuong Pham \\- Head of Communications**\n\nExperiences:\n\nParticipate in organizing the events &quot;Cardano Blockchain Hackathon 2025&quot; and &quot;Vietnam University Cardano Workshop &amp; Onboarding Series&quot;\n\nBlockchain &amp; Sustainability Researcher\n\nContact:\n\nTelegram:  @ptmthuong18\n\n**Vy Chu \\- Deputy Head of Communications**\n\nExperiences:\n\nParticipate in organizing the events &quot;Cardano Blockchain Hackathon 2025&quot; and &quot;Vietnam University Cardano Workshop &amp; Onboarding Series&quot;\n\nBlockchain &amp; Sustainability Researcher.\n\nContact:\n\nTelegram:  @Vuynuch","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Rewards for top teams: 10,000 ADA\n\nVenue costs for the event series: 15,000 ADA\n\nMarketing: 2,000 ADA\n\nDesign and promotion: 4,000 ADA\n\nManagement: 10,000 ADA\n\nPhotography and Videography: 5,000 ADA\n\nFood support for participants: 5,000 ADA\n\nMedia publications/Merch: 5,000 ADA\n\nProject Manager: 4,000 ADA\n\n(Total: 60,000 ADA)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Our budget of 60,000₳ is designed to achieve maximum capital efficiency for the Cardano ecosystem. Every expense is transparently calculated to ensure technical output quality.\n\nCost Efficiency: We guarantee at least 5 projects successfully deployed to Cardano Mainnet. To justify costs, we referenced the average salary of experienced developers in Vietnam. The 60,000₳ allocation covers remuneration/scholarships and expert mentoring, equivalent to funding 3-4 months of full-time work for a core team. The cost of ~12,000₳ per DApp (including QA and Mentoring) is 30-50% cheaper than hiring an experienced blockchain freelancer for a comparable project; thus, this cost is highly commensurate and economical by industry standards.\n\nMinimizing technical risk & ensuring quality: To address concerns about short-term program output, we commit to a rigorous QA process. This includes 1:1 supervision and intensive technical mentoring from top regional Cardano experts. Each project undergoes at least 3 rounds of checks from ideation to design and build.\n\nCore value - Investing in long-term human resources: The 60,000₳ investment brings superior long-term benefits by building a developer community with foundational expertise. We deliver 30+ intensively trained individuals capable of developing DApps, who can serve as future mentors in subsequent Catalyst Funds. We educate 200+ people on Cardano business models and Tokenomics, creating a team of community ambassadors with solid knowledge to support adoption and user growth for Cardano DApps.\n\nConclusion: The requested budget funds not just products but core personnel, delivering a high ROI in terms of deployment speed, technical quality, and sustainable ecosystem growth.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Community","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1670}