{"pr_id":"019abdbb-aeb0-7cbc-93b8-874184db79da","title":"Ascent: Gaming Catalyst to Onboard the Next Million Users","event_id":15,"objective":37,"objective_title":"Cardano Partners: Tier-1 Enterprise Integrations","summary":"Cardano lacks a validated path to reach mainstream gamers outside its finance-focused vertical, limiting access to the largest consumer audience in digital entertainment.","solution":"A global award-winning title game incorporating Japanese IP to validate mainstream adoption and define a repeatable blueprint for studios launching consumer Cardano experiences.","proposer_name":"Michael Yagi","proposer_relevant_experience":"**Michael Yagi** — CEO &amp; Cofounder\n\nTechnical and gaming background specializing in strategy, design, and system architecture. DigiPen alumnus with shipped titles at 2K Games and prior senior engineering at Tableau. Top-tier competitive player across multiple esports titles with strong product intuition and systems thinking.\n\n[https://www\\.linkedin\\.com/in/michaelyagi/](https://www.linkedin.com/in/michaelyagi/)\n\n**Steven George** — Lead Engineer &amp; Cofounder\n\nOne of the two core engineers behind Ascent, responsible for engine systems, physics, networking, multiplayer, and full-stack infrastructure. DigiPen alumnus and Principal Architect with experience building custom C++ gameplay and graphics engines.\n\n[https://www\\.linkedin\\.com/in/stevenbgeorge/](https://www.linkedin.com/in/stevenbgeorge/)\n\n**Stanley Hayes** — Lead Rendering Engineer &amp; Cofounder\n\nSpecialist in rendering, shaders, environment systems, and gameplay support. DigiPen alumnus with experience at NVIDIA, Unreal Engine, and Fortnite.\n\n[https://www\\.linkedin\\.com/in/stanleyhayes/](https://www.linkedin.com/in/stanleyhayes/)\n\n**David Yagi** — COO &amp; Cofounder\n\nOperator focused on finance, strategy, market timing, and community growth. Founded the industry’s top crypto merchandise store and scaled a vitamin chain from bankruptcy to multi-million profitability. Former rank-1 global StarCraft II competitor with deep experience in building and maturing businesses.\n\n[https://x\\.com/NFTCollector](https://x.com/NFTCollector)\n\n**Chris Chung** — Business Development &amp; Partnerships &amp; Cofounder\n\nOversees partnerships, outreach, and operational support. Previously exited a top 3 coding bootcamp (Coding Dojo).\n\n[https://www\\.linkedin\\.com/in/christopher\\-j\\-chung/](https://www.linkedin.com/in/christopher-j-chung/)\n\n**Cliff Garvis** — Senior Developer\n\nFull-stack architect specializing in blockchain integrations including Aiken wagering contracts and Midnight privacy-enabled payouts. DigiPen alumnus with prior engineering experience at Nintendo and Level 11. Built multiple custom C++ game and graphics engines.\n\n[https://www\\.linkedin\\.com/in/cliff\\-garvis\\-5394b380/](https://www.linkedin.com/in/cliff-garvis-5394b380/)\n\n**Sandeep Casi** - Antler\n\n- Sandeep is senior executive with a diverse career spanning industries from automotive, manufacturing, visual effects, television broadcasting, venture capital, R&amp;D, hardware, firmware, middleware, and software.\n- His expertise includes developing advanced technologies via the use of AI, ML, Web3, Blockchain, Broadcasting technologies, CAD, CAM, FEA, Virtual Reality, and visual effects rendering pipelines, with involvement in notable projects such as Star Wars, Jurassic Park, and Titanic.\n- He held significant roles at Fuji-Xerox Palo Alto Lab and successfully led many research product to market initiatives for Fujifilm in Japan and the broader Asia-Pacific region.  Post Fujifilm, he joined a boutique venture capital fund in Japan and raised millions from Japanese investors for many silicon valley companies and established their Japanese presence (Product-Market Fit, Sales).\n- He spun off 30 patents from Fujifilm, raised $7 million from Japanese, Korean, and US investors for a new venture, and exited that venture in 2021.\n- Sandeep  has deep connections to CxO in US, Asia, Europe, With over 18 years of experience in Japan, he is well connected within the Japanese corporate CxO circles.\n\n[https://www\\.linkedin\\.com/in/sandeepcasi](https://www.linkedin.com/in/sandeepcasi)\n\n**Tomoko Takasaki** - Senior Manager at Antler\n\n- Nearly 20 years in the media and entertainment industry, developing deep expertise in Japan’s IP and copyright business and a clear understanding of rights-holder and creator pain points\n- built through extensive work at Horipro (leading Japanese talent agency) and agehasprings (top music creative company). Partners include: Sony Music / Aniplex, avex, Shueisha, Kodansha, Toei Animation and Sunrise—major IP holders in Japan’s anime and manga ecosystem\n\n[https://www\\.linkedin\\.com/in/tomoko\\-takasaki/](https://www.linkedin.com/in/tomoko-takasaki/)","url":null,"funds":700000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Ascent: Gaming Catalyst to Onboard the Next Million Users","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Michael Yagi","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an Incorporated entity or a Consortium?","description":"Are you submitting this proposal as an Incorporated entity or a Consortium?","format":null,"answer":"Consortium","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 250,000 and $ADA 750,000","format":null,"answer":700000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":8,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano lacks a validated path to reach mainstream gamers outside its finance-focused vertical, limiting access to the largest consumer audience in digital entertainment.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A global award-winning title game incorporating Japanese IP to validate mainstream adoption and define a repeatable blueprint for studios launching consumer Cardano experiences.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.ascentrivals.com/","https://x.com/AscentRivals/bio","https://store.steampowered.com/app/2748420/Ascent_Rivals/","https://ibex.now"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","description":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","format":null,"answer":"Smart contracts will be auditable and open-sourced under open MIT License","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Gaming","group":"GameFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your established collaborations.","description":"Please provide your rationale for your established collaborations.","format":null,"answer":"This proposal is delivered in collaboration with Antler Ibex, the corporate innovation and investment arm of Antler. Antler Ibex maintains strong relationships across Japan and internationally, providing access to Tier-1 institutions, regional banks, entertainment groups, and major franchise IP holders.\n\n\n\nThrough this partnership, Ascent: Rivals can integrate and showcase popular Japanese IP within the game, strengthening appeal in one of the world’s most influential gaming markets. Antler Ibex’s network accelerates market entry, enhances cultural alignment, and supports long-term adoption pathways that expand Cardano’s presence across Japan’s mainstream entertainment ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe funding commitments.","description":"Please provide your rationale for your funding commitments.","format":null,"answer":"Antler is a global early-stage VC with more than $1.2B AUM and a portfolio of 1,500+ startups across 30 cities. Antler Ibex, its corporate innovation and investment arm, is supported by Antler’s global platform and investor base, which includes institutional LPs, sovereign wealth funds, and leading family offices.\n\n\n\nAdditional grant commitments have been received from Cardano Builder DAO and Sundial to support early marketing activities including creator campaigns, targeted ads, tournaments, and critical game feature development. These commitments reinforce the shared confidence in Ascent: Rivals and provide layered co-funding alongside Catalyst support.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your key performance metrics.","description":"Please provide your rationale for your key performance metrics.","format":null,"answer":"Success will be measured by:\n\n1. **50,000\\+** wallets created\n2. **5,900,000\\+** transactions on-chain\n3. **1\\+ Japanese institutions** and/or Japanese corps engaged, (e.g. Sony, Sumitomo Real Estate, SMBC, Hokkuku Bank, Kyoto Bank, Mitsui-Fudosan, Hankyu Hanshin...)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The solution is to bring a high quality, award-winning game to market that abstracts Web3 entirely and integrates Cardano in the background. Players join and progress without needing any blockchain knowledge, while still benefiting from Cardano’s open protocol features such as tradable items, player driven value exchange, and competitive wager matches. This creates a credible and accessible path for onboarding mainstream gamers who are not Web3 savvy.\n\n![](https://i.postimg.cc/mr6wHZrm/screenshot-864-(1).webp)\n\nAscent: Rivals follows a traditional gaming development and publishing path and has been validated by mainstream events and competitions. The game has won PAX Rising and DreamHack Indie Playground, two of the most selective showcases for emerging indie titles, and has been featured at Gamescom, DreamHack, GDC, Momocon, and ETH Denver Arcade. These events are curated by established developers, publishers, and industry professionals, confirming that Ascent is recognized as a competitive product within the traditional gaming market.\n\nThe game has already reached more than 15,000 hours of organic playtime, more than 4,000 wishlists, and more than 2,500 monthly active users in limited alpha testing. These results show clear traction with traditional players outside the finance focused vertical where Cardano is strongest today.\n\nCatalyst funding will support scaling multiplayer servers and infrastructure, delivering new maps, ships, weapons, and environments, expanding visual fidelity, and developing a career mode that improves onboarding for new players. It will also support broader event participation and an expanded creator program to reach new audiences across multiple regions.\n\nTo further strengthen global expansion, we are working with Antler Ibex to establish a presence in Japan, one of the world’s largest gaming markets. The Ibex team includes seasoned operators with more than 20 years of experience across major venture, media, and entertainment organizations including LucasFilm, FujiFilm, Sony, Universal, Warner, Aniplex, Kodansha, Shogakukan, Shueisha, Kadokawa, Fuji, Shochiku, and Toho. Through this partnership, we aim to explore collaboration with leading Japanese IP and support Cardano’s visibility within Japan’s high value entertainment ecosystem.\n\nOnce players are in game, Cardano operates quietly in the background. Players create or link wallets through Steam, Xbox, or PlayStation accounts without learning Web3 terminology. Gameplay activity naturally creates on-chain interactions through cosmetics purchases, tournaments, sponsorship payouts, team ownership, wagers, and marketplace exchanges. A dedicated spectator and tournament platform expands participation for communities, organizers, and sponsors by allowing them to host events, promote teams, and run competitive circuits similar to traditional esports.\n\nPartnerships with MSI, Starforge, Shelby, Saleen, Dirtfish, and AccelByte provide global reach and demonstrate enterprise level confidence in Ascent as a traditional game that uses Cardano only where it enhances user experience and value.\n\nBy scaling a game that already shows strong appeal to mainstream players, abstracting all Web3 complexity, enabling open protocol features, and expanding into key markets such as Japan with Antler Ibex, Ascent: Rivals offers a clear and scalable path to bring new users to Cardano. It also creates a repeatable blueprint that future studios can adopt when building high quality consumer titles on Cardano.\n\n![](https://i.postimg.cc/8PJVJsPv/screenshot-894-(1).webp)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"![](https://i.postimg.cc/d3JLQrKL/ascent-pax.webp)\n\n\n\nAscent: Rivals drives measurable on-chain activity by converting traditional gamers into active Cardano users. Wallets are created automatically through Steam, Xbox, or PlayStation, allowing players to join without needing Web3 knowledge. Gameplay, wagers, item ownership, tournaments, and rewards all generate verifiable on-chain transactions.\n\n# **Year\\-1 On\\-Chain Transaction Projection**\n**Wallet creation:** 50,000\n\n**Asset mints and updates:** 250,000\n\n**Wagers and currency swaps:** 5,475,000\n\n_Calculated from 750 daily active players, each playing one hour per day, averaging 5 matches per hour and 4 races per match, with a value exchange per race \\(in\\-game currency is committed each race\\)\\._\n\n**Seasonal reward claims:** 50,000\n\n**Total Year\\-1:** Approximately **5\\.9 million transactions**\n\n# **Additional KPIs**\n- 1,000,000+ reach from marketing and events\n- 50+ activated creators across regions\n- 10,000+ tournament participants\n- Four seasonal content drops\n- 15,000+ marketplace listings and trades post launch","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"![](https://i.postimg.cc/vTPHQKhR/banner-(2).webp)\n\nOur team combines a proven history of delivering high-quality games, contributing to Cardano infrastructure, and executing at industry events. The project is already validated through live public testing, awards, and partnerships, demonstrating the capability and feasibility required for successful delivery.\n\n# **Track Record**\n- Shipped commercial games, internal engines, and high-performance multiplayer systems.\n- Contributions to Cardano standards including **CIP\\-102** (metadata and asset interaction improvements).\n- Core development involvement in **Sundial**, a next-generation Cardano rollup framework.\n- Delivered to mainnet grabbit.market, a Cardano-based auction and marketplace system.\n- Documented [behind the scenes footage](%5Bhttps://www.youtube.com/watch?v=9dsoSMzfkwo&list=PLv6OI6cX9BZk93b6KSv46iK9zWTF7SL73)%5D(https://www.youtube.com/watch?v=9dsoSMzfkwo&amp;list=PLv6OI6cX9BZk93b6KSv46iK9zWTF7SL73)) of attending various events with more being edited and on the way.\n- Antler Ibex is the world’s first full-service vertical growth engine for established corporates. Backed by Antler, the world’s most active early-stage VC (with 1,500+ investments globally with $1.2B AUM), and led by a seasoned team of venture and growth specialists, Ibex helps corporates strategically engage with the $3.5 trillion global venture economy to unlock growth (organic, inorganic, and transformational)\n\n# **Team Capability**\n- DigiPen alumni engineers experienced in Unreal Engine, multiplayer networking, physics, rendering, and engine-level C++ development.\n- Antler Ibex senior partners to oversee program quality and corporate engagement at the executive level.\n- Transparent public professional profiles, including LinkedIn references for all founders and contributors.\n- Capable of simultaneously delivering production content, Cardano integrations, and global growth initiatives.\n\n# **Feasibility**\n- Playable today on Steam through a public, limited alpha with more than **15,000 hours** of organic gameplay.\n- Thousands of wishlists and stable monthly active players validating core gameplay and retention.\n- Winner of **PAX Rising**, a leading predictor for major indie awards.\n- Showcased at DreamHack Indie Playground, Gamescom, GDC, ETH Denver, Momocon, and multiple PAX events.\n- Only Web3-enabled game of its category featured live on Steam.\n- Broad ecosystem partnerships, reinforcing the feasibility of scaling both game and Cardano integrations.\n\n**Conclusion**\n\nOur combined execution history, ecosystem contributions, award recognition, and live user validation demonstrate clear capacity to deliver Ascent: Rivals with high trust and accountability. The project’s feasibility is already proven through tangible progress, real users, and market traction, ensuring strong alignment with Cardano’s adoption goals.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Core Stabilization, Account Onboarding & Analytics Foundation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Core gameplay systems are finalized, including ship handling, combat interactions, collision, environmental hazards, and round logic, all implemented in a stable and feature-locked state that allows consistent play sessions and prepares the foundation required for content expansion, wallet integration, and creator-driven testing later in the project.\n- A stability pass is completed across physics, networking, matchmaking, and session flow, ensuring that all core mechanics behave predictably under load and enabling the team to confidently proceed into adding new maps, ships, cosmetic systems, and onboarding flows without risking regression to the core experience established here.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Core gameplay features operate without major blocking bugs or regressions; all fundamental mechanics behave consistently across multiple test sessions, with documented performance metrics demonstrating alignment with expected framerates, latency thresholds, and gameplay responsiveness under realistic multiplayer scenarios.\n- Internal playtest cohorts report high stability and coherence in gameplay flow, with minimal crash reports, consistent synchronization across clients, functional session loops, and validated baseline telemetry that shows survival of extended test cycles without major drops in performance, engagement, or technical integrity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- QA reports, internal playtest recordings, and stability logs demonstrating that core gameplay systems function reliably across representative hardware and matchmaking scenarios, with no critical issues preventing player progression or session continuity during extended testing cycles.\n- Exported telemetry dashboards showing successful capture of gameplay events, frame-time consistency, network stability, and user interactions, alongside documentation confirming the completion of the feature-lock checklist and readiness for the content expansion and creator testing phases of Milestone 2.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":70000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Content Expansion, Career Mode & Content Creator Programs","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- New maps, ships, cosmetics, and environmental upgrades significantly enhance gameplay variety, while the career mode provides structured introductory missions that improve comprehension, retention, and meaningful player progression.\n- Controlled creator trials introduce new player cohorts, generating measurable acquisition data and validating how early content, social systems, and progression affect engagement across different audience segments.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Career mode presents clear goals, progression steps, unlockable rewards, and tutorial-style guidance with no blocking issues, while social systems enable friend interactions and team functionality across multiple test sessions.\n- Creator activations show measurable improvements in onboarding numbers, retention ratios, and behavioral metrics, confirming that content and progression updates strengthen user acquisition and session depth.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Recorded playthroughs, QA reports, and gameplay captures showing functional maps, ships, and career mode progression, with stability verified across multiple sessions and hardware profiles to support scale.\n- Creator campaign analytics including account creation spikes, retention deltas, session metrics, and comparative data demonstrating increased engagement relative to earlier milestone baselines.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":150000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Wallet Migration & Seemless Cardano Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Wallet migration flow enables users to seamlessly convert accounts into Cardano-compatible wallets without technical friction, supporting future asset ownership, economic loops, and blockchain-linked progression systems.\n- Testnet integration for mints, metadata updates, wagers, and marketplace features ensures that gameplay-driven events consistently translate into on-chain transactions for validation of future mainnet scaling behavior.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Wallet creation and migration consistently succeed with correct linkage between game identity and blockchain address, with testnet transactions processing accurately under repeated load and varied gameplay conditions.\n- Economic systems reliably generate on-chain events such as reward claims, value exchanges, and asset updates, and analytics confirm correct attribution of these blockchain events to individual user actions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Logs of wallets created, and validation reports confirming stable execution of mints, updates, wagers, and transfers, with supporting QA evidence demonstrating consistent blockchain behavior under volume testing.\n- Exported analytics showing wallet migration adoption, successful blockchain event mapping, and internal dashboards verifying real-time tracking of testnet activity tied to player interactions.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":175000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Global Launch & KPI Validation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- A public accessible across major regions delivers real gameplay at scale, capturing live user behavior, wallet events, and on-chain transactions that demonstrate how Ascent converts traditional players into active Cardano users.\n- Creator campaigns amplify reach, generating large surges of player interest and enabling the team to measure early indicators such as CAC, retention, on-chain activity, and geographic performance variability.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Gobal build remains stable under live player load, with matchmaking, progression, and wallet-linked mechanics functioning reliably across regions and traffic spikes from creator activations.\n- Verified on-chain events appear across mints, wagers, trades, and reward claims, with analytics dashboards confirming wallet creation, retention improvements, and scalable user behavior aligned with adoption goals.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public launch build link, live transaction logs, wallet activity summaries, and exported dashboards showing DAU, MAU, retention curves, playtime, geographic segmentation, and real on-chain activity produced during the launch period. These metrics collectively validate the system’s ability to support global scale.\n- Creator campaign reporting detailing viewership, reach, conversion rates, and wallet migration performance, along with documentation showing direct correlations between launch traffic, user actions, and resulting Cardano transactions captured in the analytics platform.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":200000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Catalyst Closeout, KPI Publication & Ecosystem Playbook","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- A complete Catalyst Closeout Report and Closeout Video are produced, summarizing the project’s end-to-end performance, measured KPIs, technical achievements, and Cardano impact, ensuring full transparency and accountability for all milestones delivered throughout the eight-month development and launch cycle.\n- A public ecosystem playbook is created detailing wallet onboarding pipelines, transaction flows, integration methods, infrastructure choices, creator activation processes, and operational lessons learned, enabling future studios to reuse the methodology and accelerate Cardano adoption at scale.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Reviewers approve all Catalyst-required materials, confirming that the Closeout Report and Video meet documentation standards, accurately reflect the project’s outcomes, and provide verifiable evidence for wallet creation, user onboarding, transaction activity, retention metrics, and global launch performance.\n- The ecosystem playbook is published and accessible, demonstrating clearly defined patterns for gameplay-driven on-chain activity, integration workflows, and repeatable practices, ensuring that other development teams can adopt or extend these validated approaches to further expand the Cardano ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Submitted Closeout Report and published Closeout Video, along with public links to the playbook repository, KPI dashboards exported with timestamped validation sources, and blockchain transaction logs verifying that measurable on-chain activity occurred as reported throughout the project lifecycle.\n- Final validation logs, reviewer approvals, documentation archives, and analytics exports collectively demonstrating that all milestones have been completed in full, with transparent reporting and verifiable data confirming the project’s impact on user onboarding and Cardano network activity.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":105000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Michael Yagi** — CEO &amp; Cofounder\n\nTechnical and gaming background specializing in strategy, design, and system architecture. DigiPen alumnus with shipped titles at 2K Games and prior senior engineering at Tableau. Top-tier competitive player across multiple esports titles with strong product intuition and systems thinking.\n\n[https://www\\.linkedin\\.com/in/michaelyagi/](https://www.linkedin.com/in/michaelyagi/)\n\n**Steven George** — Lead Engineer &amp; Cofounder\n\nOne of the two core engineers behind Ascent, responsible for engine systems, physics, networking, multiplayer, and full-stack infrastructure. DigiPen alumnus and Principal Architect with experience building custom C++ gameplay and graphics engines.\n\n[https://www\\.linkedin\\.com/in/stevenbgeorge/](https://www.linkedin.com/in/stevenbgeorge/)\n\n**Stanley Hayes** — Lead Rendering Engineer &amp; Cofounder\n\nSpecialist in rendering, shaders, environment systems, and gameplay support. DigiPen alumnus with experience at NVIDIA, Unreal Engine, and Fortnite.\n\n[https://www\\.linkedin\\.com/in/stanleyhayes/](https://www.linkedin.com/in/stanleyhayes/)\n\n**David Yagi** — COO &amp; Cofounder\n\nOperator focused on finance, strategy, market timing, and community growth. Founded the industry’s top crypto merchandise store and scaled a vitamin chain from bankruptcy to multi-million profitability. Former rank-1 global StarCraft II competitor with deep experience in building and maturing businesses.\n\n[https://x\\.com/NFTCollector](https://x.com/NFTCollector)\n\n**Chris Chung** — Business Development &amp; Partnerships &amp; Cofounder\n\nOversees partnerships, outreach, and operational support. Previously exited a top 3 coding bootcamp (Coding Dojo).\n\n[https://www\\.linkedin\\.com/in/christopher\\-j\\-chung/](https://www.linkedin.com/in/christopher-j-chung/)\n\n**Cliff Garvis** — Senior Developer\n\nFull-stack architect specializing in blockchain integrations including Aiken wagering contracts and Midnight privacy-enabled payouts. DigiPen alumnus with prior engineering experience at Nintendo and Level 11. Built multiple custom C++ game and graphics engines.\n\n[https://www\\.linkedin\\.com/in/cliff\\-garvis\\-5394b380/](https://www.linkedin.com/in/cliff-garvis-5394b380/)\n\n**Sandeep Casi** - Antler\n\n- Sandeep is senior executive with a diverse career spanning industries from automotive, manufacturing, visual effects, television broadcasting, venture capital, R&amp;D, hardware, firmware, middleware, and software.\n- His expertise includes developing advanced technologies via the use of AI, ML, Web3, Blockchain, Broadcasting technologies, CAD, CAM, FEA, Virtual Reality, and visual effects rendering pipelines, with involvement in notable projects such as Star Wars, Jurassic Park, and Titanic.\n- He held significant roles at Fuji-Xerox Palo Alto Lab and successfully led many research product to market initiatives for Fujifilm in Japan and the broader Asia-Pacific region.  Post Fujifilm, he joined a boutique venture capital fund in Japan and raised millions from Japanese investors for many silicon valley companies and established their Japanese presence (Product-Market Fit, Sales).\n- He spun off 30 patents from Fujifilm, raised $7 million from Japanese, Korean, and US investors for a new venture, and exited that venture in 2021.\n- Sandeep  has deep connections to CxO in US, Asia, Europe, With over 18 years of experience in Japan, he is well connected within the Japanese corporate CxO circles.\n\n[https://www\\.linkedin\\.com/in/sandeepcasi](https://www.linkedin.com/in/sandeepcasi)\n\n**Tomoko Takasaki** - Senior Manager at Antler\n\n- Nearly 20 years in the media and entertainment industry, developing deep expertise in Japan’s IP and copyright business and a clear understanding of rights-holder and creator pain points\n- built through extensive work at Horipro (leading Japanese talent agency) and agehasprings (top music creative company). Partners include: Sony Music / Aniplex, avex, Shueisha, Kodansha, Toei Animation and Sunrise—major IP holders in Japan’s anime and manga ecosystem\n\n[https://www\\.linkedin\\.com/in/tomoko\\-takasaki/](https://www.linkedin.com/in/tomoko-takasaki/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Total Requested: 700,000 ADA\n\nProject Duration: 8 months\n\nThe budget prioritizes high-quality development, large-scale user acquisition, and international partnership growth to maximize Cardano onboarding and on-chain activity.\n\n# Cost Breakdown by Category\n**Game Development &amp; Content Production \\(50% | 350,000 ADA\\)**\n\n- Map and ship art production\n- Environment polish and visual fidelity upgrades\n- Single-player and career mode content\n- Cosmetics, skins, and unlockable rewards\n- UI/UX, VFX, and animation improvements\n- Development tasks supporting Cardano integration\n\n**Marketing, User Acquisition &amp; Creator Activation \\(35% | 245,000 ADA\\)**\n\n- Global content creator campaigns\n- Paid user acquisition and targeted ads\n- Influencer tournaments and beta promotion\n- Promotional events and large-scale showcases\n- Trailer production, marketing assets, and promotional materials\n\n**Travel &amp; Events \\(5% | 35,000 ADA\\)**\n\n- Attendance at major gaming conventions\n- Regional testing activations\n- In-person creator collaborations\n- Partner meetings and live showcases\n\n**Business Development &amp; International Partnerships \\(10% | 70,000 ADA\\)**\n\n- Expansion through Antler Ibex in Japan\n- APAC localization research and strategy\n- Partnership development with IP holders and studios\n- Cross-border licensing and collaboration activities\n\n# Budget by Milestone\nMilestone\tAmount\t% of Total\n\n- Milestone 1 – Core Gameplay Completion & Stability Foundation | 70,000 ADA | 10%\n- Milestone 2 – Content Expansion, Career Mode & Creator Trials | 150,000 ADA | 21.4%\n- Milestone 3 – Wallet Migration & Cardano Testnet Integration | 175,000 ADA | 25%\n- Milestone 4 – Global Launch & KPI Validation | 200,000 ADA | 28.6%\n- Final Milestone – Catalyst Closeout & Ecosystem Playbook | 105,000 ADA | 15%","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project represents strong value for the Cardano ecosystem:\n\n\n\n- **High-Volume User Onboarding:** With 700,000 ADA, the project delivers a global beta of Ascent: Rivals, onboarding large numbers of traditional gamers who are outside Cardano’s current finance-centric demographic. This directly expands the ecosystem’s reach to one of the largest consumer sectors in digital entertainment.\n\n- **Significant On-Chain Transaction Growth:** The game’s wager systems, cosmetic economies, marketplace trades, and seasonal reward flows are projected to generate millions of transactions in Year 1. These interactions create recurring utility for ADA and demonstrate Cardano’s capability to support consumer-scale applications.\n\n- **Leverage of Existing Investment:** The core game development is already funded by the team. Catalyst funds primarily scale user acquisition, content, and Cardano integration. This multiplies the impact of the requested funding because the foundational product exists and is already live-tested.\n\n- **Reusable Model for Future Studios:** The project produces a full integration blueprint for other game studios, including wallet onboarding flows, economic logic, and scalable Cardano settlement patterns. This creates a replicable model for onboarding additional games and developers into the ecosystem.\n\n- **Strengthened International Reach:** Through Antler Ibex and global creator networks, the project expands Cardano visibility in Japan, North America, Europe, and APAC. Penetration into these markets increases brand credibility and opens pathways to broader partnerships and IP integrations.\n\n- **Alignment With Core Catalyst Priorities:** The project drives real users, real transactions, and measurable adoption while showcasing Cardano to mainstream gamers and international entertainment markets. It demonstrates a high-value use of Catalyst resources by delivering concrete metrics and long-term ecosystem lift.\n\n\n\n**In summary:** For 700,000 ADA, the Cardano ecosystem gains a globally launched beta, millions of projected on-chain interactions, a proven onboarding pipeline for mainstream gamers, and a repeatable model for future game studios—representing a high-impact, high-leverage investment for Catalyst.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead applicant is a verified legal business entity.","description":"Legal Entity:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead org has a ≥2-year track record, and the consortium collectively has ≥$5M in verifiable annual revenue.","description":"Track Record & Revenue:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of collaboration with a qualified Tier-1 enterprise is provided.","description":" Tier-1 Collaboration:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is for mature R&D or integration, not an early-stage concept or core infrastructure.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of a mature product is provided, with a clear integration plan if not already on Cardano.","description":"Mature Product & Path:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that all key partners, including the Tier-1 collaborator, are clearly identified.","description":"Partner Identification:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that a clear statement of the partner's in-kind or financial contributions is included.","description":"Partner Commitment:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable references (e.g., LinkedIn, portfolio) for key team members.","description":"Verifiable Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear KPIs for adoption (e.g., transaction volume, user growth). Forecast for projected on-chain transaction volume is provided with adequate justification.","description":"Measurable Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that delivery is ≤ 12 months with clear milestones.","description":"Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a co-marketing or community engagement plan to amplify Cardano's visibility.","description":"Visibility & Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal budget is for future work only, not for completed tasks. No incentives, giveaways, private treasuries and regranting are included in the budget.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Gaming","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1671}