{"pr_id":"019ac37c-7d9e-7cb7-b9fd-f4152f6d00ea","title":"Blank Wars: Bringing Legendary NFTs to Life on Cardano","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Web3 games struggle to attract Web2 players. Despite CIP-68 enabling evolving NFTs, static assets and high friction block mainstream adoption.","solution":"Blank Wars draws Web2 gamers to Web3 by using CIP-68 to create Living NFTs with evolving traits and memories. Low-cost batch updates and iconic characters boost adoption and viral off-chain reach.","proposer_name":"Gabe Greenstein","proposer_relevant_experience":"Gabriel Greenstein — Founder, Lead Developer\n\n\n\n    Skills: Full-stack development (TypeScript, Node.js, PostgreSQL, React, Three.js), creative writing, graphic design, computer systems architecture, and team leadership.\n\n\n\nBackground: 4 successful business exits, started multiple businesses; Master of Public Administration candidate.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/gabealon](https://linkedin.com/in/gabealon)\n\n\n\nMike Johanning — Senior Strategist\n\n\n\n    Skills: Strategic planning, technology roadmap development, stakeholder management, cross-functional coordination, and risk assessment/mitigation.\n\n\n\nBackground: 4 years as Director of Technology at an enterprise organization.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/mikejohanning](https://linkedin.com/in/mikejohanning)\n\n\n\nBrittany Battaglia — Developer, Art Lead\n\n\n\n    Skills: 3D modeling/asset creation (Meshy), UI/UX design, frontend development, project coordination, and quality assurance.\n\n\n\nBackground: 9 years as a Laboratory Manager overseeing complex technical operations; active Cardano community member.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/brittany\\-battaglia\\-13b3b485](https://linkedin.com/in/brittany-battaglia-13b3b485)\n\n\n\nSteven Greenstein — Developer\n\n\n\n    Skills: Backend development, database optimization, and building scalable production systems.\n\n\n\nBackground: Computer Science degree; Master's candidate in Library Science with data management expertise.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/steven\\-greenstein\\-69690279](https://linkedin.com/in/steven-greenstein-69690279)\n\n\n\nTroy Bertolino — Consultant\n\n\n\n    Skills: Gameplay testing, feedback loops, tutorial design, and onboarding flow design.\n\n\n\nBackground: STEM educator and game development instructor who understands player experience and educational game design.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/troy\\-bertolino\\-hybee](https://linkedin.com/in/troy-bertolino-hybee)\n\n\n\nJoe Tyler — Influencer Business Development\n\n\n\n    Skills: Professional athlete representation, contract negotiation, influencer relationship management, and partnership development.\n\n\n\nBackground: NBA/FIBA certified sports agent; leads outreach to sign influencers as in-game Living NFT characters.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/joe\\-tyler\\-a2509342](https://linkedin.com/in/joe-tyler-a2509342)","url":null,"funds":150000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Blank Wars: Bringing Legendary NFTs to Life on Cardano","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Gabe Greenstein","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":150000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Web3 games struggle to attract Web2 players. Despite CIP-68 enabling evolving NFTs, static assets and high friction block mainstream adoption.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Blank Wars draws Web2 gamers to Web3 by using CIP-68 to create Living NFTs with evolving traits and memories. Low-cost batch updates and iconic characters boost adoption and viral off-chain reach.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.blankwars.com/","https://drive.google.com/drive/folders/1uJ64bHxWUhxD08hJjsMUmFmJb-tlZOBn?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"no dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Our project will be partially open-sourced. All Cardano-related components, smart contracts, and blockchain integrations will be fully open for community review and reuse. However, the Web2 game systems, backend services, and proprietary features will remain closed-source and owned by Wise Sage LLC to protect core business assets and competitive IP.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Gaming","group":"GameFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Blank Wars isn’t just another blockchain game. It introduces several ideas that solve real problems in the current Web3 gaming space, especially around onboarding Web2 players and making NFTs feel truly alive. Most blockchain games fall into one of two buckets: either the NFTs never change, or everything gets written to the chain constantly, making it expensive and slow. Blank Wars takes a different approach by using a hybrid “Living NFT” model that focuses on story, personality, and long-term identity rather than endless stat updates.\n\n\n\nOne of the biggest innovations is the way you handle on-chain updates. Instead of spamming the blockchain with every little action, you run the fast gameplay off-chain, then publish a single monthly snapshot using CIP-68. All the character’s battles, relationships, events, and big moments get condensed into one compact update. This avoids the two extremes most games fall into—static NFTs or bloated chains—and makes truly evolving characters possible without high fees.\n\n\n\nYou’re also doing something unusual with narrative metadata. Instead of just storing numbers like “Strength: 10,” Blank Wars uses AI to select “Vintage Memories” from the month—little story beats like betrayals, victories, rivalries, and weird moments. These get permanently added to the character’s identity. It turns the NFT into a kind of miniature biography instead of another static collectible, which makes players care about their characters in a way numbers alone never could.\n\n\n\nAnother standout feature is your psychology and adherence system. In most games, characters always obey the player. In Blank Wars, characters have moods, egos, relationships, and stress levels—and sometimes they push back. They might refuse a command, argue, or go off-script, which makes them feel more like unpredictable roommates than obedient units. This flips a common frustration of AI behavior into an actual gameplay mechanic.\n\n\n\nFinally, you’ve solved one of the biggest barriers for bringing Web2 gamers into Web3: forcing wallet setup too early. Blank Wars can be played entirely as a normal Web2 game at first. Players only interact with Cardano if they choose to mint their character or preserve their monthly identity snapshot. By the time they reach that step, they’re already invested—so the blockchain becomes a value add, not an obstacle.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our game is already in an early alpha stage, supported by a production-grade backend with over 100 data tables and fully operational AI systems. The prototype demonstrates a \"Reality TV\" style strategy game where you act as the coach to a squad of legendary characters living together in a chaotic shared house. Players—both Web2 and Web3—open card packs to unlock these big personalities, then manage their lives through strategic turn-based battles, therapy sessions, group activities, and even financial choices. The core challenge isn't just winning fights; it is managing the volatile psychology of your team as they form alliances, hold grudges, and potentially rebel against your coaching decisions based on their mental state.\n\n\n\nThis prototype specifically showcases the transition of these characters into \"Living NFTs\" on Cardano using the CIP-68 standard. We will demonstrate a complete gameplay loop where the dynamic history of your team—including their relationship drama, battle scars, and \"vintage memories\" from the season—is aggregated into a monthly on-chain snapshot. This creates a verifiable digital identity that evolves over time, proving that Cardano can support complex, narrative-driven gaming experiences where your NFT is a record of a life lived, not just a static image.\n\n\n\nYou can access game alpha at [https://www\\.blankwars\\.com/](https://www.blankwars.com/)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Success for Blank Wars can be measured through a combination of on-chain activity, system reliability, and player engagement. The most important indicators come directly from Cardano, showing that the Web2-to-Web3 onboarding funnel is working and that the Living NFT concept is operational.\n\n\n\nMilestone 1 establishes the foundation: a complete production database, local test environment, and baseline Web2 onboarding. Success here is measured by a fully operational theater UI, seeded character tables, and initial gameplay loops running deterministically. Player engagement at this stage—watching characters, reading narratives, and exploring placeholder interactions—provides an early signal that the system is intuitive and accessible, even before blockchain integration.\n\n\n\nMilestone 2 validates the core simulation systems. Metrics include stable AI-driven personalities, abilities integration, and a battle engine performing at ~85% completion. High-volume simulation pipelines, relationship scoring, narrative tag generation, and memory-aging logic will be load-tested. Success is reflected in smooth, scalable character evolution off-chain, confirming that the system can generate meaningful events to feed the future snapshot engine.\n\n\n\nMilestone 3 measures on-chain readiness. Testnet minting of CIP-68 identity NFTs will demonstrate that metadata, reference datums, CBOR serialization, and policy scripts work reliably. Metrics include successful minting, versioned identity updates, and explorer-verified reference datums. This milestone provides concrete evidence that evolving Living NFTs can exist on Cardano, laying the groundwork for mainnet adoption.\n\n\n\nMilestone 4 represents full Web2-to-Web3 integration and mainnet preparation. Key on-chain success metrics include:\n\n\n\nSnapshot engine producing valid identity JSON\n\n\n\nBatch updates successfully updating 100+ characters per cycle\n\n\n\nCIP-68 reference datum updates functioning end-to-end on testnet\n\n\n\nViewer tool displaying real-time snapshot data\n\n\n\nPlayers completing wallet onboarding and minting their Living NFTs\n\n\n\nAdditional indicators of success include system performance (updates under 60 seconds), cost efficiency (≈0.18 ADA per character per cycle), and reliable handling of thousands of off-chain events per month. Player adoption, measured through beta participation and tutorial completion rates, will provide supporting evidence that the game is engaging, accessible, and capable of introducing Web2 players to Cardano.\n\n\n\nTogether, these milestones and metrics provide a clear, measurable path from early off-chain gameplay to scalable, on-chain Living NFTs. They demonstrate both functional success and meaningful ecosystem impact, showing how Blank Wars will grow Cardano’s user base, highlight CIP-68 capabilities, and establish best practices for other dynamic NFT projects.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Blank Wars solves the problem by combining a viral, low friction onboarding funnel with a robust Cardano native identity engine built on CIP-68. The solution uses beloved public domain legends and influencer inspired characters, endowed with digital life, living data, and evolving personalities, to create a fun entry point for new users. Players can begin in a familiar Web2 style environment, enjoy the comedy and drama of the house, and only touch Cardano when they are ready to mint their character, claim variants, or receive monthly identity snapshots. This Web2 to Cardano funnel lowers technical barriers to entry while turning characters into shareable, clip worthy personalities that naturally generate off chain attention and bring new audiences onto the network.\n\n\n\nUnder the hood, Blank Wars implements a hybrid architecture where the full game simulation runs off chain, and Cardano is used as the canonical identity and history layer. All high frequency simulation work happens in the backend and database: psychology and adherence systems, training and work loops, battle outcomes, roommate events, environmental changes, AI generated dialogue, and long form narrative. PostgreSQL stores raw character state, aggregation views for snapshot preparation, materialized views for memory aging, relationship scoring tables, environment and living condition states, and narrative event logs. A dedicated worker service transforms this rich simulation data into compact monthly identity summaries.\n\n\n\nAt the core of the solution is the monthly snapshot engine that maintains each character as a Living NFT. Once per month, the snapshot job aggregates character state from the database and summarizes it using a canonical CIP-68 compatible schema. This schema includes identity, progression, stats, spells and powers, rebellion history, relationship graph, social history, living conditions, badges and narrative tags, incident context, AI selected vintage memories, communication summaries, and provenance markers. Memories are aged, important events are distilled, and the final identity payload is encoded to CBOR and written as a CIP-68 reference datum.\n\n\n\nAll updates are batched so that hundreds or thousands of characters can be updated in a single predictable cycle. The snapshot engine batches CIP-68 writes to minimize transaction count, publishes monthly metadata updates, logs transaction hashes, and increments a snapshot index for each character. This monthly batching pattern is a key part of the solution. It shows how dynamic NFTs can evolve at scale and still respect Cardano’s cost profile, turning what would be an expensive continuous update model into a stable, sustainable schedule of on chain identity checkpoints.\n\n\n\nBlank Wars uses CIP-68 as the foundation for its Cardano integration. Each character is represented by a mutable identity NFT that points to a reference datum storing the current snapshot. Monthly updates write new snapshots, and event driven micro updates are merged when minting, purchases, or special drops occur. The solution follows Cardano best practices for versioned, mutable metadata storage, avoids unnecessary writes, and uses Cardano only for identity level data rather than raw simulation logs. This keeps on chain payloads small while still giving explorers, wallets, and external tools a rich, structured view of each character’s life.\n\n\n\nSecurity and integrity are built into the solution. All minting and snapshot updates originate from official Blank Wars backend signing keys. A policy script governs allowed update intervals, permitted datums, and authorized actors. Data validation ensures there are no oversized payloads, no invalid enum values, and no malformed memory tags. AI driven memory selection is constrained by in game events, bounded tag vocabularies, and deterministic encoding rules. This protects the chain from malformed data and ensures that identity evolution is auditable and predictable.\n\n\n\nThe solution includes a thorough testing strategy. Blank Wars uses a local Cardano testnet for minting and snapshot updates, unit tests for each field aggregator, snapshot diff tests to verify month to month changes, integration tests for CIP-68 reading and writing, and load testing with hundreds of characters to verify performance. Regression tests guard against schema changes, and wallet disconnected gameplay tests verify that players can experience the game fully in Web2 mode before touching Web3. This testing plan makes the solution reliable and reduces technical risk for Fund15.\n\n\n\nOn the gameplay and user experience side, the solution is implemented as a complete Web2 to Web3 loop. The player has. to try and coach an AI driven cast of legendary and influencer style personas who live together, train, work, and compete. Their choices, conflicts, and story arcs generate chaotic, comedic, highly shareable moments. When a player decides to mint, the system turns their character into a Living NFT that captures their stats, memories, relationships, and season history. Over time, monthly snapshots preserve this journey on Cardano, while off chain simulation keeps the game fast, responsive, and fun.\n\n\n\nThe implemented tech stack is mature and production ready. Blank Wars uses a Next.js and React 19 frontend, a Node and Express backend, PostgreSQL with more than one hundred tuned tables, AI microservices for psychology, narrative, and character behavior, and a GPU workstation with LocalAI for low cost inference. CIP-68 metadata structures are used to provide scalable, evolving on chain identity. This architecture supports rapid iteration, monthly content expansion, smooth onboarding, fast simulation, and a very low on chain footprint. It is designed not just to ship a single game, but to serve as a reusable pattern for other Cardano builders.\n\n\n\nThe solution includes specific deliverables for Fund15 that map cleanly to the Use Cases Prototype and Launch category. These include a CIP-68 integration library, minting system, snapshot engine, monthly update pipeline, testnet implementation, playable prototype with a full Web2 to Web3 loop, developer documentation, and a basic character viewer. The CIP-68 integration layer and associated utilities will be released open source so that other teams can adopt the same dynamic identity patterns without building everything from scratch.\n\n\n\nBlank Wars is already far beyond idea stage, which strengthens the solution further. The current implementation includes a production grade database, a complete psychology and adherence system, more than six hundred powers and abilities, a battle engine that is roughly eighty five percent implemented, active AI integration, and substantial progress on multiple mini games. A live testing environment already exists. Catalyst funding is focused on completing Cardano integration, finishing the remaining game systems, polishing the 3D theater and onboarding experience, and bringing the dynamic identity engine to mainnet.\n\n\n\nFinally, the solution is designed for long term sustainability on Cardano. Detailed chain usage projections show that even at ten thousand active users the annual transaction count and cost remain manageable using monthly batched CIP-68 updates instead of constant writes. Recurring monthly updates, occasional badge drops, and rare major event updates create a stable, predictable transaction flow that is economical at every scale. Combined with a revenue model based on cosmetics, influencer character drops, tournaments, and future seasons, the solution is built to survive and grow beyond the funding window while continuously demonstrating Cardano’s strengths to new players and communities.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Blank Wars’ use of beloved public-domain characters and influencer personas—endowed with digital life, living data, and evolving identities—creates a fun, viral on-ramp for new audiences to onboard to Cardano. This funnel expands the Cardano ecosystem organically by introducing mainstream players, influencers, and content creators to the network with lowered technical barriers to entry. Because characters generate chaotic, comedic, highly shareable moments, the game naturally produces off-chain viral content that loops back into Cardano visibility and adoption.\n\n\n\nIn addition to onboarding, Blank Wars showcases a novel and distinctly Cardano-native use of NFTs: living AI personalities with evolving stats and data powered by CIP-68. This project demonstrates what the ecosystem can uniquely support—scalable dynamic identity, expressive metadata, persistent memories, relationship graphs, behavioral summaries, and narrative-driven evolution. Very few Cardano projects use CIP-68 for meaningful state progression, and none at the scale or narrative depth presented here. Blank Wars establishes a new category of NFT usage that highlights Cardano’s strengths: low fees, predictable updates, and a two-layer metadata standard ideal for evolving state.\n\n\n\nThe proposal addresses several ecosystem-wide gaps. Most NFT projects on Cardano still rely on static metadata, while games attempting dynamic updates face prohibitive costs or complexity. Many Cardano games also require early wallet setup, limiting accessibility for mainstream adoption. Furthermore, Catalyst-funded projects rarely integrate AI-driven storytelling or behavior systems into NFTs in a scalable, chain-efficient way. Blank Wars directly solves these issues through its hybrid architecture: monthly snapshot batching for predictable low cost, event-driven micro-updates, compact identity deltas, and off-chain simulation that absorbs the heavy compute load.\n\n\n\nThis approach not only makes dynamic NFTs viable, but also establishes best practices for other teams. The project will release its CIP-68 integration layer open-source, along with developer documentation and a basic character viewer. These tools help other builders adopt dynamic identity patterns and apply expressive metadata without inflating costs or bloating the chain. The compact schema and update pipeline presented here are reusable, scalable, and directly beneficial to the broader Cardano developer ecosystem.\n\n\n\nBlank Wars delivers tangible, near-term impact because much of the system already exists. The game currently includes a production-grade database, a complete psychology and adherence system, more than 600 powers and abilities, an 85 percent implemented battle engine, active AI integration, and substantial progress on multiple supporting mini-games. A live testing environment already exists. This high level of readiness dramatically reduces delivery risk and ensures that Cardano benefits from a working prototype early in the funding cycle.\n\n\n\nTechnically, the architecture demonstrates how thousands of evolving characters can be maintained on Cardano with an extremely low network footprint. Off-chain simulation handles 99 percent of computation, while only compact identity deltas hit the chain. Monthly batch publishing keeps traffic predictable and sustainable. This provides the ecosystem a clear, scalable model for high-frequency NFT evolution that would be impractical or financially impossible on higher-fee blockchains.\n\n\n\nFinally, Blank Wars includes a clear community engagement strategy: a Cardano community beta, Discord-driven feedback loops, milestone demo videos, transparent roadmap publishing, and integration of community-requested features. These efforts strengthen ecosystem participation while showcasing Cardano as the ideal platform for dynamic, narrative-driven NFTs.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Blank Wars is already well beyond the concept stage and exists today as a functioning, production-grade system. This significantly increases our capability to deliver and reduces typical uncertainty associated with early-stage Catalyst proposals. The current implementation includes a 115+ table PostgreSQL production database, a complete psychology and adherence system, more than 600 powers and abilities, an AI-driven behavioral layer, an ~85 percent implemented battle engine, two mini-games in active development, and a working testing environment. These components demonstrate that the core simulation, world logic, data structures, and technical stack are already real, stable, and maintained. Catalyst funding accelerates the Cardano integration and final production polish rather than supporting speculative or unproven work.\n\n\n\nOur team has direct experience building full-stack systems, tuning relational database architectures, integrating AI services, designing game loops, and implementing performant backend pipelines. The architecture we have already built shows clear capability: multiple interacting systems (psychology, stats, incidents, relationships, combat, identity snapshots) run deterministically and consistently across thousands of simulations. We have also already implemented a working Web2-style onboarding flow and a 3D theater environment powered by React 19 and Next.js, demonstrating our ability to deliver polished player-facing features.\n\n\n\nTrust and accountability are supported through transparent development practices. All Cardano interactions will be logged, including CIP-68 writes, snapshot hashes, and policy IDs. Milestone outputs (CIP-68 integration library, snapshot engine, testnet implementation, viewer, and playable prototype) can all be independently verified through testnet transactions, open-source code, and milestone demo videos. Each milestone includes clear acceptance criteria such as: completed testnet minting, snapshot publication logs, explorer-readable metadata, and functional Web2→Web3 transitions. Reviewers and the community will be able to validate progress directly through the blockchain and through the published artifacts.\n\n\n\nFeasibility is validated through rigorous testing across the full stack. We use a local Cardano testnet for iterative minting and snapshot publishing, ensuring CIP-68 integration is correct before mainnet deployment. The backend includes unit tests for each field aggregator, snapshot diff tests to ensure month-to-month integrity, and regression tests to protect schema stability. Load testing verifies that our batching system can scale to hundreds or thousands of character updates within expected performance and cost limits. Wallet-disconnected gameplay tests confirm that onboarding works seamlessly for users who have never interacted with a blockchain before.\n\n\n\nOur architecture makes feasibility concrete. The off-chain simulation engine performs 99 percent of the compute, while only compact identity deltas are written on chain through monthly batching. This guarantees predictable costs, low network footprint, and reliable production scaling. Cardano’s low fees and CIP-68’s two-layer design make this approach technically and economically viable. Furthermore, because the identity schema, CBOR serializer, snapshot builder, and update pipeline are all deterministic and testable, the system is highly auditable and straightforward to maintain.\n\n\n\nBy combining a real, functioning prototype; a mature database and simulation engine; a clear testing and validation framework; verifiable on-chain outputs; and transparent milestone-driven development, we demonstrate high capability to deliver this project with trust, accountability, and technical feasibility.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Development Environment, Core DB Schema, and Web2 Onboarding Foundation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone establishes the foundation of Blank Wars by finalizing the production PostgreSQL schema (115+ tables), deploying the development and testing environments, and implementing the basic Web2 onboarding path. Players will be able to enter the game without a wallet, interact with characters, observe simple incidents, and explore the early-stage theater UI. This milestone ensures the database architecture, character table structures, memory-aging logic, relationship scoring tables, and environmental state tables are correct and functioning. Early gameplay loops—including viewing characters, reading narrative logs, simple reactions, and placeholder interactions—will run to validate deterministic simulation.\n\n\n\nThe 3D React/Next.js “theater mode” interface will be installed using placeholder animations and static dialogue bubbles to confirm rendering stability. No advanced combat or powers are required here. All work in this milestone reduces early risk, validates performance assumptions, and prepares the system for full simulation and CIP-68 integration in later milestones. A live local test environment will be deployed for continuous development validation.\n\nAcceptance Criteria","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"• Production database schema complete and seeded\n\n• Local test environment deployed\n\n• Baseline Web2 onboarding functional (no wallet needed)\n\n• Theater UI operational with placeholder behaviors\n\n• Initial prototype demo video submitted\n\n• Architecture / GitHub documentation delivered","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"• A deployed local testing environment accessible through documented startup instructions\n\n• PostgreSQL schema file (115+ tables) and ERD diagram published in repo or documentation\n\n• Seeded database demonstrating working tables, memory-aging views, relationship tables, and environment states\n\n• Video walkthrough of baseline Web2 onboarding (no wallet required)\n\n• Demonstration of the theater UI with placeholder interactions and static bubbles\n\n• Architecture document or GitHub repo containing non-proprietary components (schema files, diagrams, setup scripts)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Core Simulation Systems: Psychology, Abilities, and Battle Engine Foundation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone brings the full AI-driven simulation engine online. The psychology and adherence systems will be connected to character logic, enabling personalities to influence choices, conflicts, and reactions. The abilities system (600+ powers) will be integrated with deterministic stat calculations, resistances, and effects. The battle engine will be stabilized to ~85 percent completion, allowing characters to train, compete, and evolve internally even before blockchain integration.\n\n\n\nHigh-volume simulation systems such as relationship scoring, conflicts, training loops, environmental changes, narrative tags, incident generation, memory aging, and character state deltas will be validated under load. The 3D theater UI will be upgraded to include comic-style word bubbles, improved animations, and live expression of AI-driven behavior. This milestone confirms the simulation performs consistently and at scale, providing the data required for Cardano snapshot generation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"• Psychology, adherence, and abilities systems complete\n\n• Battle engine ~85 percent complete\n\n• High-volume simulation pipelines functional\n\n• 3D theater UI upgraded with dynamic bubbles\n\n• Simulation load-testing complete\n\n• Demo video submitted","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"• Live demo video showing psychology and adherence affecting character behavior\n\n• Battle engine demonstration (abilities, resistances, effects) with 85 percent functionality\n\n• Load-test logs showing high-volume simulation features functioning under stress\n\n• Demo of narrative tags, incidents, relationship scoring, training loops, aging memories, and state deltas\n\n• Updated 3D theater UI demonstration with dynamic comic-style word bubbles\n\n• Internal test logs validating deterministic sim output across multiple runs","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"CIP-68 Identity Integration: Testnet Minting and Metadata Framework","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers full CIP-68 integration for testnet identity NFTs. The canonical snapshot schema (identity, stats, memories, relationships, incidents, achievements, provenance) will be fully implemented with versioning. The CBOR serializer and validator will be built, enabling compliant and compact metadata. The reference-datum layer for CIP-68 will be added, and the initial minting pipeline will allow players to mint their character’s identity NFT on testnet.\n\n\n\nA secure backend signing-key service will handle all identity updates, enforced by a policy script controlling authorized actors, permitted datums, and update intervals. Integration tests will validate minting, reading reference datums, schema adherence, and multi-character consistency. The prototype UI will gain a “Mint Character” interface that performs a complete testnet transaction. This milestone establishes the backbone required for evolving identity.\n\nAcceptance Criteria","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"• CIP-68 schema implemented with versioning\n\n• Testnet minting pipeline functional\n\n• Reference datums readable in explorers\n\n• CBOR serializer + validator completed\n\n• Policy script finalized\n\n• Demonstration video + transaction IDs provided","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"• Testnet transaction IDs for minting at least several identity NFTs\n\n• Explorer-readable reference datums showing correct CIP-68 metadata structure\n\n• Published CBOR serializer + validation tool (repo, docs, or code snippet)\n\n• Policy script file and documentation explaining authorized update rules\n\n• Demo video of minting flow inside the prototype UI\n\n• Testnet logs showing schema validation across multiple characters\n\n• Report of integration tests confirming:","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Snapshot Engine, Batch Updates, Cardano Prototype, and Mainnet Launch Prep","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone combines the final two major components:\n\n\n\n    The monthly snapshot engine\n\n\n\n    The Cardano-integrated playable prototype and launch prep\n\n\n\nThe snapshot engine will convert off-chain simulation into on-chain identity updates. It will aggregate each character’s state (stats, relationships, incidents, memories, badges, living conditions), compute derived fields, age memories, select AI-validated vintage memories, assemble the canonical snapshot, encode it to CBOR, and write to each character’s CIP-68 reference datum. The batching engine will update hundreds of characters per cycle, validated through load testing and cost modeling. Snapshot diffs will be automatically validated.\n\n\n\nIn parallel, the full Web2→Web3 flow will be completed: players interact off-chain, mint their Living NFT, and see their identity evolve on chain. A viewer tool will display snapshot data directly from testnet. Mainnet preparation includes finalizing scripts, optimizing snapshot size, validating performance, securing the pipeline, polishing onboarding, and conducting a Cardano beta. A mainnet deployment plan and catalyst close-out report conclude the milestone.\n\nAcceptance Criteria","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"• Snapshot generator producing valid identity JSON\n\n• Batch engine updating ≥100 characters per run\n\n• CIP-68 updates functioning end-to-end on testnet\n\n• Viewer tool reading snapshot data\n\n• Wallet onboarding + minting flow functioning\n\n• Mainnet script package + deployment plan complete\n\n• Final demo video, documentation, and close-out report delivered","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"• Snapshot engine demonstration video showing:\n\n    state aggregation\n\n    memory aging\n\n    vintage memory selection\n\n    canonical snapshot assembly\n\n    • Testnet transaction IDs showing ≥100 characters updated in a batch cycle\n\n    • Snapshot diff logs comparing month-to-month deltas\n\n    • Viewer tool displaying testnet CIP-68 snapshot data\n\n    • Fully playable Cardano-integrated prototype demo\n\n    • Working minting + wallet onboarding flow video\n\n    • Mainnet deployment plan document (policy scripts, cost model, performance benchmarks)\n\n    • Final documentation package:\n\n    snapshot schema\n\n    batching architecture\n\n    integration instructions\n\n    • Catalyst final report confirming milestone completion","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Gabriel Greenstein — Founder, Lead Developer\n\n\n\n    Skills: Full-stack development (TypeScript, Node.js, PostgreSQL, React, Three.js), creative writing, graphic design, computer systems architecture, and team leadership.\n\n\n\nBackground: 4 successful business exits, started multiple businesses; Master of Public Administration candidate.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/gabealon](https://linkedin.com/in/gabealon)\n\n\n\nMike Johanning — Senior Strategist\n\n\n\n    Skills: Strategic planning, technology roadmap development, stakeholder management, cross-functional coordination, and risk assessment/mitigation.\n\n\n\nBackground: 4 years as Director of Technology at an enterprise organization.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/mikejohanning](https://linkedin.com/in/mikejohanning)\n\n\n\nBrittany Battaglia — Developer, Art Lead\n\n\n\n    Skills: 3D modeling/asset creation (Meshy), UI/UX design, frontend development, project coordination, and quality assurance.\n\n\n\nBackground: 9 years as a Laboratory Manager overseeing complex technical operations; active Cardano community member.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/brittany\\-battaglia\\-13b3b485](https://linkedin.com/in/brittany-battaglia-13b3b485)\n\n\n\nSteven Greenstein — Developer\n\n\n\n    Skills: Backend development, database optimization, and building scalable production systems.\n\n\n\nBackground: Computer Science degree; Master's candidate in Library Science with data management expertise.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/steven\\-greenstein\\-69690279](https://linkedin.com/in/steven-greenstein-69690279)\n\n\n\nTroy Bertolino — Consultant\n\n\n\n    Skills: Gameplay testing, feedback loops, tutorial design, and onboarding flow design.\n\n\n\nBackground: STEM educator and game development instructor who understands player experience and educational game design.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/troy\\-bertolino\\-hybee](https://linkedin.com/in/troy-bertolino-hybee)\n\n\n\nJoe Tyler — Influencer Business Development\n\n\n\n    Skills: Professional athlete representation, contract negotiation, influencer relationship management, and partnership development.\n\n\n\nBackground: NBA/FIBA certified sports agent; leads outreach to sign influencers as in-game Living NFT characters.\n\n\n\nLinkedIn: [https://linkedin\\.com/in/joe\\-tyler\\-a2509342](https://linkedin.com/in/joe-tyler-a2509342)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Budget Assumptions\n\n• 12 month development schedule\n\n• Team rate: 40 USD per hour\n\n• One GPU workstation (single purchase)\n\n• One enterprise AI subscription (200 USD per month)\n\n• Infrastructure sized to actual needs\n\n• All mini games included at lightweight scope\n\n• Staking removed\n\n\n\nA. Core Game Engineering\n\nSubtotal: 19,200 USD\n\n\n\nFinalize battle hex grid engine\n\nCost: 3,200 USD\n\nHours: 80 (M1)\n\nNotes: Makes game playable; enables real game state on chain.\n\n\n\nAdherence and rebellion logic\n\nCost: 2,800 USD\n\nHours: 70 (M1)\n\nNotes: Core autonomy logic; produces metadata snapshots.\n\n\n\nCharacter stat engine v2 cleanup\n\nCost: 1,600 USD\n\nHours: 40 (M1)\n\nNotes: Stable progression; clean CIP 68 serialization.\n\n\n\n3D theater chat engine integration\n\nCost: 2,400 USD\n\nHours: 60 (M1)\n\nNotes: Replaces text chat; improves explorer visibility.\n\n\n\nAI voice integration\n\nCost: 1,600 USD\n\nHours: 40 (M1)\n\nNotes: Characters feel alive; enhances narrative NFTs.\n\n\n\nMini game polish: Arbor Apocalypse\n\nCost: 1,200 USD\n\nHours: 30 (M1)\n\nNotes: Ready for beta.\n\n\n\nMini game polish: Beast Blank Ball\n\nCost: 1,200 USD\n\nHours: 30 (M1)\n\nNotes: Better UX; increased engagement.\n\n\n\nTutorial creation\n\nCost: 1,600 USD\n\nHours: 40 (M1)\n\nNotes: Better onboarding; more users and mints.\n\n\n\nReward and economy system link\n\nCost: 1,600 USD\n\nHours: 40 (M1)\n\nNotes: XP, currency, leveling; supports Cardano seasons.\n\n\n\nStability, refactor, QA\n\nCost: 2,000 USD\n\nHours: 50 (M1)\n\nNotes: Bug reduction; reliable on chain writes.\n\n\n\nB. Cardano Integration\n\nSubtotal: 15,200 USD\n\n\n\nCIP 68 schema finalization\n\nCost: 2,000 USD\n\nHours: 50 (M2)\n\n\n\nSnapshot 0 mint builder\n\nCost: 1,600 USD\n\nHours: 40 (M2)\n\n\n\nCBOR serialization and size limits\n\nCost: 1,200 USD\n\nHours: 30 (M2)\n\n\n\nReference NFTs on preprod\n\nCost: 2,400 USD\n\nHours: 60 (M2)\n\n\n\nWallet connections (Nami, Eternl, Lace)\n\nCost: 2,400 USD\n\nHours: 60 (M2)\n\n\n\nTransaction builder service\n\nCost: 1,600 USD\n\nHours: 40 (M2)\n\n\n\nTestnet environment setup\n\nCost: 800 USD\n\nHours: 20 (M2)\n\n\n\nCIP 68 read/write validation\n\nCost: 1,600 USD\n\nHours: 40 (M2)\n\n\n\nIntegration layer documentation\n\nCost: 1,600 USD\n\nHours: 40 (M2)\n\n\n\nC. Monthly Snapshot Engine\n\nSubtotal: 10,000 USD\n\n\n\nSnapshot aggregator\n\nCost: 2,000 USD\n\nHours: 50 (M3)\n\n\n\nMemory aging logic\n\nCost: 800 USD\n\nHours: 20 (M3)\n\n\n\nVintage Memory selector\n\nCost: 1,200 USD\n\nHours: 30 (M3)\n\n\n\nRelationship graph compression\n\nCost: 1,200 USD\n\nHours: 30 (M3)\n\n\n\nLiving condition aggregator\n\nCost: 800 USD\n\nHours: 20 (M3)\n\n\n\nIncident and event tagger\n\nCost: 1,200 USD\n\nHours: 30 (M3)\n\n\n\nBatch publishing engine\n\nCost: 1,600 USD\n\nHours: 40 (M3)\n\n\n\nSnapshot diff validator\n\nCost: 1,200 USD\n\nHours: 30 (M3)\n\n\n\nD. 3D Assets and Animation\n\nSubtotal: 6,000 USD\n\n\n\n3D character rigging and retargeting\n\nCost: 2,000 USD\n\nContractor (M1)\n\n\n\nBattle cutscene animations\n\nCost: 2,000 USD\n\nContractor (M1)\n\n\n\nSignature move animations\n\nCost: 1,200 USD\n\nHours: 30 (M1)\n\n\n\n3D prop and environment integration\n\nCost: 800 USD\n\nHours: 20 (M1)\n\n\n\nE. Influencer Pipeline\n\nSubtotal: 4,000 USD\n\n\n\nOutreach and negotiation\n\nCost: 2,400 USD\n\nHours: 60 (M4)\n\n\n\nInfluencer onboarding\n\nCost: 800 USD\n\nHours: 20 (M4)\n\n\n\nLegal and rights formatting\n\nCost: 800 USD\n\nHours: 20 (M4)\n\n\n\nF. Infrastructure and AI Tools\n\nSubtotal: 7,700 USD\n\n\n\nAI enterprise license\n\nCost: 2,400 USD\n\n200 USD per month for 12 months\n\n\n\nHosting and DevOps\n\nCost: 1,200 USD\n\n100 USD per month for 12 months\n\n\n\nBlockfrost and Cardano API\n\nCost: 600 USD\n\n50 USD per month for 12 months\n\n\n\nLocalAI GPU workstation\n\nCost: 3,500 USD\n\nSingle hardware purchase\n\n\n\nG. Misc and Required Costs\n\nSubtotal: 3,600 USD\n\n\n\nCardano fees\n\nCost: 500 USD\n\n\n\nPromo video and editor\n\nCost: 2,500 USD\n\nContractor (M4)\n\n\n\nDomain, legal, miscellaneous\n\nCost: 600 USD\n\n\n\nTOTAL BUDGET\n\n65,700 USD\n\n\n\nADA CONVERSION\n\n65,700 USD at 0.44 USD per ADA equals approximately 149,318 ADA.\n\n\n\nFINAL ADA REQUEST\n\n150,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Blank Wars delivers strong value for money because the majority of the heavy development work is already complete. The project currently includes a production PostgreSQL database with over 115 structured tables, a mature simulation engine, psychology and adherence systems, 600+ abilities, an ~85 percent battle engine, active AI integration, and a functional Web2 prototype. Catalyst funding accelerates Cardano integration and launch preparation rather than paying for speculative R&D. This dramatically reduces risk and ensures funds are used to finalize a system that already exists and works today.\n\n\n\nThe architecture is designed to minimize on-chain cost for both the project and the ecosystem. Instead of placing simulation or high-frequency updates on chain, the system uses off-chain computation with compact monthly CIP-68 snapshots. This reduces traffic by more than 99 percent compared to continuous updates and keeps identity evolution affordable at scale. Batching hundreds of characters into predictable cycles maximizes efficiency and ensures long-term sustainability without placing unnecessary load on Cardano. The system demonstrates how dynamic NFTs can exist with extremely low chain footprint, providing reusable patterns for future builders.\n\n\n\nCatalyst funds also generate compounding value for the broader Cardano community. The CIP-68 integration layer, the identity snapshot engine, CBOR serializer, metadata schema, and viewer tool will be released open source. These components allow other teams to adopt dynamic identity patterns without building their own infrastructure, reducing duplication and speeding up innovation across the ecosystem. Because the Blank Wars metadata format is modular and well-structured, it can be adapted by games, storytelling projects, metaverse tools, and identity-driven applications.\n\n\n\nThe cost structure is proportional to the deliverables. Milestones follow a logical progression from foundational setup, to simulation, to CIP-68 integration, to the snapshot engine and launch-ready prototype. Each milestone has clear acceptance criteria that can be independently verified through testnet transactions, demo videos, documentation, and on-chain data. Funds are tied to objective outputs, ensuring accountability and reducing delivery uncertainty.\n\n\n\nBlank Wars also provides strong return on investment through its viral adoption funnel. By leveraging beloved public-domain icons and influencer-style characters who generate chaotic, comedic, highly shareable content, the game naturally produces off-chain visibility that draws new users toward Cardano. The Web2 onboarding flow lowers barriers for mainstream players, and conversion to CIP-68 Living NFTs occurs only when users choose to engage on chain. This approach delivers real user growth for the ecosystem at minimal cost.\n\n\n\nFinally, the project is built for sustainability beyond the funding window. The monthly snapshot pattern keeps long-term operating costs predictable and low. Revenue from cosmetics, influencer-driven character drops, tournament events, and future expansion packs supports continued development. The open-source components, documentation, and integration tooling ensure that even after launch, the ecosystem continues to benefit from the infrastructure Catalyst funded. Together, these factors make Blank Wars a cost-efficient, low-risk, high-impact investment for Cardano.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Gaming","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1672}