{"pr_id":"019ac239-0d7e-7298-8379-eed961374ba7","title":"USDM cash-out at network of ATM and Retail & Hydra prototype","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardless stablecoin cash withdrawal needs two types of scale: global widely available access points, and adequate network throughput.","solution":"NBX and Moneta Digital will launch a commercially available cash-out service via the Flip App using the widely available Pin4 network. We will also prototype scaling solutions with Hydra L2.","proposer_name":"Norwegian Block Exchange & Moneta Digital","proposer_relevant_experience":"- Eystein Hansen (Head of Staking, Norwegian Block Exchange): Responsible for project planning, coordination, and ensuring alignment with the broader Cardano ecosystem (Staking Pool Operator, CC Council member).[https://www\\.linkedin\\.com/in/eystein\\-hansen\\-93376756/](https://www.linkedin.com/in/eystein-hansen-93376756/)\n- Alex Karpov (Chief Technology Officer, Norwegian Block Exchange): Responsible for high-level technical planning, architecture, scoping, and overall implementation oversight, leveraging previous experience with Cardano blockchain integration at NBX. [https://www\\.linkedin\\.com/in/alex\\-karpov/](https://www.linkedin.com/in/alex-karpov/)\n- James Meidinger (Business Development Lead, Moneta Digital / USDM): Consultant and Community Manager focused on building consensus within the Cardano community and translating complex initiatives into clear, accessible messaging for the broader ecosystem. Will be responsible for community engagement, socialization and narrative building, this will also include real time engagement with partners currently working and building within this space. Showcasing those that have led the development, like DripDrops and DeltaDefi and how this complements what's currently making impact within Cardano and beyond. [https://www\\.linkedin\\.com/in/james\\-meidinger\\-7a777b43/](https://www.linkedin.com/in/james-meidinger-7a777b43/)\n\n\n\nIn addition, the project will leverage:\n\n- NBX Development Team: Experienced engineers providing front-end (Flip App) and robust backend (NBX platform) development.\n- Moneta Digital Development Team: Providing specialist expertise in stablecoin issuance, custody, and liquidity management.\n- External Hydra Experts: Consultation to ensure best practices and optimal implementation of the Hydra L2 protocol.","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"USDM cash-out at network of ATM and Retail & Hydra prototype","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Norwegian Block Exchange & Moneta Digital","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardless stablecoin cash withdrawal needs two types of scale: global widely available access points, and adequate network throughput.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"NBX and Moneta Digital will launch a commercially available cash-out service via the Flip App using the widely available Pin4 network. We will also prototype scaling solutions with Hydra L2.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.nbx.com","https://moneta.global/","https://www.pin4.com/","https://www.theflip.app/","https://hydra.family/head-protocol/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"We depend on successfully deploying the cash-out feature through Pin4 and thus rely on their partnership. We also depend on successful technical integration of Hydra in our solution to demonstrate the scaling, and to demonstrate Hydra L2 is fit for purpose for a L2 solution for cash-out.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"The project and its implementation will be the intellectual property of Norwegian Block Exchange. ","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Financial Services","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"As far as NBX and Moneta Digital is aware in our initial research there is no current solution on the Cardano Blockchain that would have the extent of cash-out locations as what we are proposing in collaboration with Pin4. We also believe prototyping the usage of Hydra L2 technology for cash-out transactions at retail locations would be novel on the Cardano blockchain and would pave the way for near-instant cash out transfers and the scale needed for widescale commercial adoption.  \n\n\n\nThis proposal delivers a commercial use case: allowing people to cash-out USDM through Pin4  at a top three global money transmitter and a top 3 US retailer.  It connects Cardano to one of the largest retail networks in the world and shows how blockchain can replace slow, expensive, and outdated payment rails. \n\n\n\nPrototyping Hydra gives us the path for further speed, low cost, and reliability needed for retail transactions of the scale where millions of people may eventually redeem stablecoins for cash and is an important prototyping step to further develop the product.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our MVP will have a commercial solution of cash-out of USDM into USD through our partner Pin4 that has a network of more than  500,000 ATM and retail store cash pick up locations globally. The solution will be accessible through the non-custodial app the Flip app. ([https://www\\.theflip\\.app/\\)\\.](https://www.theflip.app/).) We will in addition prototype using Hydra L2 and demonstrate near instant settlements of cash-out with Hydra L2 as the initial settlement layer and document this on a cardano testnet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"We will demonstrate cash-out withdrawals of USDM to USD from retailers and ATM with the cardless solution of our partner Pin4 across locations both in the US and in Europe.\n\n\n\nFor the Hydra prototype demonstrating scale through a simulated 3000 daily cash-out withdrawals (equivalent of over 1 million a year) on a testnet, and a near instant settlement time would be considered a successful prototype.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"NBX and Moneta Digital will solve the commercial problem of limited cash-out locations by  partnering with Pin4, accessing their vast network of more than 500,000 ATM and retail store cash pick up locations globally. This cash-out capability will be deployed within our non-custodial app the Flip App. This immediately provides the wide adoption necessary for the USDM stablecoin cash-out to be a commercially viable product.\n\nTo overcome the limitations of the Cardano L1 that hinders mass adoption for cash-out services of transaction fees, slower speed and limits on scale, we at NBX and Moneta Digital are prototyping a cash-out service utilizing Hydra Layer 2 scaling technology. This prototype will pave the way for near-instant, low-cost settlement for users to redeem USDM stablecoins for cash.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This proposal integrates Cardano and its premier fiat-backed stablecoin (USDM) into the Pin4 network, providing more than 500,000 ATM and retail store cash pick up locations globally. This massive scale provides utility for high-impact use cases like consumer incentives, payroll, and remittances, including the ability to disburse cash for disaster or financial relief, serving both banked and unbanked populations.  The integration with the Flip App allows for seamless peer-to-peer (P2P) USDM transfers, where the recipient can cash out via the Pin4 network. The Hydra prototyping will demonstrate the scale capabilities needed for widescale commercial adoption of such a cash-out solution.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Norwegian Block Exchange (NBX) will be the main developer of this project with support from Moneta Digital the USDM issuer. NBX has in the past (F11) proposed a CNT marketplace that while not approved for a grant, we where able to deliver the solution. ([https://projectcatalyst\\.io/funds/11/cardano\\-use\\-cases\\-product/create\\-a\\-cnt\\-marketplace\\-on\\-norwegian\\-block\\-exchange\\-nbxcom\\)\\.](https://projectcatalyst.io/funds/11/cardano-use-cases-product/create-a-cnt-marketplace-on-norwegian-block-exchange-nbxcom).) You can find our CNT marketplace for USDM stablecoin here: [https://app\\.nbx\\.com/markets](https://app.nbx.com/markets)\n\nNBX was founded in 2018, and is headquartered in Oslo, Norway. The company is registered with Finanstilsynet (the Norwegian Financial Supervisory Authority) and is listed on the Oslo Stock Exchange Euronext Growth. Our latest public report (H1 2025) can be found on our investor relations page ([https://nbx\\.com/en/investor\\)](https://nbx.com/en/investor)\n\nMoneta Digital is the issuer of Cardano’s premier fiat-backed stablecoin, USDM. Launching  the USDM token last year, and successfully completing their Project Catalyst Fund 10 proposal ([https://milestones\\.projectcatalyst\\.io/projects/1000189\\),](https://milestones.projectcatalyst.io/projects/1000189),) USDM provides the foundation for lending, trading, and real-world utility on-chain. Its integration across dApps and liquidity pools proves how strategic funding and financial infrastructure can drive measurable network growth. The Moneta Digital team is eager to collaborate with NBX and other partners to extend the utility of its stablecoin.\n\nMoneta Digital LLC is headquartered in Indiana, USA and is Moneta Digital LLC is Federally regulated by Financial Crimes Enforcement Network as a Money Service Business. FinCEN MSB Registration number 31000296483332.\n\n\n\nThis project builds upon the capabilities of Moneta Digital ([https://moneta\\.global/retail\\-launch/\\)](https://moneta.global/retail-launch/)) and NBX to issue USDM, as well as our past experience with NBX integrating USDM into our Centralized Exchange ([https://nbx\\.com/en/usdm\\),](https://nbx.com/en/usdm),) and utilize Pin4’s  capabilities in cash-out solutions ([https://www\\.pin4\\.com/\\#how\\-it\\-works\\)\\.](https://www.pin4.com/#how-it-works).) \n\n\n\nWe will demonstrate on testnets that the Hydra technology works with cash-out solutions of Pin4. We’ll use that data to evaluate whether this solution can scale effectively for mass adoption. We will test actual cash withdrawals with a peer to peer transfer on the Flip app of USDM that we cash-out at both an ATM and a retailer.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Initial integration work with pin4","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will create the foundational API and settlement logic to execute a complete USDM transaction flow using Cardano L1. This involves establishing the secure interface between the settlement infrastructure and the Pin4 API network to process fiat withdrawal requests.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A single Cardano mainnet on-chain transaction of USDM, demonstrably processed through the settlement solution, and must be successfully approved by the Pin4 network for fiat USD withdrawal at a designated retail or ATM location.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Confirmation by Pin4, delivered through official API response logs and internal reconciliation reports, that the specific L1 USDM transaction was successfully received, validated on the Cardano mainnet ledger, and the Pin4 system correctly initiated the request for physical cash withdrawal by the end-user","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":33333,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Initial Flip App integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Development and integration of the initial cash-out request feature within the non-custodial Flip App mobile wallet (iOS/Android). This includes implementing the necessary SDK calls to allow users to securely select a cash-out amount, sign a verifiable Cardano transaction with their private keys, and communicate the finalized L1 transaction details to the NBX backend for Pin4 processing.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The Flip App must successfully initiate and broadcast a valid Cardano L1 transaction for a specified USDM cash-out amount, signed exclusively by the user's non-custodial wallet. The application's UI must accurately process the subsequent API response, resulting in the correct display of the corresponding Pin4 authorization code for withdrawal.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A video demonstration the end-user journey within the Flip App, starting from non-custodial wallet selection, transaction signing, to the final, successful display of the Pin4 authorization code on the screen.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":33333,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Integration with NBX platform","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Development and deployment of the NBX platform API, specifically designed for secure integration with the Flip App wallet's non-custodial transaction requests. This API will handle transaction routing with the Flip App, balance checks and Pin4 API communication.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Deployment of a fully functional and documented NBX API endpoint that is securely stress-tested and successfully receives, validates, and processes signed USDM L1 transaction requests originating from the Flip App.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A comprehensive technical documentation (API specification) detailing the Flip App/NBX API interface.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":33333,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Commercial prototype","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Deployment of the full end-to-end commercial prototype onto the Cardano Mainnet. This system integrates the Flip App, the NBX API, and the Pin4 cash-out network, making the service live for a controlled beta testing group of Cardano users","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Successful execution and full reconciliation of 10 complete, end-to-end cash-out transfers using the Flip App on Cardano Mainnet.This sequence must result in a verifiable fiat USD withdrawal at a physical Pin4 ATM or retailer location by a beta tester, confirming the commercial service is functional and reliable.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A consolidated report providing verifiable evidence for all 10 Mainnet tests, including the unique Mainnet Transaction IDs  and the corresponding authenticated Pin4 withdrawal confirmation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":33333,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Prototype of Hydra L2","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Deployment of a fully operational Hydra Head on the Cardano Testnet specifically for cash-out transaction low simulation. Implementation and stress-testing of a FanOut logic. Successful execution of simulated cash-out transactions achieving 3,000 settlement transactions in a single 24-hour period to prove high-throughput capability.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The prototype system must accumulate a total state exceeding 100 UTXOs within the closed Head, and subsequently, the automated logic must successfully realize all UTXOs onto the L1 Testnet. A recorded throughput rate demonstrating the successful processing of 3,000 USDM debits within the Hydra head over a continuous 24-hour simulation period.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Testnet transaction IDs and detailed system log files demonstrating the successful L1 realization of the accumulated state.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":11,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":33333,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #6","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Documentation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Production of the comprehensive Final Technical Report and the official Project Catalyst Closeout Report. The technical report will detail R&D findings, including the Testnet validation of the Hydra FanOut logic.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Submission of the official Project Catalyst Closeout Report, and subsequent formal approval by the designated Milestone Reviewers, confirming all committed deliverables (M1-M5) have been achieved and the R&D findings regarding Hydra L2 scalability have been documented.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The final, approved Project Catalyst Closeout Report submitted to the platform. This evidence must include the public link to the detailed technical documentation package (M4 Hydra R&D findings) and a summarized report on the community beta feedback.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":33335,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"- Eystein Hansen (Head of Staking, Norwegian Block Exchange): Responsible for project planning, coordination, and ensuring alignment with the broader Cardano ecosystem (Staking Pool Operator, CC Council member).[https://www\\.linkedin\\.com/in/eystein\\-hansen\\-93376756/](https://www.linkedin.com/in/eystein-hansen-93376756/)\n- Alex Karpov (Chief Technology Officer, Norwegian Block Exchange): Responsible for high-level technical planning, architecture, scoping, and overall implementation oversight, leveraging previous experience with Cardano blockchain integration at NBX. [https://www\\.linkedin\\.com/in/alex\\-karpov/](https://www.linkedin.com/in/alex-karpov/)\n- James Meidinger (Business Development Lead, Moneta Digital / USDM): Consultant and Community Manager focused on building consensus within the Cardano community and translating complex initiatives into clear, accessible messaging for the broader ecosystem. Will be responsible for community engagement, socialization and narrative building, this will also include real time engagement with partners currently working and building within this space. Showcasing those that have led the development, like DripDrops and DeltaDefi and how this complements what's currently making impact within Cardano and beyond. [https://www\\.linkedin\\.com/in/james\\-meidinger\\-7a777b43/](https://www.linkedin.com/in/james-meidinger-7a777b43/)\n\n\n\nIn addition, the project will leverage:\n\n- NBX Development Team: Experienced engineers providing front-end (Flip App) and robust backend (NBX platform) development.\n- Moneta Digital Development Team: Providing specialist expertise in stablecoin issuance, custody, and liquidity management.\n- External Hydra Experts: Consultation to ensure best practices and optimal implementation of the Hydra L2 protocol.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The project requests 200,000 ADA in total funding, allocated across six milestones over a 12-month delivery schedule. We will mint each milestone ADA we receive into USDM. \n\n\n\nEach milestone includes a proportional share of development, research, and implementation work necessary to reach the stated outcomes. To maintain fair competition and protect internal rate structures, we are not disclosing individual developer compensation. However, the budget follows a transparent and industry-standard allocation model:\n\n\n\n• Approximately 70 percent of the funding supports core engineering, testing, and implementation performed by our internal development team.\n\n• Up to 30 percent is reserved for external expertise, specifically Hydra specialists who may be engaged on an as needed basis to validate or stress test components critical to the solution. \n\n• No funds will be used for marketing, administration, or unrelated overhead. All resources directly support technical delivery.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The project ensures immediate, measurable L1 transaction volume by deploying the Pin4 network for USDM cash-out and accessible through a non-custodial wallet. This provides the commercial proof-of-concept necessary to validate that USDM is a viable asset for real-world financial needs like payroll and remittances, instantly competing with traditional payment rails that often incurring higher fees or longer settlement delays.  \n\n\n\nWe also prototype and validate Hydra's viability as a scaling solution for this type of commercial product. \n\n\n\nThe combination of the 1M+ app download base of the Flip App and the immediate, high-volume reach of the Pin4 ATM and Retail network gives an instant market channel for USDM stablecoin for cash-out solutions.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Financial Services","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1673}