{"pr_id":"019ac1a4-6c25-7f6c-aa4d-06ec9ac66885","title":"SolarVillage - Metering protocol w. Carbon Credits on Hydra","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Microgrid energy data is stored in spreadsheets and closed systems, making it unverifiable. This prevents trust, blocks carbon credits, and limits financing for clean energy projects.","solution":"We create a Hydra-based metering and payments layer that anchors microgrid energy data to Cardano, providing tamper-evident records that enable trust, transparency, and verifiable carbon credits.","proposer_name":"Noak Lindqvist","proposer_relevant_experience":"**Project Manager – Noak Lindqvist \\(Cubid Protocol\\)**\n\nLeads overall delivery, technical architecture, and coordination across engineering, Cardano integration, and partner agencies. Oversees milestones, reporting, and ensures that the system is built with transparency, rigorous documentation, and adherence to Catalyst expectations.\n\n\n\n**Africa Minigrid Program \\(AMP\\) – Temitope Omowumi **\n\nSustainable Infrastructure Strategist at African Minigrid Program, Nigeria. Oversees reporting requirements and strategy. Responsible for pan-African coordination.\n\n\n\n**REA \\- Dr\\. Bala Tyoden \\(Project Manager, REA\\)**\n\nPrimary liaison for the 23 microgrids in the pilot. Provides access to metering infrastructure, ensures correct operational data flow, and validates the feasibility of deployment at the site level. Confirms that the metering, workflows, and telemetry align with AMP/REA’s operational standards.\n\n\n\n**UNDP Nigeria – Lantana Elhassan \\(Product Development &amp; Partnerships\\)**\n\nEnsures alignment with UNDP oversight processes, QAMF indicators, community-level validation, and donor reporting needs. Provides governance support, transparency monitoring, and ensures system integrity and inclusive access for rural communities.\n\n\n\n**UNDP Nigeria – Osondu Ogbodo \\(Program Coordination / UNDP Technical Lead\\)**\n\nCoordinates implementation work from the UNDP side, ensures partner alignment, risk management, and regulatory engagement (NCCC, REA, NEP). Supports verification, community engagement, and ensures transparent communication between field teams and the technical team.\n\n\n\n**Cardano / Hydra Architect – Prof\\. Lawrence Ley \\(Cubid Protocol\\)**\n\nResponsible for Cardano-side design, Hydra head setup, Plutus/Aiken contract architecture, Merkle-root anchoring logic, and integration reviews. Provides technical assurance that the implementation follows Cardano best practices and Hydra reference patterns.\n\n\n\n**Identity Layer Partners \\- Cubid  and ClearPass \\(Device \\+ Operator Attestation\\)**\n\nProvide device and operator verifiable credentials (DID/VC) to ensure all meters, operators, and data sources are authenticated. Their work guarantees the integrity of the data pipeline from the sensor level upward.\n\n\n\n**Core Engineering Team \\- Firebelly Advisory \\+** others as needed\n\nHydra engineers, backend developers, IoT specialists, and frontend/dashboard developers responsible for implementation of Hydra automation, IoT ingestion, the metering/payments apps, energy tokenization, carbon pipeline, and operator/donor dashboards.\n\n\n\n**Microgrid Operators & Field Technicians \\(AMP / REA Network Contractors\\)**\n\nWork with the engineering team to install, test, and validate the data acquisition devices, ensure 15-minute telemetry accuracy, and support meter-level verification and troubleshooting during each deployment phase.","url":null,"funds":140000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"SolarVillage - Metering protocol w. Carbon Credits on Hydra","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Noak Lindqvist","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":140000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":11,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Microgrid energy data is stored in spreadsheets and closed systems, making it unverifiable. This prevents trust, blocks carbon credits, and limits financing for clean energy projects.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We create a Hydra-based metering and payments layer that anchors microgrid energy data to Cardano, providing tamper-evident records that enable trust, transparency, and verifiable carbon credits.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://solarvillage.xyz/","https://demo.app.solarvillage.xyz/","https://github.com/Solar-Village","https://youtu.be/f3fmP0moHTQ?si=YFC93uzW8msRZUwc","https://youtu.be/QJXLlwKE9uE"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"We are delivering this project in partnership with UNDP Nigeria, and as part of UNDP's SDG Blockchain Accelerator Cohort 2, in the Emurgo Labs track.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"MIT License, once our POC has been implemented.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"RWA","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"# Comparison to existing work\nCatalyst has already funded sustainability pilots (solar NFTs, IoT sensors, carbon markets).\n\n- Many of them start with tokenizing credits first, and then attempt to properly verify them later, almost as an afterthought. **SolarVillage instead starts with the requisite fundamentals: proper capture and verification of information at the source = the individual meters\\.**\n- Others, such as KWARXS were funded to expand Cardano-based solar investments. But they take a different angle: Simply tokenizing and financing fractional ownership in one otherwise fully centralized project.  **SolarVillage builds infrastructure to help any grid owner with their foundational metering, payments, reporting and carbon credits, bringing it all on chain\\.**\n- None yet deliver a Hydra-based, high-throughput metering substrate that feeds trustworthy data into any registry or marketplace.\n\n# How SolarVillage is different\nWe build on Cardano’s Hydra protocol which is tailor-made for this use case: each microgrid can run as an independent “head” that processes 15-minute metering intervals off-chain and commits a frequent Merkle root back to mainnet - a design pattern straight from Hydra’s reference architecture.  The approach drastically lowers transaction costs while maintaining tamper-evidence.\n\nFurther differentiators include:\n\n1. **Infrastructure\\-first:** we build verifiable energy data streams before minting any carbon or energy tokens.\n2. **Industrial scale: **23 microgrids already built or in construction in Nigeria will run as live Hydra heads. With our design, we will be ready from day one to operate hundrdreds or even thousands of microgrids.\n3. **Open and portable:** once stabilized, SolarVillage will be open-sourced and offered as a SaaS platform to other operators across Nigeria, Africa, and the world.\n4. **Identity integrity:** integrations with Cubid (proof-of-personhood) and ClearPass (KYC + DID) guarantee that each device and operator is authenticated on-chain.\n5. **Regulatory alignment:** direct collaboration with the National Council on Climate Change (NCCC), Rural Electrification Agency (REA), the United Nations Development Programme (UNDP) in Nigeria, and the African Minigrid Program (AMP) ensures compatibility with emerging national and pan-African standards. Particularly, we collaborate with and will be one of the very first adopters of the\n6. **Partnering with proven builders**: SolarVillage borrows extensively from and partners with M3tering Protocol, which leverages on-chain-first metering hardware. Where they currently save to Arweave, SolarVillage will extend the protocol to Hydra as an option for users of m3tering protocol.\n\n\n\nOur own resrch into current Microgrids indicates almost feverish focus on building cheaper and better hardware, and installing fast to get up and running. Microgrid designs are prolific, and HW providers sometimes inclde a bare-bones software package, leaving users with power but microgrid operators with substandard software and investors struggling to recoup their investments. SolarVillage aims to fill this gap by providing an API-driven solution that can control and manage any Microgrid, on Cardao rails.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"# The SolarVillage MVP\nThe SolarVillage MVP will deliver a production ready solution, with one implementation operational on PreProd (or potentially on Mainnet), verified by user testing and ready for producsion and scaling to multiple sites.\n\nThe MVP demonstrates a complete end-to-end version of the SolarVillage metering pipeline running on Hydra and anchoring proofs to Cardano. It shows how real telemetry—collected at 15-minute intervals—flows into a dedicated Hydra head, is validated with digital signatures, and is written as high-frequency transactions inside the head. At the end of each epoch (daily?), the MVP generates a Merkle root of all metering data and submits that proof to the PreProd network, creating a tamper-evident record that can be independently verified.\n\nThe MVP also includes a public dashboard where operators, reviewers, and regulators can inspect live telemetry, head status, and PreProd anchor confirmations. Energy-token minting logic is integrated in prototype form, demonstrating the conversion of verified energy data into a standardized on-chain representation. Together, these components prove that Hydra can reliably support continuous IoT data ingestion, auditability, and on-chain settlement logic—establishing the foundation for scaling to multiple microgrids in later phases.\n\nFor Cardano, this creates one of the first industrial-grade Hydra deployments producing continuous, verifiable transaction flow, a showcase of real-world, revenue-linked on-chain utility.\n\nWe are collaborating with NCCC and will be one of the first implementers of the soon to be launched National Carbon Market Framework: [https://africasustainabilitymatters\\.com/nigeria\\-approves\\-national\\-carbon\\-market\\-framework\\-ahead\\-of\\-cop30/\\.](https://africasustainabilitymatters.com/nigeria-approves-national-carbon-market-framework-ahead-of-cop30/.) Once they go live, carbon credits originating from SolarVillage can be found on their site.\n\nA prototype of our dashboard solution can already be accesed at [https://demo\\.app\\.solarvillage\\.xyz/](https://demo.app.solarvillage.xyz/,), and the final solution will be at [https://app\\.solarvillage\\.xyz/](https://demo.app.solarvillage.xyz/)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"# Hydra Metrics\n- Number of active Hydra heads (1 → 23).\n- 15-minute metering TX per head (~96/grid/day), each with hundreds of data points.\n- Data integrity rate of signed meter readings (>99%).\n\n# Mainnet Metrics\n- Daily L1 Merkle-root anchors per head (~8,000/grid/year).\n- 100% verifiable Merkle-proof replay in audit scripts.\n\n# Energy & Carbon Tokens\n- kWh/Wh token mints per microgrid (CIP-68).\n- Settlement token transfers inside Hydra ($$$ and/or NGN).\n- First carbon-credit issuance event (Gold Standard / Verra / NCCC).\n\n# Identity & Authentication\n- Devices/operators onboarded with DID/VCs.\n- Number of on-chain VC attestations.\n\n# Operational Adoption\n- Microgrids onboarded (1 → 10 → 23).\n- Total kWh captured as signed telemetry.\n- Active operator/regulator dashboard users.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"SolarVillage creates an **immutable metering and settlement layer** for off-grid solar microgrids by giving each microgrid its own Hydra head. All energy production and consumption is logged every 15 minutes by an estimated ~30 meters per head, producing a continuous, tamper-evident record. At the end of each day or period, a Merkle root of all readings is posted to Cardano L1, creating a permanent audit trail. This data becomes the basis for verifiable carbon credits using Gold Standard, Verra, and/or the Nigerian Carbon Standard.\n\n\n\nThe solution directly addresses the core problem: today, microgrid energy data is scattered in spreadsheets, proprietary devices, or USB sticks, making it impossible for regulators, investors, or carbon-credit registries to trust claims. By anchoring meter data to Cardano through Hydra, **SolarVillage turns every watt\\-hour into a transparently verifiable digital fact**. This unlocks reliable carbon-credit issuance, reduces fraud vectors (double counting, tampered logs), and provides operators, donors, and regulators with real-time transparency.\n\n\n\nThe platform includes the **metering app, payment app, operator dashboards, **and** open APIs** so any microgrid operator can join. After the pilot with 23 Nigerian microgrids, SolarVillage will be open-sourced and offered as a hosted SaaS platform to other operators across Africa. In short: it replaces unverifiable spreadsheets with cryptographically provable energy records, enabling trust, climate finance, and scalable clean-energy deployment.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"SolarVillage demonstrates a flagship real-world utility case for Hydra, showing that Cardano can securely handle high-frequency IoT workloads. With 23 Hydra heads running ~30 meters each, the project produces sustained on-chain activity: continuous Hydra transactions, daily L1 anchors, kWh token mints, identity attestations, and later also carbon-credit issuance. This provides Cardano with one of its first industrial-scale deployments of Hydra in production.\n\n\n\nFor developers, SolarVillage contributes open-source reference implementations, including Hydra head automation, Merkle-proof anchoring, IoT telemetry signing, identity integrations, and Plutus/Aiken contracts for energy and carbon tokens. These components become reusable building blocks for any team building IoT, RWA, carbon, or impact-finance applications on Cardano.\n\n\n\nFor ecosystem growth, SolarVillage brings high-value institutions (UNDP Nigeria, NCCC, REA, and the African Minigrid Program) into the Cardano orbit, strengthening adoption across Africa. It also creates a standard, open API for other microgrid operators to integrate, expanding future usage and providing new on-chain data streams that can support DeFi, impact markets, or sustainability dashboards.\n\n\n\nIn short, SolarVillage enriches the Cardano community with:\n\n• Proven Hydra scalability in a real industrial setting.\n\n• Open-source tooling and patterns for IoT, identity, and RWA integrations.\n\n• Continuous real-world transaction volume tied to energy and climate outcomes.\n\n• New institutional partnerships and long-term ecosystem growth in emerging markets.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"We can deliver this solution with integrity because the project is built with institutional partners who already operate the microgrids:\n\n- UNDP Nigeria\n- The African Minigrid Program (AMP)\n- The National Council on Climate Change (NCCC)\n- Rural Electrification Agency (REA)\n\n\n\nThese partners provide direct oversight, meter access, policy alignment, and transparent monitoring frameworks. Their involvement ensures the work is accountable to national standards, carbon methodologies, and community-level expectations.\n\n\n\nFrom a technical standpoint, the team already has deep experience across Cardano, Hydra, Plutus/Aiken, IoT pipelines, and identity systems (Cubid + ClearPass).\n\nThe architecture (Hydra heads for high-frequency metering, Merkle-root commits to Cardano L1, and signed telemetry from devices) is drawn directly from Hydra’s reference patterns, not speculative design. This gives us a strong foundation with implementation pathways that are known to work.\n\n\n\nFeasibility is verified through a phased approach:\n\n- We are already running our own market research with potential Microgrid operators (example: [https://forms\\.gle/2kd3ZZ7dtyMBnE436\\)](https://forms.gle/2kd3ZZ7dtyMBnE436)) and we have a clickable prototype of the dashboard which we have already started collecting user feedback on.\n- We will start with running a single microgrid on a Hydra preview network, and validate the design with experts in the field.\n- Then we anchor daily Merkle roots on pre-prod and validate proof replay end-to-end.\n- In the second half of the program we validate the design thoroughly with our extepded ecosystem of partners.\n- Finally, we expand to 10 and then 23 microgrids, each with ~30 meters.\n\n\n\nAt every stage, the system produces objective signals: successful Hydra transactions, verifiable L1 anchors, reproducible Merkle proofs, and correct token minting for kWh/Wh units. These on-chain artifacts serve as an immutable audit trail proving that the system works, is tamper-evident, and meets the expectations of carbon registries.\n\n\n\nIn short, delivery integrity comes from real operational partners, real meters, and real data—and feasibility is verified through incremental deployment, technical proofs, and transparent on-chain results.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Architecture Finalization & First Hydra Head Running","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers the complete technical blueprint for the SolarVillage Hydra-based metering system and a functioning prototype head running on a preview environment. Outputs include\n\n- A finalized system architecture covering Hydra head orchestration, telemetry signing, Merkle-root generation, and Cardano anchoring patterns\n- Documented data ingestion specifications for the meters within a single microgrid;\n- An operational Hydra head receiving synthetic 15-minute meter data. \n\n\n\nAdditional outputs may include the initial codebase for Hydra automation, the first version of the meter data signature verifier, and early operator-facing diagnostic tools. These collectively establish the system foundations and ensure all partners share a unified technical approach.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The architecture must be fully documented, internally reviewed, and approved by the project manager and Cardano architect.\n- The Hydra head prototype must process continuous telemetry from simulated or test meters at the correct 15-minute interval and successfully produce daily Merkle roots.\n- The telemetry validation pipeline must detect malformed or unsigned data, and the Merkle-root generation must be reproducible across independent runs.\n- All core components must be committed to the project repository, and UNDP/AMP must confirm the architecture aligns with metering realities in the field.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- A fully published architecture document in the project repository\n- GitHub commits for Hydra configuration, telemetry validator, and prototype code\n- Logs or screenshots showing telemetry flowing into Hydra and daily Merkle-root generation\n- A short screen-recorded demo walking through the prototype head’s end-to-end operation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"MVP on Hydra Testnet with Public Dashboard","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers the first fully integrated MVP demonstrating the core pipeline running on Hydra testnet: meter telemetry ingestion, Hydra transaction logging, Merkle-root generation, and anchoring to Cardano pre-prod. \n\n- Outputs include a testnet-connected dashboard displaying real-time readings, head status, and daily anchor confirmations. \n- The MVP will include operator tools for meter health, anchor verification, and data-integrity review. \n- All underlying components (Hydra automation scripts, telemetry normalization, Merkle-root generator, and pre-prod anchoring) will be packaged into a stable early release. \n- The dashboard will be accessible publicly so Catalyst reviewers and community members can inspect the running system.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The system must successfully anchor at least three consecutive Merkle roots to Cardano pre-prod, with each proof verifiable from the dashboard.\n- The dashboard must show current meter values, head operational status, and anchor confirmations.\n- Test coverage must include failure cases such as invalid signatures, malformed data packets, and dropped telemetry.\n- All MVP components must be deployed to a publicly accessible environment, and the code must be open in the project repository.\n- AMP and UNDP must validate that the MVP reflects the expected operational flow of real microgrids.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Links to pre-prod anchor transactions\n- A public dashboard URL demonstrating live testnet activity\n- GitHub commits covering all MVP components\n- A demo video walkthrough showing telemetry → Hydra → Merkle root → pre-prod anchor.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"First Production Microgrid Anchored to Cardano PreProd","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers the first live test deployment of SolarVillage on a real Nigerian microgrid containing more than 5 meters (target: 30 meters). Outputs include:\n\n- Field-validated telemetry signatures, continuous 15-minute ingestion into the Hydra head, and daily Merkle-root commitments to Cardano preprod.\n- This milestone also includes implementing watt-hour (Wh) token distribution based on verified energy generation and integrating operator dashboards for AMP and UNDP.\n\n\n\nAdditional outputs may include on-site configuration procedures, fallback recovery paths, and monitoring tools for production reliability.\n\n\n\nThis milestone proves that the full system can work under real-world operational constraints, and is ready for Mainnet go-live.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The production microgrid must post at least 14 consecutive days of validated Merkle-root anchors to PreProd, with reproducible proofs.\n- Meter-level data must be correctly validated against signatures, and the head must maintain stable operation with no more than minimal downtime.\n- Token mints must accurately reflect verified energy output and must produce valid on-chain transactions.\n- Operational teams (AMP, REA, UNDP) must confirm data accuracy and dashboard usability.\n- All production code must be committed to the repository with documented deployment steps.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- PreProd anchor transaction links; token-mint transaction links\n- Screenshots demonstrating live data from the production microgrid\n- Confirmation letters or emails from AMP/UNDP validating successful field operation\n- A recorded walkthrough of the pre-production dashboard.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Close-Out Report & Final Demonstration Video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A comprehensive close-out report summarizing all accomplishments, on-chain activity, performance metrics, technical findings, partner validations, and lessons learned.\n\n- The report will include an evaluation of real-world feasibility, operational reliability, and alignment with emerging carbon standards.\n- A final public demonstration video will show the system’s end-to-end operation, including telemetry ingestion, Hydra processing, Merkle-root anchoring to mainnet, and token minting.\n- All repositories will be documented, with setup instructions, developer notes, and open-source packaging.\n- This milestone ensures that all work is transparent, reproducible, and accessible to the Cardano community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The report must cover all milestones, system KPIs, anchor counts, energy-data volumes, reliability statistics, and lessons learned. \n- The video must clearly demonstrate the system functioning across all core components. \n- Repositories must include complete documentation and deployment scripts. All deliverables must be made public and shared with the Catalyst community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Published close-out report (PDF + public link)\n- ublic demo video (YouTube/Vimeo)\n- Finalized GitHub repositories with complete documentation and tags for all major releases.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Project Manager – Noak Lindqvist \\(Cubid Protocol\\)**\n\nLeads overall delivery, technical architecture, and coordination across engineering, Cardano integration, and partner agencies. Oversees milestones, reporting, and ensures that the system is built with transparency, rigorous documentation, and adherence to Catalyst expectations.\n\n\n\n**Africa Minigrid Program \\(AMP\\) – Temitope Omowumi **\n\nSustainable Infrastructure Strategist at African Minigrid Program, Nigeria. Oversees reporting requirements and strategy. Responsible for pan-African coordination.\n\n\n\n**REA \\- Dr\\. Bala Tyoden \\(Project Manager, REA\\)**\n\nPrimary liaison for the 23 microgrids in the pilot. Provides access to metering infrastructure, ensures correct operational data flow, and validates the feasibility of deployment at the site level. Confirms that the metering, workflows, and telemetry align with AMP/REA’s operational standards.\n\n\n\n**UNDP Nigeria – Lantana Elhassan \\(Product Development &amp; Partnerships\\)**\n\nEnsures alignment with UNDP oversight processes, QAMF indicators, community-level validation, and donor reporting needs. Provides governance support, transparency monitoring, and ensures system integrity and inclusive access for rural communities.\n\n\n\n**UNDP Nigeria – Osondu Ogbodo \\(Program Coordination / UNDP Technical Lead\\)**\n\nCoordinates implementation work from the UNDP side, ensures partner alignment, risk management, and regulatory engagement (NCCC, REA, NEP). Supports verification, community engagement, and ensures transparent communication between field teams and the technical team.\n\n\n\n**Cardano / Hydra Architect – Prof\\. Lawrence Ley \\(Cubid Protocol\\)**\n\nResponsible for Cardano-side design, Hydra head setup, Plutus/Aiken contract architecture, Merkle-root anchoring logic, and integration reviews. Provides technical assurance that the implementation follows Cardano best practices and Hydra reference patterns.\n\n\n\n**Identity Layer Partners \\- Cubid  and ClearPass \\(Device \\+ Operator Attestation\\)**\n\nProvide device and operator verifiable credentials (DID/VC) to ensure all meters, operators, and data sources are authenticated. Their work guarantees the integrity of the data pipeline from the sensor level upward.\n\n\n\n**Core Engineering Team \\- Firebelly Advisory \\+** others as needed\n\nHydra engineers, backend developers, IoT specialists, and frontend/dashboard developers responsible for implementation of Hydra automation, IoT ingestion, the metering/payments apps, energy tokenization, carbon pipeline, and operator/donor dashboards.\n\n\n\n**Microgrid Operators & Field Technicians \\(AMP / REA Network Contractors\\)**\n\nWork with the engineering team to install, test, and validate the data acquisition devices, ensure 15-minute telemetry accuracy, and support meter-level verification and troubleshooting during each deployment phase.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Cost Breakdown of Proposed Work & Resources (₳140,000)\n\n\n\n**1\\. Solution Architecture & Cardano/Hydra Engineering – ₳45,000**\n\nResources:\n\n• **Blockchain Architect** (Hydra head design, L1 anchoring, Merkle proofs, token logic)\n\n• **Smart Contract Engineer** (Plutus/Aiken for kWh + carbon modules)\n\n• **DevOps Engineer** (Hydra automation, node orchestration, monitoring)\n\n\n\nWork delivered:\n\nHydra head setup, Merkle-root pipeline, token contracts, anchoring scripts, integration patterns.\n\n\n\n---\n\n\n\n**2\\. Frontend & Dashboard Development – ₳25,000**\n\nResources:\n\n• **Frontend Developer** (Next.js dashboards, real-time charts, operator views)\n\n• **UI/UX Designer** (layouts for operators, regulators, donors)\n\n\n\nWork delivered:\n\nRole-based dashboards for microgrid operators, auditors, and regulators; public demo interface.\n\n\n\n---\n\n\n\n**3\\. Backend, IoT Pipeline & Carbon Layer – ₳20,000**\n\nResources:\n\n• **Backend Developer** (IoT ingestion, signed telemetry validation, APIs)\n\n• **IoT Engineer** (meter data integration, MQTT/telemetry signing, field protocol testers)\n\n\n\nWork delivered:\n\n15-minute meter ingestion pipeline, data integrity checks, carbon conversion logic.\n\n\n\n---\n\n\n\n**4\\. Testing, QA & Infrastructure – ₳15,000**\n\nResources:\n\n• **QA Engineer** (unit testing, integration testing, replay verification)\n\n• **SRE/DevOps** (testnet/mainnet nodes, Hydra clusters, monitoring, logs)\n\n\n\nWork delivered:\n\nQuality assurance, on-chain verification, testnets, load testing, infrastructure reliability.\n\n\n\n---\n\n\n\n**5\\. Documentation, Open\\-Source Packaging & Community Engagement – ₳10,000**\n\nResources:\n\n• **Technical Writer / Developer Advocate**\n\n• **Open-Source Maintainer**\n\n\n\nWork delivered:\n\nDocumentation, public repos, tutorials, developer onboarding materials, Catalyst reporting.\n\n\n\n---\n\n\n\n**6\\. Project Management & Contingency – ₳15,000**\n\nResources:\n\n• **Project Manager** (coordination, milestones, partner alignment)\n\n• **Budget buffer** for unknown integration challenges\n\n\n\nWork delivered:\n\nCross-partner coordination (AMP, UNDP, NCCC), reporting, timelines, risk management.\n\n\n\n---\n\nContingency: – ₳10,000\n\n# Total: ₳140,000","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The requested budget delivers outsized value because it produces one of the first real industrial deployments of Hydra and Cardano in the wild. For ₳140k, the ecosystem gains a full open-source reference implementation for high-frequency IoT data on Hydra, daily L1 anchoring patterns, CIP-68 energy tokens, carbon-credit issuance workflows, and identity-backed device authentication. These components would cost far more if built in isolation by separate teams.\n\n\n\nThe investment also brings 23 real microgrids, representing roughly 700 physical meters, directly onto Cardano infrastructure. This creates sustained, real-world on-chain activity (Hydra TX, daily Merkle-root commits, token mints, VCs) and demonstrates Cardano’s capability for climate, energy, and RWA applications. The same codebase can be reused by any other IoT, sustainability, or RWA project, multiplying ecosystem impact far beyond the pilot.\n\n\n\nFinally, the budget enables Cardano to secure long-term partnerships with national institutions (UNDP, NCCC, REA, AMP), opening pathways for further adoption across Africa. For a modest cost, the ecosystem gets open tools, real utility, continuous on-chain activity, and institutional credibility. We deliver strong value relative to scope and impact.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"RWA","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1674}