{"pr_id":"019ac365-95d7-74fd-bb99-d00843afa56e","title":"Sun4Schools - Decentralized Solar Crowdfunding for Schools","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Mauritian schools face high electricity costs and lack upfront capital for solar systems. No transparent, community-driven mechanism exists to fund renewable energy and reduce this financial burden.","solution":"A blockchain-based crowdfunding platform that lets citizens and diaspora fund school solar projects transparently, enabling affordable clean energy, lower costs, and community-driven impact.","proposer_name":"Alexandre Mboule","proposer_relevant_experience":"UNDP Mauritius & Seychelles\n\n\n\nVichittra Purdassee – Project Manager\n\n\n\nAlexandre Mboulè – IT Implementation Specialist\n\n\n\nVathlu Nazombe – IT Implementation Specialist\n\n\n\nLyse Aneze – IT System Assistant\n\n\n\nSocious Fund (Solution Maker)\n\n\n\nSeira Yun – CEO\n\n\n\nTarh Joshua – Product Manager\n\n\n\nManah Linda – Project Lead & Business Development\n\n\n\nIman – Frontend Developer\n\n\n\nMohammad – Backend Developer","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Sun4Schools - Decentralized Solar Crowdfunding for Schools","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Alexandre Mboule","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Mauritian schools face high electricity costs and lack upfront capital for solar systems. No transparent, community-driven mechanism exists to fund renewable energy and reduce this financial burden.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A blockchain-based crowdfunding platform that lets citizens and diaspora fund school solar projects transparently, enabling affordable clean energy, lower costs, and community-driven impact.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://docs.google.com/presentation/d/1ERYQ2ZtTbHfMJnyX61vHou3EdPcayWls/edit?usp=drive_link&ouid=104788261921979135531&rtpof=true&sd=true","https://drive.google.com/file/d/1uqqXPX20f6B8GLDE3zyCY2CTEH-emY3D/view?usp=drive_link","https://docs.google.com/spreadsheets/d/1E9mJDKIpYHZkC5qF1Tl9VGXZBhFxxNwE/edit?usp=drive_link&ouid=104788261921979135531&rtpof=true&sd=true","https://docs.google.com/spreadsheets/d/1Bn7r3cXsB1dugjyeOGR86hwB7_SPZobp/edit?usp=drive_link&ouid=104788261921979135531&rtpof=true&sd=true","https://undp-devfund.socious.io/projects"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"The Sun4Schools decentralized crowdfunding platform depends on a wide ecosystem of government institutions, regulatory bodies, technical partners, energy authorities, and implementation partners. These dependencies are essential for regulatory compliance, data exchange, grid integration, school participation, and long-term sustainability. The dependencies fall into four major categories: Regulatory, Governmental & Institutional, Technical, and Operational/Implementation.  1. Regulatory Dependencies a. Financial Services Commission (FSC) – Crowdfunding Licensing Sun4Schools interacts directly with the Financial Services (Crowdfunding) Rules 2021, which regulate all crowdfunding activities in Mauritius. The platform depends on FSC authorization for: •\tCrowdfunding operator licensing •\tInvestment limits •\tKYC/AML compliance •\tDue diligence obligations for issuers and contributors Any delay or change in FSC regulatory approval may impact the timing of onboarding contributors or formally launching the platform. b. VAITOS Act 2021 – Virtual Assets & Tokenization Rules Because the solution uses blockchain, tokenized contributions, and crypto payments, it must comply with the Virtual Asset and Initial Token Offering Services (VAITOS) Act. This introduces dependencies on: •\tVASP licensing (if tokenization or on-chain assets are activated) •\tITO registration (for fractional ownership or solar tokens) •\tData protection safeguards for on-chain metadata c. Bank of Mauritius & Economic Development Board – Regulatory Sandbox Authorization The solution may require RSA approval to operate as an innovative FinTech use case, especially during the MVP. This sandbox provides a controlled environment for blockchain pilots, especially while tokenization and smart contracts are not yet fully regulated for government-linked services.  2. Governmental & Institutional Dependencies a. Ministry of Education (MoE) – School Participation & Approvals Since the pilot targets Mauritian public schools, the project heavily depends on the Ministry of Education for: •\tApproving participating schools •\tAllowing site assessments & roof inspections •\tValidating school-level energy data •\tCoordinating with school administrators Without MoE authorization, the pilot cannot begin. b. Ministry of Information Technology, Communication and Innovation (MITCI) MITCI is expected to host the platform on the Government Cloud / Government Online Centre during the pilot rollout. Dependencies include: •\tCloud hosting approval •\tGovernment DevOps/security compliance •\tIntegration with national digital identity tools (future phases) c. Central Electricity Board (CEB) – Grid Integration & Tariff Structures CEB is a critical dependency, as the platform cannot function without energy data and grid-connection approvals. Dependencies include: •\tAccess to the Gross Metering or MSDG schemes •\tPPA validation •\tProduction meter and export meter installation •\tVerification of solar generation data for dashboards Delays in CEB approvals directly delay school onboarding. d. Government of Mauritius (Policy Alignment) The project depends on national targets and ministerial commitments under: •\tRenewable Energy Roadmap 2030 •\tEnergy & climate policies (60% renewable targets) •\tUNSDCF & UNDP Country Programme alignment Changes in policy may affect tariff revenue, investor appeal, or school selection.  3. Technical Dependencies a. Socious Fund (Solution Maker) Responsible for: •\tBlockchain integration •\tPlatform backend & frontend •\tSmart-contract automation •\tWallet integration •\tTokenization features Since developer time is limited, technical capacity is a dependency and potential risk. b. Cardano Infrastructure The project requires: •\tStable access to Cardano mainnet •\tWallet compatibility (Yoroi, Nami, Lace, etc.) •\tLow-fee ADA transaction environment •\tMetadata tagging, UTxO handling, smart contract execution Any major blockchain network outage or protocol change affects the MVP. c. Self-Sovereign Identity (SSI) / Hyperledger Identus Used for: •\tKYC/AML compliance •\tPrivate, verifiable identity checks The SSI stack is external, therefore availability and compatibility are dependencies. d. External Payment Providers (e.g., Stripe) For fiat contributors, dependency includes availability of Stripe or other approved gateways for Mauritian users. e. Government Data Systems For future phases: •\tIntegration with MITCI’s national super-app •\tIntegration with future national digital wallets These require government engineering coordination.  4. Operational & Implementation Dependencies a. Solar PV Installers (CEB-approved EPCs) Solar installation, maintenance, and technical verification depend on certified installers. Dependencies include: •\tSite assessment accuracy •\tCompliance with CEB grid codes •\tSpeed of installation •\tMaintenance and post-installation support b. School Administrators & PTAs Operational dependencies include: •\tProviding access to school premises •\tCoordinating communications with communities •\tSupporting awareness campaigns c. Contributors, Diaspora, CSR Actors The project relies on community participation for: •\tFunding campaigns •\tCSR sponsorship and blended finance Without sufficient contributor activity, project scaling slows. d. UNDP Mauritius & Seychelles UNDP provides: •\tStrategic oversight •\tStakeholder coordination •\tM&E support UNDP’s support is essential for convening ministries and development partners.  5. Financial Dependencies a. Donors and Climate Financing Partners The pilot depends on resource mobilization: Potential contributors: •\tCSR funds •\tPrivate sector •\tGCF, GEF, AfDB, EU, etc. b. Catalyst Funding Catalyst funds are required to complete: •\tBlockchain components •\tSmart contracts •\tWallet integration •\tField testing •\tTokenization modules Without this funding, the MVP cannot reach pilot readiness.  6. Legal & Governance Dependencies a. Data Protection Act (Mauritius) The platform must comply with national privacy rules for: •\tUser data •\tEnergy data from schools •\tInvestor identity verification b. Governance Body / Joint Oversight Committee A governance structure involving MoE, CEB, MITCI, UNDP, and Socious is required to safeguard transparency and long-term sustainability.  Conclusion The Sun4Schools project has several critical dependencies across regulatory, governmental, technical, operational, financial, and governance domains. These dependencies are expected and appropriate for a national-level renewable energy and blockchain initiative. They ensure that the platform remains compliant, secure, scalable, and properly integrated with public institutions and national infrastructure. All dependencies are manageable but require active coordination, especially with the Ministry of Education, CEB, FSC, MITCI, and the Cardano technical ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Core platform components will be released as open-source under a permissive licence, enabling public reuse and adaptation. Socious Inc retains ownership of pre-existing generic modules, while UNDP and government receive a royalty-free, perpetual licence for all localized enhancements.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Environment","group":"Sustainability"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Sun4Schools introduces a new financing model that does not currently exist in Mauritius or in most global education systems: a blockchain-powered, community-driven crowdfunding platform specifically designed to finance solar energy for public schools. While solar projects and crowdfunding each exist independently, no existing solution combines:\n\n\n\n1. Decentralized financing of public solar assets\n\nMost renewable energy projects rely on government budgets, loans, or private developers. Sun4Schools makes solar funding open to anyone, including parents, diaspora, youth, and CSR contributors—democratizing access to clean-energy investment.\n\n\n\n2. Transparent ADA-based contributions\n\nUnlike traditional donation portals, Sun4Schools uses Cardano blockchain transactions and metadata to provide tamper-proof transparency. Every contribution is traceable, verifiable, and permanently recorded—something conventional crowdfunding platforms cannot offer.\n\n\n\n3. Fractional ownership via tokenization\n\nFuture phases introduce tokenized fractions of solar assets, allowing people to “own” parts of school solar systems and receive verifiable impact data. This is a significant innovation compared to legacy CSR or donation models that offer no traceability or ownership.\n\n\n\n4. Integrated smart contracts for energy revenue\n\nLegacy systems rely on manual invoicing and opaque accounting. Sun4Schools plans to automate:\n\n•\tPayments\n\n•\tAllocation of funds\n\n•\tPPA processes\n\nvia Plutus smart contracts, reducing administrative overhead and increasing trust.\n\n\n\n5. On-chain environmental impact tracking\n\nThe platform links:\n\n•\tkWh generated\n\n•\tCO₂ avoided\n\n•\tSchool energy savings\n\nto on-chain records, creating auditable SDG impact reporting—a feature not found in traditional crowdfunding or solar procurement systems.\n\n\n\n6. A first-of-its-kind model for public schools in SIDS\n\nWhile a few global platforms (e.g., Sun Exchange) finance private/commercial solar, no platform globally offers decentralized, blockchain-backed solar crowdfunding for government schools—especially in Small Island Developing States (SIDS) with high energy costs and climate vulnerability.\n\n\n\n7. Government integration and regulatory alignment\n\nSun4Schools uniquely combines:\n\n•\tCrowdfunding rules\n\n•\tVirtual asset regulations\n\n•\tCEB energy schemes\n\n•\tMinistry of Education participation\n\n•\tGovernment cloud hosting\n\nThis creates a nationally compliant, institutional-grade blockchain application, unlike typical startup-led solar crowdfunding.\n\n\n\nWhy it is innovative overall\n\n\n\nSun4Schools is not just another crowdfunding tool or solar project—it is a new category of public infrastructure financing that blends:\n\n\n\nclean energy + blockchain + community empowerment + transparent impact tracking.\n\nIt replaces opaque, centralized funding models with a trustless, open, efficient, and inclusive mechanism powered by Cardano. No comparable solution exists in Mauritius, the region, or the global public-school sector.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The prototype and MVP demonstrate how Sun4Schools enables transparent, community-driven crowdfunding of solar projects for Mauritian public schools using ADA and fiat contributions. The platform showcases the full user journey, including browsing school projects, viewing funding needs, making a contribution, and seeing real-time progress indicators such as kWh impact, CO₂ savings, and funds raised.\n\n\n\nThe MVP also includes core features such as:\n\n\n\n- Project listings and impact dashboards\n- ADA payment flow simulation\n- Contributor verification (KYC/SSI)\n- Role-based access for school admins, government, and investors\n- Early logic for fractional ownership and tokenization\n- Basic admin approval workflow\n\n\n\nThese elements validate usability, interface design, and the decentralized funding model before completing smart contracts, token minting, and blockchain automation in the full pilot.\n\n\n\nThe prototype can be accessed at:\n\n🔗 [https://undp\\-devfund\\.socious\\.io/home](https://undp-devfund.socious.io/home)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Realistic Measures of Success (Including On-Chain Metrics)\n\nSuccess for Sun4Schools is measured by real user adoption, successful funding of school solar projects, and verifiable on-chain activity recorded on the Cardano blockchain.\n\n 1. On-Chain Contribution Metrics\n\n•\tNumber of ADA contributions recorded on-chain\n\n•\tTotal ADA value contributed to school solar projects\n\n•\tUnique contributor wallets participating in campaigns\n\n•\tOn-chain metadata records linked to each contribution (project ID, school ID, amount, timestamp)\n\n•\tTransaction volume per project, showing traction for each school\n\nThese metrics provide transparent, immutable evidence of community engagement.\n\n\n\n2. On-Chain Asset & Token Metrics (Pilot Phase)\n\n•\tNumber of fractional solar tokens minted (representing ownership or impact units)\n\n•\tDistribution count of tokens to contributor wallets\n\n•\tSmart contract events triggered, such as funding completion or revenue distribution\n\n•\tCO₂-impact or kWh-impact metadata written to Cardano for verification\n\nThese demonstrate the real-world utility of decentralized renewable energy assets on Cardano.\n\n\n\n3. Platform & User Adoption Metrics (Off-chain but verifiable)\n\n•\tNumber of registered users (local + diaspora + CSR)\n\n•\tNumber of schools onboarded (target: 5 for pilot)\n\n•\tFunding goal completion rate for each school\n\n•\tTotal amount raised (ADA + fiat) across all campaigns\n\n•\tRepeat contribution rate (contributors returning for new projects)\n\nThese validate that the system works for real users and institutions.\n\n4. Real-World Impact Metrics\n\n•\tkWh of clean energy generated by funded solar systems\n\n•\tCO₂ emissions avoided, linked to on-chain records\n\n•\tReduction in school electricity bills (quantified monthly)\n\n•\tPercentage of school operations powered by solar\n\nThese demonstrate tangible SDG impact and public value.\n\n\n\n5. Government & Institutional Integration Metrics\n\n•\tAPI calls and data events transmitted from CEB (solar generation, export tariff data)\n\n•\tOperational dashboards used by Ministry of Education and UNDP\n\n•\tRegulatory compliance milestones achieved (FSC/VAITOS/Sandbox)\n\nThese confirm institutional adoption and long-term sustainability.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Sun4Schools is a blockchain-enabled crowdfunding platform that enables citizens, diaspora, CSR actors, and impact-driven contributors to fund solar photovoltaic (PV) installations for Mauritian public schools in a transparent, secure, and inclusive way. The platform allows anyone to contribute small or large amounts— via fiat—to specific school projects, with every contribution transparently recorded on the Cardano blockchain.\n\n\n\nThe solution directly addresses the main barrier faced by schools: lack of upfront capital for solar systems. Instead of relying on limited government budgets, Sun4Schools unlocks a new, community-driven financing mechanism that mobilizes funding from a broad contributor base. By aggregating small contributions, the platform enables schools to access renewable energy schemes (e.g., Gross Metering, Solar PV Scheme for Educational Institutions) and reduce long-term electricity costs.\n\n\n\nThe platform provides real-time project visibility, including funds raised, installation status, kWh generated, CO₂ reduced, and financial savings for schools. Future phases introduce fractional ownership through tokenization and smart contracts to automate fund flows and power-purchase agreements. This builds trust, ensures accountability, and enables verifiable impact reporting aligned with national renewable energy targets and SDG goals.\n\n\n\nBy combining clean energy, digital inclusion, and transparent financing, Sun4Schools creates a scalable model that reduces school electricity expenses, empowers communities to participate in climate action, and demonstrates real-world utility of Cardano for public infrastructure financing.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Sun4Schools strengthens the Cardano ecosystem by demonstrating a real-world, regulated, and legally compliant use of Cardano where end users never touch cryptocurrency. Instead, the platform uses fiat payments, while Cardano operates in the backend to provide trust, transparency, and automation.\n\n1. A Real-World Government-Linked Use Case for Cardano, Without Crypto Payments\n\nSince crypto payments are not allowed in Mauritius, Sun4Schools uses traditional fiat payment gateways, but still leverages Cardano for:\n\n•\timmutable record-keeping of contributions,\n\n•\tverifiable timestamps and project metadata,\n\n•\ttransparent tracking of fund flow and project status.\n\nThis showcases a powerful model: Cardano as digital public infrastructure, not a payment tool.\n\n2. Transparent, auditable crowdfunding using on-chain metadata\n\nAll contributions (made in fiat) are hashed and recorded onto Cardano with:\n\n•\tproject ID\n\n•\tamount\n\n•\ttimestamp\n\n•\tmilestone reached\n\n•\tCO₂ or kWh impact snapshots\n\nThis demonstrates how Cardano can be used for public auditing systems, a growing need in global development, UN agencies, and governments.\n\n3. Tokenization for impact reporting, not financial ownership\n\nThe platform introduces non-financial impact tokens (not tradable, not speculative), which represent:\n\n•\tsolar capacity funded\n\n•\tCO₂ impact units\n\n•\tcontribution badges (digital credentials)\n\nThis aligns with Mauritius regulations and demonstrates a safe, compliance-friendly token use case on Cardano.\n\n4. Smart contracts used internally to automate trust\n\nPlutus smart contracts are used internally (not exposed to users) to automate:\n\n•\tmilestone validation\n\n•\tproject unlock stages\n\n•\tfund-release logic\n\n•\tEPC/installer verification events\n\nThis shows how Cardano can streamline public-sector processes even when users interact only with fiat interfaces.\n\n5. Cardano as a digital backbone for SDG-aligned development\n\nThe project generates on-chain climate and infrastructure data, including:\n\n•\tCO₂ avoided\n\n•\tsolar generation impact\n\n•\tschool energy savings\n\n•\tprogress towards national renewable goals\n\nThis positions Cardano as the blockchain of choice for SDG monitoring, climate finance, and public-impact tracking, an area with rising global demand.\n\n6. Onboards institutions—not crypto users—into Cardano’s ecosystem\n\nThe project introduces Cardano to:\n\n•\tthe Ministry of Education\n\n•\tMITCI (IT ministry)\n\n•\tCEB (energy authority)\n\n•\tUNDP and development partners\n\n•\tschools and PTAs\n\n•\tCSR foundations and private-sector donors\n\nThis is high-value institutional exposure that greatly strengthens Cardano’s reputation as a trusted, enterprise-ready blockchain.\n\n7. Establishes a replicable blueprint for compliant “fiat-in / blockchain-backend” models\n\nThis approach can be reused by:\n\n•\thealth facilities\n\n•\tmunicipalities\n\n•\tCSR-funded public projects\n\n•\tcommunity renewable energy initiatives\n\n•\tinternational development partners\n\nThis expands the range of regulatory-compliant Cardano deployments in countries that do not allow crypto.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Sun4Schools is delivered through a multi-institutional partnership combining UNDP’s governance and public-sector experience with Socious Fund’s technical expertise in building secure, transparent digital platforms. This structure ensures strong accountability, regulatory compliance, and institutional oversight.\n\n\n\n1. Strong Institutional Capacity (UNDP)\n\nUNDP Mauritius brings:\n\n•\tLongstanding collaboration with the Government of Mauritius\n\n•\tExperience implementing renewable energy, digital transformation, and climate resilience projects\n\n•\tProven monitoring, evaluation, and reporting frameworks\n\n•\tTransparent procurement and risk-management systems\n\n•\tDirect access to ministries (Education, MITCI, Energy) for alignment and validation\n\nUNDP’s involvement ensures the project follows international standards, ethical guidelines, and full regulatory compliance.\n\n\n\n2. Technical Capacity (Socious Fund)\n\nSocious Fund provides:\n\n•\tA functioning prototype platform\n\n•\tExpertise in secure backend development, dashboards, identity verification, and modular system design\n\n•\tExperience integrating blockchain as a transparent backend ledger without exposing users to crypto\n\n•\tAbility to implement tokenization and smart-contract automation in a compliance-friendly environment\n\nThe team has already built core modules, demonstrating capability and readiness to deliver the MVP and pilot.\n\n\n\n3. Government Partnerships Enable Trust\n\nProject delivery is supported by:\n\n•\tMinistry of Education (school selection, site access, administrative support)\n\n•\tMITCI (government cloud hosting & cybersecurity compliance)\n\n•\tCentral Electricity Board (CEB) (energy generation data, tariff structures, verification of impact)\n\nThese institutions ensure that the project is anchored in national policy objectives and supported by reliable data sources.\n\n\n\n4. Built-in Transparency & Accountability Measures\n\nEven with fiat payments, the system employs:\n\n•\tBlockchain-backed verification (hashed contributions, milestone records, installation data)\n\n•\tRole-based access controls for schools, CEB, donors, and regulators\n\n•\tAudit trails for every action, contribution, and project update\n\n•\tOpen dashboards showing project progress, energy production, and impact\n\nThis allows donors, ministries, and schools to independently verify progress.\n\n\n\nHow We Intend to Validate the Feasibility of the Approach\n\n\n\n1. Comprehensive Feasibility Study (Months 1–3)\n\nThe project begins with a structured feasibility assessment including:\n\n•\tTechnical reviews of school roofs, electrical infrastructure, and PV installation conditions\n\n•\tVerification of CEB scheme applicability (Gross Metering / School RE Scheme)\n\n•\tLegal review under FSC Crowdfunding Rules and VAITOS Act\n\n•\tEconomic modelling of cost savings and installation ROI\n\n•\tStakeholder interviews with schools, ministries, and installers\n\nThis ensures the model is practical, legal, and technically implementable.\n\n\n\n2. Pilot Deployment With 5 Schools\n\nA small, manageable pilot will validate:\n\n•\tPlatform usability\n\n•\tWillingness of schools and communities to participate\n\n•\tAccuracy of energy and cost-savings projections\n\n•\tIntegration with CEB for energy data\n\n•\tGovernment cloud hosting readiness\n\n•\tOperational coordination with installers\n\n•\tCommunity trust and donor engagement\n\nThis pilot becomes the evidence base for national rollout.\n\n\n\n3. Continuous Validation Through Data\n\nValidation is supported by real operational data:\n\n•\tEnergy generated (kWh)\n\n•\tCO₂ emissions avoided\n\n•\tElectricity savings for schools\n\n•\tFunding success rate across projects\n\n•\tUser participation and repeat engagement\n\n•\tOn-chain audit records validating transparency\n\nThis provides proof that the approach works in practice.\n\n\n\n4. Iterative Feedback Loops\n\nFeedback will be collected from:\n\n•\tSchool administrators\n\n•\tParents and community donors\n\n•\tDiaspora contributors\n\n•\tGovernment partners\n\n•\tSolar installers\n\n•\tCEB technical staff\n\nThis feedback informs continuous improvements in UI, workflows, trust mechanisms, and impact reporting.\n\n\n\n5. Compliance Checks With Regulators\n\nThe project includes ongoing review with:\n\n•\tFSC (Crowdfunding compliance)\n\n•\tMITCI (security, hosting, data protection)\n\n•\tCEB (technical validation)\n\n•\tMinistry of Education (operational alignment)\n\nFeasibility is validated not only technically but also legally and institutionally.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Regulatory Compliance Strategy","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A complete regulatory and compliance framework outlining all legal requirements for operating a fiat-based crowdfunding platform in Mauritius. This includes an in-depth review of the Financial Services (Crowdfunding) Rules 2021, the VAITOS Act, Ministry of Education protocols, MITCI cybersecurity standards, and government cloud-hosting requirements. The output also covers risks, compliance pathways, required approvals, and recommendations for the safe integration of blockchain as a transparency layer without using cryptocurrency. The deliverable ensures the platform is aligned with national laws, sector regulations, data protection requirements, and any sandbox mechanisms required for innovation pilots.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A professionally drafted compliance report validated by registered legal advisors with expertise in fintech and digital platforms.\n\n\n\nConfirmation that the platform’s design, workflows, and fiat-only payment structure meet FSC requirements.\n\n\n\nDetailed mapping of all approvals or non-objection letters needed from MoE, FSC, MITCI, and CEB.\n\n\n\nClear indication that blockchain components (metadata, token logic, smart-contract automation) do not breach local financial or virtual asset laws.\n\n\n\nPresentation of mitigation measures for risks related to data security, user onboarding, and platform governance.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Final signed compliance report including regulatory mapping, impact analysis, and risk assessments.\n\n\n\nOfficial meeting minutes or email confirmations from FSC, MITCI, MoE, and CEB acknowledging consultations.\n\n\n\nAny obtained non-objection letters, written clarifications, or formal correspondence supporting compliance decisions.\n\n\n\nInternal review approval by UNDP’s governance and legal units.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Platform Development","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Delivery of a functional, secure, and user-friendly crowdfunding platform built for fiat contributions but supported by a Cardano-based backend for transparency. The platform includes: project listing pages, donor onboarding, school dashboards, admin controls, impact visualization, hashed on-chain metadata, role-based access management, and government cloud hosting integration. Security upgrades, mobile responsiveness, and UX improvements are included. This milestone ensures the system is technically ready for a live pilot.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All core modules (frontend, backend, admin panel) fully operational and tested.\n\n\n\nContribution workflow functional using fiat payments through approved gateways.\n\n\n\nSuccessful integration of Cardano metadata hashing for key project and impact records.\n\n\n\nPlatform meets MITCI’s hosting and cybersecurity requirements.\n\n\n\nCompletion of penetration testing, load testing, and user acceptance testing involving at least 2–3 pilot schools.\n\n\n\nDocumentation of APIs, architecture, and data flows.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Access to a working staging environment with all core features enabled.\n\n\n\nTechnical and security documentation including test results and vulnerability scans.\n\n\n\nUX testing reports and feedback logs from schools and administrators.\n\n\n\nApproval note from MITCI confirming hosting readiness.\n\n\n\nDemonstration video or walkthrough of platform functionalities.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":150000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Awareness & Education Campaign","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A full outreach and engagement campaign aimed at parents, communities, diaspora groups, CSR donors, and participating schools. Outputs include campaign branding, promotional materials, educational content explaining the platform and renewable energy benefits, school briefing kits, social media posts, press releases, and public webinars. The campaign ensures broad awareness, trust, and preparedness ahead of the pilot rollout.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Production of high-quality communication materials tailored for digital, print, and school outreach.\n\nDelivery of at least two information webinars targeting stakeholders (schools, donors, diaspora groups).\n\nActivation of a dedicated awareness page on the platform.\n\nCollaboration with MoE and UNDP to endorse messaging and ensure alignment with national communication standards.\n\nMeasurable engagement indicators (views, attendance, reactions).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Archive of campaign materials (videos, flyers, social posts, website pages).\n\nWebinar attendance sheets and recordings.\n\nCommunication analytics reports summarizing reach and engagement.\n\nUNDP and MoE confirmation of campaign deployment.\n\nMedia mentions, press coverage, or official announcements.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Rollout to Pilot Schools","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Deployment of the platform to 5 pilot schools, including onboarding of school administrators, validation of school energy profiles, integration of CEB data streams (where applicable), and initiation of first contribution cycles. The milestone includes final operational testing, support documentation, training sessions, and monitoring of real usage patterns.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All 5 pilot schools registered and fully onboarded on the platform.\n\n\n\nAt least one fundraising campaign initiated and visible on the platform.\n\n\n\nSchool administrators trained on dashboard usage and reporting tools.\n\n\n\nValidation from CEB or solar installers on technical feasibility and installation timelines.\n\n\n\nInitial impact data (funding progress, page visits, user engagement) collected for evaluation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Signed onboarding forms from schools and administrators.\n\n\n\nPlatform screenshots of live pilot school pages and active campaigns.\n\n\n\nPilot implementation report summarizing readiness, testing outcomes, and early user metrics.\n\n\n\nConfirmation from UNDP and MoE that rollout is complete.\n\n\n\nPresentation of preliminary M&E findings.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"UNDP Mauritius & Seychelles\n\n\n\nVichittra Purdassee – Project Manager\n\n\n\nAlexandre Mboulè – IT Implementation Specialist\n\n\n\nVathlu Nazombe – IT Implementation Specialist\n\n\n\nLyse Aneze – IT System Assistant\n\n\n\nSocious Fund (Solution Maker)\n\n\n\nSeira Yun – CEO\n\n\n\nTarh Joshua – Product Manager\n\n\n\nManah Linda – Project Lead & Business Development\n\n\n\nIman – Frontend Developer\n\n\n\nMohammad – Backend Developer","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Regulatory Compliance Strategy – USD 15,000\n\nDescription:\n\nLegal and regulatory consultation covering FSC Crowdfunding Rules, VAITOS Act, data protection compliance, MITCI hosting/security review, and government alignment.\n\nResources Covered:\n\n•\tFintech legal consultants\n\n•\tRegulatory analysts\n\n•\tConsultation sessions with FSC, MITCI, MoE, CEB\n\n•\tCompliance documentation & approval mapping\n\n\n\nPlatform Development – USD 150,000\n\nDescription:\n\nFull development of the Sun4Schools fiat-based crowdfunding platform with Cardano backend transparency features. Includes backend, frontend, dashboards, metadata hashing, non-financial token logic, admin systems, UX/UI, hosting deployment, and security testing.\n\nResources Covered:\n\n•\tProject Lead / Product Manager\n\n•\tBackend Developers\n\n•\tFrontend Developers\n\n•\tBlockchain Engineer (Cardano metadata, token logic, smart-contract automation)\n\n•\tUX/UI Designer\n\n•\tQuality Assurance & Testing\n\n•\tInfrastructure setup (Government Cloud integration)\n\n•\tSecurity & penetration testing\n\n•\tAPI development and documentation\n\n•\tMaintenance during the pilot phase\n\n\n\nAwareness & Education Campaign – USD 20,000\n\nDescription:\n\nNationwide outreach to parents, schools, diaspora, CSR actors, and community groups to build awareness, trust, and engagement before the pilot launch.\n\nResources Covered:\n\n•\tCommunications specialists\n\n•\tGraphic design & content creation\n\n•\tVideo production & explainer materials\n\n•\tSocial media outreach\n\n•\tWebinars, school briefings, stakeholder sessions\n\n•\tCampaign management & analytics\n\n•\tPrinting and distribution of materials (where needed)\n\nRollout to Pilot Schools – USD 15,000\n\nDescription:\n\nDeployment of the platform in 5 pilot schools, onboarding of school admins, coordination with CEB and installers, operational testing, and monitoring.\n\nResources Covered:\n\n•\tSchool onboarding & training\n\n•\tDeployment officers\n\n•\tCoordination with CEB-certified installers\n\n•\tIntegration of energy data (where applicable)\n\n•\tM&E support for early results\n\n•\tTravel & field visits (if applicable)\n\n•\tHelpdesk and implementation support","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The USD 200,000 budget delivers significant value to the Cardano ecosystem because it funds a real, government-linked, national-level pilot that demonstrates how Cardano can be used as a trusted transparency and public-impact infrastructure—without requiring crypto payments, ensuring full regulatory compliance. This creates a replicable model for dozens of countries where crypto is restricted but blockchain adoption is possible.\n\n\n\n1. Investment into a High-Visibility, Real-World Cardano Use Case\n\n\n\nThe project shows Cardano being deployed in the public sector to track funding, milestones, and climate impact for solar installations in schools. This is one of the strongest forms of Cardano utility—real-world transformation with measurable outcomes.\n\n\n\n2. Open-Source Components Reusable by the Community\n\n\n\nMost of the platform’s blockchain-related elements—metadata hashing, impact token logic (non-financial), smart-contract automation frameworks, and transparency modules—will be released open source. This allows other Cardano builders to reuse, modify, and scale these tools at zero cost.\n\n\n\n3. Demonstrates Cardano’s Role in SDG Impact Finance\n\n\n\nThe project becomes a blueprint for how Cardano can support:\n\n\n\nclimate action tracking\n\n\n\nrenewable-energy impact reporting\n\n\n\npublic-sector transparency\n\n\n\ncommunity-driven funding models\n\n\n\nThis strengthens Cardano’s standing as a blockchain for sustainability, inclusion, and development.\n\n\n\n4. Institutional Onboarding into the Cardano ecosystem\n\n\n\nA portion of the project cost supports coordination with:\n\n\n\nMinistry of Education\n\n\n\nMITCI (IT Ministry)\n\n\n\nCEB\n\n\n\nUNDP\n\nThese institutions learn and interact with Cardano-backed systems, expanding institutional trust and long-term adoption potential.\n\n\n\n5. Large-Scale Social Visibility for Cardano (Public + Government)\n\n\n\nThe awareness campaign introduces Cardano’s transparency features to thousands of parents, teachers, students, CSR foundations, and community partners—even without using crypto. This elevates Cardano’s visibility in a regulated but tech-forward context.\n\n\n\n6. Technical Development Strengthens Cardano’s Developer Ecosystem\n\n\n\nMost of the budget (USD 150,000) funds skilled developers building:\n\n\n\nmetadata-linked records\n\n\n\nnon-financial impact token modules\n\n\n\nsmart contract automation\n\n\n\nblockchain transparency APIs\n\n\n\nsecure enterprise-grade backend\n\nThese are direct technical assets for Cardano’s ecosystem.\n\n\n\n7. A Scalable Model That Can Be Replicated Globally\n\n\n\nBecause the solution is fiat-in / blockchain-backend, it can be adopted in:\n\n\n\nAfrica\n\n\n\nSmall Island Developing States\n\n\n\nAsia\n\n\n\nLatin America\n\nwhere crypto restrictions exist.\n\nCatalyst funds the first implementation, but the model can scale to hundreds of schools worldwide, growing Cardano’s footprint exponentially.\n\n\n\n8. Measurable On-Chain Impact Metrics\n\n\n\nThe project produces verifiable Cardano-linked metrics:\n\n\n\nhashed records of contributions\n\n\n\non-chain impact snapshots (CO₂ avoided, kWh generated)\n\n\n\ntokenized impact badges\n\nThis demonstrates meaningful blockchain utility beyond financial products.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Environment","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1679}