{"pr_id":"019abf02-f6ed-7bdb-be9c-dd80f3f952e7","title":"Research-Backed Viral Shorts to Bust Cardano Myths","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Persistent myths (“ghost chain,” “not decentralized”) spread online, confusing newcomers and deterring builders. Misinformation clouds Cardano’s image and slows adoption.","solution":"Map top Cardano myths, research why they stick, and turn evidence-based refutations into 30–90s shorts + a creator playbook—shareable tools that correct FUD and help the community spread the truth.","proposer_name":"Agnostica, Ltd","proposer_relevant_experience":"Dr. Robert Danielson, PhD – Educational Psychologist & Research Lead. Dr. Danielson is an educational psychologist with extensive experience in how people overcome misconceptions. He has spent over a decade researching conceptual change and refutational learning methods, authoring more than 25 peer-reviewed publications and securing nearly $2 million in competitive research funding (including grants from the NSF and NIH). One of his recent works was a meta-study on refutational approaches – the very strategy this project will use – and he is contributing a chapter on teaching for conceptual change in an upcoming Oxford educational psychology handbook. In short, Robert’s academic rigor and specialty in correcting false beliefs will ensure our messaging is evidence-based and effective at helping people “unlearn” Cardano myths. He will lead the research-driven design of the content so that each video short is not only factually accurate but also psychologically tuned to change minds.\n\n\n\nAlex James, MA – Managing Director, Agnostica; Technical Program Manager. Alex has led end-to-end delivery of products and research programs for startups, public sector, and large enterprises—owning roadmaps, budgets, vendor coordination, and risk/compliance with his extensive experience in technology product management and content development, strengthens our project's implementation side. His track record of driving successful technology adoption and value-realization projects lends credibility to our capability to deliver. His graduate-level training in qualitative research methodologies further enhances our research capacity.\n\n\n\nAgnostica, Ltd. – Research & Innovation Consultancy (Team Track Record). Dr. Danielson and Mr. James have joined forces under Agnostica, their research and innovation consultancy, which has a strong track record in blockchain communication and peer-reviewed research. In 2025, they spearheaded a public science communication initiative on decentralized knowledge, co-authoring an industry research report on blockchain-based peer review and publishing. That project was all about bridging complex research into accessible insights for the community – and they delivered a comprehensive report openly to Cardano members, showcasing their commitment to open knowledge and Cardano’s values. The same combination of academic rigor and creative flair that drove that success will be applied to Debunking Cardano Myths. Both team members are long-time Cardano community members, and together they bring a “secret sauce” of credibility and creativity: an expert who understands the science of learning, and a producer who understands the art of storytelling. This is not theory for them – it’s a continuation of work they’ve already been doing to make blockchain concepts understandable and engaging to broad audiences.","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Research-Backed Viral Shorts to Bust Cardano Myths","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Agnostica, Ltd","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":8,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Persistent myths (“ghost chain,” “not decentralized”) spread online, confusing newcomers and deterring builders. Misinformation clouds Cardano’s image and slows adoption.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Map top Cardano myths, research why they stick, and turn evidence-based refutations into 30–90s shorts + a creator playbook—shareable tools that correct FUD and help the community spread the truth.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://agnostica.global/","https://scholar.google.com/citations?user=ShZt80kAAAAJ&hl=en","https://www.tradingview.com/news/u_today:ae5f56717094b:0-cardano-founder-debunks-ghost-chain-claims-what-s-going-on/","https://www.tandfonline.com/doi/abs/10.1080/00461520.2024.2365628","https://docs.google.com/document/d/1tdnH3RqyxNWTmF_ZYw197Atpy8Ccrs9cn0-wqdoSWvc/edit?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Yes—everything we ship is open and reusable from day one. Content (reports, guides, videos, transcripts, playbook) will be released under CC BY 4.0; any code or analysis notebooks under MIT. A public repo will host all files with clear LICENSE and CONTRIBUTING docs so the community can remix, translate, and build on the work. Where we publish data, it will be de-identified to protect privacy. No proprietary components—just transparent, forkable assets the Cardano community can use and extend.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Social Media","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Primary: crypto-curious newcomers and skeptics who meet Cardano myths in TikTok/YouTube/X feeds. We’ll reach them with short, myth-busting videos tuned to each platform.\n\n\n\nSecondary: Cardano advocates (SPOs, educators, creators) who counter FUD—we’ll equip them with a messaging guide, playbook, and repostable assets. Why it matters: fact-based narratives lift trust, onboarding, and builder interest. Distribution: Shorts on YouTube/TikTok/Instagram/X; forum/Reddit/Medium posts; Catalyst updates; community calls; open, global translations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"Myth research & mapping: scan crypto channels + survey to rank top myths; publish Myth Map & audience insights.\n\n\n\nRefutations & guide: craft evidence-based messaging with phrasing patterns and do/don’ts.\n\n\n\nAI-assisted shorts: produce 5–10 myth-busting videos (30–90s) + transcripts/captions; platform-optimized copy.\n\n\n\nCreator Playbook: structure, tone, visuals, checklist, localization tips.\n\n\n\nDistribute & engage: multi-platform posts, community calls.\n\n\n\nRCT: 3-arm trial with pre/post/follow-up.\n\n\n\nOpen repo & handoff: publish all assets + walkthrough.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"Success = outputs + outcomes.\n\n\n\nOutputs: Myth Map with ≥10 myths documented; 5–10 shorts + messaging guide + creator playbook;\n\nAI‑efficient production (<5 hrs/video).\n\nReach: >10k views in month 1, strong watch‑through, shares, constructive comments.\n\nAdoption: ≥5 creators reuse/translate; repo downloads, stars, forks, PRs.\n\nEffectiveness: RCT shows ≥20% lift vs control; higher share intent.\n\nDelivery: milestones on time, positive community/Catalyst feedback.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Refutational Techniques – An Evidence-Backed Approach:\n\nThe cornerstone of our solution is the use of refutational messaging – a proven educational psychology technique for correcting misinformation. Unlike simple fact-checking or lists of “myths vs. facts,” refutational content explicitly calls out a misconception first, then systematically debunks it with evidence and explanation. Research has shown this approach to be far more effective at dispelling false beliefs. For example, multiple meta-analyses have found that across topics, student groups, and even countries, refutational approaches consistently and statisctically outperform traditional approaches. In other words, people are more likely to change their minds when misinformation is directly confronted and corrected, rather than ignored or just outweighed by data. This works because our minds don’t automatically reject false information – once a myth is heard, it can linger (“conceptual contamination”), so the myth must be actively refuted to clear the way for the truth. By first acknowledging the myth and then providing a clear correction, refutational messaging prevents the inadvertent reinforcement of the falsehood that can happen when myths are simply repeated or when facts are presented in isolation. It’s an approach validated across numerous topics: Dr. Robert Danielson – a Washington State University educational psychologist and leading researcher on refutation methods – has shown that refutational texts yield better learning outcomes on subjects ranging from innocuous science facts to highly charged issues. In short, refutation is a powerful antidote to misinformation, and our project will put this technique at the heart of Cardano mythbusting. [https://www\\.labmanager\\.com/facts\\-alone\\-are\\-insufficient\\-to\\-overcome\\-misinformation\\-32725](https://www.labmanager.com/facts-alone-are-insufficient-to-overcome-misinformation-32725)\n\n\n\nFor a fun real world example, checkout our breakdown of Charles Hoskinson's recent rebuttal to Justin Bons twitter thread.[https://docs\\.google\\.com/document/d/1tdnH3RqyxNWTmF\\_ZYw197Atpy8Ccrs9cn0\\-wqdoSWvc/edit?usp=sharing](https://docs.google.com/document/d/1tdnH3RqyxNWTmF_ZYw197Atpy8Ccrs9cn0-wqdoSWvc/edit?usp=sharing)\n\n\n\nSolution Overview – Phased Plan:\n\n\n\nMyth Research &amp; Mapping:\n\nWe begin by rigorously identifying and cataloguing the most persistent and damaging myths about Cardano. This phase involves research and data gathering – combing through social media discussions, forums, articles, and community input to pinpoint where misunderstandings arise. We will map each myth in detail: What is the false claim? How did it originate or spread? Which audiences or stakeholder groups are most influenced by it? By creating this “myth map,” we establish a factual baseline and gather the evidence needed to counter each claim. This may include consulting subject-matter experts (for example, getting input from Cardano engineers on technical myths) and compiling authoritative sources to cite in our refutations. \n\n\n\nRefutation Development &amp; Messaging Guide:\n\nIn this phase, we turn raw research into polished refutation narratives. For each identified myth, our team will craft a concise yet compelling refutation script. This isn’t just about stating the correct facts – we will structure each refutation following the proven model: state the myth clearly, explain why it’s wrong (using evidence), and then reinforce the correct information. We pay careful attention to tone and framing, avoiding jargon and using accessible language so that the message resonates with a broad audience. Alongside the individual myth responses, we will produce a Messaging Guide – essentially a playbook that captures the overall communication strategy. This guide will include key messages and themes (for instance, emphasizing Cardano’s research-driven ethos when refuting “Cardano has no real science behind it,” or using analogies to clarify complex technical concepts), as well as style guidelines to maintain factual accuracy without inadvertently amplifying the myths. The messaging guide distills our approach into principles that can be consistently applied, ensuring that all content (videos, posts, etc.) speaks in a unified, effective voice. This phase benefits greatly from Dr. Danielson’s input: we align each refutation with educational best practices, making sure to avoid common pitfalls (like the “familiarity effect” where repeating a myth without refutation can reinforce it). By the end of Phase 2, we’ll have a library of myth-busting scripts and a strategic guide to Cardano myth messaging – the intellectual toolkit for the content to come.\n\n\n\nScriptwriting and AI-Assisted Video Production:\n\nWith refined refutation scripts in hand, we move into content production, creating a series of shareable video shorts. Each video will be a brief, engaging piece (think 60–120 seconds) that presents one myth and debunks it in a refutational format. Scripting is tailored for visual media – we incorporate analogies, simple graphics or text callouts, and a narrative flow that keeps viewers’ attention. To keep production cost-effective and agile, we leverage AI-assisted content tools. This means utilizing modern AI media software for tasks like avatar-based video creation, text-to-speech narration, and automated video editing. For example, instead of hiring a full film crew or on-screen narrator, we can use AI avatars or voiceovers to present the information in a professional tone, dramatically reducing costs and turnaround time.\n\n\n\nCreator Playbook:\n\nEven the best content can have limited impact if it stands alone. That’s why Phase 4 focuses on enabling and encouraging the wider Cardano community to join the effort. We will develop a Creator Playbook that empowers community members, Cardano enthusiasts, and content creators to produce and disseminate mythbusting content on their own. This playbook will be a practical how-to guide, covering everything from the messaging principles (developed in Phase 2) to the technical steps of making videos (as done in Phase 3). Concretely, it will include: guidelines for maintaining an objective and respectful tone (e.g. focusing on facts, not attacking people who hold misconceptions), tips on simplifying complex information, and instructions on using the same AI-assisted tools we employed (with links or tutorials for tools that are free or low-cost). We’ll also provide templates – for instance, sample storyboards or video editing project files – so that creators can easily plug in updated text or voiceovers to make new mythbusting videos following our style. Importantly, the playbook will address multi-language or localized content creation, inviting community members from non-English speaking segments to adapt the materials for their languages/cultures. By distributing this playbook (as a PDF guide, webinars/workshops, and open documentation online), we transform the project from a one-time content drop into a sustainable, community-driven campaign. Any Cardano ambassador or interested YouTuber will have a blueprint to amplify and extend the myth-debunking mission. Phase 4’s deliverable ensures that the knowledge and process we’ve developed can be picked up by others, increasing the project’s reach and longevity.\n\n\n\nDistribution andEngagement Strategy:\n\nDistribution &amp; Engagement Strategy (light‑touch, template‑first) Our goal is not a large marketing push. The shorts are exemplars—testable, reusable templates the community can adopt and extend. We’ll run a light‑touch release: publish each video to our core channels (YouTube Shorts, X/Twitter, and/or the Cardano Forum), archive repost‑ready files, captions, and source notes in the open repository, and notify a small set of community hubs (SPOs, ambassadors, educators) that these assets are free to co‑brand and remix.\n\n\n\nRCT-Based Effectiveness Testing:\n\nA distinguishing aspect of our project is the commitment to rigorously test our impact. In Phase 6, we will conduct an evaluation using an RCT (Randomized Controlled Trial), considered a gold standard approach to objectively measure how effective our refutational videos are at changing minds. Working with Dr. Danielson and following ethical research practices, we will design an experiment to gather quantitative data. For example, we might recruit participants from the target audience (both Cardano-savvy individuals and more casual observers) and randomly assign them to two groups: one group watches a mythbusting video (e.g. debunking “Cardano is too slow” with our refutational content), and the other group might either get no intervention or see a more traditional fact-sheet version of the same information. Both groups would then answer the same set of questions to gauge their beliefs or understanding of the topic. We will compare results between the groups to see if the refutational video led to a stronger correction of the misconception than the alternative. We expect, based on prior research, that the refutational approach will outperform simple fact delivery – and this experiment will let us quantify that effect in the context of Cardano myths. We will conduct such tests for multiple myths if possible, to ensure robust data. The outcome will be compiled into a report on effectiveness, which not only validates our work but provides insights for the community. (For instance, the data may show which type of myths are hardest to correct, or which style of messaging yielded the greatest change in belief.) By treating our content as a hypothesis to be tested, we underscore the research-driven nature of this project – it’s not just communication, it’s also experimentation and learning. The findings from the RCT will be shared openly and will feed back into improving the content further (if needed) or informing future educational projects. This evidence-based verification step is seldom seen in outreach efforts, and it will set a high standard for accountability and impact in the Catalyst community.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Cleaner, more fact‑based discourse.\n\n\n\nBy isolating the most persistent myths and publishing concise, research‑grounded refutations, we reduce the “FUD tax” the community pays in every discussion. Newcomers encounter clear answers instead of noise, and existing members can point to ready‑made materials rather than re‑argue the same points.\n\n\n\nTools that empower advocates.\n\n\n\nThe open Myth Map, Tested Refutations & Messaging Guide, and Creator Playbook give SPOs, ambassadors, educators, and creators immediately usable assets. Instead of starting from scratch, they can co‑brand, adapt, or translate proven messages—lowering the barrier to high‑quality community outreach.\n\n\n\nStronger reputation and trust.\n\n\n\nWhen myths like “ghost chain” are met with crisp, credible counters—and those counters are reused by many voices—the external narrative shifts toward accuracy. We’re not promising market outcomes; we are improving informational quality so observers, partners, and media have better signals to judge Cardano on its merits.\n\n\n\nEducation and capacity‑building.\n\n\n\nEvery short and guide doubles as a learning resource. Viewers leave with a clearer grasp of core concepts (e.g., decentralization via staking, what on‑chain activity really means), while creators pick up portable skills in refutational communication they can apply to future topics. That grows the ecosystem’s communication capacity over time.\n\n\n\nA repeatable model for communications.\n\n\n\nThis project is intentionally open and methodical. The combination of Myth Map → tested refutations → exemplar shorts → playbook → RCT evaluation becomes a blueprint the community can reuse for new myths, governance questions, or developer onboarding. It sets a higher standard: evidence‑backed, transparent, and easy to extend.\n\n\n\nMeasured impact, not just impressions.\n\n\n\nOur randomized controlled trial (RCT) provides an empirical read on what changes minds and what doesn’t. That evidence helps the community invest effort where it works (and refine where it doesn’t), creating a feedback loop that improves future education campaigns.\n\n\n\nLong‑run effects on participation.\n\n\n\nClearer information lowers friction for people on the fence—whether that’s a developer choosing a stack, a newcomer deciding to stake, or a voter engaging in Catalyst. Each myth we disarm removes a small barrier to entry; collectively, that supports a healthier pipeline of users, builders, and contributors.\n\n\n\n**Net effect: **fewer misleading claims dominating the conversation; more accurate, shareable explanations in circulation; and a community equipped with research‑backed methods to keep the narrative aligned with reality.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Dr. Robert Danielson, PhD – Educational Psychologist & Research Lead. Dr. Danielson is an educational psychologist with extensive experience in how people overcome misconceptions. He has spent over a decade researching conceptual change and refutational learning methods, authoring more than 25 peer-reviewed publications and securing nearly $2 million in competitive research funding (including grants from the NSF and NIH). One of his recent works was a meta-analysis on refutational approaches – the very strategy this project will use – and he is contributing a chapter on teaching for conceptual change in an upcoming Oxford educational psychology handbook. In short, Robert’s academic rigor and specialty in correcting false beliefs will ensure our messaging is evidence-based and effective at helping people “unlearn” Cardano myths. He will lead the research-driven design of the content so that each video short is not only factually accurate but also psychologically tuned to change minds.\n\n\n\nAlex James, MA – Managing Director, Agnostica; Technical Program Manager. Alex has led end-to-end delivery of products and research programs for startups, public sector, and large enterprises—owning roadmaps, budgets, vendor coordination, and risk/compliance with his extensive experience in technology product management and content development, strengthens our project's implementation side. His track record of driving successful technology adoption and value-realization projects lends credibility to our capability to deliver. His graduate-level training in qualitative research methodologies further enhances our research capacity.\n\n\n\nAgnostica, Ltd. – Research & Innovation Consultancy (Team Track Record). Dr. Danielson and Mr. James have joined forces under Agnostica, their research and innovation consultancy, which has a strong track record in blockchain communication and peer-reviewed research. In 2025, they spearheaded a public science communication initiative on decentralized knowledge, co-authoring an industry research report on blockchain-based peer review and publishing. That project was all about bridging complex research into accessible insights for the community – and they delivered a comprehensive report openly to Cardano members, showcasing their commitment to open knowledge and Cardano’s values. The same combination of academic rigor and creative flair that drove that success will be applied to Debunking Cardano Myths. Both team members are long-time Cardano community members, and together they bring a “secret sauce” of credibility and creativity: an expert who understands the science of learning, and a producer who understands the art of storytelling. This is not theory for them – it’s a continuation of work they’ve already been doing to make blockchain concepts understandable and engaging to broad audiences.\n\n\n\nPrior Catalyst Success – The team has also proven its reliability within Project Catalyst. Their previous Catalyst proposal (Fund13, Project ID #1300172) recently completed under the Agnostica banner, successfully delivered all of our major milestones, on time and to a high standard. The first deliverable, an extensive literature review on academic peer review, was completed in April 2025. The second, a follow-up industry report on decentralized publishing platforms, was published in mid-2025. Both outputs were delivered as planned and shared openly with the community, reflecting the team’s ability to meet deadlines and produce quality work. In short, the team has already demonstrated that they know how to meet milestones and deliver results in the Catalyst environment. Voters and reviewers can trust that this project will be executed with the same professionalism and accountability – the team is familiar with Catalyst processes (they’ve navigated proof-of-life, reporting, etc.) and has a history of transparent communication and on-schedule delivery.\n\n\n\nProject Feasibility & Financial Plan – The use of funds for this proposal is straightforward and sensible, which further enhances feasibility. The budget is dedicated largely to the team’s time and expertise (research, scripting, filming, editing) along with the essential tools and resources needed for content production. There are no complex technical development costs or unknown dependencies – this is a focused content campaign, so the plan is well within the team’s direct control. Both core members have substantial experience managing funded projects responsibly. Dr. Danielson, for example, has overseen nearly $2 million in research grant funding in his academic career, which speaks to his ability to act as a good steward of project resources. Likewise, through their prior Catalyst work, the team has shown prudent financial management by delivering milestones within scope and budget. This proposal will apply the same disciplined approach: clear milestones, efficient use of tools, and rigorous tracking of progress. Overall, the combination of a veteran research-professional and an experienced media producer – backed by a consultancy structure and proven track record – ensures that Debunking Cardano Myths is not only an inspiring idea but an entirely feasible project. The team has the knowledge, the skills, and the organizational experience to execute this plan and responsibly manage the funds to achieve the intended impact. Each ADA requested will go toward tangible outputs (informative, high-quality video shorts) and the expertise to produce them, making this a low-risk, high-impact investment for the Cardano community.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Myth Map & Research Complete","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Completion of the Myth Map & Audience Insights report. This report will document approximately 10 major Cardano myths, providing context, examples, and references for each. It will also include preliminary analysis of who propagates these myths and on which platforms or channels they circulate.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The report covers at least 10 significant Cardano myths with clear explanations and supporting evidence/data for each one. It has been reviewed for accuracy and completeness – ideally with community input to confirm no major myth is overlooked. Minor adjustments from feedback (if any) are addressed.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A written report (or wiki page) titled Cardano Myth Map & Audience Insights is published and accessible to the community. Each myth entry in the report includes evidence (references, data points). We will also have a record of community feedback or a forum post confirming that the documented myths align with community experience (e.g. comments like “this covers the big ones”).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":5000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Refutation Guide & Content Plan","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Delivery of the first edition of the Tested Refutations & Messaging Guide and a finalized plan for the myth-busting video shorts. This includes written refutation write-ups for each identified myth – i.e. a “truth statement” countering the myth, backed by evidence and crafted with effective messaging. In addition, we will have the scripts or detailed outlines prepared for each of the 5–10 planned short videos. Essentially, the written content (myth explanations and refutations) will be complete, and the video content will be fully planned and ready for production.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A comprehensive Messaging Guide document (or slide deck) is produced, containing every major myth from Milestone 1 along with its refutation and key talking points. All myths identified have a corresponding refutation drafted. The guide is reviewed internally (and fact-checked) to ensure accuracy.\n\n\n\nAt least one video script or storyboard has been pilot tested (e.g. reviewed by a few community members or target audience representatives) to confirm the tone and clarity are effective.\n\n\n\nAny feedback from this test is incorporated, and there are no major factual contentions from the community about our refutations. This milestone is achieved when the guide is ~90% content-complete and approved by the team (with minor tweaks remaining possible) and the video planning is in place.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The Refutations & Messaging Guide (text document or PDF) is released to the project repository or shared with the community. It clearly lists each myth with the corresponding refutation and evidence. Additionally, we will provide a sample video script or outline (for at least one myth-busting video) as evidence that content planning is done – this might be shared via a Google Doc link or in the repository for community feedback. Evidence could also include notes from an internal review or a brief report on the pilot test of a script (e.g. summary of feedback received and changes made).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Myth-Busting Videos Produced","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Production and publication of 5 to 10 myth-busting short videos (each approximately 30–90 seconds) along with captions and transcripts for accessibility. By this stage, the first batch of videos will have been created and released on platforms such as YouTube, TikTok, Instagram, and X (Twitter). We will also prepare accompanying social media copy for each video to facilitate sharing. (Videos will be rolled out progressively in Month 4 and Month 5, rather than all at once, to gather audience feedback and maintain momentum. However, by the end of Month 5 the full set of targeted videos will be completed and live.)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"At least 5 high-quality videos addressing distinct Cardano myths are fully produced, captioned, and publicly released by the end of Month 5 (our stretch goal is to have 10 videos if time and resources allow).\n\n\n\nEach video should accurately and engagingly refute the targeted myth, consistent with the messaging guide. Transcripts for each video are compiled and available (for example, in the open repository or as blog posts) so that the content can be consumed in text form as well.\n\n\n\nThis milestone is considered achieved when the minimum number of videos (5) are live on our channels with initial engagement metrics (views, likes, or comments) indicating that the community and public are noticing them. The successful completion demonstrates that our production pipeline is working and content rollout is on track.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public links to the myth-busting videos on platforms (YouTube playlist, TikTok profile, etc.) will serve as evidence. We will also provide a document of transcripts for all videos (and subtitle files if applicable) in the open repository. Screenshots or summary statistics of the videos’ performance (e.g., number of views or engagements in the first few weeks) will be gathered to show that the videos have indeed been published and reached an audience. Additionally, any community feedback or comments on these videos can be documented as further evidence that the content is out in the wild and making an impact.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Creator Playbook & Open Repository Launch","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Publication of the Creator Playbook and launch of the open-access repository containing all project outputs to date. The Creator Playbook will be a guide (in PDF/Markdown format) that distills our methods, best practices, and lessons learned for others who may want to replicate or build upon this project. Concurrently, a public repository (e.g., on GitHub) will be populated and organized with all materials: the Myth Map report, the Refutations & Messaging Guide, all video files or links (with clear titles and attributions), video transcripts and caption files, and the playbook itself.\n\n\n\nThe repository will include appropriate licensing and contribution guidelines to encourage community use and contributions. We will announce and share this repository with the community (for example, via the Cardano Forum and social channels).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The Creator Playbook document is fully written, edited, and understandable to the target audience (content creators and community educators). To ensure clarity, we might have a community member or an independent reviewer go through the playbook to confirm it’s easy to follow. The open repository is live and contains all relevant project files in a well-organized structure.\n\n\n\nAll content produced up to this point (myth research, messaging guide, videos, transcripts) is accounted for and accessible. This milestone is achieved when the playbook is published and the repository is publicized, and when at least an initial positive reception from the community is observed (for instance, a few GitHub stars, forks, or appreciative comments that indicate people are interested in the material). The essence of this milestone is making sure the work is transparently documented and handed to the community in a usable format.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A publicly accessible GitHub repository link (or link to another open platform) will be provided, showing the repository populated with: the Myth Map & research report, the Refutation/Messaging Guide, the video files or links (and instructions for access), transcripts, the Creator Playbook, and supporting files like licenses.\n\n\n\nThe Creator Playbook itself will be available in the repository (and perhaps as a downloadable PDF). We will present an announcement post (for example, on the Cardano Forum or Project Catalyst update) that the repository is live – this announcement and any community responses to it will serve as evidence that the handoff of materials has taken place. We can also document any direct feedback on the playbook (e.g., a community member’s confirmation that they found it useful or understandable).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Effectiveness Testing & Evaluation Report","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Execution of an RCT-based (Randomized Controlled Trial) effectiveness study and a published report detailing the findings. In this phase, we will formally evaluate how effective our myth-busting videos are at changing perceptions or increasing understanding. For example, we will design an experiment where participants are split into groups – one group watches a selected myth-busting video while a control group does not (or sees a straightforward fact sheet instead) – and then both groups answer the same questions to assess their beliefs or knowledge about the topic. We plan to run such a test for at least one major myth (ideally multiple myths if time permits) following proper research ethics (with guidance from Dr. Danielson).\n\n\n\nAfter collecting and analyzing the data, we will produce an Effectiveness Testing Report that outlines the methodology, results (with data visualizations as appropriate), interpretation of the impact, and recommendations. This report effectively “closes the loop” by validating our approach and offering insights for the community on what worked and what could be improved.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A rigorous evaluation is conducted with a defined methodology (including sample size, control conditions, and measured outcomes).\n\n\n\nThe result should be quantitative data demonstrating the difference in understanding or belief correction between those exposed to our refutational content and those who were not.\n\n\n\nThe Effectiveness Testing Report is completed, documenting the experiment and its findings in detail. Success is not contingent on the outcome being positive or negative; rather, success is in the completion of the test and the extraction of actionable insights.\n\n\n\nIn other words, whether the videos significantly improved understanding or showed only mild effects, the key is that we have credible data and analysis. The milestone is achieved when the report is published and shared with the community, providing an evidence-based assessment of our project’s impact.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The primary evidence will be the published evaluation report, added to our open repository and also shared as a standalone document or long-form post (e.g., on a blog or the Cardano Forum). The report will contain the methodology and results, including any charts or tables comparing groups (for example, a graph of quiz scores or belief ratings for the video group vs. control group).\n\n\n\nWe will also include a summary of insights or conclusions drawn. If feasible, we may share anonymized raw data or a data summary as an appendix or in the repository to demonstrate that the results are backed by real data.\n\n\n\nAdditionally, we will provide proof that this report was disseminated to the community – for instance, a forum announcement or a presentation in a community call where we discuss the findings. Any feedback or discussion generated by the report can further serve as evidence that the community has engaged with our evaluation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #6","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Community Handoff & Outreach Event","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A final community outreach and handoff event, along with complete project wrap-up documentation. We will host a session (for example, a live webinar, AMA, or recorded video presentation) to walk the community through all the resources we’ve created.\n\n\n\nIn this event, the team will demonstrate how to access and use the repository, how to leverage the Creator Playbook, and will answer any questions from the community. We will also take this opportunity to acknowledge contributors and thank the community for their support.\n\n\n\nAdditionally, we will prepare a final summary report or closing post that lists all project deliverables with links and provides guidance for how the community can continue the work (e.g., encouraging them to update the myth map over time, create new content, or fork the repository for their own initiatives). Essentially, this milestone focuses on ensuring the sustainability and uptake of the project’s outputs beyond the project’s official end.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A successful handoff event is conducted and made available to those who couldn’t attend live (recorded if live). The event or presentation clearly covers where to find the materials and how to use them.\n\n\n\nThere is evidence that the community is prepared to take ownership: for instance, attendees ask questions or express interest in using the materials, or immediately following the event there’s an uptick in repository visits/clones or playbook downloads.\n\n\n\nThe final summary (project close-out) is posted on the Catalyst platform or forum, and it contains all necessary information for anyone who wants to follow up or build upon the project. This milestone is achieved when the knowledge transfer is completed and the community indicates understanding of how to utilize the outputs, marking the project as fully wrapped up.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A recording or link to the community handoff webinar/presentation will be provided (for example, a YouTube link if it’s a recorded video or a Zoom recording link if it was a live session).\n\n\n\nWe will also supply the final project summary document/post – likely as a link to a Catalyst close-out report or a forum post – which enumerates all deliverables and includes references to the repository and playbook.\n\n\n\nAdditional evidence may include engagement metrics from the event (such as number of attendees or viewers) and any community responses (comments on the forum post, thank-you notes, or indications that community members have started using the materials).\n\n\n\nWe will furthermore note that the Project Close-Out Report and a short project completion video (if required by Catalyst procedures) have been submitted, signifying formal completion.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Dr. Robert Danielson, PhD – Educational Psychologist & Research Lead. Dr. Danielson is an educational psychologist with extensive experience in how people overcome misconceptions. He has spent over a decade researching conceptual change and refutational learning methods, authoring more than 25 peer-reviewed publications and securing nearly $2 million in competitive research funding (including grants from the NSF and NIH). One of his recent works was a meta-study on refutational approaches – the very strategy this project will use – and he is contributing a chapter on teaching for conceptual change in an upcoming Oxford educational psychology handbook. In short, Robert’s academic rigor and specialty in correcting false beliefs will ensure our messaging is evidence-based and effective at helping people “unlearn” Cardano myths. He will lead the research-driven design of the content so that each video short is not only factually accurate but also psychologically tuned to change minds.\n\n\n\nAlex James, MA – Managing Director, Agnostica; Technical Program Manager. Alex has led end-to-end delivery of products and research programs for startups, public sector, and large enterprises—owning roadmaps, budgets, vendor coordination, and risk/compliance with his extensive experience in technology product management and content development, strengthens our project's implementation side. His track record of driving successful technology adoption and value-realization projects lends credibility to our capability to deliver. His graduate-level training in qualitative research methodologies further enhances our research capacity.\n\n\n\nAgnostica, Ltd. – Research & Innovation Consultancy (Team Track Record). Dr. Danielson and Mr. James have joined forces under Agnostica, their research and innovation consultancy, which has a strong track record in blockchain communication and peer-reviewed research. In 2025, they spearheaded a public science communication initiative on decentralized knowledge, co-authoring an industry research report on blockchain-based peer review and publishing. That project was all about bridging complex research into accessible insights for the community – and they delivered a comprehensive report openly to Cardano members, showcasing their commitment to open knowledge and Cardano’s values. The same combination of academic rigor and creative flair that drove that success will be applied to Debunking Cardano Myths. Both team members are long-time Cardano community members, and together they bring a “secret sauce” of credibility and creativity: an expert who understands the science of learning, and a producer who understands the art of storytelling. This is not theory for them – it’s a continuation of work they’ve already been doing to make blockchain concepts understandable and engaging to broad audiences.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Primary Researchers Compensation:\n\n\n\nWe anticipate two primary researchers (the joint applicants, Robert and Alexander, listed above) working on the project for a total of approximately 550 hours. This includes time spent on the research, development, data analysis, content creation, and distribution aspects of the project.\n\n\n\nBreakdown:\n\n\n\nEstimated time: 550 hours\n\n\n\nTotal: $22,500 per researcher\n\n\n\nOverall: $22,500 * 2 = $45,000\n\n\n\nExpenses & Participation Incentives:\n\n\n\nThere will be expenses related to subscriptions, fees associated with publication, and other incidental costs.\n\n\n\nAdditionally, given the importance of obtaining quality data from interview participants, some funds will be set aside to offer as participation incentives. This could help ensure high-quality responses and a broad pool of participants. We intend to pay the participants where possible in ADA, which will also serve as a validation step in some instances that they are active in the Caradno ecosystem, at least to some extent.\n\n\n\nBreakdown:\n\n\n\nTotal: $1000\n\n\n\nThus we request 60,000 ADA or approximately $45,000 USD (if valued at an optimistic .75 USD/ADA)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"We believe our proposal offers excellent value for money by delivering a broad suite of tangible outputs and long-term benefits for a relatively modest budget. Here’s why funding this project is a smart investment for the Cardano ecosystem:\n\n\n\nAddressing a High-Impact Problem: Misinformation isn’t just a minor annoyance – it has real costs. It can scare away potential users, investors, and developers, which in turn slows down ecosystem growth and can even indirectly affect market value. By investing 60,000 ADA in dispelling myths, the community is effectively investing in improving Cardano’s image and attractiveness. Compared to the potential gains (even if a few high-capacity developers or a new wave of ADA holders join because they got the correct info), the cost is small. It’s like funding a public relations and education campaign that can prevent much larger opportunity losses down the line.\n\n\n\nMultiple Deliverables for the Price of One: Our budget isn’t just creating a report or just a video – it’s funding an entire package: detailed research insights, educational guides, a series of videos, a creator toolkit, and an effectiveness study. Each of these components on its own could have been a separate proposal, but we’ve combined them to be efficient and coherent. This means the ecosystem gets a comprehensive solution rather than piecemeal efforts. The Myth Map can inform other marketing efforts; the videos can be shared far and wide; the playbook enables ongoing content creation; the test results feed back into strategy. It’s a multiplier effect, all for one budget.\n\n\n\nOpen Source and Open Access = Exponential Reuse: Because everything we produce will be open source (CC BY 4.0 and MIT licensed), the content can be reused infinitely at no extra cost. Community members, other projects, even the Cardano Foundation or Emurgo can take our outputs and incorporate them into their materials. For example, a university blockchain club could use our videos in their Cardano intro class, or the content could be repurposed in different languages by volunteers. This means the one-time cost creates assets that continue to deliver value without needing further funding. We’re essentially seeding a library of myth-busting resources for Cardano that anyone can draw from freely. In terms of value, it’s like building infrastructure – an initial investment yields ongoing utility.\n\n\n\nLeveraging Technology to Save Costs: We purposely plan to use AI video generation and existing tools to keep production costs low. Traditional video content of similar quality (5-10 short professional videos) could easily cost significantly more – consider hiring videographers, editors, on-screen talent, studio time, etc. That could run into tens of thousands of dollars alone. By using AI and doing it in-house, we might be doing it for a fraction of that, effectively passing those savings back to the project’s scope (allowing us to do more with the same budget). Voters can be assured that we’re not spending, say, $20k on renting cameras or anything; the funds go into actual content and outreach rather than expensive overhead. This approach shows our mindset of cost-effectiveness – we want to maximize outputs per ADA.\n\n\n\nCommunity Upskilling and Autonomy: By funding this project, the community isn’t just buying content, it’s also investing in skill development. The Creator Playbook and the involvement of community members means more people will learn how to communicate effectively about Cardano. This builds human capital. In the future, the community might not need to fund another similar proposal because we’ll have a cadre of experienced myth-busters and a template to follow. In essence, this project is somewhat self-terminating in funding needs – it creates the tools for people to continue the work without needing additional large budgets (maybe just small updates or expansions as needed). That’s high value because it can reduce dependency on continuous funding for education.\n\n\n\nTransparency and Measurable Outcomes: We have clear success metrics and we’re even doing a formal evaluation. This means the community can verify the return on investment. If our videos collectively get, say, 50,000 views and a chunk of those viewers change their stance on Cardano, that’s a huge win for a one-time 60k ADA spend. If our guide is used by dozens of content creators, that’s a lasting network effect generated. We’ll present these outcomes openly. The ability to measure our impact reduces the risk of waste – voters will not be funding a black box; they’ll fund something with concrete checkpoints and a feedback loop.\n\n\n\nAligned with Cardano’s Mission and Catalyst Goals: Cardano is all about research-driven, long-term thinking and community empowerment. This project embodies those values by combining research (we’re not winging it, we’re studying the issue deeply) with community empowerment (open source content and playbooks). Funding this sends a message that the community values truth and education – which in turn can attract like-minded contributors. The project could also set an example for other Catalyst teams to incorporate testing and open-sourcing, thereby elevating the quality of proposals in general. So the value isn’t just in our outputs but also in setting a standard for how to approach educational challenges in Catalyst (with rigor and openness).\n\n\n\nEconomic Value via Improved Adoption: While it’s hard to quantify precisely, clearing misconceptions can have economic benefits. For instance, if even a small percentage of those who dismissed Cardano due to myths reconsider and start using the network (be it through transacting, building, or staking), that adds transaction volume, TVL, and overall vibrancy to the ecosystem. More developers building can attract more users, more users can attract more businesses or interest – it’s a virtuous cycle. The cost of 60k ADA is trivial compared to the potential economic activity from even one mid-sized project deciding to build on Cardano because they learned “hey, Cardano isn’t actually a ghost chain; it has a supportive community and good tech.” In other words, we’re enhancing Cardano’s competitive edge in the crypto space with this investment.\n\n\n\nRisk Mitigation: Misinformation can also lead to poor decisions (e.g., voters in Catalyst might be swayed by myths if they aren’t corrected, or holders might panic sell on false news). By proactively dispelling false narratives, we help mitigate such risks. It’s like an insurance policy for the community’s knowledge base. For 60k ADA, the community buys a bit of resilience against FUD storms. Considering how much value can be lost in a single wave of FUD (market cap drops can be millions), this preemptive strike is a bargain if it prevents or softens even a small FUD-driven dip or controversy.\n\n\n\nIn conclusion, our proposal offers high leverage: relatively low cost for potentially large and lasting benefits. We deliver concrete outputs and empower others, creating a ripple effect that extends well beyond the immediate project. By funding “Debunking Cardano Myths,” the community is effectively investing in its own clarity, reputation, and future growth – a value proposition we believe is very compelling for Catalyst voters and the Cardano ecosystem as a whole.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Social Media","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1681}