{"pr_id":"019ac08c-94f5-7fcc-8d66-be9c09c9b6e5","title":"[HBA] Develop Blockchain Student Hub in 10 universities","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"• Students lack structured, credible blockchain learning paths.\n• Unitour events are fragmented and don’t build long-term growth.\n• Cardano’s education efforts still lack strong media visibility.","solution":"• Cardano’s Unitour will run within Club system.\n• HBA’s formal mandate provides strong legitimacy for student activities.\n• Cardano gains improved visibility across mainstream media.","proposer_name":"Ho Chi Minh City Blockchain Association","proposer_relevant_experience":"# **Lead 1: Mr\\. Tran Xuan Tien**\n**Responsibilities:**\n\n- Overall Project Management &amp; Execution: Serve as the General Secretary overseeing the entire program, managing daily operations, logistics, and ensuring alignment between the HBA board and the project team.\n- Official Representation &amp; Media Relations: Act as the official spokesperson and representative for the HBA, directly responsible for Public Relations (PR) and managing media content, supporting the goal of securing mainstream press coverage.\n- Institutional &amp; Partner Engagement: Manage communication and consensus-building between the student clubs, HBA leadership, and external partners, strengthening the program's legitimacy.\n- Knowledge Dissemination: Actively participate in educational events and panels to share expertise on the cryptocurrency market and blockchain technology, enhancing curriculum credibility.\n\n**Qualifications:**\n\n- Executive Management: General Secretary of the HCMC Blockchain Association (HBA), demonstrating proven capacity for high-level organizational management, administration, and project execution.\n- Journalism &amp; Media Expertise: Possesses 8 years of experience in the journalism/media industry, providing deep insight into mainstream communication channels and crisis management skills.\n- Public Profile &amp; Authority: Highly reputable expert in the blockchain and cryptocurrency space, frequently participating in official panel discussions and forums.\n- Communication &amp; Advocacy: Experienced official spokesperson, validating the ability to effectively convey the value proposition of HBA and Cardano to the broader business and public community.\n\n# **Lead 2: Mr\\. Bui Quang Tinh Tu**\n**LinkedIn: **[https://www\\.linkedin\\.com/in/tinhtu/](https://www.linkedin.com/in/tinhtu/)\n\n**Responsibilities:**\n\n- Overall Project Leadership: Manage and oversee the entire project, ensuring the establishment, operation, and sustainable growth of 5 Student Blockchain Clubs are on track and within budget.\n- Marketing &amp; Scaling Strategy: Responsible for designing and executing the marketing strategy to achieve the 1M+ Media Reach KPI, including attracting and managing mainstream media partnerships.\n- Educational Content Development: Oversee the quality and professionalism of the educational content, specifically the &quot;Blockchain Handbook&quot;, ensuring its suitability for digital transformation and blockchain education within academic settings.\n- Community Engagement: Design the mechanisms for engaging and sustaining the club communities, converting promising students into active contributors to the Cardano ecosystem.\n\n**Qualifications:**\n\n- Executive-Level Experience (CEO): Currently the CEO of Conversion Asia (Marketing and Digital Transformation consulting firm), demonstrating capacity for strategic planning and complex project management.\n- Scalable Growth Expertise: Former Chief Growth Officer (CGO) at JobHopin, with direct experience in building and scaling business/community initiatives effectively.\n- Mass Community Building Capability: Founder of the UAN (Underground Agency Network), one of Vietnam’s largest professional marketing communities, confirming the unique ability to organize, manage, and mobilize large-scale audiences.\n- Extensive Experience: Over 10 years of experience in Marketing, Digital Transformation, and Community leadership.\n- Public Authority: Recognized as a TEDx Speaker, enhancing the credibility and authority of all program events and public outreach activities.\n\n\n\n# Cardano Vietnam will partner with HBA in human-resource training and development.\n**About Cardano Vietnam**\n\nCardano Vietnam is a long-standing, sustainable community dedicated to education, technical training, builder development, and the expansion of the Cardano ecosystem in Vietnam. Led by Cardano Ambassadors, the community has built an extensive network across universities, technology clubs, Web3 startups, and domestic blockchain partners.\n\nAs an event partner and a collaborator in applying Cardano Blockchain technology, Cardano Vietnam will take on the following roles:\n\nDeveloper onboarding and practical training: wallet creation, testnet interaction, transaction execution, introductions to Plutus and Hydra, and setting up development environments.\n\n- Ecosystem education: governance, Project Catalyst, treasury mechanisms, and funding opportunities for startups and emerging project teams.\n\n- Enterprise advisory: supporting traditional businesses and startups in adopting Cardano Blockchain solutions.\n\n- Content development and localization: producing high-quality Vietnamese materials for students, developers, founders, and ADA holders.\n\n- Event and community media support: promoting activities, amplifying communication across social channels, and engaging participants.\n\n- Collaboration with universities, developer communities, and Web3 partners to help Cardano reach broader user groups across Vietnam.\n\n- With a strong network and consistent training and communication efforts, Cardano Vietnam plays a critical role in attracting new builders and supporting businesses in adopting Cardano technology.","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"[HBA] Develop Blockchain Student Hub in 10 universities","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Ho Chi Minh City Blockchain Association","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"• Students lack structured, credible blockchain learning paths.\n• Unitour events are fragmented and don’t build long-term growth.\n• Cardano’s education efforts still lack strong media visibility.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"• Cardano’s Unitour will run within Club system.\n• HBA’s formal mandate provides strong legitimacy for student activities.\n• Cardano gains improved visibility across mainstream media.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://drive.google.com/file/d/170X5dh37SRAEUtRn_zeZkqtqyG5zmXHp/view?usp=sharing","https://docs.google.com/document/d/19oJhNEhTf9vtPNdsbv-oCrpHIB3aqvwvGGrdY8jjrkI/edit?usp=sharing","https://drive.google.com/file/d/1zxKcjL07cA2zexXg2DB-Y9qnR32rUypU/view?usp=sharing","https://www.facebook.com/share/p/19uA4WWb3g/","https://www.facebook.com/share/p/14L2r1qYLpX/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"The club model operates as a CSR initiative, fully dedicated to serving the community.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Education","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"- We aim to build a future talent pipeline for Ho Chi Minh City by bringing foundational Blockchain knowledge to students across universities.\n\n- By partnering with universities, HBA is establishing a network of Blockchain Clubs on campus. HBA will serve as an advisor, providing **structured programs and clear learning pathways** for students interested in Blockchain.\n\n- **Cardano’s activities will be organized within this system**, allowing value to be accumulated and expanded through each initiative over time.\n\n- All educational activities related to Cardano will also be featured in **mainstream media**, strengthening Cardano’s presence and credibility in Vietnam.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"- Formal University MOUs: Establish and finalize official Memorandums of Understanding (MOUs) with at least **5 top\\-tier universities** in Ho Chi Minh City to formally authorize the establishment of **student blockchain clubs\\.**\n- Government Alignment &amp; Recognition: Leverage the HBA's authority to actively integrate the program's activities into the official operational plans of key competent governmental agencies (e.g., **Ho Chi Minh City Digital Transformation Center**) to ensure institutional recognition.\n- Educational Events: Organize and host at least 5 large-scale educational events (combining academic workshops and public meetups) over 12 months, featuring official HBA.\n- On-Chain Certification: Design, mint, and issue **800\\+ NFT** Certificates to students completing the structured training.\n- The Unitour series, sponsored by Cardano, will focus on themes such as career opportunities in the blockchain industry.\n\nMedia support will include featuring the Unitour events, along with Cardano’s presence—on official and mainstream media channels.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"- Community Infrastructure: Establish and formalize **5 dedicated Blockchain Student Clubs** at major universities, officially recognized by their institutions and partnered with the Ho Chi Minh City Blockchain Association (HBA).\n- Media &amp; Outreach Reach: Achieve **1,000,000\\+ **total cumulative impressions/reach across mainstream and social media channels (views, pictures, and engagement data) for all program activities.\n- Ecosystem Conversion (On-Chain): Directly convert students into verifiable contributors by issuing **800\\+ NFT Certificate**, serving as proof of skills acquired during the workshops.\n- Foundational Recognition: Formally recognize and **award 5\\-10 key individuals, including Cardano Representatives/Foundations,** for their significant contributions to the development and growth of the Blockchain community in Ho Chi Minh City.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The Government has designated blockchain as a strategic technology within the National Digital Transformation agenda. Ten research and training institutions have been established or upgraded to develop a dedicated **human\\-resource strategy for blockchain**. The technology has also been incorporated into the official curricula of universities, colleges, vocational schools, and research centers.\n\n\n\nUnder **Decision No\\. 1236/QĐ\\-TTg**, the Prime Minister approved the National Strategy for the Application and Development of Blockchain Technology through 2025, with orientation toward 2030.\n\n# **Problem perception**\n- The adoption of blockchain technology in Vietnam has accelerated in recent years. However, university students, who represent the future talent pipeline of the industry currently lack structured and credible pathways to access blockchain education and practical experience.\n- Separate, one-off Unitour activities do not create a consistent pathway for students to grow or accumulate meaningful value in Blockchain. Without a unified hub, students lack a place to develop, connect, and progress in a structured way.\n- At the same time, Cardano’s educational initiatives in Vietnam have not yet translated into strong, legitimate visibility or presence in mainstream media.\n\n# Our approach\n- Cardano’s Unitour series will be organized within the official structure of the Blockchain Club system, coordinated by HBA in partnership with universities.\n- As an official association established under the governance of the HCMC Electronic Media Association, the HBA provides the project with an unprecedented level of institutional legitimacy within Vietnam's regulatory environment. This formal mandate ensures that the student-focused activities are not merely grassroots initiatives but are instead officially sanctioned and supported by a recognized local authority.\n- This ensures Cardano’s activities are continuously accumulated, expanded, and sustained over time—while also being featured in mainstream media, elevating Cardano’s visibility and reputation to a new level in Vietnam.\n\n# Target engagement\n- Future Blockchain Workforce from University Students","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"# **Legitimacy**\nHBA is the official and government-recognized blockchain organization in Ho Chi Minh City. All of HBA’s activities are conducted under this formal mandate. Therefore, participation in these initiatives elevates the credibility and positioning of Cardano within the local ecosystem.\n\n# **Media Impact**\nHBA’s activities consistently generate strong mainstream media coverage, something Cardano has not fully leveraged in Vietnam in recent years. Through this project, Cardano will gain official, high-visibility exposure across major press channels.\n\n# **Community Expansion**\nCommunity growth begins with establishing Blockchain Clubs at universities. As these student communities take shape and mature, they gain exposure to various ecosystems and can choose the ones that best fit their interests. If Cardano delivers strong value and visibility, these communities can naturally evolve into future contributors and builders within the Cardano ecosystem—fueling long-term growth and expansion.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"- HBA is the official blockchain organization with the sole mission of promoting blockchain adoption in Ho Chi Minh City.\n\nOur partners for conducting this survey include both government and non-government organizations such as the Ho Chi Minh City Digital Transformation Center (DXC).\n\n- We are also collaborating with the Institute of Copyright Technology and Digital Assets to provide expert consultation on the educational content designed for students.\n- Each phase of the program will include clearly defined milestones to ensure structured progress and measurable outcomes.\n\n# **Team capabilities**\n- From a technical standpoint, we receive expert guidance from the Institute’s team, along with support from a strong lineup of highly qualified blockchain specialists in Vietnam.\n- The event organizer has a proven track record of delivering large-scale conferences, including Conviction, the number one blockchain conference in Vietnam, which attracted more than 30,000 attendees.\n\n# **Previous work**\n- Conviction: the largest crypto and AI event in Vietnam in 2024, attracting more than 30,000 attendees.\n- Unitour Series: a high-quality educational roadshow hosted across major universities, designed to provide students with advanced knowledge in blockchain and emerging technologies.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Foundation Building, Launch of 3 Clubs, & Initial Outreach","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Successful establishment and formalization of 2 Blockchain Student Clubs (out of 5 total).\n- Successful completion of 1 Unitour, collaboration with Cardano.\n- Social media–based engagement programs.\n- Press Release.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Successful launch and operationalization of 2 formalized Student Clubs. Completion of 1 Unitour with satisfactory attendance records.\n- 30% of Media Reach KPI achieved (300,000 views), including verifiable coverage from at least 5 major mainstream media outlets.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Formal acceptance letters/MOU links from the final 2 universities confirming club formalization.\n- Verifiable media clippings and links to articles published by mainstream media outlets documenting the project's institutional achievements and contributor recognition event.\n- 120+ issued NFT Certificates.\n\nPublic link/documentation of the Cardano Contributor Recognition event.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Successful establishment and formalization of the remaining 2 Blockchain Student Clubs","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Successful establishment and formalization of 2 Blockchain Student Clubs (out of 5 total).\n- Successful completion of 2 Unitour, collaboration with Cardano.\n- Social media–based engagement programs.\n- Press Release.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Successful launch and operationalization of 2 formalized Student Clubs. Completion of 2 Unitour with satisfactory attendance records.\n- 30% of Media Reach KPI achieved (300,000 views), including verifiable coverage from at least 5 major mainstream media outlets.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Formal acceptance letters/MOU links from the final 2 universities confirming club formalization. \n\n- Verifiable media clippings and links to articles published by mainstream media outlets documenting the project's institutional achievements and contributor recognition event. \n\n- 240+ issued NFT Certificates. \n\n- Public link/documentation of the Cardano Contributor Recognition event.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Strengthening the Club Model and Unitour Activities","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Successful establishment and formalization of final Blockchain Student Clubs (out of 5 total).\n- Successful completion of 2 Unitour, collaboration with Cardano.\n- Social media–based engagement programs.\n- Press Release.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Successful launch and operationalization of 1 formalized Student Clubs. Completion of 2 Unitour with satisfactory attendance records. \n\n- 40% of Media Reach KPI achieved (400,000 views), including verifiable coverage from at least 5 major mainstream media outlets.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Formal acceptance letters/MOU links from the final university confirming club formalization. \n\n- Verifiable media clippings and links to articles published by mainstream media outlets documenting the project's institutional achievements and contributor recognition event. \n\n- 240+ issued NFT Certificates. \n\n- Public link/documentation of the Cardano Contributor Recognition event.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Wrap up","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- The final close-out report provides a complete summary of all activities, outcomes, and key metrics from the project. \n- The final close-out video is also available, showcasing event highlights and ensuring full transparency for all stakeholders.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The final closeout report is publicly available, fully aligned with all commitments outlined at each milestone and in the overall project plan. \n- The final closeout video is also publicly accessible for transparency and verification.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to the final closeout report (including participant numbers, media reach, engagement metrics, and overall program performance).\n- Link to final closeout video.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"# **Lead 1: Mr\\. Tran Xuan Tien**\n**Responsibilities:**\n\n- Overall Project Management &amp; Execution: Serve as the General Secretary overseeing the entire program, managing daily operations, logistics, and ensuring alignment between the HBA board and the project team.\n- Official Representation &amp; Media Relations: Act as the official spokesperson and representative for the HBA, directly responsible for Public Relations (PR) and managing media content, supporting the goal of securing mainstream press coverage.\n- Institutional &amp; Partner Engagement: Manage communication and consensus-building between the student clubs, HBA leadership, and external partners, strengthening the program's legitimacy.\n- Knowledge Dissemination: Actively participate in educational events and panels to share expertise on the cryptocurrency market and blockchain technology, enhancing curriculum credibility.\n\n**Qualifications:**\n\n- Executive Management: General Secretary of the HCMC Blockchain Association (HBA), demonstrating proven capacity for high-level organizational management, administration, and project execution.\n- Journalism &amp; Media Expertise: Possesses 8 years of experience in the journalism/media industry, providing deep insight into mainstream communication channels and crisis management skills.\n- Public Profile &amp; Authority: Highly reputable expert in the blockchain and cryptocurrency space, frequently participating in official panel discussions and forums.\n- Communication &amp; Advocacy: Experienced official spokesperson, validating the ability to effectively convey the value proposition of HBA and Cardano to the broader business and public community.\n\n# **Lead 2: Mr\\. Bui Quang Tinh Tu**\n**LinkedIn: **[https://www\\.linkedin\\.com/in/tinhtu/](https://www.linkedin.com/in/tinhtu/)\n\n**Responsibilities:**\n\n- Overall Project Leadership: Manage and oversee the entire project, ensuring the establishment, operation, and sustainable growth of 5 Student Blockchain Clubs are on track and within budget.\n- Marketing &amp; Scaling Strategy: Responsible for designing and executing the marketing strategy to achieve the 1M+ Media Reach KPI, including attracting and managing mainstream media partnerships.\n- Educational Content Development: Oversee the quality and professionalism of the educational content, specifically the &quot;Blockchain Handbook&quot;, ensuring its suitability for digital transformation and blockchain education within academic settings.\n- Community Engagement: Design the mechanisms for engaging and sustaining the club communities, converting promising students into active contributors to the Cardano ecosystem.\n\n**Qualifications:**\n\n- Executive-Level Experience (CEO): Currently the CEO of Conversion Asia (Marketing and Digital Transformation consulting firm), demonstrating capacity for strategic planning and complex project management.\n- Scalable Growth Expertise: Former Chief Growth Officer (CGO) at JobHopin, with direct experience in building and scaling business/community initiatives effectively.\n- Mass Community Building Capability: Founder of the UAN (Underground Agency Network), one of Vietnam’s largest professional marketing communities, confirming the unique ability to organize, manage, and mobilize large-scale audiences.\n- Extensive Experience: Over 10 years of experience in Marketing, Digital Transformation, and Community leadership.\n- Public Authority: Recognized as a TEDx Speaker, enhancing the credibility and authority of all program events and public outreach activities.\n\n\n\n# Cardano Vietnam will partner with HBA in human-resource training and development.\n**About Cardano Vietnam**\n\nCardano Vietnam is a long-standing, sustainable community dedicated to education, technical training, builder development, and the expansion of the Cardano ecosystem in Vietnam. Led by Cardano Ambassadors, the community has built an extensive network across universities, technology clubs, Web3 startups, and domestic blockchain partners.\n\nAs an event partner and a collaborator in applying Cardano Blockchain technology, Cardano Vietnam will take on the following roles:\n\nDeveloper onboarding and practical training: wallet creation, testnet interaction, transaction execution, introductions to Plutus and Hydra, and setting up development environments.\n\n- Ecosystem education: governance, Project Catalyst, treasury mechanisms, and funding opportunities for startups and emerging project teams.\n\n- Enterprise advisory: supporting traditional businesses and startups in adopting Cardano Blockchain solutions.\n\n- Content development and localization: producing high-quality Vietnamese materials for students, developers, founders, and ADA holders.\n\n- Event and community media support: promoting activities, amplifying communication across social channels, and engaging participants.\n\n- Collaboration with universities, developer communities, and Web3 partners to help Cardano reach broader user groups across Vietnam.\n\n- With a strong network and consistent training and communication efforts, Cardano Vietnam plays a critical role in attracting new builders and supporting businesses in adopting Cardano technology.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Due to anticipated market conditions, we propose using an estimated ADA price of **$0.40 **to ensure the project’s feasibility and proper execution. At this rate, 60,000 ADA is equivalent to approximately **$24,000\\.**\n\n\n\nThe projected program cost is around **$29,000**, and we plan to secure additional socialized funding to cover the remaining expenses.\n\n\n\nBelow is the detailed budget breakdown for the program: [https://docs\\.google\\.com/spreadsheets/d/1lnXugoh5ivSujzhGUkjtwuBPWQJv3v6alr6L7BOwwDs/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1lnXugoh5ivSujzhGUkjtwuBPWQJv3v6alr6L7BOwwDs/edit?usp=sharing)\n\n\n\n- PRODUCTION &amp; PRINTING: Standee, Backdrop, Leaflet, Handheld Hashtag: 2,000 ADA.\n- DESIGN &amp; ADAPTATION: Design (Backdrop, Standee, leaflet), Design adaptation: 6,000 ADA.\n- MEDIA: Media team (Photo, Video): 6,000 ADA.\n- HR SUPPORT &amp; LOGISTIC: Booth Supporter: Transport, Media team (Video): 2,500 ADA.\n- GAME: Engagement Activity, Sport Game, Falling Stick Reaction Game: 1,500 ADA.\n- PROJECT MANAGEMENT: 5,000 ADA.\n- COMMUNICATION: Press Release, PR Article, Interview Cardano Contributor, Campaign (Collab with HBA): 45,000  ADA.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"**Legitimacy**\n\nHBA is the official and government-recognized blockchain organization in Ho Chi Minh City. All of HBA’s activities are conducted under this formal mandate. Therefore, participation in these initiatives elevates the credibility and positioning of Cardano within the local ecosystem.\n\n**Media Impact**\n\nHBA’s activities consistently generate strong mainstream media coverage, something Cardano has not fully leveraged in Vietnam in recent years. Through this project, Cardano will gain official, high-visibility exposure across major press channels.\n\n**Community Expansion**\n\nCommunity growth begins with establishing Blockchain Clubs at universities. As these student communities take shape and mature, they gain exposure to various ecosystems and can choose the ones that best fit their interests. If Cardano delivers strong value and visibility, these communities can naturally evolve into future contributors and builders within the Cardano ecosystem—fueling long-term growth and expansion.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Education","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1683}