{"pr_id":"019ac3d1-566e-75a8-b696-5e5eb4de7fc9","title":"Aiken Dojo","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano's potential is locked behind complex setups and invisible logic. 60% of developers drop out because they spend days configuring environments instead of coding.","solution":"We are building the \"Codecademy\" of Cardano.\nAiken Dojo is a browser-native IDE that allows users to write, compile, and test Aiken smart contracts instantly. ","proposer_name":"Quan Nguyen","proposer_relevant_experience":"Harry – Project Lead\n\nHarry has 4+ years of experience in the blockchain industry, having previously worked in Developer Relations and contributed to multiple DeFi projects. For this proposal, he is responsible for managing the roadmap, tracking milestones, and handling all Catalyst reporting requirements.\n\nMargo – Smart Contract Developer\n\nMargo is a highly skilled developer with over 3 years of specialized experience in the Web3 space. She focuses on secure smart contract architecture and will lead the implementation of the vault and automation logic.\n\nQuan Nguyen – Full-Stack Developer\n\nQuan brings 3 years of web development experience, with the last 2 years dedicated to building Web3 interfaces using React and TypeScript. He will develop the user dashboard, backend engine, and monitoring bot. Quan is an AI engineer who received a scholarship and worked alongside engineers at Google DeepMind, achieving strong results in scientific research and global competitions.","url":null,"funds":95000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Aiken Dojo","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Quan Nguyen","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":95000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":5,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano's potential is locked behind complex setups and invisible logic. 60% of developers drop out because they spend days configuring environments instead of coding.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We are building the \"Codecademy\" of Cardano.\nAiken Dojo is a browser-native IDE that allows users to write, compile, and test Aiken smart contracts instantly. ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://github.com/jasong-03/aiken-dojo"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Aiken Dojo is committed to being a public good. All software source code (WASM compiler, Frontend, Test Runner) will be released under the MIT License to maximize reusability. All educational content, curriculum, and documentation will be licensed under Creative Commons (CC-BY-4.0). We will host the code on a public GitHub repository accessible from the project start, allowing the community to audit, fork, and contribute to the platform's development.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Training","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"1. Client-Side WASM Compilation (The Technical Breakthrough): Unlike existing playgrounds that rely on heavy backend servers (which are slow and costly to scale), Aiken Dojo ports the Aiken compiler to WebAssembly (WASM). This allows code to compile directly in the user's browser in milliseconds. It eliminates the \"Nix/Docker\" setup wall entirely—something no other Cardano education platform currently offers.\n\n\n\n2. Visualizing the \"Invisible\" eUTxO: Current tools (like block explorers) display data as raw JSON or text, which is abstract for beginners. Aiken Dojo innovates by introducing a \"UTXO Graph Renderer.\" We visually map inputs, outputs, and datum transformations as interactive nodes and edges. This turns the abstract eUTxO mental model into a tangible visual experience, drastically reducing the learning curve for developers coming from Ethereum (Account model).\n\n\n\n3. \"Gamified\" vs \"Academic\": While current resources are excellent but academic (textbook style), Aiken Dojo applies the \"Duolingo/Codecademy\" model: bite-sized, interactive, and instantly rewarding with automated feedback loops.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"1. What the MVP will demonstrate:\n\n- Instant Onboarding: A user will land on the website and compile a \"Hello World\" smart contract within 10 seconds, with zero software installation.\n- Interactive Coding: A full Monaco-based editor (VS Code style) with custom Aiken syntax highlighting and error reporting.\n- The \"Feedback Loop\": Users will complete the first module of exercises. The MVP will demonstrate the \"Auto-Grader\" system, which runs test cases against the user's code and provides immediate \"Pass/Fail\" feedback and visual debugging hints.\n\n2. Where it can be accessed:\n\n- Public URL: The MVP will be hosted at a public domain (e.g., aikendojo.io or a Vercel deployment link) accessible to anyone with a modern web browser.\n- Open Source Repo: All source code (Frontend + WASM Adapter) will be published on GitHub under the MIT license for community verification.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"1. Educational Engagement (Platform Metrics):\n\n- Completion Volume: Achieve 200+ completed coding exercises within the first 3 months of Mainnet launch.\n- User Retention: Convert 15% of visitors who try the \"Hello World\" lesson into registered users who complete the \"Validator Basics\" module.\n\n2. Technical Performance:\n\n- Zero-Friction Speed: Maintain a compilation time of < 200ms via the WASM core to ensure a seamless flow.\n- Reliability: Achieve 99.9% uptime for the learning environment.\n\n3. Ecosystem Impact (On-Chain/Proxy Metrics):\n\n- Testnet Transactions: Since this is a learning tool, we track success via the \"Lucid Integration.\" We aim for students to generate 500+ successful transaction simulations (equivalent to Pre-Prod testnet txs) directly within the browser console, proving they have successfully built and signed a valid transaction.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We are building the \"Codecademy\" of Cardano.\n\nAiken Dojo is a browser-native IDE that allows users to write, compile, and test Aiken smart contracts instantly. We remove the friction so developers can focus on logic, not infrastructure.\n\nZero-Setup Environment: Open the URL, and you are ready to code. No installs. No Nix. No waiting.\n\nVisual Debugging:\n\nInput: See the UTXOs your script is consuming.\n\nOutput: See the resulting UTXOs and Datum changes.\n\nGamified Curriculum: Progression from \"Syntax Basics\" to \"Writing a Vesting Contract,\" verified by automated test runners in the browser.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"1. Democratizing Cardano Development: Currently, Cardano development is perceived as \"elite\" and \"difficult.\" Aiken Dojo dismantles this perception. By removing the need for Nix/Docker setups, we lower the barrier to entry to near-zero. This directly increases the Top-of-Funnel developer acquisition, allowing anyone with a browser to write their first smart contract in seconds, not days.\n\n\n\n2. Increasing Developer Retention & Success Rate: The \"Haskell Gap\" and abstract eUTxO model cause high drop-off rates. Our visual debugging tools and interactive curriculum directly address this \"friction.\" By helping developers visualize inputs/outputs, we turn frustration into understanding. A developer who understands why their transaction failed is a developer who stays to build dApps.\n\n\n\n3. Accelerating Cross-Chain Migration: Aiken Dojo acts as the perfect bridge for Solidity and TypeScript developers. By presenting a familiar IDE interface and C-family syntax (Aiken), we make Cardano accessible to the millions of Web2 and EVM developers, significantly expanding the talent pool available to build on Cardano.\n\n\n\n4. Open Source Contribution: We are not just building a product; we are building infrastructure. Our core components (WASM compiler adapter, Monaco Editor integration, React components) will be open-sourced, allowing other education platforms and tool builders in the ecosystem to reuse our work.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"1. Team Expertise & Track Record: Our team combines deep expertise in Rust, WebAssembly (WASM), and Full-stack Web Development, which are the exact skills required for this project.\n\n- Lead Engineer: Senior experience in Rust and system architecture, capable of handling the complex task of porting the Aiken compiler to WASM.\n- Smart Contract Specialist: Deep understanding of the eUTxO model and Aiken best practices to design a curriculum that is both accurate and pedagogical.\n- Frontend Lead: Expert in React/Next.js and data visualization (D3.js/Canvas), ensuring the \"Visual Debugger\" is intuitive and performant.\n- \n\n2. Technical Feasibility & Validation:\n\n- Proof of Concept: We have already validated that the Aiken compiler can be targeted to WASM. The core logic exists; the task is now integration and UI wrapper.\n- Existing Standards: We are not reinventing the wheel. We leverage industry-standard tools (Monaco Editor for the IDE, Lucid for off-chain logic) to ensure stability and reduce development risk.\n\n\n\n3. Project Management & Accountability:\n\n- Agile Methodology: We operate on 2-week sprints with clear deliverables.\n- Transparency: All code will be hosted on public GitHub repositories from Day 1. The community can track commits and progress in real-time.\n- Milestone Reporting: We have broken down the project into 4 distinct milestones with verifiable outputs (e.g., \"Compiler works,\" \"First 10 lessons live\") to ensure funds are released only upon proof of achievement.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"The Core Engine (The \"Brain\")","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- A functioning WebAssembly (WASM) adapter for the Aiken Compiler.\n- Integration of the Monaco Editor (VS Code engine) into the React frontend.\n- Custom syntax highlighting configuration for the Aiken language.\n- A &quot;Test Runner&quot; interface capable of capturing and displaying compiler stdout/stderr.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Users can type basic Aiken code into the web editor.\n- Clicking &quot;Compile&quot; successfully triggers the WASM binary and returns UPLC (Untyped Plutus Core) or specific error messages within the browser console log.\n- The editor correctly highlights Aiken keywords (e.g., validator, let, expect) in color.\n- The system operates entirely client-side without crashing the browser.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Video Demo: A screen recording showing code being typed, compiled, and the resulting UPLC output.\n- GitHub Repository: Link to the open-source repository containing the initial frontend structure and WASM configuration.\n- Dev Link: A temporary Vercel/Netlify deployment link where reviewers can test the compiler manually.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"The Curriculum & Validation (The \"Content\")","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Completion of the first 20 progressive coding exercises (covering Primitives, Custom Types, and Basic Validators).\n- Implementation of the &quot;Auto-Grader&quot; logic to verify user code against hidden test cases.\n- User state persistence system (using LocalStorage or basic Auth) to save progress.\n- UI for the &quot;Lesson Dashboard&quot; showing locked/unlocked levels.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Users can navigate through a list of 20 distinct lessons.\n- Submitting a correct solution results in a &quot;Pass&quot; status and unlocks the next lesson.\n- Submitting an incorrect solution provides a specific feedback message from the Auto-Grader.\n- Refreshing the page does not lose the user's completed lesson progress.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Curriculum Document: A PDF or Markdown file listing the syllabus and learning objectives for the 20 exercises.\n- Platform Demo: A video walkthrough completing 3 different exercises (Easy, Medium, Hard) to demonstrate the grading logic.\n- Live Beta URL: An updated deployment link allowing reviewers to try the first 5 lessons.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Visual Visualization (The \"Magic\")","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Development of the UTXO Graph Renderer component.\n- Integration of the &quot;Debugger View&quot; to highlight code lines causing failures.\n- Blueprint UI Generator that auto-creates input fields based on plutus.json schemas.\n- Integration of Lucid library for off-chain transaction simulation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The interface visually renders inputs and outputs as connected boxes/nodes when a script is tested.\n- When a test fails, the UI highlights the specific line of code or the specific UTXO that caused the validation error.\n- Users can input parameters into auto-generated forms (e.g., an Integer field) instead of writing raw JSON.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Screenshots: High-resolution images of the UTXO Graph and Debugger View in action.\n- Video Walkthrough: A demonstration of debugging a broken contract using the visual tools to identify the error.\n- Code Commit: Link to the specific GitHub PRs for the visualization components.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Polish, Audit & Launch (The \"Ship\")","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Mobile-responsive optimization for the entire platform.\n- Execution of a Community Beta Test with ~50 users from the Aiken Discord.\n- Final deployment to the main public domain (aikendojo.io).\n- Production of the Project Close-out Report and &quot;Proof of Achievement&quot; video.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The platform is fully accessible and readable on mobile devices.\n- Critical bugs identified during the Beta phase are resolved.\n- The website is live, publicly accessible, and load-tested for stability.\n- The Final Report is submitted to Project Catalyst.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public URL: The live link to the fully functional Aiken Dojo platform.\n- Close-out Report: The official document summarizing project impact and metrics.\n- Community Feedback Summary: A report aggregating feedback from the 50 beta testers.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":17000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Harry – Project Lead\n\nHarry has 4+ years of experience in the blockchain industry, having previously worked in Developer Relations and contributed to multiple DeFi projects. For this proposal, he is responsible for managing the roadmap, tracking milestones, and handling all Catalyst reporting requirements.\n\nMargo – Smart Contract Developer\n\nMargo is a highly skilled developer with over 3 years of specialized experience in the Web3 space. She focuses on secure smart contract architecture and will lead the implementation of the vault and automation logic.\n\nQuan Nguyen – Full-Stack Developer\n\nQuan brings 3 years of web development experience, with the last 2 years dedicated to building Web3 interfaces using React and TypeScript. He will develop the user dashboard, backend engine, and monitoring bot. Quan is an AI engineer who received a scholarship and worked alongside engineers at Google DeepMind, achieving strong results in scientific research and global competitions.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"1. Software Development (65,000 ADA)\n\n\n\n- Aiken Smart Contract Engineer: 30,000 ADA.\n    - Role: Designing the non-custodial \"Smart Vault,\" implementing the \"Owner-Manager\" security pattern in Aiken, and optimizing script execution units.\n\n\n\n- Backend & Automation Developer: 20,000 ADA.\n    - Role: Building the off-chain bot (Rust/Go) to monitor pool APYs, the data aggregation engine, and the \"Copy-Trading\" execution logic.\n\n\n\n- Frontend & UI/UX Developer: 15,000 ADA.\n    - Role: Developing the React dashboard, the \"Leaderboard\" interface, and integrating Cardano wallets (Lace, Eternal).\n\n\n\n2. Project Operations & Security (18,000 ADA)\n\n\n\n- Internal Audit & Testing: 10,000 ADA.\n    - Detail: Conducting extensive property-based testing (using Aiken's built-in tools), peer code reviews, and Pre-Prod testnet simulations.\n- Infrastructure Costs: 8,000 ADA.\n    - Detail: Cloud hosting (AWS/DigitalOcean), Database storage, and Blockfrost Enterprise API subscription for 12 months.\n\n3. Marketing & Community (12,000 ADA)\n\n- Content & Education: 7,000 ADA.\n    - Detail: Production of \"How-to\" video tutorials, technical documentation for the open-source vaults, and project updates.\n- Community Management: 5,000 ADA.\n    - Detail: Managing the Discord server, support for Beta testers, and distributing incentives for early adopters.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"1. High ROI on Liquidity Retention: For a grant of just 95,000 ADA, CardanoFlow builds critical infrastructure to secure and grow millions in Total Value Locked (TVL). By automating rebalancing and preventing Impermanent Loss, we stop capital from leaving the ecosystem due to user frustration. If our tool saves just 10% of users from \"rage-quitting\" DeFi, the network fees generated from their continued activity will outweigh the cost of this proposal within the first year.\n\n\n\n2. Closing the Gap with Competitors (at a fraction of the cost): Competitor chains like Solana and Arbitrum already offer automated \"Smart Vaults\" and copy-trading. This proposal brings Cardano to feature parity for < $40,000 USD (approx.). This is significantly cheaper than venture-backed alternatives on other chains, providing the ecosystem with a \"pro-level\" tool without the \"pro-level\" price tag.\n\n\n\n3. The \"Aiken\" Efficiency Multiplier: By utilizing Aiken, we drastically reduce the development complexity and audit costs compared to legacy Plutus projects. This allows us to deliver a secure, production-ready DeFi protocol with a lean budget, allocating funds strictly to engineering logic rather than fighting tooling issues.\n\n\n\n4. Sustainable \"Public Good\" Model: We are not building a tool that will require perpetual grants to survive. CardanoFlow is designed to become self-sustaining via a small performance fee on profitable copy-trades (e.g., 2% on profits). This Catalyst fund acts merely as the \"seed capital\" to build the engine; once launched, the protocol pays for its own maintenance and growth.\n\n\n\n5. Open Source Contribution: The \"Non-Custodial Smart Vault\" pattern we are building is a reusable primitive. By open-sourcing this core logic, we save future developers hundreds of hours when building their own asset management or DAO treasury tools.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Training","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1685}