{"pr_id":"019abb25-af31-7fb3-9204-337967a7d428","title":"[B-REC]: Energy RWA Protocol (Aiken & Satellite Validation)","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Energy RWA face a dilemma: IoT hardware is too expensive, while API data is easily spoofed. Current solutions fail to balance scalability with trust, leaving Cardano without a verified energy standard","solution":"A Data Agnostic Protocol (Aiken/CIP-68). We combine a Universal Legacy Adapter with a Satellite Anti-Fraud Engine to validate data, enabling trusted mass RWA onboarding without new hardware.","proposer_name":"BREC Team","proposer_relevant_experience":"This project combines high-level operational execution with elite software engineering. We bridge the gap between physical network scaling and blockchain protocol architecture.\n\n**Duc Le – Project Lead &amp; Strategy**\n\n- **Role:** Overall Project Management, Business Development, and Ecosystem Growth.\n- **Track Record:** Co-founded and successfully scaled the Big Family Pharmacy franchise to over 1,000 stores nationwide in just 3 years.\n- Why this matters for a Protocol: Building a protocol is useless without adoption. Duc’s experience in managing complex supply chains and scaling physical networks proves he possesses the &quot;Zero-to-One&quot; execution capability required to onboard energy producers and partners (B2B) into the B-REC ecosystem.\n- Social Facebook: [https://www\\.facebook\\.com/LeDucOpus/](https://www.facebook.com/LeDucOpus/)\n- Telegram: @duclv_10m\n\n**The Engineering Core \\(Software &amp; Protocol\\)**\n\nBehind the leadership operates a specialized team of Senior Engineers focused on the Cardano stack and High-availability Systems. Detailed profiles and portfolios are constantly updated at: [https://docs\\.brec\\.io/meet\\-our\\-team](https://docs.brec.io/meet-our-team)\n\n**Senior On\\-Chain Architect \\(Aiken Specialist\\):**\n\n- **Role**: Designing the CIP-68 Metadata Standard and the Aiken Minting Policy.\n- **Expertise:** Deep understanding of the EUTxO model and Aiken language. Focused on contract security, property-based testing, and optimizing execution units (ExUnits) for low-cost minting.\n\n**Backend Integration Lead \\(The &quot;Orchestrator&quot;\\):**\n\n- **Role:** Building the &quot;Legacy Adapter&quot; and &quot;Satellite Validator&quot;.\n- **Expertise:** 7+ years in building scalable microservices (Go/Rust). Specialist in Reverse-engineering APIs (integrating Huawei/Sungrow systems) and handling high-concurrency data streams. Responsible for the &quot;Anti-Fraud&quot; logic engine.\n\n**Full\\-Stack Product Engineer:**\n\n- **Role:** Producer Dashboard &amp; User Experience.\n- **Expertise:** Creating intuitive interfaces for non-crypto users. Ensuring that connecting a wallet or inputting an API key is as simple as using a Web2 app.\n\nA successful Protocol needs two things: Code that works and A Business Model that scales.\n\n- Duc Le brings the Scaling DNA: Ensuring the project doesn't remain a &quot;lab experiment&quot; but grows into a real-world network.\n- The Engineering Core brings the Technical Rigor: Ensuring the Protocol is secure, gas-efficient, and truly &quot;Data Agnostic&quot; as promised.","url":null,"funds":140000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"[B-REC]: Energy RWA Protocol (Aiken & Satellite Validation)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"BREC Team","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":140000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Energy RWA face a dilemma: IoT hardware is too expensive, while API data is easily spoofed. Current solutions fail to balance scalability with trust, leaving Cardano without a verified energy standard","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A Data Agnostic Protocol (Aiken/CIP-68). We combine a Universal Legacy Adapter with a Satellite Anti-Fraud Engine to validate data, enabling trusted mass RWA onboarding without new hardware.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://docs.brec.io","https://docs.brec.io/market-insight","https://docs.brec.io/b-rec-energy-rwa-protocol-aiken-and-satellite-validation","https://github.com/BREC-App"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All outputs are released under the Apache 2.0 License. This includes the full Aiken Smart Contracts (Minting Policy), the CIP-68 Metadata Schema, and the Orchestrator Core (Legacy Adapter & Satellite Validator). This ensures total transparency and allows the community to audit the logic or build DeFi dApps on top of our standard.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"RWA","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"B-REC fundamentally shifts the RWA paradigm from \"Hardware-Dependent\" to \"Validation-Centric.\" While most competitors build walled gardens requiring proprietary hardware, our innovation lies in three distinct architectural breakthroughs:\n\n\n\nThe \"Data Agnostic\" Strategy (Breaking the Hardware Wall):\n\n\n\nWe recognize that replacing infrastructure is a non-starter for most energy producers. Instead of forcing hardware upgrades, B-REC builds a Universal Legacy Adapter. This middleware connects directly to the APIs of the two global market leaders: Huawei and Sungrow. Together, these giants control 55% of the global inverter market, with a combined installed base of over 1,370 GW (Source: 2024-2025 Market Reports). By integrating just these two APIs, B-REC instantly makes over half the world's solar capacity compatible with Cardano, unlocking immediate liquidity.\n\n\n\nThe \"Trust but Verify\" Satellite Engine:\n\n\n\nConnecting to APIs introduces the risk of data spoofing (fake energy reports). B-REC solves this with a novel Satellite Cross-Check Mechanism. The protocol queries historical satellite irradiance data (from providers like Solcast) for the specific geolocation of the asset. If an API reports high energy generation during a time when satellite data shows storm conditions or night-time, the Orchestrator automatically flags the anomaly and rejects the minting request. This brings \"Physical Truth\" to API data.\n\n\n\nDynamic Asset Tiering via CIP-68:\n\n\n\nWe leverage the full power of the CIP-68 standard to create \"Living Assets.\" The metadata includes a trust_tier field. The token's on-chain image dynamically renders a \"Gold Border\" for cryptographically signed IoT data (Tier 1) and a \"Silver Border\" for Satellite-Verified API data (Tier 2). This visualizes risk directly in the user's wallet, creating a transparent, tiered marketplace.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"By the end of the 6-month timeline, B-REC will deploy a fully functional MVP on the Cardano Mainnet that demonstrates the complete lifecycle of a verified energy asset:\n\n- The Orchestrator Backend: We will demonstrate a live backend system capable of ingesting data streams from a Huawei FusionSolar account (Legacy) and a simulated IoT device (Trusted).\n- The Validation Logic: We will showcase the &quot;Anti-Spoofing&quot; capability by intentionally feeding fake high-generation data to the system during a simulated night-time period, demonstrating how the Satellite Validator detects and rejects this fraud on-chain.\n- The User Dashboard: A publicly accessible web application where users can connect their Cardano wallet (Nami/Eternl), input their inverter API credentials (encrypted), and view their real-time Trust Tier status.\n- On-Chain Evidence: Visible transactions on Cardanoscan showing the minting of both Tier 1 and Tier 2 tokens, with distinct metadata indicating their validation source.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"We focus on infrastructure reliability and developer adoption as primary success metrics:\n\n- System Reliability &amp; Throughput:\n- The Transaction Batching Service must successfully bundle at least 5 minting requests into a single transaction to demonstrate gas fee optimization (~0.2 ADA per asset).\n- The API Adapter must maintain 99.9% uptime while handling rate limits from external providers (Huawei/SolarEdge).\n- Validation Accuracy:\n\nThe Satellite Cross-Check mechanism must achieve a &lt;5% False Positive rate (incorrectly flagging real data) during the pilot phase, ensuring genuine producers are not penalized.\n\n- Real-World Pilot:\n- Successful execution of a Hybrid Pilot involving at least one real-world solar site (Legacy API) and one simulated IoT site.\n- Generation of at least 100 Verified Energy Tokens (representing MWh) on the Mainnet during the pilot window.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**The Vision: A Decentralized Energy Network on Cardano**\n\n\n\nB-REC envisions a transparent, liquidity-rich marketplace where renewable energy certificates (RECs) are traded as easily as cryptocurrencies. Our mission is to digitize Real World Assets (RWA) from the energy sector, solving the \"Trust Gap\" that plagues current manual systems. To achieve this, we are building a modular ecosystem comprising two pillars:\n\n\n\nThe Brain (This Proposal): The B-REC Protocol, a universal software layer that validates data and mints tokens on Cardano using Aiken & CIP-68.\n\n\n\nThe Senses (Proposal 2): The Trusted IoT Edge, a hardware layer providing cryptographically signed data (Tier 1).\n\n\n\nThis proposal specifically delivers \"The Brain\" – the core Protocol Layer.\n\n\n\n**The Problem Perception:**\n\nThe current RWA landscape for energy is polarized. On one side, we have &quot;Low-Trust&quot; solutions that rely on PDFs and manual entry, leading to double-counting and greenwashing. On the other side, we have &quot;High-Barrier&quot; solutions requiring expensive blockchain-native IoT meters, which freezes out 99% of the market. Cardano needs a middle path that is Accessible yet Verifiable.\n\n\n\n**The B\\-REC Protocol Solution:**\n\nWe are building the &quot;TCP/IP for Energy RWA&quot; on Cardano—a protocol that standardizes how energy data is ingested, validated, and tokenized, regardless of its source.\n\n**1\\. The &quot;Orchestrator&quot; Layer \\(Off\\-Chain Backend\\):**\n\nThis is the brain of the system, designed to handle complexity so the blockchain doesn't have to.\n\n- Legacy Adapter: Connects to existing inverter accounts (Huawei/SolarEdge). It manages API tokens, handles rate limits via queues, and normalizes data into a standard JSON format.\n- Satellite Validator: Before any data touches the blockchain, this module pulls weather data for the asset's coordinates. It employs a Baseline Learning Model to establish site-specific efficiency profiles, minimizing false positives while flagging statistical anomalies.\n- Batching Engine: Instead of users minting one by one (costing ~0.2 ADA + Fees each time), the engine aggregates valid data and submits one transaction for multiple assets, reducing costs by up to 80%.\n\n**2\\. The &quot;Protocol&quot; Layer \\(On\\-Chain Aiken Contracts\\):**\n\n- Minting Policy: Written in Aiken for safety and efficiency. It enforces that only transactions signed by the Orchestrator's key (proving validation passed) can mint tokens.\n- CIP-68 Metadata: Stores the energy_amount, generation_time, geolocation, and crucially, the validation_method (Satellite-Verified vs. DID-Signed).\n\n**Target Engagement:**\n\nWe are targeting small-to-medium independent power producers (IPPs) and solar installers who already use digital monitoring (FusionSolar/SolarEdge) but have no way to monetize their green attributes. We also target DeFi developers on Cardano looking for a standardized RWA asset class to build lending or trading dApps.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**Value to the Cardano Community:**\n\n- **Bootstrapping RWA Liquidity:** By enabling &quot;Legacy&quot; integration, B-REC can potentially bring gigawatts of existing solar capacity onto Cardano without waiting for hardware adoption. This creates immediate TVL (Total Value Locked) potential for the ecosystem.\n- **Establishing Data Standards:** We are setting the standard for how &quot;imperfect&quot; real-world data should be handled on-chain—not by rejecting it, but by verifying and tiering it. This model can be replicated for other RWA sectors like Supply Chain or Weather Insurance.\n- **Real World Utility:** This project generates transactions based on real economic activity (energy production), moving Cardano away from speculative usage towards utility-driven volume.\n\n\n\n**Sustainability Model \\(Post\\-Funding\\):**\n\nTo ensure the protocol survives beyond the catalyst grant, we will implement a micro-fee model. A small protocol fee (e.g., 0.25 ADA) will be charged per minting transaction. This revenue stream will be used to cover the operational costs of the Satellite Data APIs and Cloud Infrastructure, ensuring the validation engine runs indefinitely without relying on further grants.\n\n\n\n**Sharing Outputs:**\n\n- **Open Source Repositories:** All Aiken smart contracts and the core Logic of the Legacy Adapter will be published under Apache 2.0.\n- **GitBook Documentation:** A comprehensive &quot;Integration Guide&quot; for solar installers and DeFi devs to plug into the B-REC protocol.\n- **Bi\\-Weekly Devlogs:** We will publish technical deep-dives on the Catalyst platform, sharing lessons learned about Aiken development and Satellite API integration.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Team Capabilities:**\n\nOur team combines deep blockchain engineering with industrial systems architecture, ensuring we can handle both the \"Crypto\" and the \"Real World\" aspects:\n\n- **On\\-Chain Lead:** A Senior Haskell/Aiken developer with 3 years of experience in the Cardano ecosystem. Verified contributor to open-source libraries (MeshJS) and has successfully deployed NFT minting protocols on Mainnet. [GitHub: YourLinkHere]\n- **Backend Architect:** 7 years of experience in building high-concurrency microservices (Go/Rust). Specializes in Industrial IoT (IIoT) data ingestion and has prior experience integrating rigid SCADA/Modbus APIs. [LinkedIn: YourLinkHere]\n- **Operational Security:** We strictly adhere to a Security-First methodology. The Orchestrator uses a Non-Custodial design where possible. User API keys are encrypted at rest using Vault technology and are never exposed to the frontend.\n\n\n\n**Financial Management & Trust:**\n\n- **Milestone\\-Based Releases:** We strictly follow the Catalyst Milestone operational model. Funds are only requested upon the verified completion of tangible outputs.\n- **Detailed Budgeting:** Our budget is calculated based on market rates for Senior Engineers (35−45$/hr) and includes specific allocations for third-party API costs (Satellite data) and Infrastructure, ensuring no hidden costs derail the project.\n- **Transparency:** We commit to open repositories from Day 1 (not just at the end), allowing the community to audit our progress in real-time.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Design CIP-68 Standard & Aiken Minting Policy","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. **CIP\\-68 Metadata Schema Definition**: Design and document a comprehensive CIP-68 (Standard 222) compliant JSON metadata schema. This includes defining specific fields for data_source_type (Legacy/IoT), validation_evidence (Satellite/DID), and trust_tier.\n2. **Aiken Minting Policy Development:** Develop the core Minting Policy smart contracts using the Aiken language. The logic will strictly enforce that only transactions containing a valid signature from the Validation Oracle can mint tokens, preventing unauthorized creation.\n3. **Property\\-based Testing Suite:** Implement an extensive property-based testing suite (Fuzz testing) for the Aiken contracts to cover edge cases, ensuring the contract is secure against exploits.\n4. **Internal Audit Report:** Conduct a rigorous internal code audit and deploy the finalized contracts to the Cardano Preview Testnet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The CIP-68 Schema is published on GitHub and supports dynamic versioning.\n- The Aiken smart contracts compile successfully and pass 100% of the property-based tests.\n- The contract is successfully deployed to Preview Testnet, verified by a transaction hash.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Link to the public GitHub Repository containing the .ak source files, the JSON Schema documentation, the Test Coverage Report, and the Testnet Policy ID.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":42000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Develop Minting Orchestrator with Legacy Adapter","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. **Legacy Data Adapter \\(Huawei and Sungrow\\.\\):** Develop the backend modules required to authenticate, fetch, and normalize energy generation data from Huawei FusionSolar and SolarEdge APIs. This includes logic to handle API rate limits and data parsing.\n2. **Satellite Validator Module:** Develop the anti-fraud logic engine. This module integrates with a commercial weather data provider (e.g., Solcast) to fetch historical irradiance data and cross-check it against the API reports to detect anomalies.\n3. **Transaction Batching Service:** Implement a transaction builder service that aggregates multiple validated minting requests into a single Cardano transaction to optimize gas fees.\n4. **Trusted Data Adapter \\(Stub\\):** Create the secure endpoint listener for future IoT device connections (Proposal 2 integration).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The Backend successfully fetches data from a test Huawei/SolarEdge account.\n- The Validator correctly flags and rejects a \"spoofed\" data packet (high generation at night) during testing.\n- The Batching Service successfully constructs a valid transaction on Preprod Testnet containing at least 5 distinct assets.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A comprehensive video demo showing the full backend flow: Fetching data -> Validating against Satellite -> Batching Transaction. Link to server logs showing successful API interactions.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":49000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Develop Producer Dashboard Web App","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. **Wallet Connect &amp; Asset Indexer:** Integrate Cardano wallet support (CIP-30) and build an Indexer (using Blockfrost/Kupos) to scan and display B-REC assets in the user's wallet.\n2. **Source Management UI:** Develop the frontend interface allowing users to securely input their API Credentials (for Legacy) or Device IDs (for Trusted).\n3. **Asset Visualization & Tiering**: Create the dashboard UI that visualizes the user's energy generation history and clearly distinguishes between Tier 1 and Tier 2 assets using visual badges.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Users can connect Lace/Eternl/Yoroi wallets and view their asset balances.\n- The Add Source flow works correctly, securely saving encrypted credentials to the backend.\n- The dashboard correctly renders Tier 1 and Tier 2 assets with distinct visual styles.\n-","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Link to the publicly accessible Beta Website. A walkthrough video demonstrating the User Experience (UX) from login to asset viewing.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mainnet Deployment & Open Source Release","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. **Production Infrastructure Setup:** Configure secure production servers (AWS/Google Cloud) with proper firewalling, SSL, and API key management (Vault). Deploy contracts to Mainnet.\n2. **Hybrid Pilot Run:** Execute a 14-day live pilot involving at least one real-world site using the Legacy Adapter and one simulated IoT site.\n3. **Documentation & Open Source Release**: Polish the codebase, add comprehensive comments, and release under Apache 2.0. Publish a GitBook with integration guides.\n4. **Project Close\\-out:** Compile the Final Project Report and Video.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Acceptance Criteria:\n\n- The system operates stably on Mainnet for 14 days without critical errors.\n- At least 100 successful minting transactions are recorded on Mainnet.\n- GitHub repository is public and documented.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Mainnet Policy ID and Transaction Hashes. Link to the final GitBook. Submission of the Close-out Report and Video to Catalyst.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":24000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"This project combines high-level operational execution with elite software engineering. We bridge the gap between physical network scaling and blockchain protocol architecture.\n\n**Duc Le – Project Lead &amp; Strategy**\n\n- **Role:** Overall Project Management, Business Development, and Ecosystem Growth.\n- **Track Record:** Co-founded and successfully scaled the Big Family Pharmacy franchise to over 1,000 stores nationwide in just 3 years.\n- Why this matters for a Protocol: Building a protocol is useless without adoption. Duc’s experience in managing complex supply chains and scaling physical networks proves he possesses the &quot;Zero-to-One&quot; execution capability required to onboard energy producers and partners (B2B) into the B-REC ecosystem.\n- Social Facebook: [https://www\\.facebook\\.com/LeDucOpus/](https://www.facebook.com/LeDucOpus/)\n- Telegram: @duclv_10m\n\n**The Engineering Core \\(Software &amp; Protocol\\)**\n\nBehind the leadership operates a specialized team of Senior Engineers focused on the Cardano stack and High-availability Systems. Detailed profiles and portfolios are constantly updated at: [https://docs\\.brec\\.io/meet\\-our\\-team](https://docs.brec.io/meet-our-team)\n\n**Senior On\\-Chain Architect \\(Aiken Specialist\\):**\n\n- **Role**: Designing the CIP-68 Metadata Standard and the Aiken Minting Policy.\n- **Expertise:** Deep understanding of the EUTxO model and Aiken language. Focused on contract security, property-based testing, and optimizing execution units (ExUnits) for low-cost minting.\n\n**Backend Integration Lead \\(The &quot;Orchestrator&quot;\\):**\n\n- **Role:** Building the &quot;Legacy Adapter&quot; and &quot;Satellite Validator&quot;.\n- **Expertise:** 7+ years in building scalable microservices (Go/Rust). Specialist in Reverse-engineering APIs (integrating Huawei/Sungrow systems) and handling high-concurrency data streams. Responsible for the &quot;Anti-Fraud&quot; logic engine.\n\n**Full\\-Stack Product Engineer:**\n\n- **Role:** Producer Dashboard &amp; User Experience.\n- **Expertise:** Creating intuitive interfaces for non-crypto users. Ensuring that connecting a wallet or inputting an API key is as simple as using a Web2 app.\n\nA successful Protocol needs two things: Code that works and A Business Model that scales.\n\n- Duc Le brings the Scaling DNA: Ensuring the project doesn't remain a &quot;lab experiment&quot; but grows into a real-world network.\n- The Engineering Core brings the Technical Rigor: Ensuring the Protocol is secure, gas-efficient, and truly &quot;Data Agnostic&quot; as promised.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**1\\. Smart Contract Engineering \\(30% \\- 42,000 ADA\\):**\n\n- **Role:** Senior Blockchain Engineer (Aiken Specialist).\n- **Details:** This covers the design of the CIP-68 standard, the complex validation logic within the Minting Policy, and extensive Property-based Testing. Security is paramount here as this is the immutable layer.\n- **Rate Estimation:** ~300 hours @ $45/hr.\n\n**2\\. Backend &amp; Validation Architecture \\(35% \\- 49,000 ADA\\):**\n\n- **Role:** Senior Backend Architect (Go/Rust).\n- **Details:** This is the most labor-intensive component. It involves building the &quot;Legacy Adapter&quot; (reverse-engineering/integrating rigid 3rd party APIs), the &quot;Satellite Validator&quot; (complex statistical logic), and the &quot;Batching Service&quot; (UTxO management).\n- **Rate Estimation:** ~350 hours @ $45/hr.\n\n**3\\. Frontend Development \\(20% \\- 28,000 ADA\\):**\n\n- **Role:** Full-stack Developer (React/Next.js).\n- **Details:** Building a responsive, professional dashboard. The focus is on &quot;Non-crypto native&quot; UX, ensuring solar farmers can use it without understanding Haskell.\n- **Rate Estimation:** ~250 hours @ $35/hr.\n\n**4\\. Infrastructure, Data &amp; Operations \\(15% \\- 24,000 ADA\\):**\n\n**Details:**\n\n- **Satellite Data API Costs:** Subscriptions to commercial weather data providers (e.g., Solcast Enterprise) for the validation engine during Dev and Pilot (~$2,000).\n- **Cloud Infrastructure:** AWS/GCP costs for hosting the Orchestrator, Database, and Vault (~$1,500).\n- **DevOps Security:** Setup of CI/CD pipelines and security audits.\n- **Project Management:** Reporting and coordination.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"**1\\. Infrastructure vs\\. DApp:**\n\nWe are not asking for 140,000 ADA to build a simple DApp; we are building a Universal Protocol. This investment creates a permanent &quot;Bridge&quot; between the massive legacy energy market and Cardano. The code for the &quot;Legacy Adapter&quot; and &quot;Satellite Validator&quot; can be reused by any other RWA project needing to verify real-world data without hardware, multiplying the value of this grant.\n\n**2\\. Unlocking Liquidity:**\n\nBy enabling connection to Huawei and Sungrow. inverters, we unlock a potential market of over 1,000 GW of installed global solar capacity that can be tokenized immediately. This provides the raw material (Tokens) needed for Cardano's DeFi ecosystem (Dexes, Lending markets) to function, generating transaction fees and &quot;Real Yield&quot; for the network.\n\n**3\\. Cost\\-Efficiency via Innovation:**\n\nThe &quot;Satellite Cross-Check&quot; is a software-based innovation that saves the ecosystem millions in hardware CAPEX. For every 1 ADA spent on this proposal, we potentially unlock access to $1,000 worth of existing solar infrastructure without requiring new equipment. This dramatically lowers the Customer Acquisition Cost (CAC) for the entire ecosystem","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"RWA","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1688}