{"pr_id":"019ab4bc-87a5-7a96-b26d-ebf8bfd595ce","title":"Fireblocks-like Tokenization Platform by Mesh & UTXOS","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano lacks Fireblocks-like RWA tokenization infra and practical tooling to issue CIP-113 programmable tokens with issuer controls like freezing and compliance logs.","solution":"Build Fireblocks-like tokenization platform and SDK that lets developers create, mint, transfer, freeze, burn, and track Cardano CIP113 tokens through a secure issuer wallet.","proposer_name":"MeshJS","proposer_relevant_experience":"- Jingles - Founder of Mesh and UTXOS. [https://github\\.com/jinglescode](https://github.com/jinglescode)\n- The proposal tasks will be distributed amongst well experienced Mesh contributors which will individually opt in/out at respective milestone tasks to ensure that we always have all capacities needed to achieve our deliverables. You can learn more about our contributors community at: [https://gov\\.meshjs\\.dev/contributors](https://gov.meshjs.dev/contributors) \n    - 1 Senior backend / blockchain engineer (architecture, on chain logic, security)\n    - 1 Senior TypeScript engineer (SDK, integration, tests)","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Fireblocks-like Tokenization Platform by Mesh & UTXOS","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"MeshJS","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":10,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano lacks Fireblocks-like RWA tokenization infra and practical tooling to issue CIP-113 programmable tokens with issuer controls like freezing and compliance logs.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Build Fireblocks-like tokenization platform and SDK that lets developers create, mint, transfer, freeze, burn, and track Cardano CIP113 tokens through a secure issuer wallet.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://utxos.dev/","https://docs.utxos.dev/","https://github.com/MeshJS/web3-sdk","https://github.com/cardano-foundation/CIPs/pull/444"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Rely on open source Mesh SDK","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"The core components for the Cardano CIP113 and its SDKs are opensource. Database and UI are closed source.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Infrastructure","group":"Development & Tools"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Enterprise platforms such as Fireblocks focus on ERC based assets for institutions, but they are not Cardano native and are not reusable as open developer tooling.\n\nOur idea is innovative because:\n\n- It translates CIP-113 style programmable token concepts and issuer controls into a practical, Cardano native toolkit: a tokenization policy engine, secure issuer wallet, and high level APIs for mint, transfer, freeze, unfreeze and burn, plus a visual dashboard that exposes logs and frozen addresses. This makes freeze and compliance friendly behaviour an everyday option for builders, not just a research demo.\n- It brings a Fireblocks like experience to Cardano, we ship an open source SDK, clear TypeScript APIs and a dashboard. Issuer wallets are developer controlled.\n- It is designed as shared infrastructure for the ecosystem. Every project that needs RWA, loyalty, governance or compliance ready tokens can reuse the same audited primitives and UX instead of rebuilding core issuance logic and ad hoc dashboards for each new idea.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our prototype and MVP will demonstrate the full lifecycle of a Cardano programmable token managed through a secure issuer wallet and simple APIs.\n\nThe MVP will show that a developer can:\n\n- Create a tokenization policy with name, symbol, decimals, max supply, metadata and a freezable flag.\n- Mint tokens to the issuer wallet using SDK.\n- Query balances and metadata for any address.\n- Transfer and batch transfer tokens to recipients.\n- Freeze and unfreeze specific addresses for freezable tokens.\n- Burn tokens and see total supply reduced.\n\nThis prototype will be accessible in:\n\n- Hosted dashboard on [https://utxos\\.dev/](https://utxos.dev/)\n- SDK published on NPM [https://www\\.npmjs\\.com/package/@meshsdk/web3\\-sdk](https://www.npmjs.com/package/@meshsdk/web3-sdk)\n- Public Github repo [https://github\\.com/MeshJS/web3\\-sdk](https://github.com/MeshJS/web3-sdk)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"We define success as evidence that this toolkit is being used in real projects and that meaningful token activity is happening on Cardano because of it. To keep this verifiable, we focus on on-chain metrics tied to the tokenization policies created through the SDK and dashboard.\n\n- Currently, we have a number of confirmed entities that will be launching these tokens, namely one of them is the AIRA project\n- At least 20 distinct issuer wallets that have minted and transferred tokens\n- At least 5000 unique addresses holding tokens created via the toolkit\n- Number of projects or companies integrating the SDK in production or pilots","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"A Fireblocks-like tokenization platform and SDK that lets developers create, mint, transfer, freeze, burn, and track Cardano CIP113 tokens through a secure issuer wallet.\n\nCIP-113 and related work on interoperable programmable tokens show how Cardano can support RWA grade assets with transfer rules and issuer controls like freezing, seizing, and burning.  Fireblocks already gives institutions on other chains an end to end tokenization console that can mint, custody, distribute, freeze, and log token operations for compliance.  Cardano does not yet offer an equivalent, developer friendly stack that turns these ideas into something builders can integrate in days instead of months.\n\nOur approach is to start from the concrete needs of issuers and developers and build a Fireblocks inspired, Cardano native toolkit: a secure issuer wallet, a token policy engine, and a clear API for mint, transfer, freeze, unfreeze, and burn. This maps directly to the scope of work described: SDK functions for creating tokenization policies, minting, querying balances and metadata, transferring (including batch), freezing and burning, plus a dashboard that exposes policies, frozen addresses, and full operation logs. By focusing on a minimal, usable feature set that already reflects regulatory expectations for RWA and stablecoins, such as the ability to freeze or prevent transfers under lawful orders, we make Cardano a realistic choice for institutions today while staying aligned with CIP-113 evolution.\n\nThe project will engage three main groups:\n\n- Builders who want to issue loyalty points, game currencies, governance tokens, and RWA on Cardano.\n- Infrastructure and project teams that need a repeatable way to integrate programmable tokens into existing apps and backends.\n- Projects that need compliant ready token layer and would rather reuse audited primitives than build their own issuance and control logic.\n\nWe will demonstrate impact through clear, measurable indicators: number of tokenization policies created through the toolkit, number of projects integrating the SDK, volume of tokens minted and managed, and real use cases showcased in public demos or workshops. Key components codes will be open source, so voters can verify delivery directly in the repositories. Operation logs and dashboards will make the effect visible onchain: every mint, freeze, unfreeze, and burn is recorded and can be audited.\n\nCardano projects get a practical path to compliance ready, freeze capable tokens. RWA issuers, consumer apps, and future stablecoin projects can build on the same toolkit instead of reimplementing the basics. This strengthens Cardano as a serious home for tokenization, improves time to market for projects, and increases the chance that new institutional and consumer flows choose Cardano over competing chains.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Our project gives the wider Cardano community something it is currently missing: a shared, reusable tokenization stack that any team can build on.\n\nDevelopers get a clear, well documented SDK and dashboard to create, mint, transfer, freeze, unfreeze, and burn native tokens using a secure issuer wallet. This lowers the barrier for new builders who are not experts in minting policies or low level transaction construction. It also saves time for experienced teams who would otherwise have to maintain their own tokenization backends and ad hoc dashboards. The result is more projects going live faster and with fewer security risks.\n\nMany projects need loyalty points, access tokens, governance tokens or RWA style representations, but do not have the resources to design compliant token flows from scratch. We give these teams production ready building blocks. They can focus on their core product while relying on a common, audited toolkit for issuance and control. Over time this creates an informal standard for “how to do tokenization on Cardano,” which improves interoperability and best practices.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Mesh has been a longtime contributor to the Cardano open-source developer ecosystem since 2021. Our tools are widely used, and we have proven our skills and commitment by building and maintaining essential infrastructure that empowers developers to build on Cardano.\n\nWe have a strong track record of shipping open source tooling for Cardano, including production SDKs and infrastructure that are already used by developers in the ecosystem. That experience is directly reusable for this proposal: the tokenization toolkit extends the same stack, standards and security practices we already apply to wallets, transaction building and dashboard features.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Tokenization Policy Engine and Issuer Wallet Infrastructure","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Backend service to create Cardano native token policies from:\n    - Token name, symbol, decimals, max supply, metadata, freezable flag.\n- SDK function `createToken()` implemented and tested.\n- Automatic creation of a developer controlled issuer wallet per tokenization policy, encrypted using the developer’s public key.\n- Internal representation of freezable policies so that later freeze / unfreeze operations are enforceable at the protocol and application level.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- A developer can:\n    - Create a token via dashboard or SDK with all parameters above.\n    - Receive a policy id and issuer address on a Cardano testnet.\n- Encrypted issuer wallet that can be decrypted only with the developer’s key.\n- Documentation includes:\n    - Step by step guide to create a tokenization policy.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public GitHub repository showing:\n    - Policy creation service code.\n    - SDK implementation of `createToken()`.\n- Demo video or screenshots demonstrating:\n    - Token creation\n- Developer documentation page published","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Minting, Balances, and Metadata Queries","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- SDK functions implemented and tested:\n    - `mintTokens(amount: number)`\n    - `getTokenBalance(address?: string)`\n    - `getTokenMetadata()`\n- Transaction builder logic for minting under the correct policy using the issuer wallet.\n- Query balances and metadata efficiently.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- A developer can:\n    - Call `mintTokens(123)` and see 123 units minted to the issuer wallet.\n    - Query balances with and without specifying an address.\n    - Retrieve token metadata.\n- Documentation includes:\n    - How to mint tokens\n    - Query balance\n    - Get metadata","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- GitHub code for:\n    - Minting tokens\n    - Querying balances\n    - Get metadata\n- Demo video or screenshots demonstrating:\n    - Minting tokens\n    - Get token info\n- Documentation:\n    - Mint tokens with the SDK\n    - Query balances and metadata","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Transfer, Batch Transfer, Freeze, Unfreeze, and Burn","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- SDK functions implemented and tested:\n    - `transferTokens({ receiverAddress, tokenAmount })`\n    - `batchTransferTokens([{ receiverAddress, tokenAmount }, ...])`\n    - `freezeTokens(address)`\n    - `unfreezeTokens(address)`\n    - `burnTokens(amount)`\n- Robust logging model for all operations: mints, burns, freezes, unfreezes, transfers, with timestamps and transaction ids.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- A developer can:\n    - Send a token transfer to any valid address.\n    - Execute a batch transfer to at least 2 recipients in a single call.\n    - Freeze an address\n    - Unfreeze addresses.\n    - Burn a specified amount of tokens and see total supply reduced accordingly.\n- Logs for these operations are visible and accessible on the dashboard.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- GitHub code for transfer, batch transfer, freeze, unfreeze, and burn.\n- Demo video or screenshots demonstrating:\n    - Freeze and unfreeze workflow.\n    - Burn transactions.\n- Documentation:\n    - Issuer operations: transfer, freeze, and burn.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Tokenization Dashboard and Documentation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Completed dashboard pages:\n    - List view of all tokenization policies for the user’s project.\n    - Create tokenization policy form.\n    - Token overview (metadata, policy id, supply, issuer address).\n    - List of frozen addresses.\n    - Full operation log: mints, freezes, unfreezes, burns, transfers.\n- End to end walkthroughs in written or video form showing:\n    - Creating a token.\n    - Minting and distributing tokens\n    - Freezing and unfreezing\n    - Burning\n    - Reviewing logs","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Any developer can:\n    - Create a policy.\n    - Mint, transfer, freeze, unfreeze, and burn tokens.\n    - Inspect everything visually in the dashboard.\n- At least one public demo or workshop is delivered for the Cardano community (live or recorded), showing how to build on top of this toolkit.\n- Documentation is published.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Deployed dashboard instance accessible to testers and the community.\n- GitHub repo.\n- Documentation for the community.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Close Out Report","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Add documentation to Mesh Playground\n- Package the wallet as a library\n- Publish to NPM\n- Close out Report\n- Close out Video\n- Publish all code base updates on the respective github repository\n- Post a twitter thread to inform the public","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Completed NPM packaged and published\n- Completed docs for developers, both on website and Github's readme file\n- Completed Close Out Report\n- Completed Close Out Video\n- Published code-base updates at the respective github repository\n- Published a twitter thread to inform the public","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public link to the developed code on Mesh Github\n- Public link to Documentation for developers\n- Public link to post on Twitter/X to inform the Public\n- Public link to the Close Out Report\n- Public link to the Close Out Video","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"- Jingles - Founder of Mesh and UTXOS. [https://github\\.com/jinglescode](https://github.com/jinglescode)\n- The proposal tasks will be distributed amongst well experienced Mesh contributors which will individually opt in/out at respective milestone tasks to ensure that we always have all capacities needed to achieve our deliverables. You can learn more about our contributors community at: [https://gov\\.meshjs\\.dev/contributors](https://gov.meshjs.dev/contributors) \n    - 1 Senior backend / blockchain engineer (architecture, on chain logic, security)\n    - 1 Senior TypeScript engineer (SDK, integration, tests)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"### 1. Core Engineering (approx. 80% - 160K ADA)\n**Scope**\n\n- Design and implementation of:\n    - Tokenization policy engine and issuer wallet infra\n    - SDK functions:`createToken`, `mintTokens`, `getTokenBalance`, `getTokenMetadata`,`transferTokens`, `batchTransferTokens`,`freezeTokens`, `unfreezeTokens`, `burnTokens`\n    - Logging and audit layer for all token operations\n    - Integration with Cardano testnet and mainnet\n\n**Resources**\n\n- 1 Senior backend / blockchain engineer (architecture, on chain logic, security)\n- 1 Senior TypeScript engineer (SDK, integration, tests)\n\n### 2. Dashboard UX and Frontend (approx. 15% - 30K ADA)\n**Scope**\n\n- Design and implementation of:\n    - `/dashboard/project/[PROJECTID]/tokenization`\n        - List of policies\n        - “Create tokenization policy” form\n    - `/dashboard/project/[PROJECTID]/tokenization/[ID]`\n        - Token overview, frozen addresses, full logs\n- Wiring frontend to backend APIs and on chain data\n- Basic responsiveness and accessibility\n\n**Resources**\n\n- 1 Frontend engineer (React / Next / Tailwind)\n\n### 3. Documentation, Examples and Community Onboarding (approx. 5% - 10K ADA)\n**Scope**\n\n- Developer documentation:\n    - Quickstart and guide\n    - Reference docs for all SDK functions\n    - Best practice notes for freezable / compliance ready tokens\n- Community activities:\n    - Live or recorded workshop / demo\n    - Ongoing support for early adopters\n\n**Resources**\n\n- Engineering time for examples and code samples","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Mesh has long been a cornerstone of Cardano development, powering hundreds of projects and widely adopted across the ecosystem. The most reliable way for open-source tools to show their “value for money” is by looking at real usage data-checking how actively the code is used across the developer ecosystem and identifying how many, and what kind of, projects build with our tooling. \n\n\n\nAt Mesh, we currently see over 900 dependent projects making use of our SDK, with around 10k npm downloads every month. This makes Mesh one of the most widely adopted Cardano open-source stacks, supporting projects across the entire spectrum to build on Cardano. These numbers show clearly that the budgets we receive translate into strong metrics, proving that treasury funds are effectively used to deliver solutions that are practical, useful, and solve real developer problems.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400080","sub_fields":null},{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1300050","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Infrastructure","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1690}