{"pr_id":"019ab514-406f-7f72-acb1-df5504892c6c","title":"sovereigns.institute","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Automation requires multidisciplinary multipolar governance keeping humans in the loop, meaningfully involved - no structure exists enabling this nor to protect contributors - at scale.","solution":"Collaborative schema development creating governance frameworks, machine-readable and legally structured across different countries and cultures - forming the emergent substrate automation inherits","proposer_name":"Self Sovereign","proposer_relevant_experience":"# Contributor Approach\nCatalyst's historical funding delays created situations where promised contributor engagement could not be honored, damaging relationships despite good intentions. \n\n\n\nLearning from this, this proposer commits to onboarding computational commons contributors—workshop facilitators, schema architects, cultural consultants building on delegated representatives from over fifty-one countries, translators emphasizing subject-object-verb structures across eight languages, disaster specialists, rural revitalization experts, legal advisors across UK, Swiss, and Japanese contexts, technical writers, community coordinators, partnership liaisons, and video producers—only after funding receipt and stable currency conversion ensuring reliable compensation.\n\n\n\nThis milestone-threshold approach protects both contributor relationships and project reputation. Should early milestones not achieve objectives as community determines, funding firewall ensures remaining allocations stay secure rather than creating cascading failures. Given eight years visible participation, reputation preservation through honest execution carries paramount importance. \n\n\n\nThe approach provides latitude for adapting to emergent realities while maintaining accountability through deliverable-based evaluation, with transparent communication about challenges and good-faith efforts toward objectives.","url":null,"funds":54321,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"sovereigns.institute","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Self Sovereign","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":54321,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Automation requires multidisciplinary multipolar governance keeping humans in the loop, meaningfully involved - no structure exists enabling this nor to protect contributors - at scale.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Collaborative schema development creating governance frameworks, machine-readable and legally structured across different countries and cultures - forming the emergent substrate automation inherits","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://sovereigns.institute","https://build.foundation","https://standards.agency"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"https://build.foundation","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All technical outputs, like scripts and developer tools, will be released under Apache License 2.0, allowing commercial and private use with attribution. Legal frameworks will be under Creative Commons Attribution 4.0 International License for adaptation. Universal schemas will use open standards. Community materials will be under Creative Commons Attribution-ShareAlike 4.0 International License. Security audits will be transparently published. Governance inputs and outputs will be made public.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Governance","group":"Governance"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We target computational commons contributors across the over fifty-one countries represnted by delegated represntatives who understand that meaningful change emerges from patient collaborative work rather than viral metrics. \n\n\n\nWe reach them, in person or otherwise, through intensive workshop processes at Central Saint Martins, University of the Arts London, Tokyo University of the Arts, and Institute of Science Tokyo where depth of engagement matters infinitely more than breadth of passive awareness. \n\n\n\nThis matters for Cardano because revolutionary governance frameworks enabling automated systems to operate with genuine human oversight have never emerged from counting attendees or measuring social media impressions. \n\n\n\nAsk yourself: did the development of public key cryptography, the invention of the World Wide Web, or the creation of Bitcoin itself come from optimizing follower counts and event attendance metrics? \n\n\n\nSubstance emerges from uncommon approaches pursued by people willing to challenge conventional assumptions about what constitutes progress. We deliberately reject vanity metrics precisely because doing things that don't scale—deep collaboration, cultural adaptation, patient schema development—creates foundations that subsequent scaling can build upon, whereas optimizing for scale from inception produces shallow structures that collapse under complexity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"International workshops creating governance schema through participatory design where quality of deliberation determines outcomes rather than quantity of participants. \n\n\n\nApplied prototyping validating frameworks through real-world Japanese disaster management and rural revitalization contexts where schema either enable coordination under pressure or fail instructively. \n\n\n\nEducational and cultural adaptation work ensuring genuine internationalization rather than English-centric thinking with superficial translations, pursued through patient collaboration with people who understand their own cultural contexts rather than optimizing for content volume metrics.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"Schema specifications emerging from workshop processes that build.foundation successfully implements technically, demonstrating governance frameworks actually enable rather than theoretically constrain technical capability. \n\n\n\nEvidence of mutual influence where governance insights measurably shape technical architecture decisions and technical constraints meaningfully inform organizational design, validated through concrete examples rather than abstract claims of collaboration. \n\n\n\nCommunity consensus on entity formation approach indicating genuine co-ownership rather than founder imposition, measured through quality of deliberation and reasoning in governance discussions rather than simple vote tallies disconnected from understanding.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"TLDR\n\nContributors building technological systems face legal vulnerability without institutional protection, while no organizational form integrates the multidisciplinary expertise automation increasingly requires. As systems become automated, they need governance frameworks that are both machine-readable and human-informed, spanning legal, cultural, technical, and operational domains. Current structures separate these disciplines completely. Sovereigns.institute addresses this through twelve months of international workshops across London and Tokyo where participants from fifty-one countries collaboratively design governance schema before any legal entity forms. These workshops produce machine-readable frameworks for personalised data sovereignty, internationalization enabling cultural diversity, and polymorphic resources representing complex real-world relationships. The UK Charitable Incorporated Organisation with Alternative Business Structure and Donor-Advised Fund capacity represents temporary legal scaffolding, not the destination. These structures are falsework enabling emergence of something more fundamental: governance frameworks that automated systems will inherit and operate within, keeping humans meaningfully in the loop. The workshops validate these frameworks through real-world applications including Japanese disaster management and rural revitalization. What emerges transcends the initial organizational forms—governance that operates at the velocity and granularity automation demands while preserving human judgment across diverse cultural and professional perspectives.\n\nProblem Description\n\nThe Protection and Integration Gap\n\nContributors building technological systems remain personally exposed to legal action without institutional backing. Member-based organizations coordinate development and fund infrastructure but provide zero legal protection when contributors face lawsuits, intellectual property challenges, or jurisdictional conflicts. You contribute expertise and create value yet stand alone if legal pressure emerges. This protection gap intensifies as systems scale toward billions of users where individual contributors become visible targets.\n\nBeyond protection, current organizational structures fundamentally cannot integrate multidisciplinary expertise into unified frameworks. Lawyers work separately from engineers who work separately from cultural specialists who work separately from healthcare practitioners. The UK Alternative Business Structure framework permits non-lawyer domain experts working directly within legal service provision, creating unprecedented integration possibilities, yet no organization serving technological ecosystems has implemented this capability.\n\nThe Automation Governance Challenge\n\nAs systems become increasingly automated, reliable operation demands more than technical correctness alone. Contextual understanding spanning legal frameworks, cultural norms, ethical considerations, and operational realities becomes essential. Fact patterns—the legally relevant circumstances surrounding events—need systematization into machine-readable formats where humans from diverse backgrounds remain actively involved. This requires organizational structures designed for this integration from inception, not awkwardly retrofitted later when incompatibilities surface.\n\nTraditional Donor-Advised Funds struggle with in-kind donations because monetary valuation systems fail capturing heterogeneous contributions. Technical expertise, cultural knowledge, time-based contributions, and specialized understanding resist translation into simple financial equivalents. Combining DAF capacity with ABS multidisciplinary expertise creates mechanisms for evaluating diverse contributions without depending on monetary pricing that systematically undervalues certain forms of work.\n\nThe UK Property Digital Assets Bill creates world-first legal recognition of digital assets as property, but realizing this breakthrough requires organizational structures capable of bridging technical, cultural, legal, and operational domains simultaneously. Recent infrastructure incidents revealed that resilience requires governance mechanisms extending beyond code. Better decision-making with genuine stakeholder participation—actual skin in the game through diverse contribution recognition—reduces attack surfaces by distributing responsibility broadly. When more participants maintain infrastructure through heterogeneous contributions beyond just capital, ecosystems become inherently more resilient.\n\nSolution Architecture\n\nTLDR on the Approach\n\nTwelve months of international workshops across London and Tokyo create governance schema before any legal entity registers. Participants from fifty-one countries collaboratively design machine-readable frameworks that automated systems will eventually inherit and operate within. The organizational forms—UK Charitable Incorporated Organisation as Alternative Business Structure with Donor-Advised Fund capacity—represent temporary legal scaffolding enabling emergence rather than terminal goals. Think of these as falsework in construction: essential temporary structures that support the building process but dissolve once permanent architecture stands independently. What persists beyond the organizational containers are the governance frameworks themselves, operating at the velocity and granularity automation demands while keeping humans meaningfully involved across diverse cultural and professional perspectives.\n\nSovereigns.institute will operate as UK Charitable Incorporated Organisation registered as Alternative Business Structure with Donor-Advised Fund capacity once workshops complete and community consensus emerges around optimal structure. This combination enables legal service provision with genuine multidisciplinary expertise where cryptographers, engineers, cultural specialists, healthcare practitioners, and educators work directly alongside legal practitioners. The Alternative Business Structure component focuses on systematization rather than litigation—translating fact patterns and legal frameworks into schema that automated systems reference reliably while keeping humans actively in the loop. As automation advances, organizational structures that represent legal knowledge in machine-readable formats while maintaining human oversight from diverse backgrounds become essential infrastructure rather than optional additions.\n\nThe Donor-Advised Fund component combined with Alternative Business Structure multidisciplinary expertise creates mechanisms for evaluating and recognizing diverse contributions without forcing everything through monetary pricing. This matters because as automation transforms economic structures, recognizing heterogeneous value forms—time, knowledge, cultural context, specialized expertise—becomes critical for maintaining human participation in governance.\n\nWorkshop-Driven Schema Development\n\nRather than forming entities prematurely and hoping communities eventually shape them, sovereigns.institute inverts this sequence entirely. Twelve months of international workshops happen before any legal registration occurs. Variables discovered through deliberation must settle into understood constants before commitments solidify into organizational structures. This patient approach prioritizes genuine community ownership over expedient entity formation.\n\nLondon workshops partner with Central Saint Martins and University of the Arts London, leveraging alumni networks to engage interaction designers, anthropologists, legal scholars, healthcare practitioners, and educators concerned about automation-driven displacement. These institutions contribute human-centered design methodology, cultural awareness, and creative problem-solving. Tokyo workshops partner with Tokyo University of the Arts contributing creative and cultural perspectives, and Institute of Science Tokyo bringing technical depth in cryptography, distributed systems, game theory, and soft robotics exploring artificial muscles and biomimetic systems. These partnerships build on pre-existing relationships Central Saint Martins established with both Tokyo universities.\n\nTokyo applications address disaster management covering earthquakes, tsunamis, typhoons, landslides, volcanic eruptions, and electromagnetic pulses, plus rural revitalization addressing depopulation, aging demographics, agricultural sustainability, cultural preservation, and infrastructure maintenance. Japanese public data initiatives enable developing schema that coordinate heterogeneous resources without forcing monetary equivalence. An elderly resident's traditional agricultural knowledge, a remote worker's technical skills, a municipality's equipment inventory, and external financial support all contribute meaningfully through frameworks recognizing distinct value forms appropriately.\n\nWorkshops produce schema in three foundational domains. Personalised data establishes on-device sovereignty ensuring individuals control information about themselves. Internationalization creates universal reference frameworks other schema invoke for language and cultural context, ensuring systems accommodate genuine diversity. Polymorphic resources enable single identifiers representing multiple simultaneous valid interpretations with different permissions, reflecting complex stakeholder relationships reality demands but current systems cannot express. Educational content in eight languages (English, Japanese, Chinese, Tamil, Hindi, Arabic, Malay, Spanish) ensures accessibility across constitutional representatives from fifty-one countries.\n\nThese schema represent what persists beyond organizational forms. As automation advances and digital governance systems mature, these machine-readable frameworks continue operating while the legal scaffolding that enabled their creation potentially becomes less relevant. The world of bits increasingly eclipses the world of atoms in governance velocity and scope. What matters long-term are frameworks that keep humans meaningfully in the loop with appropriate input rather than either total control or complete exclusion.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The most fundamental impact sovereigns.institute creates for the Cardano ecosystem emerges from solving a problem that has constrained every distributed technological system attempting genuine decentralization: how do you protect individual contributors from legal vulnerability while enabling multidisciplinary expertise to shape governance frameworks that automated systems will eventually inherit and operate within? Right now, people building valuable infrastructure or contributing specialized knowledge to ecosystem development remain personally exposed to legal action without any institutional backing defending them. \n\n\n\nThis protection gap means the ecosystem systematically loses contributors who cannot afford the risk, particularly those from jurisdictions where legal systems prove less predictable or more expensive to navigate. By creating organizational infrastructure that provides genuine legal protection while integrating expertise across disciplines that typically remain separated, sovereigns.institute enables participation from people who currently must remain on the sidelines despite having knowledge the ecosystem desperately needs.\n\n\n\nConsider what happens when healthcare practitioners, cultural anthropologists, legal scholars focused on indigenous rights, educators working with underserved populations, and disaster management specialists can work directly alongside cryptographers and distributed systems engineers within unified frameworks designed to keep humans meaningfully in the loop as automation advances. \n\n\n\nThe governance schema emerging from this integration become technical foundations that all ecosystem participants can reference and build upon, creating shared vocabulary and architectural patterns that reduce fragmentation. \n\n\n\nWhen a developer in Buenos Aires, a community organizer in Lagos, and a rural municipality official in Hokkaido can all work with the same governance frameworks because those frameworks were designed through genuinely international participatory processes accounting for subject-object-verb linguistic structures and cultural context from inception rather than as afterthoughts, the ecosystem gains coordination capabilities that homogeneous governance structures simply cannot provide.\n\n\n\n\n\nThe international workshop approach with deep engagement across Central Saint Martins, University of the Arts London, Tokyo University of the Arts, and Institute of Science Tokyo creates something rarely seen in technological ecosystems: patient collaborative development where variables discovered through deliberation settle into understood constants before commitments solidify into inflexible structures. \n\n\n\nThis inverted approach where community designs governance schema before any legal entity forms prevents the pattern that constrained prior organizational attempts where entities formed quickly then struggled endlessly to become what communities actually needed. \n\n\n\nThe educational content produced in eight languages with genuine cultural adaptation rather than superficial translation means that constitutional representatives from fifty-one countries can engage with governance concepts in ways that make sense within their own cultural contexts rather than forcing adoption of foreign conceptual frameworks that never quite fit local realities.\n\n\n\n\n\nThe regulatory landscape exploration coordinated with build.foundation technical security validation creates unprecedented value for the entire ecosystem by establishing pathways for demonstrating schema-governed compliance while genuinely preserving privacy. \n\n\n\nWhen sovereigns.institute engages with UK regulatory sandboxes spanning financial services, data protection, healthcare innovation, food safety, energy systems, transportation, and legal service provision while maintaining protective commitments rather than compromising them for regulatory approval, the entire ecosystem benefits from proven approaches to institutional engagement. This matters enormously because regulatory relationships either enable or constrain every subsequent development initiative, and having organizational infrastructure that can navigate these relationships while maintaining technical and ethical integrity provides public good benefits extending far beyond immediate project scope.\n\n\n\n\n\nThe Donor-Advised Fund innovation combined with Alternative Business Structure multidisciplinary expertise creates mechanisms for evaluating and recognizing heterogeneous contributions that monetary systems fundamentally cannot capture. When an elderly resident's deep knowledge of traditional agricultural practices, a remote worker's technical skills, a municipality's equipment inventory, and external financial support can all contribute meaningfully through frameworks recognizing their distinct value forms appropriately, the ecosystem gains ability to coordinate resources that current architectures systematically exclude or undervalue. \n\n\n\nThis becomes critical as automation transforms economic structures because maintaining human participation in governance requires recognizing value forms beyond simple monetary equivalents.\n\nThe applied prototyping using Japanese public data for disaster management and rural revitalization demonstrates that governance frameworks developed through this work enable real-world coordination under genuine pressure rather than only functioning in theoretical contexts. When earthquakes, tsunamis, typhoons, or infrastructure failures occur, schema-governed coordination that keeps humans meaningfully in the loop while enabling automated systems to operate reliably could literally save lives. \n\n\n\nThe rural revitalization applications addressing depopulation, aging demographics, agricultural sustainability, and cultural preservation show how governance frameworks can help communities maintain vitality as economic structures transform. These concrete demonstrations attract attention from institutions and populations that speculative use cases never reach, expanding the ecosystem's relevance beyond early adopter communities into populations facing urgent challenges requiring coordination at scale.\n\n\n\n\n\nPerhaps most importantly, sovereigns.institute establishes pattern for genuine community ownership where organizational forms serve as temporary scaffolding enabling emergence of something more fundamental rather than becoming ends in themselves. The synthesis documenting how governance insights shaped build.foundation technical decisions and how technical constraints influenced organizational design throughout twelve-month collaboration provides the entire ecosystem with concrete examples of co-evolution between human governance and technical infrastructure rather than abstract assertions of alignment. This demonstrates possibility for escaped institutional forms where what persists beyond organizational containers are the governance frameworks themselves, operating at velocity and granularity automation demands while keeping humans meaningfully involved across diverse cultural and professional perspectives.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"# Proposer's Background\nI, The proposer bring eight years continuous ecosystem participation since 2017, including early London meetups with Michael Parsons, initial Cardano Foundation team, and Charles Hoskinson's team, participating from Catalyst's inaugural fund through present, attending summits from Lausanne to Dubai, governance workshops in Zug and Tokyo, EMURGO's RWA events, and community gatherings.\n\nProfessional background spans theatre and film production, architecture, design and technology integration, and public service, creating multidisciplinary perspective bridging creative practice, technical implementation, and institutional contexts.\n\nAs a Central Saint Martins alumnus, the proposer maintains active engagement with London arts institutions like their Alma mater as a trnsitive property or contrapositive conditional Tokyo University of the Arts and Institute of Science Tokyo, where pre-existing institutional relationships exist through Central Saint Martins' longstanding collaborations. Alumni networks enable organic relationship development through shared interests rather than bureaucratic constraints. Workshop partnership confirmations represent Milestone 1 deliverables establishing formal agreements once funding enables concrete planning.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 1: International Workshop Foundation and Cross-Proposal Schema Emergence","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"International workshop series initiated across London and Tokyo venues establishing collaborative design processes with build.foundation technical validation occurring in parallel\n\nInitial schema specifications emerging from participatory design processes that build.foundation implements as reference patterns in testnet environments\n\nCommunity engagement infrastructure operational serving both sovereigns.institute governance deliberations and build.foundation technical discussions","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Workshop series demonstrably underway with documented evidence of participatory design processes yielding schema specifications that inform build.foundation technical architecture decisions\n\nSchema specifications published showing clear lineage from workshop deliberations with build.foundation providing technical feasibility validation\n\nCommunity platform operational demonstrating active engagement across both governance and technical domains","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Workshop documentation including participant engagement records, design artifacts, and published schema specifications with attribution to collaborative processes\n\nCommunity platform demonstrating integrated discussions where governance considerations and technical constraints inform each other\n\nPartnership documentation confirming institutional relationships enabling ongoing collaboration","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25321,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 2: Applied Validation and Regulatory Exploration Coordinated with Technical Security","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Applied prototyping using Japanese public data contexts validating schema that build.foundation implements technically, demonstrating governance frameworks enabling technical capabilities\n\nEducational and cultural adaptation work expanding accessibility while build.foundation develops multilingual conversational interfaces incorporating these insights\n\nRegulatory landscape exploration coordinated with build.foundation security validation ensuring legal compliance frameworks align with technical security models","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Working prototypes demonstrating schema application in real-world contexts with build.foundation technical implementation supporting these use cases\n\nEducational materials demonstrating cultural adaptation approaches that build.foundation conversational systems incorporate architecturally\n\nEvidence of regulatory engagement coordinated with build.foundation security work showing alignment between legal and technical compliance approaches","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Published prototypes with documentation showing how governance schema enable technical functionality build.foundation provides\n\nEducational materials with demonstrated cultural adaptation coordinated with build.foundation internationalization architecture\n\nDocumentation demonstrating coordination between regulatory exploration and build.foundation security validation processes","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 3: Synthesis and Unified Vision Demonstration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Comprehensive synthesis documenting how governance insights shaped build.foundation technical decisions and how technical constraints influenced organizational design throughout twelve-month collaboration\n\nEntity formation approach emerging from community consensus coordinated with build.foundation mainnet readiness timing\n\nCoordinated roadmap with build.foundation for subsequent development demonstrating unified vision where human governance and technical infrastructure genuinely co-evolve","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Synthesis documentation demonstrating concrete examples where sovereigns.institute governance work directly influenced build.foundation technical architecture and vice versa\n\nEntity approach documentation showing community-derived consensus coordinated with build.foundation production readiness rather than premature independent formation\n\nSubsequent phase roadmap jointly developed with build.foundation showing continued co-evolution rather than separate trajectories","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Published synthesis report with specific examples of mutual influence between governance and technical work across both proposals\n\nEntity approach documentation with evidence of community consensus and coordination with build.foundation deployment timing\n\nJoint roadmap document demonstrating integrated planning for subsequent development phase","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":14000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"# Contributor Approach\nCatalyst's historical funding delays created situations where promised contributor engagement could not be honored, damaging relationships despite good intentions. \n\n\n\nLearning from this, this proposer commits to onboarding computational commons contributors—workshop facilitators, schema architects, cultural consultants building on delegated representatives from over fifty-one countries, translators emphasizing subject-object-verb structures across eight languages, disaster specialists, rural revitalization experts, legal advisors across UK, Swiss, and Japanese contexts, technical writers, community coordinators, partnership liaisons, and video producers—only after funding receipt and stable currency conversion ensuring reliable compensation.\n\n\n\nThis milestone-threshold approach protects both contributor relationships and project reputation. Should early milestones not achieve objectives as community determines, funding firewall ensures remaining allocations stay secure rather than creating cascading failures. Given eight years visible participation, reputation preservation through honest execution carries paramount importance. \n\n\n\nThe approach provides latitude for adapting to emergent realities while maintaining accountability through deliverable-based evaluation, with transparent communication about challenges and good-faith efforts toward objectives.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Preface: Important Note on ADA Price Collapse **\n\n\n\n_When Fund 15 budget thresholds and category limits were being conceived and set \\(September–early October 2025\\), ADA was trading at approximately £0\\.60 GBP and ¥120 JPY per ₳1\\. All budgeting and scoping for this proposal \\(both the original milestone amounts and the detailed line items below\\) were prepared in good faith using those exchange rates\\._\n\n\n\n_In the roughly one to two months since then — from when the Fund 15 budget and thresholds were being set — ADA has halved to around £0\\.30 GBP and ¥60 \\(as of 27 November 2025\\)\\. This means the fixed\\-ADA budget presented here now delivers only about half the originally assumed fiat purchasing power for salaries, international travel \\(London & Tokyo\\), venue costs, regulatory work, and development hours\\._\n\n\n\n\n\n_The proposer remains fully committed to delivering every promised milestone and output, but voters should understand that the requested ADA amount now represents approximately double the real\\-world cost that was assumed when Fund 15 rules and expectations were established\\._\n\n\n\nMilestone 1\n\n(Month 4, ₳25,321):\n\nWorkshop facilitation &amp; personnel (₳10,000),\n\nvenue &amp; travel expenses (₳6,000),\n\ndesign &amp; schema development (₳5,000),\n\ncommunity platform setup (₳3,321),\n\ndocumentation &amp; attribution (₳1,000).\n\nMilestone 2\n\n(Month 8, ₳15,000):\n\nPrototyping &amp; validation (₳5,000),\n\neducational &amp; cultural adaptation (₳4,000),\n\nregulatory research &amp; coordination (₳3,500), documentation &amp; evidence (₳2,500).\n\nMilestone 3\n\n(Month 12, ₳14,000):\n\nSynthesis report development (₳5,000),\n\nentity formation planning (₳4,000),\n\nroadmap coordination (₳3,000),\n\ncommunity consensus building (₳2,000).\n\nTotal: ₳54,321","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This work creates value as an institutional falsework enabling emergence of governance frameworks that automated systems will inherit.\n\nIt addresses contributor protection  (lacking in cardano ecosystem) through systematic framework development rather than reactive litigation.\n\nIt enables heterogeneous contribution evaluation recognizing diverse value forms beyond monetary reduction. It builds authentic community ownership through patient deliberation where schema emerge organically.\n\nIt leverages UK Property Digital Assets Bill for world-first integration of digital property concepts with organizational practice. It establishes regulatory landscape understanding as ecosystem public good. It ensures global cultural diversity through fifty-one country representation and subject-object-verb language understanding that centralized systems economically cannot maintain.\n\nIt systematizes fact patterns into machine-readable schema keeping humans meaningfully involved as essential infrastructure for advancing automation. It creates governance mechanisms reducing attack surfaces through distributed responsibility and heterogeneous contribution recognition.\n\nThe organizational forms represent temporary structures supporting emergence of something more fundamental. As digital governance operates at increasing velocity and scope, potentially eclipsing traditional institutional forms, what persists are the frameworks themselves—governance operating at the granularity and speed automation demands while preserving human judgment across diverse perspectives.\n\nThe legal scaffolding enables this emergence then potentially dissolves, having served its purpose. What remains are the schema, the patterns of coordination, the mechanisms for recognizing heterogeneous value—foundations for sustainable governance that transcends its initial containers. Laying the foundations for perpetual value creating aligned values.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Governance","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1691}