{"pr_id":"019ac34c-4787-7113-82f3-1b8065a04772","title":"Last Mile Lending Infrastructure for UNDP Bangladesh","event_id":15,"objective":37,"objective_title":"Cardano Partners: Tier-1 Enterprise Integrations","summary":"In UNDP Bangladesh’s context, last-mile microfinance is slow, costly and prone to fraud, limiting affordable loans and hurting beneficiaries who need fast, transparent, secure financial access.","solution":"Leveraging blockchain to enable the climate resilience fund to deploy decentralised IDs, smart contracts, and tamper-proof tracking, restoring trust among donors, governments and communities.","proposer_name":"Cladfy Inc","proposer_relevant_experience":"**UNDP Bangladesh \\(Country Office\\)**\n\n**Team Members & Roles:**\n\nA.K.M. Azad Rahman – Project Coordinator, LoGIC Project, UNDP Bangladesh\n\nMd. Humayun Kabir – MIS Officer, LoGIC Project, UNDP Bangladesh\n\nT.M. Selim – Programme Analyst, LoGIC Project, UNDP Bangladesh\n\n\n\n\n\n**Team Name: Cladfy**\n\n**Team Members & Roles**\n\nEbby Gatamu - Strategy Lead, CEO Cladfy\n\nKibe John – UX/UI Designer/Product Lead, CTO Cladfy\n\nDuncan Warukira  – Blockchain Engineer, Cladfy\n\nHassan Rapando - Full-stack developer, Cladfy","url":null,"funds":296000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Last Mile Lending Infrastructure for UNDP Bangladesh","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Cladfy Inc","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an Incorporated entity or a Consortium?","description":"Are you submitting this proposal as an Incorporated entity or a Consortium?","format":null,"answer":"Consortium","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 250,000 and $ADA 750,000","format":null,"answer":296000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"In UNDP Bangladesh’s context, last-mile microfinance is slow, costly and prone to fraud, limiting affordable loans and hurting beneficiaries who need fast, transparent, secure financial access.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Leveraging blockchain to enable the climate resilience fund to deploy decentralised IDs, smart contracts, and tamper-proof tracking, restoring trust among donors, governments and communities.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://drive.google.com/drive/folders/1cY4JvQzLdtK-tz-G3MHa1b00HvzHrsdI?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"One of our dependencies is platform users. We will deploy this software solution through 248 local cooperatives in Bangladesh, currently serving 42,000 benefeciaries. So our dependencies are the cooperatives and the users as well adopting the solution. Luckily, these cooperatives and beneficiaries were onboarded by UNDP Bangladesh onto this project, therefore UNDP has significant influence and say on adoption, since they are the ones who finance the fund that deploys the micro loans to communities. Our other dependency is ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","description":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","format":null,"answer":"The intellectual property (IP) generated through this project will be owned by Cladfy Inc, the Tech partner/solution maker. All Tech outputs will be retained under Cladfy Inc’s proprietary licence and will not be released as open-source. \n\nOther non-tech outputs from the project e.g Impact metrics, process data, challenges, opportunities and so on will belong to UNDP Bangladesh and will be shared/published at their discretion","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Financial Services","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your established collaborations.","description":"Please provide your rationale for your established collaborations.","format":null,"answer":"The collaboration between UNDP Bangladesh &amp; Cladfy Inc project came about from a partnership bewteen UNDP AltFinLab, Emurgo Labs and The Blockchain For Good Alliance, that brought together startups to help UNDP solve real world challenges through the Cardano Blockchain.\n\n\n\nCladfy Inc has a partnership with UNDP Bagladesh for this pilot project, and\n\nThe pilot will run for up to 12 months across up to 10 cooperatives serving up to  ~1000 beneficiaries.\n\n\n\nUNDP has established partnersips with 248 local cooperatives and 42,000 beneficiaries/users as part of the Climate Resilience Fund. Post-pilot, we intend to scale up to cover all 248 cooperatives. UNDP has plans to scale up the entire project as well, to serve 150,000 beneficiaries in the coming years. This pilot will set the stage for massive impact in coming years.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe funding commitments.","description":"Please provide your rationale for your funding commitments.","format":null,"answer":"UNDP Bangladesh and Cladfy Inc have together committed $23,000 in cash and in-kind support to the project so far, providing critical resources to advance implementation and pilot activities effectively. We are fundraising for the rest of the pilot budget.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your key performance metrics.","description":"Please provide your rationale for your key performance metrics.","format":null,"answer":"1. % loans disbursed digitally.\n2. Average time from loan request to disbursement.\n3. Beneficiary satisfaction scores.\n4. Number of cooperatives onboarded.\n5. Donor confidence (audit trail transparency).\n6. Scale of adoption (number of cooperatives, beneficiaries onboarded)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Bangladesh is one of the most climate-vulnerable countries in the world. Rural communities and smallholder farmers are disproportionately affected by flooding, salinity, and other climate shocks. Fund disbursement for climate adaptation programs often passes through multiple layers of intermediaries, creating delays, data gaps, and risks of mismanagement.\n\n\n\nThe key challenge in climate resilience programs like LoGIC (our project) is ensuring transparent and trustworthy fund disbursement and beneficiary tracking. Current centralized systems face risks of data tampering, fund leakages, high administrative costs, and difficulties verifying identities of marginalized groups, undermining stakeholder trust and future climate finance. \n\n\n\nThrough this pilot, Blockchain offers a solution by enabling secure digital identities, automated fund releases via smart contracts, and immutable tracking of adaptation progress, restoring confidence among donors, governments, and communities while positioning Bangladesh as a leader in transparent, locally led climate adaptation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"1. Showcases Real-World Impact: Demonstrates Cardano’s ability to power transparent, decentralized financial systems for social good, reinforcing its utility beyond speculative use.\n2. Promotes DApp Adoption: By deploying a live cooperative finance system, the project drives practical use of Cardano smart contracts, UTxO accounting, and decentralized identities (DIDs), encouraging developers and enterprises to build on the platform.\n3. Strengthens Ecosystem Credibility: Transparent, tamper-proof microfinance systems validate Cardano as a reliable platform for high-integrity, auditable financial solutions, attracting more institutional and donor interest.\n4. Expands Developer & Partner Network: The project creates opportunities for partnerships with local fintechs, mobile money providers, and NGOs, fostering ecosystem growth and technical collaboration.\n5. Data & Knowledge Sharing: Lessons learned on scalable blockchain-based lending, DID integration, and on-chain accountability provide valuable insights for Cardano developers, researchers, and other pilot projects globally.\n6. Encourages Social Impact Projects: Success inspires other blockchain initiatives targeting financial inclusion, climate adaptation, and sustainable development, positioning Cardano as a hub for socially responsible innovation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Capability to Deliver with High Trust and Accountability\n\n1. Blockchain-Based Transparency: Using Cardano’s UTxO model and smart contracts ensures every transaction is immutable, traceable, and auditable in real time. This eliminates ambiguity and builds confidence among all stakeholders.\n2. Decentralized Identities (DIDs): Borrowers are verified through secure digital identities, preventing fraud and ensuring that only eligible beneficiaries access funds.\n3. Direct-to-Beneficiary Disbursements: Loans are delivered straight to mobile wallets (e.g., bKash), reducing intermediaries and minimizing risk of fund leakage.\n4. Automated Governance & Oversight: Smart contracts automate loan approval, disbursement, and repayment processes, ensuring rules are consistently applied without manual intervention.\n5. Pilot with Reputable Partner (UNDP Bangladesh): Partnership with UNDP provides credibility, oversight, and alignment with international development standards.\n6. Real-Time Monitoring & Reporting: Co-operative committees, UNDP, and auditors can track all activity on-chain, creating a tamper-proof record that enables accountability at every step.\n7. Experienced Team: Cladfy Inc is an award-winning Fintech that brings technical expertise in blockchain development, fintech integration, and operational scaling to ensure reliable implementation and stakeholder confidence. \n\n\n\nValidating if our approach is feasible\n\n1. Pilot Deployment: Launch a controlled pilot with a select group of verified borrowers and cooperatives, funded through UNDP Bangladesh, to test real-world loan disbursements and repayments.\n2. Transaction Monitoring: Track all disbursements, repayments, and loan lifecycle events on-chain to assess accuracy, transparency, and efficiency compared to traditional manual systems.\n3. User Feedback: Collect qualitative feedback from beneficiaries (especially women and low-income borrowers) and cooperative committees to evaluate usability, accessibility, and trust in the system.\n4. Operational Metrics: Measure transaction processing times, error rates, and administrative cost reductions to validate operational efficiency.\n5. Financial Integrity Checks: Audit smart contract execution, DID verification, and mobile wallet transfers to ensure funds are correctly allocated and tamper-proof.\n6. Scalability Assessment: Test system performance under increasing transaction volumes and multiple cooperatives to determine readiness for broader deployment.\n7. Stakeholder Reporting: Provide UNDP and other partners with real-time dashboards and reports to verify transparency, accountability, and impact.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Pilot Setup & Onboarding","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The Cardano-based platform is fully configured and deployed, with 2–10 cooperatives onboarded and the first 100–200 beneficiaries verified with secure decentralized digital identities (DIDs), ensuring readiness for automated and transparent loan disbursements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All selected cooperatives are registered on the platform, smart contracts are successfully deployed and operational, and at least 100–200 beneficiaries have verified DIDs and active accounts ready for the first loan cycle, with no critical errors.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Signed cooperative agreements, screenshots of active beneficiary accounts, verification logs of DIDs, deployment confirmation of smart contracts, and functional dashboard ready for live loan operations.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":69048,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"First Loan Disbursement & Testing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The first round of loans is disbursed to beneficiaries’ mobile wallets via smart contracts, demonstrating the platform’s ability to execute secure, automated, tamper-proof financial transactions while providing full transparency and traceability.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All loans are successfully delivered on schedule to beneficiaries’ wallets, transaction records are accurate on-chain, smart contracts execute correctly, and beneficiaries confirm receipt and understanding of repayment terms, with no operational disruptions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"On-chain transaction logs, beneficiary confirmation messages, reconciled financial reports, screenshots of completed smart contract executions, and internal tracking reports confirming successful disbursement and receipt by all intended beneficiaries.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":57540,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mid-Pilot Evaluation & Optimization","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A detailed evaluation of pilot operations, including loan processing efficiency, borrower experience, fraud prevention, and system reliability, is conducted. Recommendations are implemented, and the platform is optimized for performance, usability, and accuracy.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Evaluation report demonstrates measurable improvements in processing time, record accuracy, and usability; optimizations are successfully applied without disrupting active operations; feedback from cooperatives and beneficiaries is incorporated.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Completed evaluation report, updated platform with documented fixes, screenshots and logs of applied optimizations, stakeholder sign-off confirming enhancements, and recorded improvements in processing speed, accuracy, and beneficiary satisfaction.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":57540,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Full Pilot Rollout","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The platform is fully operational across all participating cooperatives, serving up to 1000 beneficiaries. Complete loan cycles, including automated disbursement, repayment tracking, and reporting, are executed entirely on-chain with full transparency and real-time accountability.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All loans disbursed and repayments tracked accurately on-chain; beneficiaries and cooperatives confirm satisfaction with usability, transparency, and support; no unresolved operational issues remain, and all transactions are verifiable.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"On-chain reports showing full loan and repayment cycles, survey feedback from beneficiaries, cooperative verification forms, and internal operational logs confirming end-to-end functionality and successful completion of pilot objectives.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":80556,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Closeout & Impact Documentation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A comprehensive project closeout report and a video summarizing implementation, outcomes, lessons learned, and impact are produced. The materials highlight beneficiary stories, cooperative feedback, and best practices to inform future replication.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Closeout report and video are reviewed and approved by UNDP Bangladesh; materials clearly document pilot achievements, lessons learned, and impact metrics; stakeholders confirm usefulness and clarity of reporting for accountability and future scaling.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Signed approval of final report, finalized impact video, documented stakeholder feedback confirming content and accuracy, and archival of all pilot data, reports, and multimedia materials for replication and reference.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":32222,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**UNDP Bangladesh \\(Country Office\\)**\n\n**Team Members & Roles:**\n\nA.K.M. Azad Rahman – Project Coordinator, LoGIC Project, UNDP Bangladesh\n\nMd. Humayun Kabir – MIS Officer, LoGIC Project, UNDP Bangladesh\n\nT.M. Selim – Programme Analyst, LoGIC Project, UNDP Bangladesh\n\n\n\n\n\n**Team Name: Cladfy**\n\n**Team Members & Roles**\n\nEbby Gatamu - Strategy Lead, CEO Cladfy\n\nKibe John – UX/UI Designer/Product Lead, CTO Cladfy\n\nDuncan Warukira  – Blockchain Engineer, Cladfy\n\nHassan Rapando - Full-stack developer, Cladfy","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The detailed budget for this project, outlining costs for platform development, pilot implementation, loan disbursement, monitoring, and closeout activities, can be accessed and reviewed at the following link: [https://docs\\.google\\.com/document/d/1bppS5hoYa8\\_JNnDUPNImINdCnSPwCNJhMk5F\\_t1OD9Q/edit?usp=sharing](https://docs.google.com/document/d/1bppS5hoYa8_JNnDUPNImINdCnSPwCNJhMk5F_t1OD9Q/edit?usp=sharing)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"1. Demonstrates Real-World Utility: The project deploys Cardano smart contracts, UTxO accounting, and decentralized identities (DIDs) to solve actual microfinance challenges in Bangladesh. Every dollar spent directly showcases Cardano’s practical capabilities for secure, transparent, and scalable financial systems.\n2. Drives Ecosystem Adoption: Funding supports integration with local mobile wallets, onboarding of cooperatives, and pilot testing with up to 1,000 beneficiaries. The pilot sets the stage for scale up phaseof 150,000 users. This creates tangible use cases that encourage developers, fintechs, and NGOs to build on Cardano, expanding its adoption and network effects.\n3. Builds Credibility & Trust: By providing UNDP and other stakeholders with tamper-proof, auditable systems, the project reinforces Cardano’s reputation as a reliable blockchain for socially impactful, high-integrity solutions. This attracts institutional partners and grants future ecosystem growth opportunities.\n4. Generates Knowledge & Best Practices: Investment supports evaluation, optimization, and documentation of the pilot, creating reusable frameworks, smart contract templates, and operational lessons that can benefit future Cardano projects globally.\n5. Social & Economic Impact as Marketing: Each successful loan disbursement and beneficiary story highlights Cardano’s role in driving financial inclusion, strengthening ecosystem visibility and positioning Cardano as the blockchain of choice for impact-driven solutions.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead applicant is a verified legal business entity.","description":"Legal Entity:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead org has a ≥2-year track record, and the consortium collectively has ≥$5M in verifiable annual revenue.","description":"Track Record & Revenue:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of collaboration with a qualified Tier-1 enterprise is provided.","description":" Tier-1 Collaboration:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is for mature R&D or integration, not an early-stage concept or core infrastructure.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of a mature product is provided, with a clear integration plan if not already on Cardano.","description":"Mature Product & Path:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that all key partners, including the Tier-1 collaborator, are clearly identified.","description":"Partner Identification:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that a clear statement of the partner's in-kind or financial contributions is included.","description":"Partner Commitment:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable references (e.g., LinkedIn, portfolio) for key team members.","description":"Verifiable Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear KPIs for adoption (e.g., transaction volume, user growth). Forecast for projected on-chain transaction volume is provided with adequate justification.","description":"Measurable Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that delivery is ≤ 12 months with clear milestones.","description":"Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a co-marketing or community engagement plan to amplify Cardano's visibility.","description":"Visibility & Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal budget is for future work only, not for completed tasks. No incentives, giveaways, private treasuries and regranting are included in the budget.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Financial Services","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1693}