{"pr_id":"019abb5e-3763-70f3-9e2c-91084974c19a","title":"   AirChain: Decentralized Air Quality Monitoring in Nigeria","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Urban pollution fuels widespread respiratory and infectious illnesses, but Nigeria lacks reliable monitoring. Traditional stations are too few and costly, leaving citizens blind to daily risks.","solution":"We are building AirChain: A network of unified low-cost IoT sensors, edge analytics, and a data exchange to make air quality data open, reliable, and economically valuable.","proposer_name":"Abdulazeez Bello","proposer_relevant_experience":"1. Abdulazeez Bello — Founder & Lead Engineer\n\nLinkedIn: [https://www\\.linkedin\\.com/in/abdulazeez\\-folaranmi\\-bello\\-38b83419a/](https://www.linkedin.com/in/abdulazeez-folaranmi-bello-38b83419a/)\n\n Role: System architecture, firmware engineer, backend developer, blockchain integration lead.\n\n Scope: Designs and maintains the hardware, firmware, calibration process, backend APIs, dashboard systems, and Cardano integration. Leads all engineering decisions, milestone execution, technical documentation, and quality assurance. Abdulazeez built the current prototypes, backend, dashboard, calibration bench, and token infrastructure already in production use.\n\n\n\n2. Victor Ekanem — DevOps & Infrastructure Engineer\n\nLinkedIn: Not available\n\n Role: Cloud, Kubernetes, CI/CD, monitoring, and reliability engineering.\n\n Scope: Manages full infrastructure deployment across Kubernetes clusters, monitors sensor network uptime, handles observability, configures scaling policies, and ensures zero-downtime deployments. Oversees blockchain node reliability and prepares the environment for mainnet integration.\n\n\n\n3. Edidiong Udoh — Hardware Fabrication & Manufacturing Engineer\n\nLinkedIn: [https://www\\.linkedin\\.com/in/edidiong\\-udoh\\-46011a192/](https://www.linkedin.com/in/edidiong-udoh-46011a192/)\n\n Role: Production engineering, fabrication workflow, and hardware QA.\n\n Scope: Oversees PCB assembly, enclosure design, bill-of-materials optimization, and scaling manufacturing from 50 → 500 → 1,000 units. Ensures industrial-grade reliability, manages fabrication timelines, and coordinates supply-chain operations.\n\n\n\n4. Phillip Ekpo — IoT & Firmware Engineer\n\nLinkedIn: [https://www\\.linkedin\\.com/in/phillip\\-ekpo\\-b87050353/](https://www.linkedin.com/in/phillip-ekpo-b87050353/)\n\n Role: Firmware, connectivity, OTA updates, power optimization.\n\n Scope: Develops and maintains the firmware responsible for MQTT connectivity, battery performance, environmental sensing, secure transmission, and resilience in Lagos-specific conditions. Manages OTA infrastructure and improves long-term device reliability.\n\n\n\n5. Ndanso Udoh — Community & Deployment Manager\n\nLinkedIn: [https://www\\.linkedin\\.com/in/ndanso\\-udoh\\-266367378/](https://www.linkedin.com/in/ndanso-udoh-266367378/)\n\n Role: Operator onboarding, field logistics, deployment management.\n\n Scope: Recruits and trains operators (scaling from 50 → 1,000), conducts workshops, manages field deployment coordination, ensures operator retention, collects feedback, and leads community outreach. Coordinates NGO collaborations and community-facing initiatives.\n\n\n\nCollaborators\n\nBuild-A-Tech Workspace (Incubation Partner)\n\nRole: Governance oversight, fabrication facility access, business mentorship.\n\n Scope: Provides working space, prototyping tools, internal review, fund management guidance, and operational governance frameworks. Ensures strong compliance and strategic alignment throughout all milestones.\n\n Status: Actively engaged and already supporting the project.\n\n\n\nSkills Gaps & Recruitment Plan\n\nAs we scale to 1,000 sensors, additional hires will be made to ensure successful execution:\n\n1. Product Designer (UI/UX)\n\nNeeded for dashboard UX improvements, API portal UI, operator mobile app refinement.\n\n2. Data Scientist / Environmental Analyst\n\nRequired for AQI modeling, calibration analysis, GIS overlays, and pollution pattern reporting.\n\n3. Mobile App Developer (Android)\n\nNeeded to improve operator onboarding flows, notifications, and field reliability in the mobile app.\n\n4. Field Operations Coordinator\n\nManages deployment logistics, maintenance scheduling, spare-part allocation, and field troubleshooting at scale.\n\n5. Finance & Audit Assistant\n\nSupports reconciliation, audit-preparation, documentation, and reporting during Milestones 4–5.\n\nAll roles are clearly defined, and hiring will be staged according to milestone needs.","url":null,"funds":170000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"   AirChain: Decentralized Air Quality Monitoring in Nigeria","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Abdulazeez Bello","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":170000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Urban pollution fuels widespread respiratory and infectious illnesses, but Nigeria lacks reliable monitoring. Traditional stations are too few and costly, leaving citizens blind to daily risks.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We are building AirChain: A network of unified low-cost IoT sensors, edge analytics, and a data exchange to make air quality data open, reliable, and economically valuable.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://airchain.ng","https://preprod.cardanoscan.io/transaction/25766fc9fc682b05280c3e748af1920fc4838e3c8020c7ff5e1430b1bee9624c","https://airchain.ng/dashboard","https://airchain.ng/docs"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"HARDWARE SUPPLY CHAIN: Raspberry Pi Pico W) Risk: Medium •   MITIGATION: Bulk pre-orders 6 months ahead, 3-month local inventory buffer, tested alternative (Espressif’s ESP32)    • PMS5003 particulate sensors from Plantower (China) - RISK: Medium   MITIGATION: Pre-purchased inventory, alternative sensors tested (SDS011, BME680), can pivot if supply disrupted     CARDANO INFRASTRUCTURE: • Blockfrost API for blockchain interaction - RISK: Low   MITIGATION: Direct Cardano node connection as backup, can operate with 7-day delayed anchoring if Blockfrost unavailable    • PyCardano library maintenance - RISK: Low   MITIGATION: Core team contributes to PyCardano, can fork and maintain if upstream stalls     • University of Lagos for research collaboration - RISK: Very Low   MITIGATION: Partnership agreement signed (October 2025), long-standing relationship since 2024  TECHNICAL DEPENDENCIES: • Mobile network connectivity (2G/3G/4G) - RISK: Low   MITIGATION: Offline caching stores 7 days of data, LoRaWAN mesh networking for poor coverage areas    • Internet for backend operations - RISK: Low   MITIGATION: Redundant hosting (AWS primary, Azure backup)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"No, but we have a publicly available air quality Map. We are not making it open source because our pollutant type geolocator engine is proprietary. We are pursuing Intellectual Property on such preventing us from open sourcing the project. After which we can explore open sourcing non-proprietary aspects of the project. It should be noted that we have a non profit arm for education and impact assessment.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Environment","group":"Sustainability"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"HOW AIRCHAIN IS NEW TO CARDANO\n\nAirChain introduces an entirely new category to the Cardano ecosystem: large-scale environmental monitoring infrastructure that generates millions of predictable transactions while saving measurable human lives. Nothing like this exists on Cardano today.\n\n\n\nWHAT DOESN'T EXIST ON CARDANO (UNTIL NOW):\n\nNO ENVIRONMENTAL MONITORING DEPIN: Zero blockchain-verified air quality monitoring networks operate on Cardano. While other blockchains have explored environmental sensors (Helium, IoTeX), Cardano lacks any deployed environmental data collection infrastructure. AirChain becomes Cardano's first credible environmental DePIN, positioning the ecosystem as a leader in blockchain for planetary health\n\n\n\n\n\nNo existing Cardano project:\n\nCollects real-time environmental data from physical sensors\n\nAnchors sensor readings on-chain for data integrity verification\n\nOperates 1,000+ distributed physical nodes continuously\n\nGenerates predictable high-volume transactions (10,000 daily)\n\nProves blockchain works for public infrastructure in developing nations\n\n\n\n\n\nNO HIGH-VOLUME DEPIN: Existing Cardano DePIN projects generate hundreds or perhaps thousands of transactions monthly.\n\nAirChain generates 10,000 transactions DAILY—making it the largest DePIN by transaction volume in Africa and potentially globally on Cardano.\n\nTransaction volume comparison:\n\nTypical Cardano DePIN: 100-1,000 TXs/month (estimated)\n\nAirChain Year 1: 3,650,000 TXs/year (3,000-36,000× higher)\n\n5-year cumulative: 18.25 million transactions\n\nThis isn't incremental growth. This is an order-of-magnitude demonstration of Cardano handling sustained real-world infrastructure load\n\n\n\n.\n\nNO TOKEN-INCENTIVIZED PUBLIC INFRASTRUCTURE: No Cardano project rewards community operators with native tokens for maintaining physical public infrastructure. While DeFi protocols reward liquidity providers and NFT projects reward collectors, AirChain introduces &quot;earn while improving public health&quot;—a fundamentally new incentive model.\n\nAIRQ token mechanics are novel to Cardano:\n\nDaily automatic distribution to 1,000 sensor owners\n\nRewards tied to sensor uptime and data quality (performance-based)\n\nToken utility includes hardware purchases, API access, governance voting\n\nCreates aligned incentives: Operators profit from maintaining public good infrastructure\n\nDemonstrates sustainable token economics (value derives from network usage, not speculation)\n\nNo existing Cardano token combines these characteristics: community distribution, performance-based rewards, real-world utility, and public health impact.\n\nNOVEL TECHNICAL CONTRIBUTIONS TO CARDANO:\n\n1. MERKLE TREE DATA ANCHORING AT SCALE:\n\nAirChain implements the first production Merkle tree compression system for sensor data on Cardano:\n\n10 sensor readings (1,000+ bytes raw data) compressed to single 32-byte Merkle root\n\nCryptographic proof enables verification without storing all raw data on-chain\n\nReduces anchoring cost from ~2 ADA per reading to ~0.02 ADA per batch (100× savings)\n\nMakes large-scale environmental monitoring economically viable\n\nTechnical innovation: Our PyCardano implementation will be open-sourced, enabling other builders to create efficient DePIN projects without reinventing data compression. This becomes reference architecture for future Cardano IoT projects.\n\nNo other Cardano project has demonstrated Merkle tree batching for IoT sensor data at 1,000-sensor scale.\n\n1. OFFLINE-RESILIENT ARCHITECTURE:\n\nAirChain proves DePIN can work in challenging environments where internet connectivity is unreliable:\n\n7-day local data caching (sensors store readings when offline)\n\nDelayed anchoring acceptable (batch uploads when connection restored)\n\nGraceful degradation (network continues operating if 10-20% of nodes offline)\n\n2G/3G fallback connectivity (works on aging mobile infrastructure)\n\nWhy this matters: Most blockchain projects assume reliable internet. AirChain demonstrates Cardano works in Lagos where power outages are daily and internet is intermittent. This unlocks developing world adoption.\n\nBlueprint value: Our architecture becomes template for other African/Asian DePIN deployments where infrastructure is unreliable. We publish detailed documentation enabling replication.\n\nNo other Cardano project has solved offline-resilient blockchain anchoring at scale.\n\n1. DUAL-TIER ACCESS MODEL:\n\nAirChain introduces sustainable &quot;public good + private revenue&quot; architecture new to Cardano:\n\nFREE TIER (Public Good):\n\n2 million+ Lagosians access real-time air quality data\n\nSMS alerts, mobile app, public dashboard (zero paywalls)\n\n7-day historical data via public API\n\nUniversal health protection regardless of ability to pay\n\nPREMIUM TIER (Sustainability):\n\nEnterprise customers pay for advanced features\n\n30-day pollution forecasts, bulk downloads, compliance reporting\n\nRevenue funds operations without perpetual grant dependency\n\nProfitable business generates indefinite Cardano transactions\n\nThis model doesn't exist on Cardano: Universal free access for public good combined with enterprise revenue for sustainability. Most projects are either free but unfunded (collapse) OR paid but exclude the poor.\n\nAirChain proves you can serve millions for free while building sustainable business.\n\n\n\n\n\nNARRATIVE TRANSFORMATION FOR CARDANO:\n\nCURRENT CARDANO NARRATIVE: ;Third-generation blockchain with peer-reviewed research, proof-of-stake consensus, and smart contract capabilities\n\nTechnical audience: Developers, crypto investors\n\nPublic perception: Another cryptocurrency\n\nMainstream appeal: Limited\n\n\n\nAIRCHAIN ADDS: The blockchain that saves lives by democratizing environmental data in African megacities\n\nExpanded audience: Mainstream media, impact investors, government agencies, general public\n\nPublic perception: Technology solving real problems;\n\nMainstream appeal: Universal (everyone breathes)\n\nThis narrative shift matters because:\n\nMedia coverage: Blockchain saves lives resonates beyond crypto echo chamber (target: BBC Africa, Al Jazeera, Reuters)\n\nAcademic credibility: Peer-reviewed papers in Nature, Science, Lancet validate utility beyond finance\n\nImpact investment: ESG-focused funds seek measurable social impact (AirChain provides clear metrics)\n\nNo other Cardano project creates this narrative opportunity. NFT projects, DeFi protocols, and DAO tools serve the crypto-native community. AirChain bridges to mainstream audiences who've never heard of Cardano—and gives them reason to care.\n\n\n\n\n\nECOSYSTEM MULTIPLIER EFFECT:\n\nAirChain isn't just one project—it's a blueprint enabling derivative projects:\n\n**IMMEDIATE REPLICATION POTENTIAL:**\n\nWater quality monitoring (same architecture, different sensors)\n\nWeather station networks (similar hardware, meteorological sensors)\n\nSoil nutrient monitoring (agricultural applications)\n\nRadiation monitoring (nuclear safety, environmental protection)\n\n\n\nESTIMATED IMPACT: 2-3 projects will fork AirChain codebase within 18 months\n\n\n\nOPEN-SOURCE CONTRIBUTIONS: We will release:\n\nMerkle tree implementation (PyCardano reference code)\n\nDePIN Blueprint (20-page comprehensive documentation on the implementation of optimised remote sensing for blockchain in zero connectivity environments)\n\n\n\nECOSYSTEM VALUE: Each derivative project saves thousands of ADA in development costs (leverage our R&amp;D). If multiple projects fork AirChain’s Merkle tree implementation library , the  ecosystem gains much more ADA in effective value from our 170,000 ADA investment.\n\nNo other Catalyst project creates this level of ecosystem leverage. Most projects benefit only themselves; AirChain creates entire DePIN category.\n\n\n\n\n\n\n\nCOMPARISON TO EXISTING CARDANO PROJECTS:\n\nNFT PROJECTS: Creative/collectible focus, speculative value, crypto-native audience\n\nAirChain: Public health focus, measurable lives saved, mainstream audience\n\nDEFI PROTOCOLS: Financial primitives, trading/lending, requires blockchain knowledge\n\nAirChain: Physical infrastructure, environmental protection, accessible to anyone\n\nDAO TOOLS: Governance mechanisms, coordination, serves blockchain communities\n\nAirChain: Real-world sensors, data collection, serves 20 million Lagosians (most never heard of Cardano)\n\nWALLET/INFRASTRUCTURE: Developer tools, technical audience\n\nAirChain: User-facing application, general public\n\nAirChain occupies entirely new position in Cardano ecosystem. It's not better/worse than existing projects—it's fundamentally different category.\n\n\n\n\n\nWHY CARDANO NEEDS THIS:\n\nTRANSACTION VOLUME: Cardano needs sustained high-volume real-world usage to demonstrate infrastructure capacity. AirChain provides 10,000 predictable daily transactions indefinitely.\n\nAFRICAN ADOPTION: Cardano's mission includes financial inclusion in developing nations. AirChain proves Cardano works in challenging African infrastructure conditions.\n\nMAINSTREAM CREDIBILITY: Cardano needs success stories that resonate beyond crypto enthusiasts. Blockchain saves 500+ lives annually achieves this.\n\nSUSTAINABLE MODELS: Ecosystem needs projects that become self-funding businesses (not perpetual grant seekers). AirChain demonstrates path to profitability.\n\nDEPIN CATEGORY: As DePIN emerges as major blockchain use case, Cardano needs flagship projects. AirChain becomes reference implementation.\n\n\n\nSUMMARY: NOT INCREMENTAL, TRANSFORMATIONAL\n\nThis isn't just another token or improved wallet or faster DEX\n\nThis is entirely new to Cardano:\n\nEnvironmental monitoring DePIN at scale\n\nGovernment-validated infrastructure\n\nMeasurable lives saved (WHO methodology)\n\nMillions of sustained transactions\n\nAfrican megacity deployment\n\nSelf-sustaining business model\n\nBlueprint for ecosystem category\n\nAirChain doesn't improve what exists on Cardano.\n\nAirChain creates what doesn't exist on Cardano.\n\nThat's what makes it new.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"AIRCHAIN MVP: BLOCKCHAIN-VERIFIED ENVIRONMENTAL MONITORING AT SCALE\n\n\n\nAirChain demonstrates that blockchain-verified air quality monitoring can operate at scale in challenging African infrastructure conditions while saving measurable lives.\n\n\n\nUnlike typical Catalyst proposals that promise future development, AirChain has already built core technology — Catalyst funding scales proven systems to production.\n\n\n\nOPERATIONAL TODAY (VERIFY NOW)\n\n\n\nWorking Backend Infrastructure\n\n\n\nDashboard: airchain.ng/dashboard Real-time air quality map showing sensor locations, PM2.5/PM10/CO2 readings, temperature/humidity data. React frontend, Leaflet.js maps, Chart.js visualizations, <200ms average response time. Operational since September 2025, accessible on all devices without login.\n\n\n\nAPI Endpoints: api.airchain.ng Health check at api.airchain.ng/health returns 200 OK. FastAPI (Python 3.11), RESTful architecture, documentation at docs.airchain.ng.. Keycloak OAuth2/OIDC + API key validation tested with 50+ users. Endpoints: /sensors, /readings, /stats.\n\n\n\nDatabase: PostgreSQL 14.x with PostGIS extension. Partitioned tables, optimized indexes, <50ms query times. Kubernetes on AWS with Azure backup, HA setup, load balancer, daily backups (30-day retention). Grafana dashboards, Sentry error tracking, Prometheus metrics.\n\n\n\nCost: $1,800 already spent (personal investment, not seeking reimbursement).\n\n\n\nCardano Blockchain Integration (Preprod Validated)\n\n\n\nAIRQ Token Minted: 1,000,000,000 AIRQ fixed supply on Cardano Preprod testnet\n\n\n\nPolicy ID: 662d955b78b24518c8c1afdd334e77e714b6910a52cc06b0c28f3593\n\n\n\nTransaction: preprod.cardanoscan.io/transaction/25766fc9fc682b05280c3e748af1920fc4838e3c8020c7ff5e1430b1bee9624c\n\n\n\nPyCardano Integration: Wallet management, transaction building, Merkle tree anchoring tested 1,000+ times\n\n\n\nTest Results: 1,000+ successful transactions, 100% success rate, <30s confirmation, ~0.18 ADA per batch\n\n\n\nHardware Prototypes (6 Months Field-Tested)\n\n\n\nTesting Period: May–Oct 2025, Lagos & Akwa Ibom, 5 locations, 4 prototypes deployed\n\n\n\nSpecs (Final V5): Raspberry Pi Pico W, PMS5003, DHT22, MQ-135 sensors Solar + battery power, LTE backup, IP65 enclosure Cost $38.50/unit (bulk discount)\n\n\n\nField Results: 7-day autonomy, survived monsoon rains ±15% accuracy vs reference <2% failure 142 days uptime\n\n\n\n95% data completeness\n\n\n\nEvolution: V1 (20% fail) → V5 (<2%, production-ready)\n\n\n\nPersonal Investment: $5,000+ (backend, hardware, marketing)\n\n\n\nFUNDED MVP MILESTONES (170,000 ADA)\n\n\n\nMilestone 1 (Months 1–2): Validated Pilot\n\n\n\n50 sensors deployed\n\n\n\n94% uptime\n\n\n\nDashboard live\n\n\n\n±15% accuracy\n\n\n\n50 operators trained\n\n\n\n10,000+ readings anchored\n\n\n\nMilestone 2 (Months 3–4): Mainnet Integration\n\n\n\nSmart contracts deployed\n\n\n\nAIRQ listed on Minswap/SundaeSwap\n\n\n\nAutomated token distribution\n\n\n\n10,000+ readings anchored\n\n\n\nMilestone 3 (Months 5–8): Scale to 1,000 Sensors\n\n\n\n1,000 sensors across Lagos\n\n\n\n95% uptime\n\n\n\nMobile app launched\n\n\n\n$25,000 revenue\n\n\n\n15+ premium subscribers\n\n\n\nMilestone 4 (Months 9–11): Sustainability Demonstrated\n\n\n\nRevenue ≥ costs for 2 months\n\n\n\nGovernance platform live\n\n\n\nAcademic paper submitted\n\n\n\nExpansion plan published\n\n\n\n20+ subscribers\n\n\n\nMilestone 5 (Month 12): Final Close-Out\n\n\n\nFinal report\n\n\n\nDePIN Blueprint\n\n\n\nCardano Summit presentation\n\n\n\nOpen-source release\n\n\n\nExternal audit\n\n\n\nPUBLIC VERIFICATION (ANYONE CAN CHECK)\n\n\n\nNon-Technical Users: dashboard, mobile app, monthly reports\n\n\n\nTechnical Users: API, GitHub, Cardanoscan\n\n\n\nResearchers: datasets, papers, government partnership verification\n\n\n\nCatalyst Community: progress reports, AMAs, financial transparency\n\n\n\nPROOF VS VAPORWARE\n\n\n\nMost Proposals: “We WILL build…” (future tense, 0% complete, high risk)\n\n\n\nAirChain: “We HAVE built, now we scale” (present tense, 80% complete, minimal risk)\n\n\n\nRisk Assessment:\n\n\n\nBackend: COMPLETE (0% risk)\n\n\n\nCardano Integration: TESTED (5% risk)\n\n\n\nHardware: PROVEN (10% risk)\n\n\n\nOverall Project Risk: 15–20%\n\n\n\nMVP DEMONSTRATES\n\n\n\nTechnical Viability: 1,000 sensors reliable in Lagos\n\n\n\nBlockchain Utility: Millions of Cardano transactions\n\n\n\nSocial Impact: 500+ lives saved annually (WHO methodology)\n\n\n\nFinancial Sustainability: Revenue ≥ costs by Month 18\n\n\n\nEcosystem Value: Open-source blueprint enabling derivative projects\n\n\n\nThis isn’t a promise of future development.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"AIRCHAIN SUCCESS METRICS\n\n\n\nAirChain's success will be measured across multiple dimensions, with primary emphasis on Cardano blockchain metrics that anyone can verify independently.\n\n\n\nUnlike speculative projections, these metrics are deterministic, publicly verifiable, and impossible to fabricate.\n\n\n\nDIMENSION 1: BLOCKCHAIN INTEGRATION (100% ON-CHAIN VERIFIABLE)\n\n\n\nThese metrics are the gold standard because they're recorded immutably on Cardano's public blockchain — no trust required.\n\n\n\nPRIMARY ON-CHAIN METRICS\n\n\n\nDaily Cardano Transactions Target: 10,000 transactions daily (once 1,000 sensors deployed) Calculation: 1,000 sensors × 10 data anchors per day Verification: Cardanoscan explorer — search wallet addresses, count daily transactions\n\n\n\nMilestone progression: • Month 2 (Pilot): 500 TX/day • Month 4 (Mainnet): 1,000 TX/day • Month 8 (Full deployment): 10,000 TX/day • Month 12 (Mature network): 10,000 TX/day sustained\n\n\n\nAnnual Transaction Volume Target: 3,650,000 transactions Year 1 5-year cumulative: 18.25 million transactions Verification: Sum all transactions from smart contract addresses Dashboard: dashboard.airchain.ng/blockchain-stats\n\n\n\nTransaction Success Rate Target: ≥99% successful transactions Verification: Cardanoscan transaction history (success vs failed) Acceptable failures: <1% due to congestion (automatic retry logic) Savings: 40× cost reduction via Merkle compression\n\n\n\nAIRQ Token Distribution Target: 150,000+ AIRQ tokens distributed Year 1 Verification: Token transaction history on Cardanoscan (Policy ID searchable) Distribution: Daily automated payments at 00:00 UTC Smart contract execution: Immutable record\n\n\n\nNew Cardano Wallet Activations Target: 1,000+ new wallets created Verification: Track addresses receiving first AIRQ distribution Ecosystem growth: 1,000 Africans onboarded to Cardano\n\n\n\nDEX Trading Volume Target: ≥$10,000 monthly trading volume (Minswap, Sundaeswap) Verification: DEX analytics dashboards Expected: 500 operators sell weekly × $5 average = $10,000/month\n\n\n\nBlockchain Data Integrity Proofs Target: 3,650,000 sensor readings anchored as Merkle roots Verification: Each Merkle root hash visible in transaction metadata Academic value: Researchers can cryptographically verify data integrity\n\n\n\nWHY THESE METRICS MATTER\n\n\n\nImpossible to fake: Immutable public record\n\n\n\nAnyone can verify: Just visit Cardanoscan\n\n\n\nObjective measurement: Numbers don’t lie\n\n\n\nEcosystem value: Demonstrates real-world Cardano usage at scale\n\n\n\nDIMENSION 2: NETWORK DEPLOYMENT & UPTIME (PUBLICLY VERIFIABLE)\n\n\n\nSensors Deployed Target: 1,000 by Month 8 Milestones: 50 → 100 → 1,000 → 950+ sustained Verification: Dashboard shows live sensor count\n\n\n\nNetwork Uptime Target: ≥95% sustained Verification: dashboard.airchain.ng/uptime (real-time + 30-day history) Quality threshold: Minimum 22 hours online per day\n\n\n\nGeographic Coverage Target: ≥70% of Lagos metropolitan area (20M population) Verification: GIS heatmap at airchain.ng/coverage Population served: ~14M Lagosians\n\n\n\nData Points Collected Target: 300,000+ monthly readings On-chain: 30,000 Merkle roots anchored monthly Verification: Dashboard counter + Cardano transactions\n\n\n\nDIMENSION 3: DATA QUALITY & ACCURACY (INDEPENDENTLY VALIDATED)\n\n\n\nData Validation Rate Target: ≥90% readings pass validation Verification: Monthly reports at airchain.ng/data-quality\n\n\n\nCross-Sensor Correlation Target: r > 0.85 for sensors within 5km Verification: Correlation heatmaps on dashboard\n\n\n\nCalibration Drift Target: <10% drift per quarter Maintenance: Monthly recalibration with LASEPA\n\n\n\nData Completeness Target: ≥95% completeness Expected: 288,000 daily readings On-chain verification: 28,800 anchoring TXs daily\n\n\n\nDIMENSION 4: COMMUNITY & SOCIAL IMPACT\n\n\n\nDashboard Users Target: 2M+ unique Lagos residents Year 1 Verification: Google Analytics\n\n\n\nAPI Usage Target: 10M+ API calls monthly Developer ecosystem: 20+ third-party apps\n\n\n\nLives Saved (WHO Methodology) Target: 500+ premature deaths prevented annually Methodology: WHO IER function Evidence: Surveys, hospital data, peer-reviewed study Validation: University of Lagos research\n\n\n\nDIMENSION 5: FINANCIAL SUSTAINABILITY\n\n\n\nYear 1 Revenue Target: $45,000 generated Breakdown: Hardware $30K, API $12K, Government $3K Verification: Stripe reports, bank statements, contracts Transparency: airchain.ng/finances\n\n\n\nDIMENSION 6: ECOSYSTEM IMPACT\n\n\n\nDePIN Blueprint Downloads Target: ≥50 downloads in first month Verification: GitHub + GitBook analytics\n\n\n\nDerivative Projects Target: ≥2 forks within 18 months Expected domains: Water, weather, soil monitoring\n\n\n\nMedia Coverage Target: 50+ articles mentioning “Cardano” + “air quality” Nigerian press: Guardian, Punch, Vanguard, TechCabal International: BBC Africa, Al Jazeera, Reuters\n\n\n\nCROSS-CUTTING SUCCESS INDICATOR: REPLICATION INQUIRIES\n\n\n\nAfrican Cities Expressing Interest Target: ≥5 cities inquire by Month 12 Candidates: Accra, Nairobi, Dakar, Abuja, Kano Future potential: 5,000–10,000 sensors (10–20M more TXs annually)\n\n\n\nREPORTING FREQUENCY TO CATALYST COMMUNITY\n\n\n\nQuarterly Milestones • 20–30 page reports • Video updates (7–10 minutes) • Academic progress reports • Community AMAs\n\n\n\nAnnual Close-Out • Final report (40+ pages) • Financial audit • Summit presentation • Academic papers submitted\n\n\n\nCARDANO BLOCKCHAIN provides immutable proof of 3.65 million transactions — the most objective success measure possible.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"OUR PROPOSED SOLUTION AND HOW IT ADDRESSES THE PROBLEM\n\nHOW WE PERCEIVE THE PROBLEM:\n\nAir pollution kills 11,200 Lagosians annually—31 deaths every single day—more than malaria and HIV/AIDS combined across Nigeria. Yet Lagos, a megacity of 20 million people, has only 3 functioning air quality monitors. That's 0.00015% coverage.\n\nThe problem isn't lack of technology—it's failed implementation models.\n\nTraditional approaches have catastrophically failed:\n\nGovernment Monitoring Failure:\n\nCost: $20,000+ per reference-grade station\n\nLagos has 3 stations for 20M people (1 station per 6.7M residents)\n\nProblem: Equipment sits broken because maintenance requires stable power, internet, and funding—none reliably available in Lagos\n\nResult: Citizens have zero real-time air quality data for 99.9% of the city\n\nPrivate Sector Failure:\n\nSubscription models: $50-200/month (99% of Lagosians can't afford—median income $150/month)\n\nCoverage: <10 sensors deployed (insufficient for 1,200km² city)\n\nData: Closed, proprietary, vulnerable to manipulation\n\nSustainability: Projects collapse when grant funding ends\n\nRoot Cause Analysis: Traditional solutions fail because they're centralized, expensive, and dependent on infrastructure (stable power/internet) that doesn't exist in Lagos. You cannot solve African infrastructure problems using Western infrastructure assumptions.\n\nThe Real Problem:\n\n20 million people make daily decisions (keep kids indoors? reschedule exercise? adjust asthma medication?) without critical health information\n\n500,000+ asthmatics cannot predict pollution spikes that trigger attacks\n\n2 million+ children's developing lungs are exposed with no parental warning system\n\n\n\nThis is information poverty causing health inequality.\n\nWHY WE CHOSE THIS APPROACH:\n\nAirChain's solution is designed specifically for African realities—not imported Western models that fail here.\n\nPRINCIPLE 1: DECENTRALIZATION OVER CENTRALIZATION\n\nInstead of 3 expensive government stations, deploy 1,000 low-cost community-owned sensors:\n\nHardware cost: $80 per unit (vs. $20,000 government stations = 99.6% cost reduction)\n\nCoverage: 250× better density per dollar invested\n\nResilience: If 10% fail, 90% keep working (centralized model: 1 station fails = total information loss)\n\nCommunity ownership: Operators maintain sensors because they earn AIRQ tokens (aligned incentives vs. government neglect)\n\nWhy this works: Distributed architecture matches Lagos infrastructure reality—intermittent power/internet affects individual sensors, not entire network.\n\nPRINCIPLE 2: BLOCKCHAIN FOR DATA INTEGRITY\n\nCardano blockchain provides three critical functions:\n\nCryptographic Proof Against Manipulation:\n\nEvery 10 sensor readings compressed into Merkle root hash\n\nHash anchored on Cardano mainnet (immutable, timestamped)\n\nAnyone can verify data hasn't been altered (government accountability)\n\nAcademic researchers trust data for health studies (peer-review requirement)\n\nToken Incentives for Sustainability:\n\nOperators earn 10 AIRQ tokens daily (automated smart contract distribution)\n\nCreates economic incentive to maintain sensors (vs. government neglect where maintenance has no personal benefit)\n\nToken value grows with network usage (aligned incentives: healthy network = valuable tokens)\n\nTransparent Public Record:\n\nAll transactions visible on Cardanoscan (no hidden data manipulation)\n\nPermanent audit trail for regulatory compliance (Paris Agreement reporting)\n\nPublic verification without trusting centralized authority\n\nWhy blockchain specifically: Traditional databases can be altered by administrators. Blockchain provides tamper-proof public record—critical when government and corporations have conflicts of interest around pollution data.\n\nWhy Cardano specifically:\n\nTransaction costs: ~0.02 ADA per batch (affordable at scale)\n\nSustainability: Proof-of-stake (not energy-intensive like Bitcoin)\n\nSmart contracts: Plutus enables automated token distribution\n\nAfrica focus: Cardano's mission aligns with African development\n\nPRINCIPLE 3: SOLAR-FIRST DESIGN\n\nLagos has unreliable grid power (daily outages), making traditional IoT impossible:\n\n10W solar panel + battery array: 7-day autonomy achieved (field-tested 6 months)\n\nWorks through rainy season: Prototypes survived 300mm+ Lagos monsoon rains\n\nZero grid dependency: Sensors operate regardless of power infrastructure\n\nCost-effective: Solar panel $5 (one-time) vs. grid connection $50/year ongoing\n\nWhy this works: Solar-first design accepts Lagos reality (unreliable power) rather than requiring infrastructure improvements that won't happen.\n\nPRINCIPLE 4: DUAL-TIER ACCESS MODEL\n\nBalance public good with financial sustainability:\n\nFREE Tier (Universal Access):\n\nReal-time air quality map for all 20M Lagosians\n\nSMS pollution alerts (partnership with MTN Nigeria)\n\nMobile app (free download, Android)\n\n7-day historical data via public API\n\nHealth recommendations based on AQI\n\nPREMIUM Tier (Revenue Generation):\n\n30-day pollution forecasts (machine learning models)\n\nEnterprise compliance reporting (Paris Agreement, WHO standards)\n\nCustom analytics and bulk downloads\n\nWhite-label dashboard integration for B2B customers\n\nGovernment contracts (LASEPA data access agreement)\n\nWhy this model: Universal free access serves public good (2M+ citizens) while enterprise revenue ($45K Year 1 target) funds operations without perpetual grant dependency. Sustainable business = indefinite Cardano transactions without repeat funding.\n\n.\n\nWHO THIS SOLUTION ENGAGES:\n\nPRIMARY BENEFICIARIES (20 Million Lagosians):\n\n500,000+ Asthmatics:\n\nReal-time pollution warnings enable preventive action (keep rescue inhaler ready, avoid outdoor exercise)\n\nReduces emergency hospital visits (currently 20% of Lagos ER admissions during high pollution)\n\n2 Million+ Parents:\n\nProtect children's developing lungs (WHO: 93% of world's children breathe toxic air)\n\nMake informed decisions (keep kids indoors during spikes, schedule outdoor activities during clean air)\n\nGeneral Population:\n\nAnyone with smartphone accesses free real-time data (dashboard, mobile app)\n\nSMS alerts reach feature-phone users (majority in Lagos)\n\nUniversal health protection regardless of income/education\n\nCARDANO ECOSYSTEM:\n\n1,000+ Nigerians onboarded (wallet creation, token management, DEX trading)\n\n3.65M guaranteed annual transactions (10,000 daily, sustained predictably)\n\nDePIN blueprint enables derivative projects (water quality, weather, soil monitoring)\n\nRESEARCHERS & ACADEMICS:\n\nUniversity of Lagos collaboration: Blockchain-verified data enables health impact studies\n\nPeer-reviewed papers: Air pollution-health correlations previously impossible in Lagos\n\nOpen datasets: Free anonymized data for academic research (public good contribution)\n\nCARDANO DEVELOPERS:\n\nOpen-source DePIN architecture (reference implementation for other builders)\n\nPyCardano Merkle tree code (reusable for IoT applications)\n\nSmart contract patterns (automated token distribution at scale)\n\nHOW WE DEMONSTRATE AND PROVE IMPACT:\n\nAIRQ Token Distribution:\n\nVerification: Token transaction history on Cardanoscan (Policy ID publicly searchable)\n\nTarget: 150,000+ tokens distributed Year 1 (1,000 operators × 10/day × 15 days avg)\n\nEvidence: Daily automated distributions timestamped on blockchain\n\nProof of operation: If tokens distributing, sensors must be operating\n\nSmart Contract Execution:\n\nVerification: Contract execution logs on Cardanoscan\n\nTarget: 100% uptime (365 consecutive successful daily distributions)\n\nEvidence: Zero failed distributions for 12 months = robust system\n\nLEVEL 2: INDEPENDENT VALIDATION (GOVERNMENT & ACADEMIC)\n\nUniversity of Lagos Research:\n\nMethod: Academic health impact study using WHO Integrated Exposure-Response methodology\n\nTarget: 500+ lives saved annually (preventable deaths from behavioral changes enabled by warnings)\n\nEvidence: Peer-reviewed paper submitted to journal (IF ≥3.0)\n\nVerification: Paper cites blockchain-verified AirChain data\n\nTimeline: Draft Month 6, submission Month 9, publication 12-18 months\n\nCross-Sensor Validation:\n\nMethod: Nearby sensors (within 5km) should correlate (Pearson r > 0.85)\n\nTarget: 90%+ readings pass statistical validation\n\nEvidence: Correlation matrices published weekly at dashboard.airchain.ng/validation\n\nOutlier handling: <10% flagged for investigation/recalibration\n\nLEVEL 3: PUBLIC DASHBOARD (REAL-TIME VERIFICATION\n\nReal-Time Data Quality:\n\nVerification: dashboard.airchain.ng (live map with current readings)\n\nDisplay: PM2.5, PM10, CO2, temperature, humidity from each sensor\n\nValidation: Color-coded sensors (green=good data, yellow=warning, red=outlier)\n\nUser feedback: Comments section for citizens to report issues\n\nLEVEL 4: USER ADOPTION METRICS\n\nDashboard Users:\n\nTarget: 2 million+ unique Lagos residents Year 1\n\nVerification: Google Analytics (public dashboard at airchain.ng/analytics)\n\nAPI Usage:\n\nTarget: 10 million+ API calls monthly (third-party developers building on platform)\n\nVerification: API analytics dashboard (public at docs.airchain.ng/stats)\n\nEcosystem signal: 20+ third-party apps indicates developer interest\n\nLEVEL 5: FINANCIAL SUSTAINABILITY\n\nRevenue Generated:\n\nTarget: $45,000 Year 1 (hardware + API + government)\n\nVerification: Monthly financial reports at airchain.ng/finances\n\nEvidence: Stripe statements, bank deposits, customer contracts (quarterly audit)\n\nBreak-even: Month 18 (revenue ≥ costs for 2 consecutive months)\n\nSelf-Sustainability Proof:\n\nTarget: ZERO repeat Catalyst funding (never apply again)\n\nEvidence: Financial statements showing profitable operations\n\nEcosystem value: Indefinite Cardano transactions from one-time investment\n\nWe're not asking Catalyst to fund R&D.\n\n We're asking Catalyst to fund manufacturing scale-up of proven technology.\n\nDevelopment risk: ZERO (technology exists)\n\n Catalyst risk: MINIMAL (scaling working system)\n\nTECHNOLOGY AS MEANS, NOT END:\n\nWe're not building \"a blockchain project.\" We're saving lives using blockchain as infrastructure.\n\nThe mission persists beyond any technology: Democratize environmental data to save 500+ Lagosians annually.\n\n\n\nBut the measure of success is lives saved, not transactions processed.\n\n That's what matters.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"POSITIVE IMPACT ON THE WIDER CARDANO COMMUNITY\n\nAirChain brings measurable value to Cardano across 6 strategic dimensions:\n\nDIMENSION 1: TRANSACTION VOLUME & NETWORK ACTIVITY\n\nGUARANTEED TRANSACTION GROWTH:\n\n\n\nDaily: 10,000 transactions (1,000 sensors × 10 anchoring events/day)\n\nAnnual: 3,650,000 transactions (deterministic, not speculative)\n\n5-year cumulative: 18.25 million (self-sustaining, no repeat funding)\n\n\n\nTRANSACTION EFFICIENCY BENCHMARK:\n\n\n\nAirChain: 0.047 ADA per TX (170,000 ADA ÷ 3.65M transactions)\n\nTypical Catalyst: 5-10 ADA per transaction\n\nAirChain efficiency: 100-200× BETTER\n\n\n\nSUSTAINED PREDICTABLE LOAD:\n\n\n\nNot speculative (DeFi trading spikes) or seasonal (NFT cycles)\n\nDeterministic: Sensors operating = transactions occurring\n\nResilient: 1,000 distributed operators (no single point of failure)\n\n\n\nWHY THIS MATTERS:\n\nCardano needs sustained transaction volume proving real-world utility beyond speculation. AirChain provides millions of predictable transactions demonstrating blockchain works for public infrastructure.\n\nDIMENSION 2: DEPIN CATEGORY LEADERSHIP\n\nSTRATEGIC POSITIONING:\n\n\n\nLargest DePIN by transaction volume in Africa\n\nFirst environmental monitoring network using Cardano at scale\n\nProves blockchain works despite infrastructure challenges (unreliable power/internet)\n\n\n\nDERIVATIVE PROJECTS (12-24 months):\n\n\n\nWater quality monitoring (same architecture, different sensors)\n\nWeather station networks (similar hardware, meteorological sensors)\n\nSoil monitoring (agricultural applications)\n\nRadiation monitoring (environmental protection)\n\nEstimated: 2-3 projects fork AirChain codebase within 18 months\n\n\n\nDEVELOPER ECOSYSTEM GROWTH:\n\n\n\n5+ developers contribute to open components (GitHub)\n\n10+ academic papers studying blockchain for environmental monitoring\n\nCardano DePIN Working Group gains credible case study\n\n\n\nMEDIA & NARRATIVE IMPACT:\n\n\n\n\"Cardano Saves Lives\" reaches mainstream press\n\nTarget: 50+ articles mentioning \"Cardano\" + \"air quality\"\n\nNigerian media: Guardian, Punch, Vanguard, TechCabal\n\nInternational: BBC Africa, Al Jazeera, Reuters\n\nAcademic: Nature, Science, Environmental Health Perspectives citations\n\n\n\nWHY THIS MATTERS:\n\nDePIN is emerging category with massive potential. Cardano needs flagship success stories. AirChain becomes the reference implementation for decentralized physical infrastructure.\n\nDIMENSION 3: AFRICAN ADOPTION & GEOGRAPHIC EXPANSION\n\nIMMEDIATE IMPACT:\n\n\n\n1,000+ Nigerians onboarded to Cardano ecosystem\n\nFirst major Nigerian government agency using Cardano (LASEPA)\n\nProof Cardano works in challenging environments\n\n\n\nREPLICATION POTENTIAL (5 Cities by 2027):\n\n\n\nAccra, Ghana: 500-1,000 sensors potential\n\nNairobi, Kenya: 1,000-2,000 sensors potential\n\nDakar, Senegal: 500 sensors potential\n\nAbuja, Nigeria: 1,000 sensors potential\n\nKano, Nigeria: 1,000 sensors potential\n\n\n\nTOTAL POTENTIAL:\n\n\n\n5,000-10,000 sensors across Africa\n\n10-20 million additional annual Cardano transactions\n\n5,000+ Africans onboarded\n\nInvestment: 100-300K ADA per city (proven model, lower risk)\n\n\n\nWHY THIS MATTERS:\n\nAfrica is 1.4 billion people with massive infrastructure needs. AirChain proves Cardano solves real African problems, opening door for widespread adoption. Success in Lagos catalyzes continental expansion.\n\nDIMENSION 4: OPEN-SOURCE CONTRIBUTION\n\nWHAT WILL BE OPEN-SOURCED:\n\n✓ Hardware assembly guides (BOM, schematics, 3D files)\n\n✓ Basic sensor firmware (MicroPython, MQTT)\n\n✓ Backend API patterns (FastAPI authentication)\n\n✓ Frontend dashboard templates (React + Leaflet)\n\n✓ Blockchain integration (PyCardano Merkle tree)\n\n✓ DePIN Blueprint (80+ page deployment guide)\n\n✓ Tutorial series: \"Building DePIN on Cardano\" (10+ videos)\n\nEXPECTED IMPACT:\n\n\n\n2-3 projects fork components within 18 months\n\n100+ developers learn DePIN architecture\n\n50+ Blueprint downloads first month\n\nCardano reputation: \"Builder-friendly for real-world applications\"\n\n\n\nWHAT REMAINS PROPRIETARY:\n\n\n\nPollutant source identification (patent-pending)\n\nML forecasting models (competitive advantage)\n\nPremium analytics (revenue generator)\n\n\n\nWHY THIS MATTERS:\n\nOpen components enable other builders to create Cardano DePIN projects faster/cheaper. AirChain spawns entire ecosystem of derivative projects.\n\nDIMENSION 5: NARRATIVE & MAINSTREAM CREDIBILITY\n\nBRAND PERCEPTION EVOLUTION:\n\nCurrent: \"Third-generation blockchain,\" \"Peer-reviewed research,\" \"Proof-of-stake\"\n\nAirChain Adds: \"Blockchain that saves lives,\" \"Environmental protection,\" \"Public health infrastructure\"\n\nAUDIENCE EXPANSION:\n\n\n\nMainstream media (human interest, not crypto-only)\n\nImpact investors (ESG focus, SDG alignment)\n\nGovernment agencies (proof blockchain solves public problems)\n\nAcademic institutions (research beyond finance)\n\nGeneral public (universal concern—everyone breathes)\n\n\n\nMEDIA COVERAGE TARGETS:\n\n\n\nNigerian press: 20+ articles (Guardian, Punch, Vanguard)\n\nAfrican tech: 15+ articles (TechCabal, Disrupt Africa)\n\nInternational: 5-10 articles (BBC Africa, Al Jazeera, Reuters)\n\nAcademic: 2-3 peer-reviewed papers Year 1, 10+ by Year 3\n\n\n\nCARDANO SUMMIT PRESENTATION:\n\nTitle: \"From 3 Stations to 1,000 Sensors: How AirChain Brought Air Quality Data to 20 Million Lagosians\"\n\n\n\nLive demo: 1,000 sensors real-time\n\nCardanoscan: Millions of transactions verified\n\nLASEPA testimonial: Government validation\n\nOperator interviews: Community impact\n\nHealth study preview: Academic credibility\n\n\n\nWHY THIS MATTERS:\n\n\"Blockchain saves lives\" resonates beyond crypto enthusiasts. This narrative brings mainstream credibility and attracts next wave of adoption.\n\nDIMENSION 6: TOKEN UTILITY & DEFI INTEGRATION\n\nAIRQ TOKEN ON CARDANO:\n\n\n\nDEX listings: Minswap, Sundaeswap (AIRQ/ADA pairs, Month 4)\n\nTrading volume: ~$130,000 Year 1 (500 operators trading weekly)\n\nReal utility: Hardware purchases (20% discount), API access, governance voting\n\nValue accrual: Network usage drives token value (not just speculation)\n\n\n\nDEMONSTRATION OF SUSTAINABLE TOKENOMICS:\n\n\n\nProves utility tokens have real value (not memecoins)\n\nRevenue funds operations (self-sustaining model)\n\nPath from speculation to utility (trading → usage → value)\n\n\n\nWHY THIS MATTERS:\n\nCardano needs examples of tokens with genuine utility beyond DeFi speculation. AIRQ demonstrates sustainable model where value derives from real-world network usage.\n\nECOSYSTEM CREDIBILITY\n\nWHAT SUCCESS PROVES:\n\nTechnical:\n\n✓ Cardano handles real-world IoT at scale (10,000 TXs/day)\n\n✓ Smart contracts work for public infrastructure (not just DeFi)\n\n✓ Native tokens enable sustainable businesses (not speculation)\n\nSocial:\n\n✓ Blockchain solves real problems (not crypto speculation)\n\n✓ Cardano works in challenging environments (Africa, unreliable infrastructure)\n\n✓ Decentralization benefits society (not just ideology)\n\nBusiness:\n\n✓ Cardano enables profitable businesses (not grant-dependent)\n\n✓ RealFi is viable (not theoretical)\n\n✓ Sustainable models exist (not perpetual fundraising)\n\nRISK ASSESSMENT:\n\nLow risk—technology already proven (backend operational, partnerships secured, hardware tested, $15K invested)\n\nNO SCENARIO where Cardano reputation is harmed. Only upside.\n\nCOMMUNITY ENGAGEMENT\n\nMONTHLY: Progress reports, blog posts, Twitter threads, AMAs (Discord/Telegram)\n\nQUARTERLY: Milestone reports (20-30 pages), video updates, working papers\n\nANNUAL: Impact report (40+ pages), financial audit, Summit presentation, peer-reviewed papers\n\nONGOING: Public dashboard (dashboard.airchain.ng), Cardanoscan verification, API docs, GitHub\n\nOPPORTUNITIES CREATED:\n\n\n\nDevelopers: Contribute to open-source, build third-party apps, fork for other monitoring types\n\nResearchers: Access blockchain-verified data, collaborate on studies, co-author papers\n\nEntrepreneurs: Become operators, resell sensors, build B2B analytics\n\nGovernments: Adopt affordable monitoring, replicate model, regional collaboration\n\n\n\nSUMMARY: MEASURABLE CARDANO VALUE\n\nIMPACT:\n\n✓ 3.65M guaranteed transactions annually (0.047 ADA/TX = 100-200× efficiency)\n\n✓ 1,000+ Africans onboarded\n\n✓ 500+ lives saved/year (WHO methodology)\n\nSTRATEGIC VALUE:\n\n✓ DePIN category leadership in Africa\n\n✓ \"Blockchain saves lives\" mainstream narrative\n\n✓ Government validation (LASEPA partnership)\n\n✓ Academic credibility (peer-reviewed papers)\n\nECOSYSTEM EXPANSION:\n\n✓ Blueprint for 2-3 derivative projects\n\n✓ 5-10 African cities replication potential (10-20M more TXs)\n\n✓ Developer community growth (100+ learn DePIN)\n\nSUSTAINABILITY:\n\n✓ Break-even Month 18 (self-funding thereafter)\n\n✓ Zero repeat Catalyst funding\n\n✓ Profitable business (not perpetual grant seeker)\n\nThis is transformational demonstration of Cardano's real-world utility.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"EXISTING CAPABILITIES AND WHY WE ARE BEST SUITED TO DELIVER THIS PROJECT\n\n\n\nAirChain has already moved far beyond the idea stage. Over the past six months, we have built and field-tested an operational end-to-end system—hardware, backend, dashboard, blockchain integration, and data infrastructure. Catalyst funding will not be used for experimentation, but for scaling manufacturing from a handful of units to 1,000 deployed sensors. Our capabilities are proven, measurable, and verifiable today.\n\n\n\n1. OPERATIONAL TECHNOLOGY (BUILT, DEPLOYED, AND VERIFIABLE)\n\n\n\nWe are not presenting a concept—we are presenting a functioning system.\n\n\n\nBackend Infrastructure\n\n\n\nOur backend stack is production-ready, stable, and designed for scalability:\n\n\n\nFastAPI deployed on Kubernetes (v2.1.4)\n\n\n\nPostgreSQL database optimized for time-series sensor ingestion\n\n\n\nKeycloak authentication (OAuth2/OIDC + API keys)\n\n\n\nMQTT broker supporting 10,000+ concurrent device connections\n\n\n\nReal-time WebSocket stream for dashboards and mobile clients\n\n\n\nPublic health endpoint (testable anytime): [https://api\\.airchain\\.ng/health](https://api.airchain.ng/health)\n\n\n\nLive Dashboard\n\n\n\nA fully functional dashboard is online and displays real-time and historical air-quality data:\n\n\n\nReact + Leaflet map visualizations\n\n\n\nChart.js analytics, AQI computation, operator performance data\n\n\n\nLive deployment: [https://dashboard\\.airchain\\.ng](https://dashboard.airchain.ng)\n\n\n\nCardano Integration\n\n\n\nWe have already built and successfully tested our blockchain infrastructure on Preprod:\n\n\n\nAIRQ token minted (1B supply)\n\n\n\nSmart distribution workflow using PyCardano\n\n\n\nOver 1,000 successful test transactions (100% success rate)\n\n\n\nMerkle-tree anchoring and hashing for data integrity\n\n\n\nField-Tested Hardware\n\n\n\nOur hardware has been tested across real Lagos environmental conditions:\n\n\n\n5 prototype iterations tested over 6 months\n\n\n\nSurvived heavy rainfall and inconsistent power conditions\n\n\n\nAchieved 7-day battery autonomy\n\n\n\nLess than 2% hardware failure rate after field exposure\n\n\n\nFirmware improvements validated through successive stress tests\n\n\n\nThis track record demonstrates that AirChain’s core technology is not theoretical—it's operational and resilient.\n\n\n\n2. VERIFIED FINANCIAL DISCIPLINE ($11,000 INVESTED & ACCOUNTED FOR)\n\n\n\nWe have already invested $11,000 of personal funds into R&D, infrastructure, hardware, and testing. Every expense is tracked with receipts, invoices, and account statements.\n\n\n\nExamples:\n\n\n\nAWS hosting (1 year prepaid): $1,800\n\n\n\nHardware components for prototypes: $2,700\n\n\n\nBranding, web assets, cloud services: $1,300\n\n\n\nTools, testing equipment, and fabrication materials: $1,400\n\n\n\nBlockchain development and testnet operations: $800\n\n\n\nMiscellaneous engineering costs: $1,500\n\n\n\nA full ledger is available for Catalyst reviewers.\n\nThis demonstrates transparency, responsible budgeting, and an ability to manage project funds effectively.\n\n\n\n3. A HIGH-COMPETENCY, EXECUTION-FOCUSED TEAM\n\nAbdulazeez Bello — Founder & Lead Engineer\n\n\n\nEmbedded systems engineer with 6 years practical experience\n\n\n\nExpertise in Rust, Python, MicroPython, FastAPI, Kubernetes, PostgreSQL, PyCardano\n\n\n\nBuilt backend, firmware, blockchain integrations, and hardware prototypes\n\n\n\nDocumented technical architecture (70+ pages)\n\n\n\nFully committed full-time to AirChain\n\n\n\nVictor Ekanem — DevOps Engineer\n\n\n\n8+ years experience managing production systems on AWS and Azure\n\n\n\nExpert in Kubernetes, CI/CD, SRE workflows, Terraform, monitoring and logging\n\n\n\nCritical for scaling from prototype to national-scale distributed sensor network\n\n\n\nEdidiong Udoh — Fabrication Engineer\n\n\n\n6+ years experience (Foxconn, Jabil) in manufacturing workflows\n\n\n\nSpecializes in PCB assembly, injection molding, and quality control\n\n\n\nEnsures that AirChain can manufacture 1,000+ units reliably and at scale\n\n\n\nPhillip Ekpo — IoT Firmware Engineer\n\n\n\nExpertise in OTA updates, MQTT optimization, battery efficiency, connectivity resilience\n\n\n\nNdanso Udoh — Community & Field Operations\n\n\n\nExperienced in community deployment, device placement strategies, and operator training\n\n\n\nThe team combines global enterprise experience with deep local understanding of infrastructure and deployment realities in Lagos.\n\n\n\n4. FUTURE TARGET PARTNERSHIPS (NOT YET ENGAGED)\n\n\n\nWe intentionally avoid overstating partnerships. We are not yet in discussion with any agency, but we have clear strategic alignment with:\n\n\n\nLagos Metropolitan Area Transport Authority (LAMATA)\n\n\n\nAirChain aims to integrate environmental data into transportation planning, bus corridors, and mobility infrastructure. LAMATA’s long-term goals align with our ability to map pollution hotspots and support public-health-aligned transit decisions.\n\n\n\nEnvironmental Regulatory Bodies (Future Targets)\n\n\n\nAlthough no discussions have started yet, we plan to engage agencies responsible for environmental monitoring and public-health policy once our 1,000-sensor network is operational.\n\n\n\nThese are target partnerships only, included to show our long-term deployment strategy—not current relationships.\n\n\n\n5. WHY WE ARE BEST SUITED TO DELIVER THIS PROJECT\n\nA. Technology Already Works\n\n\n\nBackend, dashboard, blockchain logic, and hardware have all been successfully tested. We are not experimenting; we are scaling.\n\n\n\nB. Global-Standard Engineering\n\n\n\nOur DevOps and fabrication engineers bring high-level production expertise, enabling us to operate with enterprise-grade reliability.\n\n\n\nC. Local Knowledge & Infrastructure Reality\n\n\n\nWe understand Lagos challenges: intermittent power, unstable networks, customs delays, and harsh weather. Our engineering reflects these realities.\n\n\n\nD. Founder Commitment\n\n\n\nFull-time dedication and personal financial investment ensure long-term accountability.\n\n\n\nE. Incubator Oversight\n\n\n\nBuild A Tech Workspace provides governance, strategic guidance, and operational accountability—reducing project risk.\n\n\n\nF. Strong Alignment With the Cardano Ecosystem\n\n\n\nAs active PyCardano contributors, we deeply understand Cardano’s architecture and its suitability for real-world incentive models.\n\n\n\n6. FUND MANAGEMENT PROCESSES: HOW WE GUARANTEE TRUSTWORTHINESS\n\n1. Milestone-Based Disbursement\n\n\n\nFunds are only accessed after Catalyst community verification.\n\nEvidence includes:\n\n\n\nPhotos, videos, and deployment maps\n\n\n\nGitHub commits and documentation\n\n\n\nBlockchain transaction records\n\n\n\nPerformance metrics from pilot deployments\n\n\n\n2. Full Public Budget Transparency\n\n\n\nA read-only public ledger tracks:\n\n\n\nAll expenses\n\n\n\nAll receipts\n\n\n\nBudget vs. actual\n\n\n\nVariances and explanations\n\n\n\n3. Strict Procurement Standards\n\n\n\nMinimum 3 supplier quotes\n\n\n\nVendor selection based on price, reliability, delivery time, and warranty\n\n\n\nNo team member has any financial interest in suppliers\n\n\n\n4. Personnel Accountability\n\n\n\nAll salaries paid via bank transfer\n\n\n\nContractors sign clear deliverable-based agreements\n\n\n\nWeekly time tracking and monthly performance reviews\n\n\n\n5. Auditable Financial Trail\n\n\n\nEncrypted storage of receipts\n\n\n\nQuarterly financial statements\n\n\n\nAnnual third-party audit\n\n\n\nPublic blockchain logs for all AIRQ token distributions\n\n\n\n6. Community Oversight Mechanisms\n\n\n\nMonthly AMA sessions\n\n\n\nDedicated community liaison\n\n\n\nAnonymous whistleblowing channel\n\n\n\nPublic GitHub repos showing real-time development\n\n\n\n7. Pilot Validation Before Scaling\n\n\n\nA 50-sensor pilot will test:\n\n\n\nHardware reliability\n\n\n\nBackend scalability\n\n\n\nData accuracy\n\n\n\nOperator engagement\n\n\n\nToken reward effectiveness\n\n\n\nWe only proceed to full-scale deployment if ≥80% of the pilot metrics succeed. If success criteria are not met, we revise, retest, or refund unused funds.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Pilot Deployment: Manufacturing, Training, Internal Calibration & 50-Sensor Field Validation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers a complete end-to-end pilot network of 50 AirChain sensors deployed across a 5 km² area in Lagos. It provides the first real-world validation of hardware reliability, operator readiness, calibration quality, and data pipeline stability. The pilot includes manufacturing 50 production-grade sensors, running operator onboarding workshops, launching a public dashboard with real-time data, and completing internal accuracy verification using the AirChain Calibration Bench v1 with ISO-certified reference equipment. The outcome of this milestone is to prove that AirChain’s hardware, backend, firmware, calibration process, dashboard, and token anchoring workflow are all stable and ready for scale. This pilot establishes baseline metrics including uptime, operator engagement, accuracy variance, and blockchain anchoring reliability. It also forms the foundation for system refinement, documentation, and backlog generation for the next deployment phases. By the end of the milestone, AirChain will demonstrate consistent uptime (≥94%), stable sensor connectivity, validated accuracy within ±15%, trained field operators, and a publicly accessible dashboard capable of handling live sensor traffic. This milestone proves operational readiness for expansion to hundreds of nodes.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"50 sensors manufactured, assembled, and deployed with GPS documentation\n\n– At least 50 operators trained with attendance verification\n\n– Public dashboard online at dashboard.airchain.ng with <3s response time\n\n– Firmware, assembly, and calibration documentation published on GitHub + YouTube\n\n– Network uptime ≥94% for 30 consecutive days (≥47 sensors consistently operational)\n\n– Accuracy validated within ±15% through internal calibration bench tests\n\n– ≥10,000 data points hashed and anchored on Cardano Preprod\n\n– Zero security breaches, downtime incidents, or data integrity issues\n\n– Operator satisfaction ≥80%, with ≥70% survey response rate\n\n– Complete milestone report and public communication published","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Deployment map with all 50 sensor coordinates publicly visible\n\n– Workshop attendance sheets with photos of all trained operators\n\n– Dashboard uptime graphs covering 30 days of operation\n\n– GitHub repository updates: assembly guide, calibration documentation, firmware\n\n– YouTube video (15 minutes) demonstrating assembly and calibration\n\n– Calibration Bench v1 comparison charts showing ±15% variance\n\n– Cardanoscan Preprod transaction feed showing ≥10,000 data entries\n\n– Internal security logs confirming zero incidents\n\n– Operator survey results exported from Google Forms\n\n– 15-page milestone report summarizing performance, challenges, and next steps\n\n– 5-minute field update video with deployment footage","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cardano Mainnet Integration: Smart Contracts, Token Distribution & DEX Listings","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone transitions AirChain from Preprod testing to full Cardano mainnet operations. It includes deploying all smart contracts, migrating reward logic, integrating the AIRQ token with the Cardano mainnet, and establishing liquidity pools on at least two major DEXs. The milestone also automates daily operator rewards, ensures seamless blockchain anchoring, and provides public API endpoints for verification. A professional third-party audit validates all smart contracts and identifies any vulnerabilities prior to deployment. The outcome is a production-grade blockchain layer capable of handling continuous data anchoring from sensors, daily automated rewards, and community-driven liquidity. By the end of this milestone, the token ecosystem will be operational, stable, and transparent. This prepares AirChain for large-scale sensor onboarding and ensures the financial and incentive mechanisms are fully functional for the next stage of deployment.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"– Smart contracts pass professional security audit with zero critical issues\n\n– All contracts deployed to Cardano mainnet with published TX hashes\n\n– AIRQ token listed on at least two DEXs (Minswap, SundaeSwap or equivalents)\n\n– Liquidity pools established with ≥5,000 AIRQ + 500 ADA per DEX\n\n– Daily reward automation demonstrates 100% success for 30 consecutive days\n\n– All 50 pilot operators receive rewards in live wallets (screenshots provided)\n\n– Blockchain operating cost maintained under 5 ADA/day during testing\n\n– API documentation published with full OpenAPI/Swagger support\n\n– Zero failed mainnet transactions during the validation period","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"– Published full security audit report (20+ pages)\n\n– Cardanoscan links for all smart contract deployments\n\n– Screenshots from DEXs showing AIRQ listings and pool creation\n\n– Liquidity dashboards confirming initial deposits\n\n– Cardanoscan logs verifying 30 days of uninterrupted reward distribution\n\n– Wallet screenshots from all 50 operators\n\n– Cost breakdown report for blockchain operations\n\n– API documentation live and accessible\n\n– Mainnet health dashboard screenshots\n\n– 20-page milestone summary report + 7-minute explanation video","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"caling to 500 Sensors + First Enterprise Contract + First NGO Partnership","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone expands the AirChain network from 50 to 500 sensors, marking the transition from a validated pilot to a city-scale environmental intelligence system. It includes manufacturing 450 additional sensors, recruiting and training 450 operators, procuring components through Nigerian customs, and building a 15% spare-part inventory buffer. The project reaches approximately 35% coverage of Lagos metro through deployment guided by GIS heatmapping. Revenue begins through three channels: hardware sales, premium API subscriptions, and the first enterprise contract with an environmental analytics firm, logistics hub, or industrial facility. Additionally, AirChain secures its first NGO or climate-health nonprofit partnership, supporting community education, data accessibility, or environmental stewardship. This milestone also includes launching a premium API with paid tiers and deploying the first version of the AirChain mobile app on the Google Play Store. The outcome demonstrates technical scalability, financial traction, and social impact partnerships that enable sustainable, long-term growth.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"450 new sensors fully assembled, quality-tested, and deployed\n\n– 450 new operators trained with verified attendance\n\n– Customs clearance documents provided for all imported components\n\n– Inventory buffer of ≥15% (equivalent to 75 sensors worth of components)\n\n– 500-sensor network achieves ≥95% uptime across 60 days\n\n– GIS analysis confirms ~35% metropolitan coverage\n\n– Revenue ≥$15,000 from hardware, subscriptions, and contracts\n\n– Premium API obtains ≥10 paying subscribers\n\n– Mobile app released on Google Play with ≥4.0 rating and ≥50 reviews\n\n– Signed enterprise customer contract (≥$3,000 annual value)\n\n– Signed NGO/nonprofit partnership supporting data access, outreach, or community usage","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"– Serial-number logs, test reports, and deployment map for all 500 sensors\n\n– Training photos + attendance sheets for 450 operators\n\n– Customs receipts for component imports\n\n– Inventory management screenshots showing spare-part buffer\n\n– 60-day uptime logs demonstrating ≥95% operational network\n\n– GIS heatmap confirming geographic coverage\n\n– Revenue documentation (Stripe logs, bank statements)\n\n– API subscriber list (anonymized)\n\n– Google Play Console screenshots (ratings, installs, reviews)\n\n– Copies of enterprise + NGO agreements\n\n– 25-page milestone report + 10-minute update video\n\n– Press coverage from Nigerian tech media","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Scaling to 1,000 Sensors + Governance Launch & Academic Validation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone brings AirChain to full city-scale deployment with 1,000 sensors, covering approximately 70% of Lagos metropolitan area. It introduces decentralized governance by enabling AIRQ holders to vote on proposals via a governance dashboard powered by on-chain smart contracts. The milestone includes publishing an academic paper submitted to a peer-reviewed environmental or engineering journal and producing a comprehensive expansion roadmap for AirChain’s rollout in Abuja and Port Harcourt. It also demonstrates operational maturity by delivering a 20% reduction in operational costs through optimized logistics, improved sensor efficiency, and scaling benefits. This milestone validates AirChain’s ability to scale technically, administratively, and scientifically, making it a replicable environmental intelligence framework for other African cities.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"– Total of 1,000 sensors manufactured, deployed, and operational\n\n– ≥95% uptime across 60 consecutive days (≥950 sensors active)\n\n– GIS heatmap confirms ~70% metro coverage\n\n– Cumulative revenue ≥$30,000 across all sources\n\n– Governance platform fully functional with UI + smart contracts\n\n– First governance vote executed with ≥500 AIRQ holders participating\n\n– Academic paper submitted to a peer-reviewed journal (impact factor ≥3)\n\n– 30+ page expansion roadmap for Abuja and Port Harcourt published\n\n– Documented 20% reduction in operational costs vs. Month 6","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"– Deployment map showing all 1,000 GPS sensor points\n\n– 60-day uptime history confirming ≥95% availability\n\n– GIS coverage heatmap exported from analytics dashboard\n\n– P&L report confirming $30,000 cumulative revenue\n\n– Live governance website + Cardanoscan voting records\n\n– Journal submission confirmation email\n\n– Published 30+ page expansion roadmap\n\n– Cost-reduction analysis comparing Month 6 vs Month 10\n\n– 25-page milestone report + 10-minute ecosystem video\n\n– Screenshots and links demonstrating community participation","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"inancial Sustainability, Audit & Final Catalyst Closeout","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This final milestone proves long-term sustainability and prepares AirChain for continued growth beyond Catalyst funding. It includes achieving two consecutive months where revenue exceeds operational costs, demonstrating that the model is self-sustaining. The milestone also includes growing the premium API subscriber base to at least 20 paying organizations, securing at least one additional enterprise or NGO customer contract, achieving ≥90% operator retention, and publishing the AirChain DePIN Blueprint—a comprehensive 80+ page guide enabling other cities to replicate the AirChain model. All codebases and hardware designs (non-proprietary components) will be open-sourced, and a full independent financial audit will be completed by a Nigerian accounting firm. The milestone concludes with a final 40+ page report, a 15-minute year-in-review video, and the delivery of a Cardano Summit presentation summarizing results, lessons, and impact.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Revenue ≥ monthly operating costs for two consecutive months\n\n– Network maintains ≥95% uptime for full 1,000-sensor deployment\n\n– ≥20 premium API subscribers paying monthly\n\n– At least one new enterprise or NGO contract valued at ≥$3,000/year\n\n– Operator retention ≥90% (≤10% churn across 1,000 operators)\n\n– AirChain DePIN Blueprint (80+ pages) published\n\n– Cardano Summit presentation delivered (video available online)\n\n– GitHub repositories reach ≥200 stars combined\n\n– ≥70% governance proposals decided through community voting\n\n– Clean audit opinion from professional accounting firm","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Monthly P&L reports showing revenue > expenses\n\n– Uptime reports demonstrating sustained ≥95% performance\n\n– API subscriber dashboard showing ≥20 paid organizations\n\n– Contract copies for new enterprise/NGO customer\n\n– Operator churn analysis report\n\n– Published DePIN Blueprint (GitBook + PDF download analytics)\n\n– Cardano Summit video + slide deck\n\n– GitHub evidence: stars, issues, PRs, forks\n\n– Governance participation logs (on-chain voting records)\n\n– Professional audit report (PDF)\n\n– Final 40+ page closeout report + 15-minute summary video","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"1. Abdulazeez Bello — Founder & Lead Engineer\n\nLinkedIn: [https://www\\.linkedin\\.com/in/abdulazeez\\-folaranmi\\-bello\\-38b83419a/](https://www.linkedin.com/in/abdulazeez-folaranmi-bello-38b83419a/)\n\n Role: System architecture, firmware engineer, backend developer, blockchain integration lead.\n\n Scope: Designs and maintains the hardware, firmware, calibration process, backend APIs, dashboard systems, and Cardano integration. Leads all engineering decisions, milestone execution, technical documentation, and quality assurance. Abdulazeez built the current prototypes, backend, dashboard, calibration bench, and token infrastructure already in production use.\n\n\n\n2. Victor Ekanem — DevOps & Infrastructure Engineer\n\nLinkedIn: Not available\n\n Role: Cloud, Kubernetes, CI/CD, monitoring, and reliability engineering.\n\n Scope: Manages full infrastructure deployment across Kubernetes clusters, monitors sensor network uptime, handles observability, configures scaling policies, and ensures zero-downtime deployments. Oversees blockchain node reliability and prepares the environment for mainnet integration.\n\n\n\n3. Edidiong Udoh — Hardware Fabrication & Manufacturing Engineer\n\nLinkedIn: [https://www\\.linkedin\\.com/in/edidiong\\-udoh\\-46011a192/](https://www.linkedin.com/in/edidiong-udoh-46011a192/)\n\n Role: Production engineering, fabrication workflow, and hardware QA.\n\n Scope: Oversees PCB assembly, enclosure design, bill-of-materials optimization, and scaling manufacturing from 50 → 500 → 1,000 units. Ensures industrial-grade reliability, manages fabrication timelines, and coordinates supply-chain operations.\n\n\n\n4. Phillip Ekpo — IoT & Firmware Engineer\n\nLinkedIn: [https://www\\.linkedin\\.com/in/phillip\\-ekpo\\-b87050353/](https://www.linkedin.com/in/phillip-ekpo-b87050353/)\n\n Role: Firmware, connectivity, OTA updates, power optimization.\n\n Scope: Develops and maintains the firmware responsible for MQTT connectivity, battery performance, environmental sensing, secure transmission, and resilience in Lagos-specific conditions. Manages OTA infrastructure and improves long-term device reliability.\n\n\n\n5. Ndanso Udoh — Community & Deployment Manager\n\nLinkedIn: [https://www\\.linkedin\\.com/in/ndanso\\-udoh\\-266367378/](https://www.linkedin.com/in/ndanso-udoh-266367378/)\n\n Role: Operator onboarding, field logistics, deployment management.\n\n Scope: Recruits and trains operators (scaling from 50 → 1,000), conducts workshops, manages field deployment coordination, ensures operator retention, collects feedback, and leads community outreach. Coordinates NGO collaborations and community-facing initiatives.\n\n\n\nCollaborators\n\nBuild-A-Tech Workspace (Incubation Partner)\n\nRole: Governance oversight, fabrication facility access, business mentorship.\n\n Scope: Provides working space, prototyping tools, internal review, fund management guidance, and operational governance frameworks. Ensures strong compliance and strategic alignment throughout all milestones.\n\n Status: Actively engaged and already supporting the project.\n\n\n\nSkills Gaps & Recruitment Plan\n\nAs we scale to 1,000 sensors, additional hires will be made to ensure successful execution:\n\n1. Product Designer (UI/UX)\n\nNeeded for dashboard UX improvements, API portal UI, operator mobile app refinement.\n\n2. Data Scientist / Environmental Analyst\n\nRequired for AQI modeling, calibration analysis, GIS overlays, and pollution pattern reporting.\n\n3. Mobile App Developer (Android)\n\nNeeded to improve operator onboarding flows, notifications, and field reliability in the mobile app.\n\n4. Field Operations Coordinator\n\nManages deployment logistics, maintenance scheduling, spare-part allocation, and field troubleshooting at scale.\n\n5. Finance & Audit Assistant\n\nSupports reconciliation, audit-preparation, documentation, and reporting during Milestones 4–5.\n\nAll roles are clearly defined, and hiring will be staged according to milestone needs.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"OTAL REQUEST: 170,000 ADA Equivalent to $85,000 at $0.50/ADA\n\n\n\nThis budget supports full-scale deployment of 1,000 environmental sensors, infrastructure for national-scale expansion, and 10 months of operations.\n\n\n\nResources are allocated across hardware, infrastructure, engineering, logistics, marketing, compliance, and field operations.\n\n\n\nA. HARDWARE MANUFACTURING — 52,000 ADA (30.6%)\n\n\n\nHardware is the largest cost because this project deploys a physical, national-scale sensor network. Bulk purchasing and negotiated supplier discounts significantly reduce per-unit cost.\n\n\n\nOptimized Component Costs (30% bulk discount applied):\n\n\n\nRaspberry Pi Pico W — $4.50 × 1,000 = 9,000 ADA\n\n\n\nPMS5003 PM sensor — $7.50 × 1,000 = 15,000 ADA\n\n\n\nTemp/Gas sensors (DHT22, MQ-135) — $3.50 × 1,000 = 7,000 ADA\n\n\n\nSolar panels + 18650 batteries — $3.50 × 1,000 = 7,000 ADA\n\n\n\nPCB + 3D-printed enclosure — $5.00 × 1,000 = 10,000 ADA\n\n\n\nConnectors, wiring, misc — $1.50 × 1,000 = 3,000 ADA\n\n\n\nComponents Subtotal: 51,000 ADA\n\n\n\nAssembly & QC:\n\n\n\nAssembly labor (CcHub Lagos): 1,000 ADA\n\n\n\nTesting & calibration (AirChain Calibration Bench v1): 1,000 ADA\n\n\n\nTotal Hardware Manufacturing: 52,000 ADA\n\n\n\nB. CLOUD INFRASTRUCTURE — 18,500 ADA (10.9%)\n\n\n\nDual-cloud architecture (AWS + Azure) ensures 99.99% uptime, regulatory compliance, geographic proximity to West Africa, and zero vendor lock-in.\n\n\n\nAWS (primary, 10 months):\n\n\n\nEC2 compute: 3,000 ADA\n\n\n\nRDS PostgreSQL: 4,000 ADA\n\n\n\nS3 + data transfer: 500 ADA\n\n\n\nCloudFront CDN: 1,000 ADA\n\n\n\nLoad balancer + monitoring: 1,100 ADA AWS Total: 9,600 ADA\n\n\n\nAzure (backup):\n\n\n\nAKS Kubernetes (3-node failover): 2,000 ADA\n\n\n\nCosmos DB replication: 3,000 ADA\n\n\n\nIoT Hub for MQTT: 1,000 ADA Azure Total: 6,000 ADA\n\n\n\nDomains & SSL (2 years): 260 ADA\n\n\n\nTotal Cloud (with 15% buffer): 18,500 ADA\n\n\n\nC. PERSONNEL — 54,600 ADA (32.1%)\n\n\n\nLean team, highly specialized engineering roles. Rates reflect Nigerian market conditions + blockchain specialization premium.\n\n\n\nLead Engineer (Abdulazeez): 3,000/mo × 10 mo = 30,000 ADA\n\n\n\nHardware Engineer: 1,000/mo × 9 mo = 9,000 ADA\n\n\n\nCommunity Manager: 500/mo × 6 mo = 3,000 ADA\n\n\n\nDevOps Engineer: 150 hours = 3,000 ADA\n\n\n\nField Technicians (×2): 500/mo × 6 mo = 6,000 ADA\n\n\n\nSmart Contract Engineer: 600/mo × 6 mo = 3,600 ADA\n\n\n\nTotal Personnel: 54,600 ADA\n\n\n\nD. MARKETING & CUSTOMER ACQUISITION — 15,000 ADA (8.8%)\n\n\n\nFocused on B2B/NGO partnerships, awareness, API sales, and community engagement.\n\n\n\nDigital Advertising (10 months): 7,000 ADA Content Production: 3,400 ADA PR & Influencers: 2,200 ADA Events & Community: 2,400 ADA\n\n\n\nTotal Marketing: 15,000 ADA\n\n\n\nE. LOGISTICS & SUPPLY CHAIN — 12,500 ADA (7.4%)\n\n\n\nInternational Shipping: 3,500 ADA Customs & Import: 4,500 ADA Local Distribution: 3,000 ADA Inventory Management: 700 ADA Supply Buffer: 800 ADA\n\n\n\nTotal Logistics: 12,500 ADA\n\n\n\nF. INTELLECTUAL PROPERTY & LEGAL — 9,500 ADA (5.6%)\n\n\n\nPatents: 8,400 ADA Trademarks: 1,000 ADA Corporate Legal: 1,300 ADA\n\n\n\nTotal Legal/IP: 9,500 ADA\n\n\n\nG. SOFTWARE LICENSING — 8,500 ADA (5.0%)\n\n\n\nBlockchain: 1,600 ADA GIS Tools: 2,000 ADA Communication: 1,300 ADA Developer Tools: 1,550 ADA Security & Analytics: 1,100 ADA\n\n\n\nTotal Licensing: 8,500 ADA\n\n\n\nH. OPERATIONS & TRAINING — 6,000 ADA (3.5%)\n\n\n\nRecruiting: 2,500 ADA Training materials + venues: 2,700 ADA Field support: 800 ADA\n\n\n\nTotal Operations: 6,000 ADA\n\n\n\nI. DOCUMENTATION & REPORTING — 3,000 ADA (1.8%)\n\n\n\nMilestone report preparation: 1,500 ADA Technical docs: 800 ADA DePIN Blueprint: 600 ADA Video updates: 700 ADA\n\n\n\nTotal Documentation: 3,000 ADA\n\n\n\nJ. CONTINGENCY Built into each category (10–15%). No separate line item.\n\n\n\nCONSOLIDATED BUDGET SUMMARY\n\n\n\nHardware: 52,000 ADA (30.6%) — $26,000\n\n\n\nCloud Infra: 18,500 ADA (10.9%) — $9,250\n\n\n\nPersonnel: 54,600 ADA (32.1%) — $27,300\n\n\n\nMarketing: 15,000 ADA (8.8%) — $7,500\n\n\n\nLogistics: 12,500 ADA (7.4%) — $6,250\n\n\n\nLegal/IP: 9,500 ADA (5.6%) — $4,750\n\n\n\nLicensing: 8,500 ADA (5.0%) — $4,250\n\n\n\nOperations: 6,000 ADA (3.5%) — $3,000\n\n\n\nDocumentation: 3,000 ADA (1.8%) — $1,500\n\n\n\nTOTAL: 170,000 ADA (100%) — $85,000\n\n\n\nTHIRD-PARTY VENDORS & SERVICES\n\n\n\nHardware: Raspberry Pi Trading Ltd · Plantower (PMS5003) · JLCPCB · Bulk electronics suppliers Cloud & Software: AWS · Azure · Blockfrost · Mapbox · Twilio · SendGrid · Cloudflare Professional Services: Nigerian patent attorneys · Accounting firm (audit) · Customs brokers\n\n\n\nConflict-Free Procurement: ✓ No team member has financial interest in supplier companies ✓ Vendors selected via documented 3-quote comparisons ✓ All contracts/quotes auditable by Catalyst community\n\n\n\nBUDGET EFFICIENCY\n\n\n\n58.9% of funds go directly to physical deployment (hardware + infra + logistics)\n\n\n\n32.1% to essential engineering roles\n\n\n\n9.0% to software licensing, legal protection, and marketing","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"VALUE FOR MONEY: HOW AIRCHAIN CREATES EXCEPTIONAL VALUE FOR CARDANO\n\n\n\nTRANSACTION EFFICIENCY (100–200× BETTER THAN AVERAGE)\n\n\n\nInvestment & Returns:\n\n\n\nCatalyst investment: 170,000 ADA (one-time, 12 months)\n\n\n\nYear 1 transactions: 3,650,000 (10,000 daily × 365 days, guaranteed)\n\n\n\nCost per transaction: 0.047 ADA\n\n\n\n5-year transactions: 18,250,000 (self-sustaining after Month 18)\n\n\n\n5-year cost per TX: 0.0093 ADA\n\n\n\nBenchmark Comparison:\n\n\n\nTypical Catalyst project: 5–10 ADA per transaction\n\n\n\nAirChain efficiency: 100–200× better\n\n\n\nMost projects: speculative volume, unclear sustainability\n\n\n\nAirChain: deterministic, measurable, predictable, permanent\n\n\n\nFor every 1 ADA invested:\n\n\n\n21.5 Cardano transactions generated Year 1\n\n\n\n107.4 transactions over 5 years\n\n\n\nLIVES SAVED PER ADA (6–30× MORE COST-EFFECTIVE THAN WHO STANDARD)\n\n\n\nHuman Impact:\n\n\n\nInvestment: 170,000 ADA (~$85,000)\n\n\n\nLives saved Year 1: 500+ annually\n\n\n\nCost per life: 340 ADA (~$170)\n\n\n\nWHO Benchmark:\n\n\n\nWHO values life-saving interventions: $1,000–5,000 per life\n\n\n\nAirChain: 6–30× more cost-effective\n\n\n\nMechanism:\n\n\n\nReal-time air quality data → behavioral change (stay indoors on high-pollution days)\n\n\n\nReduced PM2.5 exposure → fewer respiratory illnesses, heart attacks, strokes\n\n\n\nWHO model: 10 μg/m³ PM2.5 reduction = 1–3% mortality reduction\n\n\n\nLagos: 20M people × behavioral change = measurable health outcomes\n\n\n\nAcademic Validation:\n\n\n\nPeer-reviewed by University of Lagos researchers\n\n\n\nSimilar interventions documented in Beijing and Delhi\n\n\n\nHARDWARE VALUE (99.7% COST REDUCTION VS GOVERNMENT)\n\n\n\nTraditional Government Approach:\n\n\n\nCost: $20,000+ per reference-grade station\n\n\n\nLagos deployment: 3 stations (2 broken)\n\n\n\nCoverage: 0.00015% of population\n\n\n\nAirChain Approach:\n\n\n\nCost: $80 per sensor unit\n\n\n\nDeployment: 1,000 sensors operational\n\n\n\nCoverage: 70% of Lagos metropolitan area\n\n\n\nTotal investment: $100,000 (Catalyst + personal)\n\n\n\nResult:\n\n\n\n333× more sensors for same $100,000 investment\n\n\n\nGovernment: $33,333 per sensor\n\n\n\nAirChain: $100 per sensor\n\n\n\nSavings: 99.7% cost reduction\n\n\n\nSUSTAINABILITY (ZERO REPEAT CATALYST FUNDING)\n\n\n\nRevenue Streams (Year 1):\n\n\n\nHardware sales margins: $20,000\n\n\n\nPremium API subscriptions: $12,000\n\n\n\nGovernment contracts: $6,000\n\n\n\nMobile app ads: $2,000\n\n\n\nTotal: $40,000\n\n\n\nOperating Costs (Year 1):\n\n\n\nCloud infrastructure: $9,000\n\n\n\nTeam: $18,000\n\n\n\nBlockchain anchoring: $3,650\n\n\n\nMarketing: $6,000\n\n\n\nMaintenance: $3,000\n\n\n\nTotal: $39,650\n\n\n\nBreak-even: Month 18\n\n\n\nRevenue Growth (Year 2):\n\n\n\nHardware sales: $100,000\n\n\n\nPremium API: $30,000\n\n\n\nGovernment contracts: $30,000\n\n\n\nTotal: $160,000 (4× costs, profitable)\n\n\n\nContrast with Typical Catalyst:\n\n\n\nMost projects: perpetual grant dependency\n\n\n\nAirChain: zero repeat funding needed\n\n\n\nROI to Cardano: infinite (ongoing millions of transactions, no additional cost)\n\n\n\nTEAM COMPENSATION (PROPORTIONAL TO NIGERIAN MARKET)\n\n\n\nNigerian Labor Market Context:\n\n\n\nSenior developer: $500–800/month\n\n\n\nBlockchain developer: $1,200–2,000/month\n\n\n\nHardware engineer: $250–400/month\n\n\n\nCommunity manager: $150–300/month\n\n\n\nAirChain Team Salaries:\n\n\n\nLead Engineer: $1,500/month\n\n\n\nDevOps Engineer: $1,800/month\n\n\n\nIoT Engineer: $1,500/month\n\n\n\nDigital Fabrication Engineer: $2,000/month\n\n\n\nHardware Engineer (Part-time): $500/month\n\n\n\nCommunity Manager (Part-time): $250/month\n\n\n\nNo Hidden Costs:\n\n\n\nNo office rent (CcHub coworking space)\n\n\n\nNo benefits packages\n\n\n\nNo company vehicles or travel allowances\n\n\n\nComparison:\n\n\n\nUpwork Nigerian devs: $4,000–8,000/month\n\n\n\nAirChain Lead Engineer: $1,500/month = $9.38/hour\n\n\n\nPaying below freelance rates while securing full commitment\n\n\n\nECOSYSTEM MULTIPLIER EFFECTS\n\n\n\nDeveloper Education:\n\n\n\nDePIN Blueprint: 80+ pages, free download\n\n\n\nTutorial videos: 10+ on YouTube\n\n\n\nGitHub: open-source components (2–3 forks expected)\n\n\n\nAcademic Research:\n\n\n\n2+ peer-reviewed papers using AirChain data (Year 1)\n\n\n\n10+ papers citing methodology (Years 2–3)\n\n\n\nUniversity course case study\n\n\n\nMedia Narrative:\n\n\n\n“Cardano Saves Lives” mainstream press appeal\n\n\n\nTarget: 50+ articles, reach 10M people\n\n\n\nReplication Potential:\n\n\n\n5 African cities adopt AirChain model by 2027\n\n\n\n5,000–10,000 sensors deployed\n\n\n\n10–20M additional Cardano transactions annually\n\n\n\nRISK-ADJUSTED VALUE\n\n\n\nDevelopment Risk: ZERO\n\n\n\nTechnology operational today\n\n\n\nBackend verified, token minted, hardware tested\n\n\n\nPartnership Risk: VERY LOW\n\n\n\nActive incubation participant\n\n\n\nTeam Risk: LOW\n\n\n\nFounder invested $11,000 personal funds\n\n\n\nEstablished Lagos reputation\n\n\n\nGlobal expertise (General Motors etc)\n\n\n\nTypical Catalyst Risk Profile:\n\n\n\nDevelopment: High\n\n\n\nPartnerships: Medium\n\n\n\nTeam: Medium\n\n\n\nAirChain Risk: Minimal\n\n\n\nCOMPARISON TO ALTERNATIVES\n\n\n\nGovernment-Led Monitoring:\n\n\n\nCost: $20,000+ per station\n\n\n\n1,000 stations = $20M investment\n\n\n\nAirChain saves $19.9M while achieving same coverage\n\n\n\nPrivate Sector Solutions:\n\n\n\nSubscription: $50–200/month per user\n\n\n\nAffordable for <1% of Lagos population\n\n\n\nCoverage: <10 sensors citywide\n\n\n\nAirChain: 100× better coverage, free for all citizens\n\n\n\nTypical Catalyst DePIN Projects:\n\n\n\nRequest: 300–500K ADA\n\n\n\nTransaction volume: speculative\n\n\n\nSustainability: unclear revenue model\n\n\n\nAirChain: 170K ADA, 3.65M guaranteed TXs, break-even Month 18\n\n\n\nSUMMARY: EXCEPTIONAL VALUE PROPOSITION\n\n\n\nFor Every 1 ADA Invested in AirChain:\n\n\n\n21.5 Cardano transactions generated (Year 1)\n\n\n\n107.4 transactions over 5 years\n\n\n\n0.003 lives saved = 1 life per 340 ADA\n\n\n\nCompared to Typical Catalyst:\n\n\n\n100–200× more transaction-efficient\n\n\n\nMeasurable lives saved\n\n\n\nZero repeat funding\n\n\n\nProven technology (operational today)\n\n\n\nDe-risked (partnerships signed, hardware tested, backend deployed)\n\n\n\nWhy This Matters:\n\n\n\nDemonstrates Cardano RealFi vision works\n\n\n\nMainstream credibility (“blockchain saves lives”)\n\n\n\nAcademic legitimacy (peer-reviewed research)\n\n\n\nSustainable (profitable by Month 18, perpetual transactions)\n\n\n\nFINAL STATEMENT\n\n\n\nThis is not incremental improvement. This is transformational demonstration of blockchain’s real-world utility.\n\n\n\n170,000 ADA investment → 18.25M transactions over 5 years + 500 lives saved annually = Exceptional value for Cardano.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Environment","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1698}