{"pr_id":"019ac3d4-bedc-7e0e-8532-39f79cc7f7e5","title":"Krippt V2: Creator-Driven SocialFi MVP & RWA Foundation","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"The Cardano ecosystem currently lacks a consumer-grade, functional SocialFi application that provides direct, peer-to-peer monetization and enables niche community-building and powers financial reward","solution":"Krippt V2 provides Cardano's first consumer-grade SocialFi MVP, delivering a superior mobile UI, on-chain tipping for direct creator monetization, and Group Creation to build niche RWA communities.","proposer_name":"Oriasotie Emmanuel","proposer_relevant_experience":"Oriasotie Emmanuel Ehimare\n\nCTO Lead Engineer and Blockchain Developer\n\nProject Lead / Strategy — Full-Time\n\nLinkedIn:[https://www\\.linkedin\\.com/in/oriasotie\\-emmanuel\\-340173a6/](https://www.linkedin.com/in/oriasotie-emmanuel-340173a6/)\n\nGitHub: [https://github\\.com/Ehiiz](https://github.com/Ehiiz)\n\n\n\nPeter Ugochukwu\n\nCTO / Founder Grinti AI\n\nLinkedIn:[https://www\\.linkedin\\.com/in/doctai/](https://www.linkedin.com/in/doctai/)\n\n\n\nStrategic Partner\n\nTechnical Partner \n\nRemostarts\n\n[https://www\\.remostarts\\.com/](https://www.remostarts.com/)","url":null,"funds":35000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Krippt V2: Creator-Driven SocialFi MVP & RWA Foundation","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Oriasotie Emmanuel","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":35000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null},{"ref":"#/definitions/singleLineHttpsURLEntry","title":"Original Document Link","description":"Provide a link to the original proposal document in its original language","format":null,"answer":"https://docs.google.com/document/d/1ZzeKOpC2XzM41FrQqkbIG0cKuVUTxh0Eohe2MnsN1CA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"The Cardano ecosystem currently lacks a consumer-grade, functional SocialFi application that provides direct, peer-to-peer monetization and enables niche community-building and powers financial reward","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Krippt V2 provides Cardano's first consumer-grade SocialFi MVP, delivering a superior mobile UI, on-chain tipping for direct creator monetization, and Group Creation to build niche RWA communities.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://nkrypt.space","https://forum.cardano.org/t/why-cardano-s-future-demands-a-social-layer/150042","https://github.com/Ehiiz/nkrypt-client-v2"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Lucid Evolution","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"MIT Open Source","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"RWA","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Our innovation lies in our &quot;Tipping-First, Groups-Next&quot; Lean MVP strategy combined with an uncompromising focus on Web3 UX refinement.\n\nUX Focus as POC: Our initial MVP (Phase 1) is dedicated to proving that a Web3 social app can be as intuitive and aesthetically pleasing as its Web2 counterparts. This low-barrier-to-entry design is itself an innovation in the dApp space.\n\nTipping-as-RWA: We are utilizing existing native assets (ADA) for simple, immediate, permissionless value transfer. This direct on-chain payment bypasses the complexity of token standards and provides instant, tangible Real World Asset (RWA) value for creators—money they can use now, not tokens they might sell later.\n\nProven Traction (Proof of Concept): Krippt (formerly Nkrypt) is not a theoretical project. We have an established, functioning beta with:\n\n500+ Registered Users (Pre-monetization)\n\n1,200+ Pieces of Content\n\n50+ Dedicated Beta Testers\n\nThis existing user base serves as the initial testing ground and proof of concept for the V2 features accessble on [https://nkrypt\\.space](https://nkrypt.space)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our MVP will demonstrate a fully functional, mobile-first SocialFi experience featuring:\n\nPhase 1 Demo (Proof of Concept): The new, professional brand identity, and the fluid, intuitive UI/UX for profiles and the content feed, proving we can deliver consumer-grade aesthetics.\n\nPhase 2 Demo (Tipping): Seamless, on-chain ADA tipping using CIP-30 wallet standards. A user can connect their wallet and execute a tip that is immediately visible on the explorer.\n\nPhase 3 Demo (Groups): Fully functional Krippt Clubs (Group Creation) demonstrating how niche communities can be organized, moderated, and managed—the foundation for future tokenized RWA governance.\n\nThe current beta (pre-V2 rebrand) is accessible on a private staging link. The final V2 Mainnet MVP will be launched at [https://app\\.krippt\\.io](https://app.krippt.io) (URL to be finalized during the rebrand).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"On-Chain Activity – Unique Tipping Transactions (ADA):\n\nTarget: More than 7,500 transactions\n\nValue to Ecosystem: This directly increases Cardano’s on-chain activity, transaction volume, and liquidity flow.\n\n\n\nOn-Chain Activity – Unique Tipping Wallets (Senders & Receivers):\n\nTarget: More than 1,500 unique wallets\n\nValue to Ecosystem: Expands the number of active wallets interacting with DeFi and micro-transaction systems on Cardano.\n\n\n\nSocialFi Adoption – New Krippt Clubs Created:\n\nTarget: Over 350 communities\n\nValue to Ecosystem: Demonstrates the platform’s strength as a foundational RWA/SocialFi layer, encouraging community formation and engagement on Cardano.\n\n\n\nSocialFi Adoption – Monthly Active Users (MAU):\n\nTarget: More than 4,000 monthly active users\n\nValue to Ecosystem: Shows strong product-market fit and validates Cardano’s role as a home for community-driven applications","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The problem of limited creator monetization affects an estimated 100,000+ globally active creators who are dissatisfied with Web2 platform cuts (up to 50%). Krippt V2 directly addresses this multi-million dollar sector gap by providing an immediate, 0% platform fee solution.\n\nThe uniqueness and immediacy of the solution are grounded in its technical simplicity and focus:\n\nUnique ADA Tipping Rail: We utilize existing, robust Plutus smart contracts and CIP-30 standards to ensure low-latency, high-reliability tipping. This avoids reliance on complex governance or newly minted tokens.\n\nGroups as Community RWA: The Krippt Clubs are designed to be token-agnostic structures. They can be utilized immediately for social organization and are architected to easily integrate future RWA features, such as fractionalized group IP or specific Group Membership Tokens. The group itself is the first layer of a digital RWA.\n\nSolutions Uniqueness and Feasibility:\n\nUniqueness: Prioritizing direct, low-friction ADA value transfer over complex SocialFi tokenomics, and leading with a superior UX.\n\nImmediacy: The entire scope is achievable within 6 months due to the focused nature of the MVP, building on existing traction.\n\nFeasibility: Built upon the established and functional Krippt beta codebase, reducing development risk by over 40%.\n\nTechnical Stack: React frontend (mobile-first), Node.js backend, Plutus (minimal smart contract for transaction orchestration), and leveraging existing Cardano dApp Connectors.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Cardano Network Activity\n\nKrippt V2 is projected to generate 7,500+ new on-chain transactions (tips) within its first year. This establishes Cardano as a viable, low-cost platform for direct creator monetization and seamless peer-to-peer value transfer.\n\n\n\nUser Acquisition\n\nWith over 1,500 new active wallets engaging with decentralized applications, Krippt V2 will attract a significant wave of Web2 creators—especially from the SocialFi sector—who are seeking transparent, equitable, and high-yield monetization models.\n\n\n\nRWA Foundation\n\nBy enabling the creation of 350+ decentralized community structures, Krippt V2 lays the foundational social and identity layer required for future Real-World Asset (RWA) initiatives. These communities will be primed for governance, co-ownership, and asset fractionalization.\n\n\n\nOpen Source Value\n\nKrippt V2 will open-source its tipping and group-management modules, contributing production-ready, high-volume peer-to-peer interaction code to the Cardano developer community. This strengthens the ecosystem with reusable, scalable primitives for SocialFi and RWA use cases.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our capability is grounded in a proven delivery history (the existing beta) and an operational, pre-funded product. The team is composed of seasoned engineers with direct experience in scalable Web3 infrastructure.\n\nTrust and Accountability: We commit to delivering against all public milestones, providing bi-weekly updates via the platform, and maintaining an open-source GitHub repository for continuous review. Funds will be released only upon verifiable completion of each milestone.\n\nFeasibility Validation: The core content sharing logic is already functioning, and the UX/UI blueprint (Phase 1) is ready. The main risk, the On-Chain Tipping Integration, will be validated by:\n\nTestnet Deployment (Phase 2): Successful deployment and multi-wallet stress testing of the Tipping smart contract on the Cardano Testnet.\n\nClosed Beta (Phase 3): A controlled release of the full MVP to our existing community of 50+ testers before Mainnet launch, ensuring real-world usability and bug resolution.\n\nOur experience, passion, and commitment are highlighted by the fact that we have already built and maintained a user base and codebase prior to this proposal, demonstrating groundedness in delivery and a measurable track record.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Phase 1: Rebrand & Foundational UI/UX","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Finalized Brand Guide (logo, name, styling) and all new design assets delivered. 100% of the mobile-first React UI/UX is built, deployed to a public Staging environment, and successfully rendering existing content and user profiles, proving production readiness across all major screen sizes.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- New Brand Identity & Style Guide: The project must have a finalized brand package including the new name (Krippt V2), logo assets (vector and raster), and a detailed Style Guide document covering color palette, typography (for mobile and web), and icon usage.\n\n\n\n- Mobile-First Responsive Design: The new UI/UX must be fully developed using React and CSS, successfully implementing the complete mobile-first responsive design across all major views (Feed, Groups, Profile, Tipping Modal). This must be verified on screen sizes from 375px (iPhone SE) to 1024px (Tablet/Desktop).\n\n\n\n- Staging Environment Launch (Proof of Concept): The new V2 UI must be deployed to a public staging URL, successfully fetching and rendering existing user accounts and content data (dummy data or V1 user base data) to prove production readiness.\n\n\n\n- Core Interaction (V1 Integration): The basic navigation and the ability to view existing content and profiles must be fully functional and stable in the new V2 frontend.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Publicly accessible Brand_Style_Guide.pdf document and a .zip archive containing all finalized logo assets.\n\n\n\n- A video demonstration (< 60 seconds) showcasing the seamless responsiveness and smooth layout transitions across mobile and desktop breakpoints.\n\n\n\n- Public Staging URL provided for manual verification. This environment must be live for the duration of the proposal period.\n\n\n\n- Confirmation from the project team that 100% of the new UI is built, deployed, and 100% of all internal navigation links function without error.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":9000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Monetization Core (Tipping Rail)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The Plutus Tipping Contract is fully developed, securely tested, and finalized with a passing external audit. CIP-30 wallet connector is integrated, enabling users to view wallet balances and execute the complete, atomic on-chain tipping transaction flow within the new V2 UI.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Aiek Contract Completion: The Tipping Contract (validator script) must be finalized, unit-tested, and optimized for low fees.\n- Security Audit Pass: The Tipping Aiken Contract must receive a audit; result from a named, independent third-party Cardano auditor.\n- Wallet Integration: The CIP-30 wallet connector must be fully integrated into the V2 UI, enabling users to authenticate and view their native token balances.\n- Tipping Transaction Success: Users must be able to successfully initiate, sign, and broadcast an on-chain tipping transaction to another user's address directly through the V2 UI on the Testnet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Full Audit Report (Pass Status) from the named third-party auditor.\n\n\n\n- Aiken Contract code publicly available on GitHub with complete documentation.\n\n\n\n- Video demonstration showcasing a successful end-to-end tip transaction (wallet connection, tip amount selection, signing, and confirmation of ADA/token receipt on a blockchain explorer).\n\n\n\n- Confirmation that the CIP-30 integration successfully connects with at least 3 major Cardano wallets (e.g., Lace, Eternl, Typhon).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":16000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Community RWA & Deployment","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Full implementation of Krippt Clubs features (creation, membership, dedicated feeds, and moderation tools) is complete. A final, comprehensive security review across Plutus, API, and the new UI is passed, confirming a robust, 100% Mainnet-ready code base suitable for public deployment.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Group Creation & Joining: Users must be able to create new Clubs (Groups) with custom settings, and other users must be able to securely join them.\n\n\n\n- Dedicated Group Feed: Each Club must feature its own isolated content feed, allowing members to post and view content exclusively within that Group.\n\n\n\n- Moderation Tools: Functional moderation controls (e.g., removing posts, banning members) must be implemented for the Group creator/admin.\n\n\n\n- Final Security Review: The final, comprehensive security review (covering the integration points between Plutus, the API layer, and the UI) must confirm the stability and security of the full stack.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Video demonstration showing the complete lifecycle of a Krippt Club: creation, member joining, posting content, and an administrator successfully using a moderation tool.\n\n\n\n- Final Security Review document provided by the development team (self-assessed final review) confirming all stack layers are secure and dependencies are updated.\n\n\n\n- Confirmation that the entire V2 codebase (Plutus, API, and UI) is merged into the Main branch and tagged as v2.0.0 Mainnet-Ready on GitHub.\n\n\n\n- Live URL on the Testnet demonstrating the full functionality of the Krippt Clubs feature.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Oriasotie Emmanuel Ehimare\n\nCTO Lead Engineer and Blockchain Developer\n\nProject Lead / Strategy — Full-Time\n\nLinkedIn:[https://www\\.linkedin\\.com/in/oriasotie\\-emmanuel\\-340173a6/](https://www.linkedin.com/in/oriasotie-emmanuel-340173a6/)\n\nGitHub: [https://github\\.com/Ehiiz](https://github.com/Ehiiz)\n\n\n\nPeter Ugochukwu\n\nCTO / Founder Grinti AI\n\nLinkedIn:[https://www\\.linkedin\\.com/in/doctai/](https://www.linkedin.com/in/doctai/)\n\n\n\nStrategic Partner\n\nTechnical Partner \n\nRemostarts\n\n[https://www\\.remostarts\\.com/](https://www.remostarts.com/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Budget Breakdown (35,000 ADA Total Request)\n\nSmart Contract &amp; Backend Development — 16,000 ADA (45.7%)\n\nThis covers CTO compensation for building and auditing the Tipping Aiken smart contract and developing the Node.js backend logic for Groups (Milestones 2 and 3).\n\nFrontend &amp; UX/UI Refinement — 10,000 ADA (28.6%)\n\nThis funds the Dev Partner to execute the rebrand and deliver a high-quality, mobile-first V2 UI/UX, including support during Milestone 3.\n\nSecurity &amp; Infrastructure — 4,000 ADA (11.4%)\n\nIncludes cloud hosting, Testnet operations, and a third-party review/audit of the Tipping contract before it is deployed to Mainnet.\n\nMarketing &amp; Community Outreach — 3,000 ADA (8.6%)\n\nCovers content creation, onboarding guides, and targeted community campaigns to drive early ADA tipping volume after launch.\n\nContingency Reserve — 2,000 ADA (5.7%)\n\nA buffer for unforeseen technical complexities to ensure on-time delivery within the 6-month development window.\n\nTOTAL — 35,000 ADA (100%)\n\nThis ensures full delivery of the Mainnet Tipping system and the Community MVP.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The cost of 35,000 ADA represents exceptional value due to its direct path to tangible metrics, strong comparative analysis, and high impact-to-cost ratio:\n\nComparative Value & Differentiation (Competitive Analysis):\n\nVersus Web2 (e.g., Twitter/X, Instagram): Krippt V2 offers 0% platform fees vs. the 30-50% cut taken by incumbents. This massive value proposition is the primary creator magnet.\n\nVersus Other Cardano SocialFi: Most existing projects focus on token launches or are still in early alpha. Krippt V2 skips proprietary token complexity (initially) to deliver immediate ADA utility and has a superior, demonstrated UI/UX focus (Phase 1). Our existing 500+ users and content base give us a significant head start in organic growth.\n\nQuantifiable Ecosystem Reach: For 35,000 ADA, Krippt V2 commits to delivering 7,500+ new on-chain transactions and attracting 4,000+ new active users within the first year. This is a powerful, quantified return on investment in terms of active usage and liquidity injection.\n\nHigh Impact-to-Cost Ratio: We are not starting from zero; we are upgrading a functional beta. This efficiency allows us to dedicate 74.3% of the budget directly to the technical delivery of the Tipping and Group features (Smart Contract & Frontend). The investment is primarily in code implementation rather than exploratory R&D, maximizing the value derived from every ADA. The resulting platform establishes the critical social and identity layer required for other Cardano RWA projects to thrive.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"RWA","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1699}