{"pr_id":"019ac3c7-9400-7b11-939c-61ea2636f40f","title":"Adavelocity-High Frequency Trading platform for Cardano DeFi","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano DeFi is secure but lacks capital efficiency. Liquidity is fragmented, execution is slow, slippage is high, and institutional trading isn’t supported, limiting volume and TVL growth.","solution":"Adavelocity unifies liquidity across DEXs with fast non-custodial execution, arbitrage, and market-making tools, reducing slippage and improving pricing to support HFT trading on Cardano.","proposer_name":"Sutapa Roy Gupta","proposer_relevant_experience":"**Team members:**\n\n**Project Lead:** Sutapa Roygupta\n\nSkills: Cardano Developer, AI Engineer and Full Stack Developer, Agile Project Management, Leadership, DevOps, Continuous Integration and Continuous Delivery (CI/CD), Scope Analysis, Market research.\n\nExperience: 15+ years of experience in product development, including Cardano Development Experience, managed multiple projects, from ideation to deployment, using agile methodologies and best practices. Contributed to the growth and improvement of products and services, by partnering with internal and external stakeholders, conducting market research.\n\n[https://www\\.linkedin\\.com/in/sutapa\\-roygupta\\-4a5a0634/](https://www.linkedin.com/in/sutapa-roygupta-4a5a0634/)\n\n**Software Developer:** Rayan Ahmad\n\nSkills: Full Stack Developer, Cardano Smart Contract Developer, Web3 &amp; dApp Engineer\n\nExperience: Built production-grade dApps in Cardano ecosystem, including Liquidity pools, with on-chain lending logic and DEX integrations; front-end and back-end development across multiple platforms; strong smart contract development experience in Plutus and Lucid.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/rayan\\-ahmad\\-25nov/](https://www.linkedin.com/in/rayan-ahmad-25nov/)\n\n**Visual Designer:** Avishek Paul\n\nSkills: UI/UX Design, Concept Art, Branding, Digital Illustration, 3D Modeling &amp; Animation\n\nExperience: 5+ years of professional and freelance graphic design experience; previously Creative Designer at AIQUANT Technologies and Visual Designer at InnerKraft Health; strong background in branding, poster and logo design, storyboard creation, and high-quality UI/visual design for web applications.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/avishek\\-paul\\-23735415b](https://www.linkedin.com/in/avishek-paul-23735415b)\n\n**Software Developer:** Snehasish Paul\n\nSkills: Full Stack Development (Spring Boot &amp; React), Microservices Architecture, API Engineering, SQL/PostgreSQL, Web3 Integration on Cardano\n\nExperience: 3+ years of full-stack engineering experience building production-grade applications end-to-end. Currently SDE-2 at AIQUANT Technologies working on scalable blockchain-enabled systems, including Cardano-based dApps. Previously contributed to multiple large enterprise products at RankTech Solutions, including AI-based live claim settlement, remote healthcare services, and legacy platform upgrades.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/snehasishpaulweb](https://www.linkedin.com/in/snehasishpaulweb)","url":null,"funds":140000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Adavelocity-High Frequency Trading platform for Cardano DeFi","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Sutapa Roy Gupta","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":140000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":8,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano DeFi is secure but lacks capital efficiency. Liquidity is fragmented, execution is slow, slippage is high, and institutional trading isn’t supported, limiting volume and TVL growth.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Adavelocity unifies liquidity across DEXs with fast non-custodial execution, arbitrage, and market-making tools, reducing slippage and improving pricing to support HFT trading on Cardano.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://adavelocity.com","https://drive.google.com/file/d/1BNi7zS1aHXUdz0Ex8D6mza68cw72tOqu/view?usp=drive_link","https://drive.google.com/file/d/1Y6Z2oPkNaWQgtwtzzV4rihrrpKP94AxL/view?usp=drive_link"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Apache License 2.0","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"DeFi","group":"DeFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"**Cardano** has strong liquidity providers and several DEXs, yet the ecosystem still behaves like a set of independent markets. Liquidity does not compound across venues, institutional liquidity cannot enter efficiently, and each DEX must acquire, retain, and incentivize liquidity on its own, a costly and unsustainable model.\n\n**Adavelocity** introduces a **new financial model** for Cardano DeFi: liquidity that is more valuable because it becomes reusable, coordinated, and high-frequency, rather than fragmented and idle.\n\n**What makes the financial model innovative?**\n\n**1\\.Liquidity earns more without moving**\n\n\n\n**2\\. Price accuracy becomes a protocol outcome, not a side effect**\n\n\n\n**3\\. A fair market that does not depend on whales or farms**\n\n\n\n**4\\. Institutions become liquidity contributors, not extractors**","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"# MVP / Prototype Description\nThe MVP will demonstrate that Cardano liquidity can operate as a single unified market without requiring new DEXs, custodial aggregation, or liquidity migrations. It will show that a non-custodial routing and execution layer can consistently deliver better pricing and lower slippage than interacting with a single DEX directly.\n\n**The MVP will include:**\n\n**Cross\\-DEX Smart Order Routing**\n\nThe system will execute trades across multiple DEXs and automatically select the best execution venue at the time of the transaction. The prototype will show measurable improvement in slippage and pricing outcomes versus executing on individual DEXs.\n\n**Automated Price\\-Convergence Mechanism \\(Arbitrage Layer\\)**\n\nThe MVP will demonstrate how price discrepancies between DEXs can be removed through deterministic arbitrage logic, improving market efficiency without custody or liquidity migration.\n\n**Liquidity\\-Reinforcement Strategies**\n\nA subset of market-making functionality will run publicly to demonstrate reduced volatility on execution and higher depth on supported pairs.\n\n**Public APIs and SDK Access**\n\nDevelopers will be able to test algorithmic strategies on top of the MVP infrastructure without building execution logic from scratch.\n\n# \n**The MVP will be deployed on Cardano Testnet\\. Access will be available through:**\n\n- A web-based demo interface for users to compare pricing outcomes between single-DEX execution and Adavelocity-routed execution.\n- A public API endpoint and documentation portal, allowing developers and automated strategies to interact directly with the routing engine.\n\n**A GitHub repository containing:**\n\n- SDK and integration libraries\n- Sample code for execution and pricing calls\n- Benchmarks and technical documentation\n\nAfter community testing and refinement, the MVP results and performance benchmarks will be published publicly.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Success will be measured by improvements in execution quality and real usage of the protocol. All metrics will be observable on-chain and publicly reported.\n\n\n\n**Routing & Execution**\n\n\n\n- Users receiving better pricing compared to direct single-DEX execution\n\n\n\n- Reduction in slippage during trade execution\n\n\n\n**Usage & Adoption**\n\n\n\n- Number of unique wallets interacting with Adavelocity over time\n\n\n\n- Returning users rather than one-time usage\n\n\n\n**Integrations**\n\n\n\n- Working live integrations with Cardano DEXs\n\n\n\n- Wallets, apps, or developers using the API/SDK\n\n\n\n**Market Efficiency**\n\n\n\n- Reduction in price divergence between integrated DEXs\n\n\n\n- Increase in average trade size that can be executed without large price impact\n\n\n\n**What success means**\n\n\n\nIf users consistently receive better execution, slippage reduces, and more applications integrate with the routing layer over time, then the protocol is improving liquidity efficiency across Cardano, which is the core goal.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"By nature, Cardano DeFi is highly technically sophisticated yet economically inefficient. Liquidity is fragmented across a set of independent DEXs, which individually serve isolated markets rather than one cohesive trading environment. Each DEX is required to source its own liquidity, maintain its own pricing dynamics, and manage execution risk. This leads to fragmented liquidity, diverging prices across platforms, and larger trades moving the market due to shallow depth. This is the principal friction to the arrival of professional capital and ongoing trading volume onto Cardano.\n\nAdavelocity directly addresses this structural limitation. It doesn't build another DEX, liquidity pool, or liquidity incentive mechanism. Instead, it introduces a non-custodial execution and liquidity routing layer that connects liquidity across DEXs, enabling Cardano to function as a single, deeper, and more efficient market-without merging protocols, changing their autonomy, or taking custody of user funds.\n\n**1\\. Cross\\-DEX liquidity aggregation and best\\-venue execution**\n\nAdavelocity constantly benchmarks liquidity on every major DEX and routes orders to the venue — or combination of venues — yielding the best execution at that instant. The routing layer considers price, liquidity depth, fee structure, slippage curves, and expected market impact. This results in better pricing, less slippage, and more predictable execution than a user could get from any one DEX alone.\n\n**2\\. Market\\-wide price convergence**\n\nThis is today's version: price discrepancies persist across Cardano DEXs because arbitrage is done privately and irregularly, instead of systematically and transparently. The outcome is delayed price discovery and users who are unknowingly trading at a worse price on venue A than venue B.\n\nAdavelocity incorporates controlled arbitrage mechanisms that automatically and continuously remove price gaps between venues. The routing layer executes risk-bounded arbitrage trades when the price of the same asset diverges across exchanges to pull prices back into alignment.\n\nThis stabilizes pricing, accelerates price discovery and increases fairness for everyday traders without enabling extractive MEV behavior.\n\n**3\\. Liquidity reinforcement, not liquidity fragmentation**\n\nToday, DEXs are racing to entice liquidity through offering incentives or adding new pools. Doing so further expands the number of venues, without expanding depth. Additional pools increase the appearance of liquidity, not its real economic utility.\n\nAdavelocity deploys its liquidity-supporting strategies - limited market-making, controlled backfilling and selective order-balancing - as shared public infrastructure rather than as private bots serving only one participant.\n\nThat is to say, liquidity can be utilized more efficiently to support more significant trades with low volatility, instead of pulling liquidity out of existing DEXs.\n\n**4\\. Designed for all user segments: retail to institutional**\n\nAdavelocity is not a product catering to the needs of just one category of users. The advantages emanate transparently to all participants:\n\nRetail traders automatically get better execution without changing wallets or having to learn new tools.\n\nSmall firms and consistent traders receive predictable fills and pricing stability\n\nProfessional traders get an automation infrastructure without having to run their own routing logic.\n\ndeterministic execution, low latency, data endpoints and integration-grade APIs for Institutions.\n\nRather than optimize the system for the most powerful participants, Adavelocity increases efficiency for the whole ecosystem.\n\n**5\\. High\\-performance execution done the Cardano way**\n\nIt achieves fast execution without compromising on decentralization.\n\nHydra Heads enable sub-second execution of routing calculations and optional batching logic while transaction settlement remains fully on Cardano. Mithril allows lightweight state synchronization between the infrastructure components without centralizing control.\n\n\n\nAdavelocity turns multiple DEXs into one cooperative liquidity network by providing the following:\n\na single price for all venues\n\n- unified liquidity without custody pooling\n- unified execution without replacing or competing with DEXs\n\nThe result is higher capital efficiency:\n\n- more volume without increasing the liquidity incentives\n- greater depth without necessarily creating new liquidity pools\n- Improved pricing without taking away liquidity from the DEXs\n\nIt means, simply put, the system scales all existing liquidity, rather than trying to replace it.\n\nBy removing the structural inefficiencies holding Cardano DeFi back today, Adavelocity:\n\n- increases fee generation for liquidity providers\n- This increases trading volume for every integrated DEX.\n- Reduced costs for traders\n- improves conditions for market makers\n\n**Solution Overview**\n\nAdaVelocity is a cross-DEX liquidity and execution protocol that transforms Cardano’s fragmented DeFi ecosystem into a coordinated, high-efficiency trading network.\n\nIt provides:\n\n- Static Liquidity, Dynamic Utilization\n- Cross-DEX Smart Order Routing (SOR)\n- Deterministic, MEV-safe trade execution\n- Arbitrage-as-a-Protocol, not private extraction\n- Unified liquidity interface for institutional traders\n\nThe design combines on-chain smart contracts, off-chain routing and simulation engines, and a distributed oracle mesh to deliver high-frequency, low-latency execution.\n\n**Off-Chain Layer   **\n\n- Routing &amp; Simulation Engine\n- Micro-Batching &amp; Settlement Coordinator\n- Arbitrage Executor\n- Institutional API Gateway\n- Price Oracle Mesh\n\n**On\\-Chain Smart Contracts**\n\n- Unified Liquidity Interface (ULI)\n- Virtual Liquidity Pools (VLPs)\n- Fee-Share &amp; Reward Logic\n- Settlement Contract (MEV-safe)\n\n**Core Components**\n\n1 Unified Liquidity Interface (ULI)\n\n- A thin smart-contract layer that creates a synthetic view of the total liquidity across Cardano DEXs.\n- Responsibilities:\n- Standardize interactions with AMM pools (Minswap, Indigo, WingRiders, Spectrum, etc.)\n- Expose a single liquidity endpoint for routing\n- Enable static-position LPing with dynamic routing across venues\n- Abstract away pool-specific fee logic and curve formulas\n- Key Features:\n- Supports CFMM variants (constant product, stable swap, concentrated liquidity)\n- Extensible via module adapters (e.g., for new DEXs)\n- Built using Aiken for optimal performance\n\n2 Virtual Liquidity Pools (VLPs)\n\n- These pools represent aggregated virtual liquidity rather than real liquidity.\n- How It Works:\n- Liquidity stays in DEX pools.\n- AdaVelocity computes virtual liquidity depth based on:\n- pool balances\n- slippage curve shape\n- historical volatility\n- transaction volume\n- Traders interact with VLPs, which map transactions to optimal real pools.\n- Benefits:\n- Liquidity multiplier effect\n- No capital migration required\n- Supports high-frequency routing without congestion\n\n3 Routing &amp; Simulation Engine (Off-Chain)\n\n- A high-performance engine responsible for:\n- Multi-DEX pathfinding\n- Price simulation across AMM curves\n- Splitting orders across pools\n- Estimating impact, fees, and slippage\n- Selecting optimal execution paths\n- Algorithms:\n- Modified Dijkstra for slippage-weighted pathfinding\n- Multi-path linear programming optimization\n- Curve-aware execution strategies per AMM type\n- Performance:\n- Optimized for &lt;200 ms routing decisions\n- Capable of 100+ routing computations per second\n\n4 Micro-Batching &amp; Settlement Coordinator\n\n- Converts user trades into settlement batches to ensure fairness and MEV-resistance.\n- Functions:\n- Collects incoming trades into time-bound micro-batches (e.g., 200–500 ms)\n- Runs batch optimization to minimize slippage across all trades\n- Produces a deterministic settlement sequence\n- Submits final execution to the on-chain settlement contract\n- MEV Protection:\n- Canonical transaction ordering\n- No miner-led insertion or sandwiching\n- Batch-level arbitrage correction\n\n5 Arbitrage Executor (“Public Arbitrage Layer”)\n\n- Instead of private arbitrage bots exploiting inefficiencies, AdaVelocity executes arbitrage for the benefit of LPs and markets.\n- Features:\n- Monitors cross-DEX price divergences in real time\n- Executes arbitrage trades through the settlement contract\n- Redistributes profits to LPs (VLP reward pool)\n- Result:\n- High price accuracy\n- Reduced value leakage\n- More consistent execution for users\n\n6 Institutional API Gateway\n\n- A single entry point for trading firms, aggregators, and apps.\n- Provides:\n- REST + WebSocket trading endpoints\n- Deep liquidity view (via VLPs)\n- Deterministic settlement expectations\n- Access to routing engine quotes\n- Rate limits + QoS for professional flows\n- This enables institutional-grade trading without predatory execution strategies.\n\n7 Price Oracle Mesh\n\n- A distributed network of data sources feeding real-time:\n- DEX pool states\n- Price deviations\n- Volume and volatility indicators\n- Liquidity depth snapshots\n\n8 Tech:\n\n- Light clients querying on-chain data\n- Off-chain state replication\n- Optional integration with Charli3 and Orcfax\n\n**Smart Contract Design \\- Modules**\n\nA. Liquidity Adapter Module\n\nConnects to individual DEX pools\n\nNormalizes interfaces\n\nPrevents reentrancy attacks\n\nSafe math for AMM calculations\n\nB. Virtual Pool Module\n\nCreates synthetic pool representation\n\nStores routing metadata\n\nExposes virtual slippage curves\n\nC. Settlement Module\n\nValidates batches\n\nExecutes multi-venue swaps\n\nEnforces deterministic ordering\n\nEmits settlement receipts for accounting\n\nD. Fee &amp; Rewards Module\n\nCollects protocol fees\n\nRedistributes arbitrage profits\n\nAllocates usage-based rewards to LPs\n\n- More details available at supporting link\n- [https://adavelcity\\.com](https://adavelcity.com)\n- [https://drive\\.google\\.com/file/d/1BNi7zS1aHXUdz0Ex8D6mza68cw72tOqu/view?usp=drive\\_link](https://drive.google.com/file/d/1BNi7zS1aHXUdz0Ex8D6mza68cw72tOqu/view?usp=drive_link)\n- [https://drive\\.google\\.com/file/d/1Y6Z2oPkNaWQgtwtzzV4rihrrpKP94AxL/view?usp=drive\\_link](https://drive.google.com/file/d/1Y6Z2oPkNaWQgtwtzzV4rihrrpKP94AxL/view?usp=drive_link)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**Adavelocity** contributes to the Cardano community by improving the economic efficiency of the entire DeFi ecosystem rather than benefitting a single platform or user group. Today, liquidity sits in separate pools, which limits the trading experience, discourages institutional capital, and forces DEXs into constant competition for incentives. By coordinating liquidity instead of splitting it, the project makes Cardano a more attractive place to trade, build, and deploy capital.\n\n**Key positive effects for the Cardano ecosystem:**\n\n**Higher liquidity productivity**\n\nExisting liquidity generates more volume and more fee revenue without requiring new token incentives or farming programs. This reduces the long-term cost of bootstrapping DeFi on Cardano.\n\n**Better trading experience for regular users**\n\nPeople no longer need to compare platforms manually or tolerate poor pricing. Fairer execution builds confidence among everyday users, not just experts.\n\n**Fairer markets for small traders and small businesses**\n\nReduced slippage and more stable execution remove a hidden disadvantage that small traders currently face compared to automated actors.\n\n**A pathway for institutional adoption**\n\nPredictable execution and stable pricing are critical requirements for professional capital. Meeting those requirements opens the door to significant new liquidity flows.\n\n**More volume and fee generation for DEXs**\n\nDEXs do not lose users or liquidity to Adavelocity. Instead, they gain activity and fee revenue without needing to change their design or operate differently.\n\n**A more competitive Cardano globally**\n\nFaster, cheaper, and fairer execution makes Cardano more attractive compared to other ecosystems, helping retain users and builders long-term.\n\nThe impact of Adavelocity is that Cardano becomes a place where trading feels good, works reliably, and supports growth for everyone, not just the biggest players, it brings diverse groups of traders into cardano dex ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"The core team has direct experience in building low-latency systems, smart contracts, liquidity automation tools, and scalable backend infrastructure. Members have previously delivered production-grade technology, market-data platforms, algorithmic trading systems, and distributed compute environments. This background enables us to build the routing engine, liquidity automation modules, and Hydra-based execution layer in a reliable and secure manner.\n\nTo ensure feasibility and accountability, the delivery plan is based on incremental validation rather than large assumptions.\n\n\n\nThe  members have very good understanding of trading and protocols. team members have buid dex connector for open source tool like humming bot to dex like minswap and sundae swap. \n\n\n\n The project will demonstrate value step-by-step, proving each core component on testnet before advancing:\n\n**Routing engine MVP**:  verify that best-execution routing consistently outperforms direct single-DEX execution.\n\n**Price convergence module:** verify that pricing gaps between DEXs are reduced in controlled scenarios.\n\n**Liquidity reinforcement module:** verify that slippage improves for medium and large trades compared to baseline.\n\n**Public API / SDK:** verify that external developers and strategies can integrate without custom infrastructure.\n\nEach milestone is measurable, recorded on testnet, and published openly so the community can validate progress. The protocol design is fully non-custodial, and audits and performance testing will be carried out prior to mainnet deployment.\n\n**We will report:**\n\n- Code progress through GitHub commits and releases\n- Development updates via public posts\n- Performance benchmarks from testnet execution\n- User feedback from the testnet pilot group\n\n**Feasibility comes from a combination of:**\n\n- A skilled engineering team with relevant experience\n- Phased delivery with measurable outcomes\n- Transparency and open development processes, and a non-custodial technical design that minimizes risk.\n\nTogether, these ensure the project is not only technically deliverable but delivered with accountability and validation at every stage.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"System Blueprint, Architecture, and Project Foundation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Full architecture for the routing protocol and liquidity logic.\n- Data model for price feeds, routing priorities, and execution triggers.\n- Component map for off-chain modules, on-chain interactions, and developer interfaces.\n- Repository initialized with structured planning and module scaffolding.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The architecture and requirements must describe all modules, data flows and execution logic with enough clarity to start development immediately. The design is clear and technically feasible, realistic to implement within the project scope and requires no major restructuring in later milestones.\n- Documentation sufficiently detailed for any developer to understand how modules interact.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public GitHub repository containing final blueprint, diagrams, and planning documents.\n- Completed architecture write-up published for community visibility in PDF format.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Price Aggregation Engine & Routing Logic Research Prototype","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Live price aggregation from at least two Cardano testnet DEX\n- Routing logic prototype that compares quotes and recommends optimal execution path\n- Market simulation framework to test routing under different liquidity + slippage conditions","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Simulation results show cases where routing recommendations outperform a direct testnet trade execution\n- Internal benchmarks and regression checks completed\n- GitHub Repository link for aggregation engine + simulation toolkit containing Readme file with documentation on how to use.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- GitHub Repository link for aggregation engine + simulation toolkit.\n- Screenshots/logs/video demonstrating routing decisions during testing.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"End-to-End Routing Prototype","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Fully functioning routed trade on Cardano testnet (quote → route → execution → settlement)\n- Automated scripts demonstrating small and medium trade scenarios\n- Early performance report comparing routed vs. direct testnet execution","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- At least one recorded routed execution is equal or better than a direct trade on testnet\n- Prototype runs consistently without critical failures across repeated test scenarios.\n- Performance report is available.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Testnet transaction links publicly shared\n- Public demo video of routing prototype\n- GitHub release including prototype code and evaluation scripts","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":35000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Documentation, Mainnet Launch & Project Close-Out","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- MVP documentation including architecture, usage guide, developer integration steps, and future roadmap opportunities\n- Public close-out video explaining the MVP, what was achieved, and how developers can experiment with it\n- Final performance summary and next-phase recommendations\n- Optional open workshop / live call for early adopters","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Documentation enables a new developer to use the prototype without team assistance\n- Close-out video published publicly and covers implementation, learnings, limitations, and next steps\n- Closeout Report is published\n- Workshop is organized","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public GitHub documentation and final PDF report.\n- Announcement post/Video.\n- Publicly published Project close-out video.\n- Publiclly published Project close-out Report summarizing progress and results.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Team members:**\n\n**Project Lead:** Sutapa Roygupta\n\nSkills: Cardano Developer, AI Engineer and Full Stack Developer, Agile Project Management, Leadership, DevOps, Continuous Integration and Continuous Delivery (CI/CD), Scope Analysis, Market research.\n\nExperience: 15+ years of experience in product development, including Cardano Development Experience, managed multiple projects, from ideation to deployment, using agile methodologies and best practices. Contributed to the growth and improvement of products and services, by partnering with internal and external stakeholders, conducting market research.\n\n[https://www\\.linkedin\\.com/in/sutapa\\-roygupta\\-4a5a0634/](https://www.linkedin.com/in/sutapa-roygupta-4a5a0634/)\n\n**Software Developer:** Rayan Ahmad\n\nSkills: Full Stack Developer, Cardano Smart Contract Developer, Web3 &amp; dApp Engineer\n\nExperience: Built production-grade dApps in Cardano ecosystem, including Liquidity pools, with on-chain lending logic and DEX integrations; front-end and back-end development across multiple platforms; strong smart contract development experience in Plutus and Lucid.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/rayan\\-ahmad\\-25nov/](https://www.linkedin.com/in/rayan-ahmad-25nov/)\n\n**Visual Designer:** Avishek Paul\n\nSkills: UI/UX Design, Concept Art, Branding, Digital Illustration, 3D Modeling &amp; Animation\n\nExperience: 5+ years of professional and freelance graphic design experience; previously Creative Designer at AIQUANT Technologies and Visual Designer at InnerKraft Health; strong background in branding, poster and logo design, storyboard creation, and high-quality UI/visual design for web applications.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/avishek\\-paul\\-23735415b](https://www.linkedin.com/in/avishek-paul-23735415b)\n\n**Software Developer:** Snehasish Paul\n\nSkills: Full Stack Development (Spring Boot &amp; React), Microservices Architecture, API Engineering, SQL/PostgreSQL, Web3 Integration on Cardano\n\nExperience: 3+ years of full-stack engineering experience building production-grade applications end-to-end. Currently SDE-2 at AIQUANT Technologies working on scalable blockchain-enabled systems, including Cardano-based dApps. Previously contributed to multiple large enterprise products at RankTech Solutions, including AI-based live claim settlement, remote healthcare services, and legacy platform upgrades.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/snehasishpaulweb](https://www.linkedin.com/in/snehasishpaulweb)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Milestone 1 – System Blueprint, Architecture, and Project Foundation**\n\nDuration: 1 Month\n\nBackend Developer: 30 person-days × ₳400/day = ₳12,000\n\nSmart Contract Developer: 25 person-days × ₳500/day = ₳12,500\n\nSolution Architect: 20 person-days × ₳500/day = ₳10,000\n\nQA / Testing: 10 person-days × ₳300/day = ₳3,000\n\nInfrastructure &amp; tooling = ₳2,500\n\nTotal: ₳40,000\n\n**Milestone 2 – Price Aggregation Engine &amp; Routing Logic Research Prototype**\n\nDuration: 2 Months\n\nBackend Developer: 30 person-days × ₳400/day = ₳12,000\n\nSmart Contract Developer: 25 person-days × ₳500/day = ₳12,500\n\nIntegration Engineer: 25 person-days × ₳400/day = ₳10,000\n\nQA / Testing: 10 person-days × ₳300/day = ₳3,000\n\nInfrastructure &amp; tooling = ₳2,500\n\nTotal: ₳40,000\n\n**Milestone 3 – End\\-to\\-End Routing Prototype**\n\nDuration: 2 Months\n\nBackend Developer: 25 person-days × ₳400/day = ₳10,000\n\nSmart Contract Developer: 15 person-days × ₳500/day = ₳7,500\n\nFrontend / SDK Developer: 25 person-days × ₳300/day = ₳7,500\n\nQA / Testing: 20 person-days × ₳300/day = ₳6,000\n\nInfrastructure &amp; tooling = ₳4,000\n\nTotal: ₳35,000\n\n**Milestone 4 –Documentation, Mainnet Launch &amp; Project Close\\-Out**\n\nDuration: 2 Months\n\nBackend Developer: 10 person-days × ₳400/day = ₳4,000\n\nTechnical Writer / Documentation: 12 person-days × ₳250/day = ₳3,000\n\nExternal Audit (security review) = ₳14,000\n\nInfrastructure &amp; monitoring = ₳4,000\n\n**Total: ₳25,000**\n\n**Total Project Budget: ₳140,000 ADA**","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project delivers value for money by improving the performance of the entire Cardano DeFi ecosystem rather than benefiting a single application. Adavelocity does not require incentives, liquidity subsidies, or ongoing treasury support. Once developed, the protocol continues to generate value without additional cost to the Cardano community.\n\n\n\nInstead of building another DEX or liquidity product that fragments the market further, this project strengthens every DEX and trading venue already live on Cardano. One investment benefits multiple platforms and thousands of users, which makes the cost more efficient than funding multiple isolated tools.\n\n\n\n**The proposal funds:**\n\n\n\n- Backend execution engine and routing logic\n\n\n\n- Smart contract development\n\n\n\n- Hydra integration for performance\n\n\n\n- Developer-accessible API and SDK\n\n\n\n- Testing, audits, and documentation\n\n\n\nThese deliverables create shared infrastructure that can be reused indefinitely by DEXs, wallets, developers, liquidity providers, and institutions, at no additional cost to the ecosystem.\n\n\n\n**The success of this project increases:**\n\n\n\n- Trading volume across DEXs\n\n\n\n- Fee revenue for liquidity providers\n\n\n\n- Retention of DeFi users\n\n\n\n- Attractiveness of Cardano as a high-performance trading environment\n\n\n\nThe budget is structured around milestones, and funding is only used to build, test, audit, and deploy the protocol. No part of the budget depends on token incentives or emissions.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"DeFi","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1702}