{"pr_id":"019ac10e-56c0-7763-892a-6dadd5158b10","title":"[HBA] Vietnam B2B Matching Project","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Most Web2 firms in Vietnam are only at the awareness stage. This project acts as a key bridge, helping Web2 businesses understand and connect with practical Web3 applications.","solution":"Conduct a large-scale survey on Web3 adoption among HCMC businesses and host a conference for Web2–Web3 companies to meet, network, and explore collaboration.","proposer_name":"Ho Chi Minh City Blockchain Association","proposer_relevant_experience":"# **Research Lead: PhD\\. Nguyen Quoc Huy**\nLinkedIn: [https://www\\.linkedin\\.com/in/nguyen\\-quoc\\-huy\\-b6195581/](https://www.linkedin.com/in/nguyen-quoc-huy-b6195581/)\n\n**Responsibilities:**\n\n• Design and implement the survey methodology, including questionnaire development and sampling approach.\n\n• Conduct data collection across selected target groups through online and offline channels.\n\n• Analyze survey results to identify key trends, insights, challenges, and opportunities.\n\n• Develop a comprehensive report with findings, conclusions, and actionable recommendations.\n\n**Qualifications:**\n\n• 50+ international research papers with 10 published just this year.\n\n• Japan Advanced Institute of Science and Technology.\n\n# **Tran Xuan Tien \\- Secretary of HCMC Blockchain Association**\nRole: Project Manager\n\n**Responsibilities:**\n\n• Ensure all events are executed smoothly across both communications and operations.\n\n• Coordinate with media partners, internal teams, and external stakeholders to deliver event outcomes.\n\n• Manage timelines, logistics, and on-site execution to maintain event quality and consistency.\n\n• Oversee post-event reporting, communication deliverables, and continuous improvement processes.\n\n**Qualifications:**\n\n• 10 years of experience in Communications and Government Relations.\n\n• PR background in leading technology companies across both Web2 and Web3 sectors.\n\n\n\n# Cardano Vietnam will partner with HBA\n**About Cardano Vietnam**\n\n- Cardano Vietnam is a long-standing, sustainable community dedicated to education, technical training, builder development, and the expansion of the Cardano ecosystem in Vietnam. Led by Cardano Ambassadors, the community has built an extensive network across universities, technology clubs, Web3 startups, and domestic blockchain partners.\n\n- As an event partner and a collaborator in applying Cardano Blockchain technology, Cardano Vietnam will take on the following roles:\n\n- Developer onboarding and practical training: wallet creation, testnet interaction, transaction execution, introductions to Plutus and Hydra, and setting up development environments.\n\n- Ecosystem education: governance, Project Catalyst, treasury mechanisms, and funding opportunities for startups and emerging project teams.\n\n- Enterprise advisory: supporting traditional businesses and startups in adopting Cardano Blockchain solutions.\n\n- Content development and localization: producing high-quality Vietnamese materials for students, developers, founders, and ADA holders.\n\n- Event and community media support: promoting activities, amplifying communication across social channels, and engaging participants.\n\n- Collaboration with universities, developer communities, and Web3 partners to help Cardano reach broader user groups across Vietnam.\n\nWith a strong network and consistent training and communication efforts, Cardano Vietnam plays a critical role in attracting new builders and supporting businesses in adopting Cardano technology.","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"[HBA] Vietnam B2B Matching Project","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Ho Chi Minh City Blockchain Association","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Most Web2 firms in Vietnam are only at the awareness stage. This project acts as a key bridge, helping Web2 businesses understand and connect with practical Web3 applications.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Conduct a large-scale survey on Web3 adoption among HCMC businesses and host a conference for Web2–Web3 companies to meet, network, and explore collaboration.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://drive.google.com/file/d/170X5dh37SRAEUtRn_zeZkqtqyG5zmXHp/view?usp=share_link","https://docs.google.com/document/d/1y8BYevOhdsjRS1O3zzaWgy-3XBv1gWxySmsezc5y-wc/edit?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"This is a research activity conducted by the Institute of Copyright and Intellectual Property Technology. Therefore, the research outcomes will be published and Cardano will receive the corresponding benefits.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Events","group":"Events & Marketing"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We aim to target both Web2 and Web3 businesses.\n\n\n\nHBA is the official blockchain organization in Ho Chi Minh City and the most suitable entity to lead these initiatives.\n\nThrough its partnership with the Institute of Copyright Technology and Digital Assets, HBA will directly engage leading business associations and Web2 enterprises such as VCCI, HUBA, and YBA. At the same time, HBA will leverage its extensive network within the Web3 ecosystem to reach relevant projects and communities.\n\n\n\nGiven the importance and expected impact of this project, Cardano will be positioned as the Diamond Sponsor. This provides Cardano with not only prominent and official mainstream media exposure, but also direct access to key businesses and government agencies in Ho Chi Minh City.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"- A press conference to announce the survey, together with relevant government agencies and business associations.\n\n- Collect and conduct interviews with Web2 and Web3 businesses.\n\n- Analyze the collected data and develop a comprehensive report on the state of blockchain adoption among businesses in Ho Chi Minh City.\n\n- A conference to present the survey findings, inviting government agencies and business representatives, including both keynote sessions and panel discussions.\n\n- A private dinner to facilitate networking between Web2 and Web3 businesses.\n\n- Related media and communication activities.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"- 500+ Web2 businesses participating in the report.\n\n- Major business associations and government agencies partnering in the report.\n\n- 10+ media articles covering the report.\n\n- 200+ VIP guests attending the survey launch event.\n\n- 50 VIP+ guests attending the private dinner","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"# **Problem perception**\n- Vietnam is one of the leading countries in the world in terms of crypto adoption. However, the practical application of blockchain technology in real business use cases remains underdeveloped.\n- Although the Prime Minister introduced the N**ational Blockchain Strategy in 2024**, setting the ambition for Vietnam to become a regional hub for blockchain innovation and a home for leading blockchain enterprises, most businesses have not yet reached the expected level of adoption.\n- Blockchain has already demonstrated clear benefits in optimizing operations, improving efficiency, and increasing revenue. However, bringing blockchain closer to businesses requires practical and well-structured initiatives that can bridge the gap between strategic vision and real implementation.\n- Ho Chi Minh City alone has more than **100,000 Web2 businesses**, yet the connection to blockchain solutions remains largely untapped. This project will serve as a strategic bridge to link Web2 enterprises with Web3 innovations.\n- **For Cardano**, the entire program provides continuous sponsor-level visibility, **ensuring prominent presence** and the highest level of access to Web2 businesses throughout all activities and events.\n\n# Our approach\n\n\n- Before developing any evaluation or solution plan, we first need a comprehensive report on the current state of Vietnamese businesses, including their attitudes, plans, assessments, and level of understanding regarding blockchain technology.\n\n- Once this overall landscape is established, HBA will take the lead as a connector to drive blockchain adoption among businesses in Ho Chi Minh City through communication initiatives and targeted events.\n\n- The first step is a survey launch conference that creates a space for both Web2 and Web3 communities to come together and discuss how blockchain can be applied in a business environment. This will be followed by a private dinner to facilitate meaningful networking between the two groups.\n\n# Target engagement\n\n\nWeb2 businesses in Ho Chi Minh City","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"# **Legitimacy**\nHBA is the official and government-recognized blockchain organization in Ho Chi Minh City. All of HBA’s activities are conducted under this formal mandate. Therefore, participation in these initiatives elevates the credibility and positioning of Cardano within the local ecosystem.\n\n# **Media Impact**\nHBA’s activities consistently generate strong mainstream media coverage, something Cardano has not fully leveraged in Vietnam in recent years. Through this project, Cardano will gain official, high-visibility exposure across major press channels.\n\n# **Ecosystem Expansion**\nThe survey and related events will create significant opportunities for blockchain adoption between Web2 and Web3 businesses. This also opens the door for Cardano to expand its ecosystem and build strategic partnerships with key organizations and enterprises in Vietnam.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"- HBA is the official blockchain organization with the sole mission of promoting blockchain adoption in Ho Chi Minh City.\n- Our partners for conducting this survey include both government and non-government organizations such as the Ho Chi Minh City Digital - Transformation Center (DXC), the Vietnam Chamber of Commerce and Industry (VCCI), the Ho Chi Minh City Union of Business Associations (HUBA), and the Young Businesspeople Association of Ho Chi Minh City (YBA).\n- We are also collaborating with the Institute of Copyright Technology and Digital Assets to execute this survey.\n\n# **Team capabilities**\n- The research team belongs to the Institute of Copyright Technology and Digital Assets and includes Associate Professors with extensive experience in technology-related research projects.\n- The event organizer has a proven track record of delivering large-scale conferences, including Conviction, the number one blockchain conference in Vietnam, which attracted more than 30,000 attendees.\n\n# **Previous work**\n- Conviction: the largest crypto and AI event in Vietnam in 2024, attracting more than 30,000 attendees.\n- Unitour Series: a high-quality educational roadshow hosted across major universities, designed to provide students with advanced knowledge in blockchain and emerging technologies.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Kickoff announcement","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"• The announcement will launch the survey, state its objectives, and introduce all participating stakeholders.\n\n• It will also highlight the media benefits and press privileges linked to the event   .","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"• An official annoucement in strengthening connections between Web2 and Web3 enterprises.\n\n• Four press articles published on strengthening connections between Web2 and Web3 enterprises.\n\n• Four posts featured on major online news platforms.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Media reporting will be provided through a shared spreadsheet with an attached link for verification.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":12000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Survey and Report","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"• A comprehensive overview of the business landscape with participation from more than 500 companies.\n\n• Survey respondents include high-quality C-level leaders and major enterprises across Ho Chi Minh City.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"• A comprehensive overview of the business landscape with participation from more than 500 companies in web2 and web3.\n\n• Data that provides valuable, pioneering insights into the blockchain sector in Vietnam.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"• A comprehensive overview of the business landscape with participation from more than 500 companies in web2 and web3.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Conference and Private Dinner","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"• The conference will be held in an elegant grand hall with participation from both Web2 and Web3 enterprises, as well as representatives from major business associations in Ho Chi Minh City.\n\n• A private dinner will be organized to facilitate direct networking between Web2 and Web3 companies.\n\n• Mainstream media coverage highlighting the survey and the event.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 200+ VIP guests attending the survey launch event.\n\n- 50 VIP+ guests attending the private dinner.\n\n- Cardano will be acknowledged as a sponsor throughout the survey.\n\n- A Cardano representative will participate as a panelist in the conference.\n\n- More than five media articles will cover the survey, highlighting ADA as the diamond sponsor.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"-Event photos.\n\n- Guest attendance list.\n\n- Spreadsheet of media articles with links and reach statistics.\n\n- 10+ media articles covering the report and the event","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":23000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Wrap up ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"• A complete event recap covering the survey report, conference, and private dinner.\n\n• A professionally edited closeout video showcasing key moments and consistent branding throughout the entire event.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"• The final closeout report will be made publicly available.\n\n• The final closeout video will also be publicly accessible.\n\n• A media performance report will summarize key results and achieved metrics.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"• Link to the final closeout report.\n\n• Link to the final closeout video.\n\n• A Google Sheet summarizing all media coverage and metrics.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":5000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"# **Research Lead: PhD\\. Nguyen Quoc Huy**\nLinkedIn: [https://www\\.linkedin\\.com/in/nguyen\\-quoc\\-huy\\-b6195581/](https://www.linkedin.com/in/nguyen-quoc-huy-b6195581/)\n\n**Responsibilities:**\n\n• Design and implement the survey methodology, including questionnaire development and sampling approach.\n\n• Conduct data collection across selected target groups through online and offline channels.\n\n• Analyze survey results to identify key trends, insights, challenges, and opportunities.\n\n• Develop a comprehensive report with findings, conclusions, and actionable recommendations.\n\n**Qualifications:**\n\n• 50+ international research papers with 10 published just this year.\n\n• Japan Advanced Institute of Science and Technology.\n\n# **Tran Xuan Tien \\- Secretary of HCMC Blockchain Association**\nRole: Project Manager\n\n**Responsibilities:**\n\n• Ensure all events are executed smoothly across both communications and operations.\n\n• Coordinate with media partners, internal teams, and external stakeholders to deliver event outcomes.\n\n• Manage timelines, logistics, and on-site execution to maintain event quality and consistency.\n\n• Oversee post-event reporting, communication deliverables, and continuous improvement processes.\n\n**Qualifications:**\n\n• 10 years of experience in Communications and Government Relations.\n\n• PR background in leading technology companies across both Web2 and Web3 sectors.\n\n\n\n# Cardano Vietnam will partner with HBA\n**About Cardano Vietnam**\n\n- Cardano Vietnam is a long-standing, sustainable community dedicated to education, technical training, builder development, and the expansion of the Cardano ecosystem in Vietnam. Led by Cardano Ambassadors, the community has built an extensive network across universities, technology clubs, Web3 startups, and domestic blockchain partners.\n\n- As an event partner and a collaborator in applying Cardano Blockchain technology, Cardano Vietnam will take on the following roles:\n\n- Developer onboarding and practical training: wallet creation, testnet interaction, transaction execution, introductions to Plutus and Hydra, and setting up development environments.\n\n- Ecosystem education: governance, Project Catalyst, treasury mechanisms, and funding opportunities for startups and emerging project teams.\n\n- Enterprise advisory: supporting traditional businesses and startups in adopting Cardano Blockchain solutions.\n\n- Content development and localization: producing high-quality Vietnamese materials for students, developers, founders, and ADA holders.\n\n- Event and community media support: promoting activities, amplifying communication across social channels, and engaging participants.\n\n- Collaboration with universities, developer communities, and Web3 partners to help Cardano reach broader user groups across Vietnam.\n\nWith a strong network and consistent training and communication efforts, Cardano Vietnam plays a critical role in attracting new builders and supporting businesses in adopting Cardano technology.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"- Due to current market conditions, we propose using an ADA reference price of **$0\\.40** to ensure project feasibility.\n- The estimated total budget required for this project is** $53,000**, equivalent to** 133,000 ADA**. We are seeking **60,000 ADA** in funding support from Cardano. In return, Cardano will receive all the benefits outlined above as the Diamond Sponsor of the program.\n- The remaining budget will be sourced through additional socialized funding to ensure full execution of the event.\n- Below is the detailed projected expenditure report: [https://docs\\.google\\.com/spreadsheets/d/1VM\\_TXJcBI\\_DhrB0bmd76SgVtgdIwfZHKAGrd5a9VRcI/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1VM_TXJcBI_DhrB0bmd76SgVtgdIwfZHKAGrd5a9VRcI/edit?usp=sharing)\n\nMILESTONE 1 (ADA 14,000 – 10%):\n\nKick-off announcement\n\n• Press kit production, media booking, and PR distribution fees:  14,000 ADA.\n\nMilestone 1 Total: 14,000\n\nMILESTONE 2 (ADA 18,000 – 40%):\n\nSurvey and Report\n\n• Survey design, questionnaire development, and methodology planning: 2,200 ADA.\n\n• Data collection costs, including distribution channels, fieldwork, and respondent incentives: 4,500 ADA.\n\n• Data cleaning, processing, and analytical work: 4,500 ADA.\n\n• Report writing, visualization, and design/formatting: 4,500 ADA.\n\n• Publication, printing,: 2,200 ADA.\n\nMilestone 2 Total: ADA 18,000\n\nMILESTONE 3 (ADA 96,000 – 40%):\n\nConference and Private Dinner\n\n• Venue rental, staging, audio-visual setup, and event logistics for the conference: 27,000 ADA.\n\n• Press kit production, media booking, and PR distribution fees: 54,000 ADA\n\n• Speaker and guest coordination costs (honorarium, travel support if required): 2,700 ADA.\n\n• Private dinner expenses including menu, beverages, table setup, and service charges: 11,600 ADA.\n\n\n\nMilestone 3 Total: ADA 96,000\n\nMILESTONE 4 (ADA 1,800 - 10%)\n\nWrap up\n\n- Edit video and report: 1,800 ADA.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"# **Legitimacy**\nHBA is the official and government-recognized blockchain organization in Ho Chi Minh City. All of HBA’s activities are conducted under this formal mandate. Therefore, participation in these initiatives elevates the credibility and positioning of Cardano within the local ecosystem.\n\n# **Media Impact**\nHBA’s activities consistently generate strong mainstream media coverage, something Cardano has not fully leveraged in Vietnam in recent years. Through this project, Cardano will gain official, high-visibility exposure across major press channels.\n\n# **Ecosystem Expansion**\nThe survey and related events will create significant opportunities for blockchain adoption between Web2 and Web3 businesses. This also opens the door for Cardano to expand its ecosystem and build strategic partnerships with key organizations and enterprises in Vietnam.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Events","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1706}