{"pr_id":"019ac12e-ff33-7489-b4a4-ad31c7e6d55a","title":"Migrating U.S. Sweepstakes Users to Cardano Skill Gaming","event_id":15,"objective":37,"objective_title":"Cardano Partners: Tier-1 Enterprise Integrations","summary":"U.S. sweepstakes gaming platforms are being shut down, leaving millions of players and major affiliate networks without a legal, scalable destination for real-money online gaming.","solution":"BananaClip offers a legal skill-gaming alternative with Cardano payouts. Through a Tier-1 affiliate integration, displaced sweepstakes users migrate to a transparent and scalable on-chain platform.","proposer_name":"Ben Barba","proposer_relevant_experience":"The BananaClip team will lead all development, integration, testing, and coordination for this project.","url":null,"funds":750000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Migrating U.S. Sweepstakes Users to Cardano Skill Gaming","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Ben Barba","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an Incorporated entity or a Consortium?","description":"Are you submitting this proposal as an Incorporated entity or a Consortium?","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 250,000 and $ADA 750,000","format":null,"answer":750000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"U.S. sweepstakes gaming platforms are being shut down, leaving millions of players and major affiliate networks without a legal, scalable destination for real-money online gaming.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"BananaClip offers a legal skill-gaming alternative with Cardano payouts. Through a Tier-1 affiliate integration, displaced sweepstakes users migrate to a transparent and scalable on-chain platform.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.bananaclip.io/","https://x.com/BananaClipGame","https://linktr.ee/bananaclipstudios"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","description":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","format":null,"answer":"All integrations and systems developed during this pilot will remain proprietary due to security, compliance, and commercial requirements.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Games","group":"GameFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your established collaborations.","description":"Please provide your rationale for your established collaborations.","format":null,"answer":"BananaClip has formed a strategic collaboration with Growth Leads, one of the largest affiliate operators in the U.S. online gaming and sweepstakes industry. Growth Leads manages high-value acquisition funnels for millions of players across casino, sweepstakes, and skill-gaming verticals, and is directly impacted by the nationwide regulatory shutdown of sweepstakes platforms.\n\n\n\nOur partnership focuses on creating a compliant, scalable replacement destination for users currently funneled to sweepstakes operators that will no longer be legal in major states such as California (starting January 2026). Growth Leads has agreed to collaborate on:\n\n\n\n- Technical integration of their attribution and tracking systems with BananaClip\n- Traffic allocation from existing sweepstakes funnels into BananaClip during the pilot\n- Joint performance analysis to validate conversion, compliance, and user behavior\n- Co-marketing and promotional alignment for launch and ongoing campaigns\n\n\n\nThis collaboration provides BananaClip with immediate national distribution and access to a proven Tier-1 user acquisition engine. Growth Leads gains a compliant skill-gaming alternative capable of absorbing displaced sweepstakes traffic, while Cardano becomes the default settlement layer for deposits, contest entries, and payouts tied to this migration.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe funding commitments.","description":"Please provide your rationale for your funding commitments.","format":null,"answer":"BananaClip and Growth Leads are jointly committing resources to ensure the success of this enterprise demonstrator pilot.\n\n\n\nGrowth Leads is contributing significant in-kind value through:\n\n\n\n- Traffic allocation from their existing high-value sweepstakes funnels, representing millions of dollars in annual acquisition value.\n- Integration engineering support, including implementation of tracking, reporting, and attribution systems required for large-scale user migration.\n- Marketing exposure across Growth Leads’ owned properties, placements, and promotional channels at no additional cost to the project.\n- Compliance consultation to align the pilot with emerging state regulations and ensure a fully legal alternative to sweepstakes gaming.\n\n\n\nThese contributions represent substantial commercial value and confirm Growth Leads' long-term commitment to transitioning users away from sweepstakes platforms and into BananaClip’s Cardano-backed skill gaming environment.\n\n\n\nBananaClip is committing:\n\n\n\n- Internal engineering resources covering infrastructure, Cardano integration, wallet settlement, and gameplay system enhancements.\n- Product, compliance, and operational oversight throughout all phases of the pilot.\n- A matching investment of ongoing development hours beyond what Catalyst funds cover, ensuring delivery of all integration milestones.\n- Co-marketing and reporting efforts, including analytics, dashboards, publishing the enterprise case study, and on-chain transaction transparency.\n\n\n\nCatalyst funding will be used exclusively for future development, technical integration, scaling, Cardano settlement infrastructure, and co-marketing execution. All parties are committed to delivering a compliant, operational, and measurable pilot that drives sustained on-chain transaction volume for Cardano.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your key performance metrics.","description":"Please provide your rationale for your key performance metrics.","format":null,"answer":"The pilot will be evaluated on two primary KPI groups:\n\n\n\n1. User Migration\n\n\n\n- Number of users referred by Growth Leads\n- Conversion rate to registered BananaClip accounts\n- Percentage of users who enter at least one contest\n\n\n\n2. On-Chain Activity (Core Catalyst Metric)\n\n\n\n- Total Cardano transactions from deposits, entries, payouts, and withdrawals\n- Stablecoin volume processed on Cardano\n- Average on-chain transactions per active user\n\n\n\nThese metrics directly measure adoption, usage, and Cardano transaction impact — the core outcomes this pilot aims to validate.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We will integrate BananaClip, a legal skill-based gaming platform, with Growth Leads, one of the largest affiliate networks serving U.S. sweepstakes players. As state regulations shut down online sweepstakes operators, Growth Leads needs a compliant destination for the significant user traffic they can no longer send to sweepstakes platforms.\n\n\n\nThis pilot creates that pathway by redirecting a portion of Growth Leads’ traffic to BananaClip, where users can participate in skill-based contests instead of chance-based sweepstakes. BananaClip enables real-money contest entries and payouts using Cardano stablecoins, providing transparent on-chain settlement, low-cost microtransactions, and a verifiable audit trail that aligns with emerging state compliance requirements.\n\n\n\nThe pilot will test the full user migration funnel end-to-end: referral, onboarding, contest participation, and Cardano-settled payouts. Success will demonstrate that Cardano can support a large-scale, consumer-facing gaming vertical and provide a viable, compliant alternative for millions of users displaced by the decline of sweepstakes platforms.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This pilot brings large-scale, mainstream users onto Cardano through a real consumer application. As sweepstakes platforms shut down, millions of players must transition to legal alternatives. By integrating BananaClip with Growth Leads’ national user acquisition channels, Cardano becomes the settlement layer for deposits, entries, and payouts for a high-volume skill gaming vertical.\n\n\n\nThis creates immediate, measurable benefits for the Cardano community:\n\n\n\n- Significant on-chain activity from real users making real transactions\n- Stablecoin transaction volume tied to a major consumer use case\n- Increased awareness of Cardano as a practical settlement solution in the U.S. gaming market\n- A proven enterprise integration, demonstrating Cardano’s value to a Tier-1 partner\n- A compliant model that other gaming and entertainment platforms can adopt\n- A public case study showing Cardano’s scalability, cost efficiency, and regulatory alignment\n\n\n\nThe result is a visible, high-impact demonstration of Cardano’s utility that strengthens the ecosystem, drives adoption, and positions Cardano as a leading chain for consumer applications.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our team has a proven track record of delivering what we commit to. BananaClip is already live today with a full gaming platform, real users, and functioning crypto payouts. We were also the first project on Cardano to complete a native integration with Fireblocks, demonstrating our ability to execute secure, production-grade infrastructure.\n\n\n\nWe work closely with Growth Leads, who are directly involved in shaping the pilot and confirming the traffic and integration requirements. Feasibility will be validated through controlled traffic tests, on-chain transaction monitoring, and ongoing data reviews with our partner as we scale.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Integration Architecture & Project Setup","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers the complete technical integration plan covering how BananaClip, Cardano settlement, and Growth Leads will connect across tracking, attribution, and payout systems. It also includes internal documentation for compliance, state-level regulatory considerations, and a fully set-up project management workspace used to track progress across all teams.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Acceptance requires that the architecture plan is finalized, internally reviewed, and shared with Catalyst. The compliance outline must be completed and approved by our internal team, and the project workspace must be created with all tasks loaded. A kickoff meeting must occur with notes recorded, demonstrating all teams understand scope and responsibilities.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will consist of a PDF export of the architecture plan, a PDF outline describing compliance considerations, screenshots showing the project workspace setup, and documented notes from the kickoff meeting confirming alignment between BananaClip, Growth Leads, and project leadership.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":225000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cardano Settlement Implementation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone completes the development of the Cardano settlement layer, including stablecoin-based deposits, withdrawals, and payouts implemented in a staging environment. A full connection to Fireblocks will be established to ensure secure settlement flows. Internal test transactions will be executed to validate reliability and readiness for further testing.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Acceptance requires the settlement code to be deployed in a working staging environment, with at least several test transactions executed and logged. The internal test checklist must be completed and reviewed, confirming that all core functions—deposit, contest entry flow, and payout logic—are behaving as intended within controlled test conditions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include screenshots of the staging environment showing the settlement UI and workflow, logs of completed Cardano test transactions with transaction hashes, and a short technical summary document describing what was implemented and how the tests were performed. This documentation will demonstrate the system is operational at the integration level.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":200000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Growth Leads Attribution & Tracking Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone integrates Growth Leads’ tracking and attribution systems with BananaClip, enabling accurate referral flow and analytics. A basic internal dashboard will be created to monitor traffic patterns, referral performance, and system behavior. Joint testing with Growth Leads will be conducted to ensure both teams confirm that data is flowing correctly.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Acceptance requires that tracking endpoints are successfully connected in staging and show sample referral data. The dashboard must populate test data and display correct metrics. A joint technical test session must occur with Growth Leads, with both teams confirming that the integration matches the requirements and works reliably.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include screenshots of the integrated tracking settings in staging, captures of the referral dashboard showing sample data, and either a written confirmation or email summary from Growth Leads acknowledging that the joint test session occurred and that the integration behaved as expected during controlled testing.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":150000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Controlled Pilot Launch (Internal Traffic Only)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone launches an internal-only pilot using simulated traffic to test the full referral, gameplay, and on-chain settlement cycle under safe, controlled conditions. The team will analyze performance, latency, and transaction flow to identify improvements before external traffic begins, ensuring the system behaves predictably at scale.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Acceptance requires a detailed internal simulation test to be completed, including settlement execution, referral tracking, and contest entry-flow verification. A full internal performance review must be documented, showing that key functions work without critical errors and that the engineering team has applied any required optimizations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include a written simulation summary report describing traffic volume, system behavior, and performance metrics. Screenshots or logs from the internal testing environment will be included, along with a completed QA checklist confirming that the controlled pilot successfully validated the functional pipeline.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":75000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"External Pilot Activation with Growth Leads","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone activates a limited external pilot with Growth Leads, routing a small amount of real referral traffic into BananaClip. The goal is to validate the full user flow in production—tracking, contest entry, and Cardano-settled payouts—while monitoring system stability. A short performance summary will be delivered after the initial live period.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Acceptance requires that production systems receive controlled external traffic, that attribution and tracking behave correctly, and that at least one full cycle of transactions flows through the Cardano settlement layer. Growth Leads must confirm that test traffic was observed on their side and that data aligns with expectations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include an email or written confirmation from Growth Leads acknowledging that external pilot traffic occurred, a PDF summarizing the first week of pilot performance, and screenshots from internal dashboards showing referral flow, transaction activity, and stable on-chain settlement during the pilot.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #6","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Report, Case Study & Closeout","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone completes the full project closeout, including a comprehensive final report summarizing the pilot’s technical execution, on-chain activity, and outcomes. A short video walkthrough will be produced showing the integration, settlement flow, and pilot results. A written case study will be drafted for potential publication with Growth Leads.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Acceptance requires the final report to be submitted to Catalyst, the video overview to be completed and shared, and a case study drafted that outlines key learnings and measurable outcomes. All documents must clearly detail how the system performed and how Cardano was used during the pilot.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include the final report PDF, a link to or file of the recorded walkthrough video, and the completed written case study. These materials will demonstrate full transparency and serve as the official closeout package, confirming that all project deliverables were completed within the expected timeline.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"The BananaClip team will lead all development, integration, testing, and coordination for this project.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The budget is allocated to cover the engineering, integration, compliance, testing, and reporting work required to execute a nine-month enterprise demonstrator pilot with Growth Leads. Most costs are concentrated in the early phases where the bulk of development and infrastructure setup occurs. Funds will support senior engineers, full-stack developers, blockchain specialists, infrastructure and DevOps resources, compliance review, analytics preparation, QA, and coordinated pilot operations.\n\n\n\n1. Cardano Settlement Engineering – 240,000 ADA\n\n\n\nThis covers the design and development of the Cardano settlement layer, including stablecoin deposit and payout logic, Fireblocks wallet integration, transaction execution, state handling, and internal testing. It also includes infrastructure setup and DevOps work required to maintain a secure, stable staging environment.\n\n\n\n2. Growth Leads Integration & Tracking Systems – 155,000 ADA\n\n\n\nAllocated to implementing referral tracking, attribution endpoints, conversion data pipelines, analytics dashboard creation, and cross-team integration work. This includes engineering hours for working with Growth Leads’ technical staff, schema mapping, and validation of referral and tracking accuracy.\n\n\n\n3. Internal Pilot Simulation & Load Testing – 80,000 ADA\n\n\n\nThis includes engineering time for traffic simulation, QA validation, on-chain settlement testing under controlled load, monitoring setup, bug fixes, optimization passes, and preparation for external traffic. It also includes infrastructure costs related to testing environments.\n\n\n\n4. External Pilot Execution & Monitoring – 65,000 ADA\n\n\n\nCovers engineering oversight during the limited external pilot with Growth Leads, ongoing monitoring, data capture, refinement of settlement flows, reliability improvements, and internal reporting on system behavior throughout the live test period.\n\n\n\n5. Compliance, Documentation, and Reporting – 95,000 ADA\n\n\n\nAllocated to preparing regulatory alignment documentation, internal compliance outlines, required architectural documentation, system performance reports, and final closeout package materials. Also includes the creation of the case study and walkthrough video required by Catalyst.\n\n\n\n6. Project Management, Coordination & Contingency – 115,000 ADA\n\n\n\nSupports project coordination across BananaClip and Growth Leads, milestone verification, reporting, communication, and general management of the pilot timeline. This also includes a necessary contingency buffer for unexpected engineering adjustments, infrastructure needs, or additional testing.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project delivers strong value for the Cardano ecosystem because it directs an existing, proven, large-scale user acquisition engine into a real on-chain use case. The cost of the project is primarily allocated to engineering, integration, and the technical work required to bring Cardano settlement into a high-volume consumer product that already exists. Rather than funding concept development or speculative experiments, Catalyst is supporting the integration of Cardano into a live platform with an established partner and a clear path to measurable transaction volume.\n\n\n\nThe budget creates direct on-chain usage by enabling deposits, contest entries, and payouts to settle through Cardano stablecoins. This positions Cardano as the default settlement layer for a major U.S. gaming vertical at the exact moment sweepstakes platforms are being shut down. The project also produces a full enterprise case study and a validated integration that other gaming platforms can adopt, multiplying the long-term value to the ecosystem.\n\n\n\nIn short, the cost represents strong value because it funds concrete development, delivers a Tier-1 integration, produces real on-chain activity, and demonstrates Cardano’s readiness to support large consumer markets.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead applicant is a verified legal business entity.","description":"Legal Entity:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead org has a ≥2-year track record, and the consortium collectively has ≥$5M in verifiable annual revenue.","description":"Track Record & Revenue:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of collaboration with a qualified Tier-1 enterprise is provided.","description":" Tier-1 Collaboration:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is for mature R&D or integration, not an early-stage concept or core infrastructure.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of a mature product is provided, with a clear integration plan if not already on Cardano.","description":"Mature Product & Path:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that all key partners, including the Tier-1 collaborator, are clearly identified.","description":"Partner Identification:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that a clear statement of the partner's in-kind or financial contributions is included.","description":"Partner Commitment:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable references (e.g., LinkedIn, portfolio) for key team members.","description":"Verifiable Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear KPIs for adoption (e.g., transaction volume, user growth). Forecast for projected on-chain transaction volume is provided with adequate justification.","description":"Measurable Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that delivery is ≤ 12 months with clear milestones.","description":"Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a co-marketing or community engagement plan to amplify Cardano's visibility.","description":"Visibility & Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal budget is for future work only, not for completed tasks. No incentives, giveaways, private treasuries and regranting are included in the budget.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Games","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1709}