{"pr_id":"019ab8f7-6b99-72e9-ae75-b1d374cdc11b","title":"Powering New Health Systems using Cardano by selfdriven","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"AI enables decentralised health, but it depends on trusted systems. Non-technical health organisations struggle to adopt blockchain and identity tech needed to make it work.","solution":"Deploy an open-source Health Systems Cooperative Kit, enabling health organisations to roll out blockchain, SSI and AI-accountable operations across traditional and emerging services.","proposer_name":"Mark Byers","proposer_relevant_experience":"**Mark Byers - Project Lead**\n\n\n\nSolution architecture, SSI, Cardano integrations.\n\n\n\nFounder of selfdriven Foundation. 10+ years designing decentralised operating systems for communities. Leads development of Cardano-enabled identity, governance and cooperative tooling.\n\n\n\n**Bence Lukács - Organisation Lead**\n\n\n\nCooperative structure, operating models, member roles.\n\n\n\nSpecialist in organisational architecture and community self-governance. Experience designing practical operating models for cooperatives and distributed teams.\n\n\n\n**Damian Noonan - Systems Lead**\n\n\n\nHealth systems, deployment, provider onboarding.\n\n\n\nHealth innovation strategist. Works across clinical and allied health systems with deep knowledge of service workflows and compliance in real-world settings.\n\n\n\n**Elizabeth Jones - Design & Engagement Lead**\n\n\n\nUX, adoption, non-technical onboarding.\n\n\n\nDesigner focused on accessibility and human-centred rollout of complex systems. Experienced in stakeholder education and communications for community-based projects.\n\n\n\n**Brian Halse - Governance**\n\n\n\nGovernance frameworks, policy, proposals & voting.\n\n\n\nIndependent governance specialist. Experience in cooperative governance, risk frameworks and transparency mechanisms for community-owned organisations.","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Powering New Health Systems using Cardano by selfdriven","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Mark Byers","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":10,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null},{"ref":"#/definitions/singleLineHttpsURLEntry","title":"Original Document Link","description":"Provide a link to the original proposal document in its original language","format":null,"answer":"https://energy.selfdriven.foundation/cardano-catalyst/proposal/health-systems-cooperative/","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"AI enables decentralised health, but it depends on trusted systems. Non-technical health organisations struggle to adopt blockchain and identity tech needed to make it work.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Deploy an open-source Health Systems Cooperative Kit, enabling health organisations to roll out blockchain, SSI and AI-accountable operations across traditional and emerging services.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://energy.selfdriven.foundation/cardano-catalyst/proposal/health-systems-cooperative/","https://selfdriven.health","https://selfdriven.network","https://behub.com.au","https://energy.selfdriven.foundation/cardano-catalyst/proposal/checklist/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Cardano network, selfdriven.network, selfdriven.health Cooperative","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Yes (MIT/Apache‑2.0/CCO).","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Healthcare","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"We cannot find any existing product or Catalyst proposal that takes a health initiative all the way from an initial intent definition through to a fully provisioned, operational, decentralised cooperative system. The gap is end-to-end delivery: most solutions focus on tooling or pilots, but none provide the full pathway for real health organisations to define a mission, coordinate stakeholders, establish governance, deploy infrastructure, and operate a live cooperative model.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The prototype will be accessible at [https://coop\\.selfdriven\\.health](https://coop.selfdriven.health) (built on org.selfdriven.app and app.behub.io). It will show the current cooperative platform in action and demonstrate how self-actuation extends it — guiding a health organisation from definition of intent through to a fully provisioned decentralised cooperative system with governance, identity, and deployment steps built in.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Success can be measured through clear on-chain signals. These include the generation of cooperative Script and Plutus addresses to manage shared assets, proofs of identity issued and verified, and evidence of cooperative members actively using the system themselves — such as creating their own wallets.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We will build and deliver an open-source Health Cooperative Kit—a fully integrated, end-to-end framework that allows health organisations to move from “intent definition” all the way to a fully operating decentralised cooperative on Cardano.\n\n- The Kit is based on our existing foundations (org.selfdriven.app, app.behub.io) but enhanced to support health-sector specific cooperative workflows.\n- It codifies a health organisation’s mission, governance, structure, roles and processes using a structured definition (e.g. JSON) — essentially a “blueprint” for what the cooperative should be and how it should operate.\n- Once defined, the Kit automates the generation of on-chain components: cooperative scripts, Plutus addresses for shared assets, identity and membership management via SSI/DID &amp; Verifiable Credentials, and asset-management logic (treasury, payments, exchanges using ADA/USDM, DeFi integrations, etc).\n- The system provides tools and UI for health-organisations (even non-technical) to onboard: register members, issue identities, manage wallets, and transparently handle operations — without requiring deep blockchain or cryptographic knowledge.\n- By combining identity, governance and asset management — the Kit creates a “plug-and-play” model for decentralised health cooperatives. Early adopters (a small network of health providers via beHub) will run a real pilot to validate the concept across traditional and emerging health services.\n\n_This is the first real health\\-sector implementation that spans definition → governance design → SSI identity → treasury/asset provisioning → live cooperative operations on\\-chain\\._\n\n**Key technical components:**\n\n- Intent &amp; Cooperative Definition Layer\n- Structured cooperative “blueprint” (JSON/YAML) for mission, roles, governance, membership and economic model.\n- Template library for different health cooperative patterns (clinic, allied health network, mutual aid, etc.).\n- Identity &amp; Membership (SSI) Layer\n- DID/SSI wallet integration for organisations and members.\n- Verifiable Credentials for roles (member, practitioner, admin, auditor).\n- Onboarding flows for non-technical users (invite, verify, issue credential).\n- Governance Layer\n- Configurable rules for proposals, voting thresholds, roles and permissions.\n- On-chain / off-chain hybrid governance workflows (e.g. signalling off-chain, enforcement on-chain).\n- Versioned governance profiles so cooperatives can evolve over time.\n- Asset &amp; Treasury Layer\n- Generation of cooperative scripts and Plutus addresses for shared assets.\n- Treasury primitives for ADA/USDM flows (member contributions, fees, payouts, rewards).\n- Hooks for DeFi integrations so members can use their own wallets and participate in shared financial activity.\n- Operations &amp; Workflow Layer\n- Configurable workflows for member onboarding, service access, contribution logging and dispute handling.\n- Role-aware views (member, practitioner, coordinator, auditor) for day-to-day operations.\n- Web App &amp; UX Layer\n- Hosted front-end at coop.selfdriven.health (backed by org.selfdriven.app and app.behub.io).\n- Dashboards for cooperative health: membership, governance activity, treasury status and SSI credential usage.\n- Guided wizards to take a cooperative from “define” to “live on Cardano”.\n- Integration &amp; API Layer\n- APIs for integrating with existing health systems (EHR/clinical systems, booking tools, CRM).\n- Webhooks and event streams for plugging into beHub and other community tools.\n- Monitoring, Proof &amp; Learning Layer\n- On-chain metrics dashboards (scripts created, transactions, identities issued, member wallet usage).\n- Data export for research, impact reporting and further Catalyst proposals.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project enables health organisations to adopt blockchain, SSI and cooperative governance in practice — not theory. Instead of more proofs-of-concept, it delivers a live cooperative model that real health providers can operate, learn from and scale.\n\n\n\n**The impact is threefold:**\n\n\n\n1.\tImpact on the health sector\n\n- Simplifies access to decentralised technology for non-technical health organisations.\n\n- Strengthens patient and practitioner trust through verifiable identity and transparent governance.\n\n- Reduces dependency on centralised operators by allowing health organisations to collectively own and govern shared digital infrastructure.\n\n- Opens the door to new models of care: mutual support networks, community-based resourcing and distributed service delivery.\n\n\n\n2.\tImpact on Cardano\n\n- Demonstrates a compelling real-world use case for Cardano combining Plutus, SSI and DeFi in a transparent and socially beneficial sector.\n\n- Creates repeatable open-source patterns for cooperative formation and on-chain treasury management.\n\n- Expands Cardano’s footprint into the health industry and generates new opportunities for integrations (identity wallets, payments, service tokens, research registries, etc.).\n\n\n\n3.\tImpact on communities and individuals\n\n- Health organisations retain control of their data, membership and financial flows.\n\n- Members can participate directly — creating wallets, receiving credentials, voting on proposals and benefiting from shared value.\n\n- Encourages patient-first health models where accountability is built in and value flows back to the community.\n\n\n\nThe project’s success establishes a reproducible pathway for other sectors (insurance, education, disability support, aged care, telehealth, mental health). Each new cooperative can be created faster and with lower cost because the framework, infrastructure and governance patterns already exist.\n\n\n\n*This project doesn’t demonstrate blockchain for health — it operationalises it.*","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"The selfdriven Foundation was founded in 2019 and the team is highly engaged within the Cardano community. It has a robust organisational structure and includes a professional services team - [selfdriven\\.services/team](%5Bhttps://www.selfdriven.services/team).\n\n**Mark Byers \\(selfdriven Co\\-founder\\)**\n\nMark is a qualified Engineer and has 30+ years experience delivering internet based high-grade solutions to market, including the vision to co-found the [https://entityOS\\.cloud](https://entityOS.cloud) service in 2000.\n\nMark has been involved in the Cardano ecosystem since 2019 and has a strong technical understanding and involvement in community projects and a co-initiator and contributor to the Eastern Cardano Council.\n\n[https://www\\.linkedin\\.com/in/marknbyers](https://www.linkedin.com/in/marknbyers)\n\n**Bence Lukács \\(selfdriven Co\\-founder\\)**\n\nBence is a former sports trainer and school teacher with 10+ years of experience in Digital Education, Higher Education Organisational Development and building open learning and collaboration (infra-)structure.\n\nBence also researches Blockchain through the lens of social sciences, focusing especially on Openness, Open Science and DeSci.\n\nAt the selfdriven Foundation he is the Organisational Lead, managing projects and organisational operations as well as supporting the development of the educational frameworks. He is engaged in the DACH (Germany, Austria and Switzerland) Cardano Community and an IntersectMBO member, participating in the Decentralised Education, the Decentralised Trust &amp; Identity SIG and (co-hosting &amp; attending various) Constitutional Workshops.\n\n[https://linkedin\\.com/in/bencelukacs](https://linkedin.com/in/bencelukacs)\n\n**Damian Noonan \\(selfdriven Co\\-Founder\\)**\n\nDamian has over 20 years experience delivering technology projects as part of strategic transformation initiatives, with expertise particularly Salesforce, MuleSoft and its emerging technologies. As co-founder of recently acquired Tquila ANZ, Damian has experience in building teams and delivering enterprise solutions.\n\n[https://www\\.linkedin\\.com/in/damian\\-noonan\\-9942891](https://www.linkedin.com/in/damian-noonan-9942891)\n\n**Elizabeth Jones – Co\\-Founder &amp; Partnership Development Manager**\n\nElizabeth is a health professional and entrepreneur with over 35 years’ experience across clinical nursing, hospital procurement, sales leadership, and healthcare innovation. A former ICU nurse, she has held senior roles with Ramsay Health Care, Sydney Adventist Hospital, BD, and ICU Medical, leading teams, managing multimillion-dollar procurement portfolios, and forging strategic partnerships in both public and private health. As co-founder of beHub, Elizabeth combines frontline clinical insight with commercial acumen to improve clinician access to accurate device information, streamline onboarding, and enhance patient flow. She continues to work part-time within NSW Health, keeping her closely connected to the realities of hospital operations.\n\n[https://au\\.linkedin\\.com/in/elizabeth\\-jones\\-38982511](https://au.linkedin.com/in/elizabeth-jones-38982511)\n\n**Brian Halse – Co\\-Founder &amp; Chair**\n\nBrian Halse is an experienced chair, non-executive director, and governance specialist with over two decades of leadership across agribusiness, education, health technology, and the not-for-profit sector. His career includes CEO roles at ChemCert Australia, High Security Irrigators, and beHub Health, where he co-founded and helped scale the platform to 31 hospitals and 3,000+ clinicians. Known for building trusted stakeholder relationships and delivering organisational transformation, Brian brings deep expertise in strategic governance, financial management, and guiding multi-stakeholder initiatives from concept to execution.\n\n[https://au\\.linkedin\\.com/in/brianhalse](https://au.linkedin.com/in/brianhalse)\n\n**About beHub**\n\nbeHub is an Australian digital health platform transforming how hospitals, manufacturers, and clinicians access medical device and product information. In large, geographically dispersed healthcare systems like Australia’s, frontline staff often struggle to access up-to-date, manufacturer-approved resources when and where they need them. beHub solves this by centralising product and training materials into one secure platform, enabling hospitals to create department-specific device “playlists,” track usage, and receive direct updates from manufacturers.\n\nAlready rolled out to 31 hospitals with over 3,000 clinicians, including some of the most remote facilities in the country, beHub is live across the Murrumbidgee Local Health District in New South Wales and Alice Springs Hospital in the Northern Territory. Operating within NSW Health – one of the world’s largest healthcare systems with 220+ hospitals – the platform ensures every site, from tertiary centres to rural outposts, has instant access to accurate, current device information. Expansion is underway into more NSW and NT hospitals, supported by early manufacturer partnerships and a scalable subscription model for long-term growth.\n\n**Teams**\n\n- [https://www\\.selfdriven\\.services/team](https://www.selfdriven.services/team)\n- [https://www\\.behub\\.com\\.au](https://www.behub.com.au)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Management Plan & Foundations","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A full project plan detailing scope, stakeholder mapping, work breakdown structure, risk register, QA approach, communications plan, and delivery calendar, ensuring every contributor understands timelines, responsibilities, dependencies, and success measures.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A single versioned plan (PDF or Markdown) stored in the project repo, tagged with release v0.1, with a visible commit history and clearly defined roles/responsibilities and timeline.A single versioned plan (PDF or Markdown) stored in the project repo, tagged with release v0.1, including full commit history, clearly defined roles and responsibilities, agreed milestones, timeline, acceptance criteria, and update process, ensuring everyone works from one authoritative source of truth throughout the project lifecycle.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public link to the repository displaying the plan file, the current version tag, the full commit history, and timestamped updates, providing transparent evidence of progress, governance, authorship, and accountability so reviewers can verify that roles, decisions, and milestones are being tracked and delivered against a single maintained source of truth.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Design & Build -  Health Systems Cooperative Kit","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Initial release of Health Cooperative Kit with define-to-provision workflow\n\n- Templates for roles, governance, and cooperative blueprint (JSON/YAML)\n\n- Basic SSI identity flows (issue/verify member credential)\n\n- Plutus script generation for cooperative addresses","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A cooperative blueprint file that can automatically generate cooperative scripts and the corresponding DID/credential structure, for the selfdriven Health cooperative from onboarding to identity issuance, member wallet setup, cooperative actions, and proof-of-participation, showing the full lifecycle can run on the selfdriven Health cooperative stack without manual intervention.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Demo video + functioning prototype at [https://coop\\.selfdriven\\.health](https://coop.selfdriven.health)\n\n- v1 release tag in repo with changelog","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":80000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Use & Reflect - Deployment with selfdriven Health Cooperative","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A live deployment with real participating health organisations, where governance processes, membership onboarding, identity issuance, and treasury operations are fully activated, supported by guided onboarding flows designed for non-technical users so they can join, manage roles, perform cooperative actions, and participate confidently without needing blockchain expertise.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A successful milestone is demonstrated by onboarding the selfdriven Health organisations, issuing credentials and wallets to a minimum of 10 members, and recording the first cooperative proposals and votes on-chain, proving the membership, governance, credentialing, and decision-making flows all operate in a real environment with verifiable participation and accountability across the selfdriven Health network.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- On-chain metrics: scripts created, transactions, credentials issued\n\n- Pilot report summarising organisational onboarding & learnings\n\n- Screenshots/dashboards from live deployment","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":60000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Document & Socialise - Public Release Kit","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Open-source repository + documentation for running a cooperative\n\n- Deployment and adoption playbook for new sector partners\n\n- Metrics dashboard showing identity usage, governance activity and treasury flow\n\n- Presentation + wrap-up video for Catalyst community","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The Health Cooperative Kit is proven when external organisations can use the toolkit independently without core-team support, a public demo instance of the cooperative kit is available for hands-on exploration, and full documentation plus an onboarding playbook are published on the website, enabling new health groups to self-start, configure governance, issue credentials, and activate cooperative operations without requiring internal intervention.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public repository and website updated with all project outputs, plus a final report to Catalyst that includes on-chain metrics, implementation outcomes, and key learnings, supported by a recorded presentation video and community demo that openly showcases functionality, adoption results, and next-steps for wider deployment.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Mark Byers - Project Lead**\n\n\n\nSolution architecture, SSI, Cardano integrations.\n\n\n\nFounder of selfdriven Foundation. 10+ years designing decentralised operating systems for communities. Leads development of Cardano-enabled identity, governance and cooperative tooling.\n\n\n\n**Bence Lukács - Organisation Lead**\n\n\n\nCooperative structure, operating models, member roles.\n\n\n\nSpecialist in organisational architecture and community self-governance. Experience designing practical operating models for cooperatives and distributed teams.\n\n\n\n**Damian Noonan - Systems Lead**\n\n\n\nHealth systems, deployment, provider onboarding.\n\n\n\nHealth innovation strategist. Works across clinical and allied health systems with deep knowledge of service workflows and compliance in real-world settings.\n\n\n\n**Elizabeth Jones - Design & Engagement Lead**\n\n\n\nUX, adoption, non-technical onboarding.\n\n\n\nDesigner focused on accessibility and human-centred rollout of complex systems. Experienced in stakeholder education and communications for community-based projects.\n\n\n\n**Brian Halse - Governance**\n\n\n\nGovernance frameworks, policy, proposals & voting.\n\n\n\nIndependent governance specialist. Experience in cooperative governance, risk frameworks and transparency mechanisms for community-owned organisations.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**M1 – Project Management Plan – 20,000 ADA**\n\n\n\nProject Management: Scope definition, stakeholder mapping, work-breakdown structure, risk register, QA plan, comms plan, delivery calendar – 18,000 ADA\n\n\n\nTools & Admin: Project repository setup, version control, reporting templates, meeting facilitation tools – 2,000 ADA\n\n\n\n**M2 – Design & Build – 80,000 ADA**\n\n\n\nSolution Architecture & Design:\n\nUse-case design, process mapping (inputs/outputs), data schema definition, public/private data categorisation – 5,000 ADA\n\n\n\nCommunity Cardano Kit Development:\n\nCore build of Community Cardano Kit components, integration with Selfdriven.network On-Chain, SSI & AI interfaces – 50,000 ADA\n\n\n\nselfdriven / Cardano Network Integration:\n\nMapping to Cardano assets, AVS/partner-chains setup, integration of AVS features including Midnight compatibility – 10,000 ADA\n\n\n\nInterface Enhancements:\n\nUpdating On-Chain interface reference and implementing UI/UX improvements for community onboarding – 10,000 ADA\n\n\n\nTesting & Quality Assurance:\n\nInternal QA, functionality verification, interface validation, regression testing – 5,000 ADA\n\n\n\n**M3 – Use / Test – Pilot – 60,000 ADA**\n\n\n\nDeployment & Setup:\n\nDeploy Community Cardano Kit in pilot environment, configure network and infrastructure – 5,000 ADA\n\n\n\nUser Onboarding & Training:\n\nCreate onboarding pathways, run training workshops, support initial users – 35,000 ADA\n\n\n\nField Testing & Feedback:\n\nRun live tests, gather feedback, analyse performance data, make adjustments – 15,000 ADA\n\n\n\nReporting & Review:\n\nDocument test results, lessons learned, and recommendations for scaling – 5,000 ADA\n\n\n\n**M4 – Document / Socialise / Publish – 40,000 ADA**\n\n\n\nDocumentation:\n\nCompile final public docs, onboarding materials, reports and technical integration notes – 30,000 ADA\n\n\n\nCommunity Engagement:\n\nPresentations, social media promotion, partnership announcements, case studies – 5,000 ADA\n\n\n\nProduction & Publishing:\n\nVideo walkthroughs, assets, website updates, graphical comms – 5,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project delivers maximum real-world impact per ADA by focusing funding on working software, live adoption and open-source infrastructure — not on research or theoretical analysis.\n\n\n\n**Why the budget is efficient**\n\n- The solution builds on existing deployed platforms (org.selfdriven.app + app.behub.io), avoiding months of foundational work and cost.\n\n- Funding goes toward extending a working system into a reusable Health Cooperative Kit rather than creating a one-off bespoke product.\n\n- Pilot partners supplied by beHub reduce outreach and onboarding costs while guaranteeing immediate use of the system.\n\n\n\n**Primary value drivers**\n\n- A repeatable cooperative model that can be used by other organisations and sectors without needing new development.\n\n- Permanent open-source assets (identity flows, governance tooling, cooperative blueprinting, wallet + treasury operations).\n\n- On-chain utility for Cardano (Plutus scripts, DID usage, transactions in ADA/USDM, governance interactions).\n\n\n\n**Cost discipline**\n\n- ~65% of funds go directly to engineering and UX for the reusable open-source kit.\n\n- ~20% support real pilot deployment, ensuring adoption and measurable usage.\n\n- ~15% cover project management, documentation and Catalyst reporting.\n\n\n\n**Long-term sustainability**\n\nAfter completion, health cooperatives and future sector partners can adopt the system without additional Catalyst funding.\n\nFuture growth is driven by organisations running their own cooperatives — not ongoing public funding.\n\n\n\n**Net effect**\n\nFor the cost of a single project, Catalyst funds infrastructure that:\n\n1.\tsolves an immediate real-world need in the health sector, and\n\n2.\tbecomes a reusable foundation for education, disability support, aged care, insurance and other community-owned service domains.\n\n\n\n*This is high-leverage funding that turns one proposal into a long-term multiplier for Cardano adoption and impact.*","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Healthcare","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1711}