{"pr_id":"019ab412-658a-7ea6-b80d-209492e46abb","title":"[5PC] Hoskinson’s Cardano Journey: Easy Edu Material","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Vietnam ranks 5th in crypto adoption with 17 million users by 2023. Educational content will help tap into this potential—this video series aims to increase users and developers on Cardano.","solution":"Hoskinson's 240+ videos are distilled into a series of short, easy-to-understand videos that make blockchain insights easy to understand and inspire the community to explore and engage with Cardano.","proposer_name":"Hoang Van Minh","proposer_relevant_experience":"**Hoang Van Minh** ([https://www\\.linkedin\\.com/in/minh\\-5pc/](https://www.linkedin.com/in/minh-5pc/))\n\n- Working in the financial sector since 2015 at Military Commercial Joint Stock Bank\n- Researching the blockchain sector in Vietnam since 2017\n- 6 years of experience in the field of content creation and investment\n\nTasks:\n\n- Control all stages in the implementation process.\n- Ensure the time and quality of the video are correct.\n- Monthly disbursement report\n\n**Nguyen Thi Kieu Oanh** ([https://www\\.linkedin\\.com/in/kieu\\-oanh\\-76aa65186](https://www.linkedin.com/in/kieu-oanh-76aa65186) )\n\n- Content Creator 5PC.\n- 4 years of experience in the field of content creation.\n- Popular influencer on YouTube channel 5 Minutes Crypto.\n\nTasks: \n\n- Write content and shoot videos.\n\n**Nguyen Thu Trang** ([https://www\\.linkedin\\.com/in/trangnguyen1996/](https://www.linkedin.com/in/trangnguyen1996/) )\n\n- Content creator at 5PC\n\n- 4 years of experience in crypto investment\n\n- 7 years of experience in media and content production\n\nTask : \n\n- Research and produce simple, easy-to-understand content\n\n**Nguyen Tuan Anh** ([https://www\\.linkedin\\.com/in/nguy%C3%AAn\\-tu%E1%BA%A5n\\-anh\\-335835242/](https://www.linkedin.com/in/nguy%C3%AAn-tu%E1%BA%A5n-anh-335835242/) )\n\n- Filming and editing at 5PC.\n- 4 years of experience in video editing.\n\nTasks: \n\n- Filming and editing videos.\n\n**Nguyen Tien Hoang** ([https://www\\.facebook\\.com/vicente\\.bosque\\.39](https://www.facebook.com/vicente.bosque.39) )\n\n- Filming and KOL at 5PC.\n- 5 years of experience in filming and content creation.\n\nTasks: \n\n- KOL for YouTube videos.","url":null,"funds":44640,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"[5PC] Hoskinson’s Cardano Journey: Easy Edu Material","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Hoang Van Minh","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":44640,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":3,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Vietnam ranks 5th in crypto adoption with 17 million users by 2023. Educational content will help tap into this potential—this video series aims to increase users and developers on Cardano.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Hoskinson's 240+ videos are distilled into a series of short, easy-to-understand videos that make blockchain insights easy to understand and inspire the community to explore and engage with Cardano.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://5phutcrypto.io/flagship-web3-projects-supported-by-5-phut-crypto/","https://www.tiktok.com/@5phut_crypto","https://www.youtube.com/@5phutcrypto/featured","https://t.me/Fivemincryptoann","https://5phutcrypto.io/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Easy-to-understand tutorial videos about Cardano through the series of founder Charles Hoskinson for the Vietnamese community will be posted on.\n- 5PC Youtube Channel (193K subscribes) \n- 5PC TikTok channel (403K followers) \n- 5PC Telegram Community (63K members)\nThe community can also track the progress of the proposal through the project's Regular Report.\nThis is all public information that the community can query and verify.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Education","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"- The project targets the Vietnamese Cardano community including ADA users, young investors, SPOs, DReps, developers and organizations who want to learn about Cardano.\n- The trend of social networks in Vietnam is videos with good inspirational KOLs, simple and easy-to-understand content, and professional video editing. Instead of dry technical language, we will use many examples and illustrations to convey to viewers. Make sure that users can understand the true nature of technology and find it interesting and attractive. We have onboarded many users for large projects thanks to this approach.\n- Specifically, we reach them through creative content about Cardano on [YouTube](https://youtube.com/c/5Ph%C3%BAtCrypto) (193k subscribers) and [TikTok](https://www.tiktok.com/@5phut_crypto?_t=8UvpiqiEE66&_r=1) (403k followers). Then we will encourage them to join the [5PC Cardano community](https://t.me/Cardano_5PC_Chat), where we will continue to update news about the ecosystem, Hoskinson's video chats to help them understand Cardano in depth. From there, increase strong belief in the long-term vision of the ecosystem, then users will confidently participate in many roles such as making Dapps, operating SPOs, Dreps, or holding and staking ADA.\n- We believe that these contents can attract at least 800 members including developers and investors to join the [5PC Cardano community](https://t.me/Cardano_5PC_Chat), learn about Cardano and actively contribute to the ecosystem.\n- This helps increase awareness among Cardano users, promote regional community participation and create a sustainable network of cooperation. Through this, Cardano expands its recognition, attracts human resources, and strengthens the ecosystem in Vietnam.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"- Research Charles Hoskinson's materials and videos, then edit and present them in a simple and easy to understand way, then produce 30 high quality viral video content about Cardano\n- Promote and communicate this content across social networks such as [Youtube](https://youtube.com/c/5Ph%C3%BAtCrypto), [TikTok](https://www.tiktok.com/@5phut_crypto?_t=8UvpiqiEE66&_r=1), [Telegram](https://t.me/Fivemincryptoann), and [Facebook](https://www.facebook.com/5phutcrypto.tkv). 5 Minute Crypto owns a channel system followed by hundreds of thousands of investors and programmers in Vietnam.\n- Continuously respond to community questions and comments, encourage them to join the 5PC Cardano group so they can receive positive information and guidance about the ecosystem","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"- There are at least 800 new members joining the 5PC Cardano community. Here we regularly update information about the ecosystem, support them to participate in roles such as making Dapps, SPOs, or simply staking ADA.\n- Attracted 1200 discussions and exchanges about Cardano on Youtube and Tiktok\n- Total 105,000 views on [youtube](https://www.youtube.com/c/5Ph%C3%BAtCrypto), 300,000 views on [Tiktok](https://www.tiktok.com/@5phut_crypto?_t=8UvpiqiEE66&_r=1)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We found that the biggest problem of the Vietnamese Cardano community is the lack of concise, easy-to-understand training content that helps both newbies and long-time investors access basic knowledge systematically. Most of the existing documents are complicated, lengthy and in English, making it difficult to absorb, especially for non-specialists.\n\nOur solution is to deploy a series of training videos based on more than 240 videos shared by Charles Hoskinson, translated, selected and edited into easy-to-understand, visually illustrated content. The video series will be released on popular platforms such as YouTube.\n\nSpecific solutions include: Producing 30 educational content about Cardano including: 15 long videos (6 - 15 minutes), 15 short videos (1 - 2 minutes).\n\nFormat: Simple, easy-to-understand videos, using familiar language, even those new to the market can easily access this knowledge base.\n\nContent: Based on Charles Hoskinson's videos, focusing on explaining the core concepts of Cardano and Cardano's vision.\n\nGoal: Help the Vietnamese community understand the potential, technological advantages and value of Cardano compared to other layer 1 blockchains.\n\nThis approach helps us reach the target community including: ADA users, SPO, DRep, developers and organizations interested in blockchain. Impact is measured through views, viewer retention, number of people joining the Cardano 5PC community, improving knowledge through posted videos.\n\nShort-term benefits:\n\n- The community can quickly gain knowledge about the Cardano blockchain through 30 educational videos.\n- Connecting the community by bringing valuable, useful products.\n- SPO and DRep can take advantage of this video series to interact and explain to their delegates.\n\nLong-term benefits:\n\n- Building a sustainable blockchain mindset, a standard for the ecosystem that next-generation blockchains can learn from.\n- SPO/DRep optimizes the network, DEV expands the ecosystem, partners integrate Cardano - creating a solid foundation for the future.\n- With 5PC's experience in synthesizing, creating content, filming and achievements on media channels, we are confident in implementing this project, and believe that the community will have a roadmap for blockchain development thinking, a standard blockchain through this series of events, thereby helping the community improve understanding, supporting the personal investment process, and only when individuals develop strongly will the community develop strongly. That is the human factor that our team aims for.\n\nThe unique point of the project is the combination of 5PC’s in-depth knowledge, easy communication ability and large existing community network. The direct beneficiaries are the Vietnamese Cardano community – from individual investors to developers – when they are equipped with solid foundational knowledge, clearly understand the potential and value of Cardano. This is important for Cardano because it helps increase recognition, attract human resources, expand the community and create a foundation for sustainable ecosystem development in Vietnam.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Strong reasons why 5PC considers this project necessary: ​​The project will create a positive impact by raising the knowledge, awareness and participation of the Vietnamese Cardano community. Through a series of 30 educational videos, participants will have a better understanding of Cardano's technology, vision and potential. This helps to strengthen trust, attract new human resources, support SPO/DRep to increase operational efficiency and encourage developers to choose Cardano.\n\nExternal reasons - market context: with many years of operating in the market, witnessing many ups and downs of the cryptocurrency market, we see thousands of tokens appear, sweeping away investors' assets and hopes and then disappearing.\n\n- On the contrary, there are also many tokens, with a team of builders working hard, day after day, month after month, they are still patiently there, building the ecosystem, persistently persevering, despite criticism from the community - Cardano is a great ecosystem.\n- Even in the market, there are KOLs calling Cardano the Ghost Chain, that Hoskinson is the cancer of Cardano. Is that really true? Why does the community make such criticisms, is it due to ignorance, or because the price of ADA has not increased yet?\n- The fact is that ADA is still there, in the top 10 list of leading cryptocurrencies, the ecosystem is dynamic, unified and harmonious. This is a community that needs to be praised and strongly promoted instead of criticized.\n\nInternal cause - strong internal strength: Cardano - the third generation blockchain, pioneering with a scientific vision, led by Charles Hoskinson, co-founder of Ethereum.\n\n- The IOHK team, comprised of leading researchers and engineers, built Cardano from peer-reviewed academic research, unique in the crypto industry.\n- ADA, the native cryptocurrency, is not only a currency but also fuels staking, on-chain governance, and a sustainable dApp ecosystem.\n- The Ouroboros method - an advanced PoS consensus mechanism - combines performance, security, and energy efficiency, shaping the future of blockchain.\n\nThe most important reason - the person leading Cardano is Charles Hoskinson - he is a different talent; Why is 5PC confident in asserting this? Let's look at some factors in this area:\n\n- Dan Larimer (EOS): Larimer is famous for DPoS, but repeatedly left the project (BitShares 2014, Steemit 2017, EOS 2021) after raising large amounts of capital, making the community doubt his commitment. On the other hand, Hoskinson has been steadfast with Cardano since 2015, showing his perseverance.\n- Justin Sun (TRX): Sun pushed TRON through the craze, acquired Steemit and prioritized profits over long-term value. Hoskinson focused on research, refused to &quot;lock in suppliers&quot;, aimed at an open ecosystem, serving the community.\n- Do Kwon (Luna): Kwon let Terra collapse (2022) when UST lost value, leaving investors behind. Hoskinson built Cardano slowly, carefully, laid a solid foundation and proved his loyalty to users.\n\nCharles Hoskinson is not only smart (mathematics, cryptography), but also persevered for more than 10 years with Cardano, loyal to the community despite the sarcasm, he knows what he is doing, his destination and persistently pursues a noble ideal: empowering humanity through blockchain. He is the embodiment of difference - not chasing profits or trends, but creating the future.\n\nWith all the advantages I analyzed above, combined with the media power of 5PC, this will be a perfect combination to spread positive things for the Cardano ecosystem.\n\nWe measure impact using both quantitative and qualitative metrics:\n\nQuantitative: views and community membership growth; number of social media discussions.\n\n- Minimum 800 new people joining the [5PC Cardano community](https://t.me/Cardano_5PC_Chat). Actively maintain community interactions, answer questions, and regularly update information about the ecosystem in a simple and easy-to-understand perspective.\n- Attracted at least 1200 comments actively discussing Cardano technology and vision on Youtube and TikTok\n- YouTube: Post on a [Youtube channel](https://youtube.com/c/5Ph%C3%BAtCrypto) with 193K subscribers, 105k views goal for 15 educational video series on Youtube.\n- TikTok: Post on a [TikTok channel](https://www.tiktok.com/@5phut_crypto?_t=8UvpiqiEE66&_r=1) with 403K subscribers, target 300K views for 15 educational video series on TikTok.\n\nThe results and opportunities from the project will be shared publicly through:\n\n- Regular reports with detailed KPI data on 5PC network channels and Catalyst Report.\n- Transparent tracking files (open source) for the community to access and verify.\n- Media content on YouTube, TikTok, Telegram.\n\nThe success of the project will help Cardano expand its influence, strengthen the community and create a sustainable foundation for Vietnam to become one of the bright spots of the global ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"5 Minute Crypto has experience supporting many large crypto media projects in Vietnam. Some of our notable achievements include:\n\n- 3600 members participating in Zama Vietnam\n- More than 1700 KYC members on Binance Vietnam\n- More than 1100 people downloading, 595 people trading on OKX web3 wallet\n- More than 1300 people downloading the Moonwalk Fitness web3 project application\n- More than 870 people downloading and using the Grass extension\n- More than 3000 members experience the Nodepay project\n\nSee details here: [Flagship Web3 Projects Supported by 5 Phút Crypto](https://5phutcrypto.io/flagship-web3-projects-supported-by-5-phut-crypto/)\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/5PC%20team%202.png)\n\nPhoto: Members of 5PC's Community Support Team\n\nWe have the largest investment community in Vietnam, more than 10,000 investors and hundreds of active programmers with:\n\n- [193,000 YouTube channel subscribers](https://youtube.com/c/5Ph%C3%BAtCrypto). Below is a snapshot of monthly viewership, the 5PC Youtube channel is viewed by 137,200 people per month.\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/youtube%20metric%20users%205PC%201.jpg)\n\n- [403,000 TikTok channel followers](https://www.tiktok.com/@5phut_crypto?_r=1&_t=ZS-91ihdiXlsBk). Below is a snapshot of monthly viewers (not views), 5PC tiktok channel has 1.3 million monthly viewers.\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/TikTok%20metric%20(2).jpg)\n\n- [63,000 Telegram 5PC members](https://t.me/Fivemincryptoann)\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/telegram%20metric.jpg)\n\n- [Cardano Vietnam community](https://t.me/Cardano_5PC_Chat) with 650 members\n\nThe team has many years of experience in producing content content, in-depth translation, organizing workshops and building communities. Successfully implementing 2 proposals at 2 funds: Fund11 (“Why Cardano?”) and Fund12 with results exceeding KPI is a clear demonstration of execution capacity.\n\n- [Fund 11 with the video Why Cardano](https://www.catalystexplorer.com/en/proposals/5pc-cardano-education-video-on-tiktok-for-the-vietnamese-community-f11/details) - 8 TikTok videos reached 322,000 views, exceeding the target by 15% - affirming the ability to convey information in an attractive way. You can [watch the series here](https://vt.tiktok.com/ZSHTkPcW22vBP-Irpqn/).\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/tiktok%20why%20cardano%20series.jpg)\n\n- [Fund 12 with the Podcast series](https://www.catalystexplorer.com/en/proposals/5pc-cardano-journey-cardano-education-podcast-series-for-the-vietnamese-community-f12/details) attracted more than 86,000 views, exceeding the target by 50%. You can [watch the series here](https://www.youtube.com/playlist?list=PLPouoDUOCcJtXyQn2gwLZxEuzCxeZ_Wbo).\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/podcast%20cardano%205PC.jpg)\n\n5PC has core values ​​that are in line with Cardano:\n\nDirect value dissemination: Cardano does not depend on KOLs or hyped projects. Catalyst is a smart PR method - instead of spending money on individuals, Cardano conveys value to end users: SPO, DRep, DEV - people who work hard to build the ecosystem. 5PC is the ideal bridge for this mission.\n\nThe 5PC community is civilized and humane: 5PC says no to advertising poor quality projects, does not put group interests above community risks.\n\nOptimal spreading opportunity: With a large number of members and easy-to-understand content, 5PC is a suitable choice to spread the value of the Cardano project and the ideology and vision focusing on Charles Hoskinson's core values.\n\nWe approach the project according to a strict process:\n\n- Research and select content from more than 240 videos of Charles Hoskinson.\n- Translate and edit into concise, easy-to-understand content, ensuring technical accuracy.\n- Produce videos with pre-approved scripts, topics that have been created and published.\n- Publish and promote on major community platforms.\n- Transparent monitoring and reporting through public KPI files, updated regularly, for the community to verify progress.\n\nValidity is verified through:\n\n- Specific KPI indicators on community participation, video volume, views, live discussions on content.\n- Public and transparent financial reporting system.\n- Proven experience from previous Catalyst projects and long-term community activities.\n\nFinal commitment with the highest confidence: 5PC is the perfect choice for this project thanks to its ability to turn complex ideas into vivid, accessible content, instilling community confidence in the true value of Cardano - a blockchain that is undervalued compared to the infrastructure that Hoskinson, hundreds of engineers, SPOs and thousands of millions of people in the community have.\n\nWith its current capacity, large community network and commitment to transparency, 5PC is perfectly suited to execute this project with the highest level of reliability, efficiency and responsibility.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Launching the project to produce 10 videos \"Laying the foundation of knowledge\"","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Develop an implementation plan: Research documents, translate, review content, write scripts, approve scripts, shoot, edit clips, approve 10 finished videos. Including 5 Youtube videos (6 - 15 minutes) and 5 TikTok videos (1-2 minutes)\n\n- 10 completed videos, released on YouTube, TikTok and Telegram Community channels.\n\n- Respond to and respond to user comments","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 5PC Cardano Community Members Increase by 200\n\n- Total Cardano Comments of 10 Videos on Platforms Reach at Least 200 Comments\n\n- Total Views of 5 Videos on YouTube Will Reach at Least 5000 Views\n\n- Total Views of 5 TikTok Videos Will Reach at Least 25,000 Views","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- The summary report link includes links to articles, videos posted on Youtube, TikTok, view statistics, comments.\n\n- Photos and links proving the number of users participating in the 5PC Cardano community on telegram.\n\n- Images illustrate the indicators achieved according to previous commitments.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":13392,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Produce 10 'Knowledge Establishment' videos","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Develop an implementation plan: Research documents, compile, review content, write scripts, approve scripts, shoot, edit clips, approve the next 10 completed videos.\n\n- The next 10 videos have been completed, released and shared on YouTube, TikTok and Telegram Community channels.\n\n- Respond to user comments on a total of 20 videos posted by M1 and M2.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 5PC Cardano community members increase by 500 people (both M1 and M2)\n\n- Total comments on Cardano of 20 videos on platforms (10 videos in M1 and 10 videos in M2) reach at least 500 comments\n\n- Total views of 10 videos on YouTube (including 5 youtube videos in M1) will reach at least 48000 views\n\n- Total views of 10 TikTok videos (including 5 TikTok videos in M1) will reach at least 145,000 views","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The summary report link includes links to articles and videos posted on Youtube, TikTok, Telegram. Statistics on the number of participants, views, and comments. Images illustrating the indicators achieved according to previous commitments.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":13392,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Finishing Line – Completing the Hoskinson Legacy","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Develop an implementation plan: Research documents, compile, review content, write scripts, approve scripts, shoot, edit clips, approve the final 10 videos.\n\n- The final 10 videos after completion will be released and shared on YouTube, TikTok and Telegram Community channels.\n\n- Respond to user comments on a total of 30 uploaded videos (at all 3 milestones).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Cardano community grows by 800 members (including M1, M2 and M3)\n- Total comments on Cardano of 30 videos across platforms (15 videos in M1 and 15 videos in M2) reach at least 1200 comments\n- Total views of 15 videos on YouTube will reach at least 105,000 views\n- Total views of 15 TikTok videos will reach at least 300,000 views","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Summary report link includes links to articles, videos posted on Youtube, TikTok, Telegram... statistics on 5PC Cardano community participants, views, comments. Images illustrate the indicators achieved according to previous commitments.\n\n- Links to final videos\n\n- Link to the project's final report","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":17856,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Hoang Van Minh** ([https://www\\.linkedin\\.com/in/minh\\-5pc/](https://www.linkedin.com/in/minh-5pc/))\n\n- Working in the financial sector since 2015 at Military Commercial Joint Stock Bank\n- Researching the blockchain sector in Vietnam since 2017\n- 6 years of experience in the field of content creation and investment\n\nTasks:\n\n- Control all stages in the implementation process.\n- Ensure the time and quality of the video are correct.\n- Monthly disbursement report\n\n**Nguyen Thi Kieu Oanh** ([https://www\\.linkedin\\.com/in/kieu\\-oanh\\-76aa65186](https://www.linkedin.com/in/kieu-oanh-76aa65186) )\n\n- Content Creator 5PC.\n- 4 years of experience in the field of content creation.\n- Popular influencer on YouTube channel 5 Minutes Crypto.\n\nTasks: \n\n- Write content and shoot videos.\n\n**Nguyen Thu Trang** ([https://www\\.linkedin\\.com/in/trangnguyen1996/](https://www.linkedin.com/in/trangnguyen1996/) )\n\n- Content creator at 5PC\n\n- 4 years of experience in crypto investment\n\n- 7 years of experience in media and content production\n\nTask : \n\n- Research and produce simple, easy-to-understand content\n\n**Nguyen Tuan Anh** ([https://www\\.linkedin\\.com/in/nguy%C3%AAn\\-tu%E1%BA%A5n\\-anh\\-335835242/](https://www.linkedin.com/in/nguy%C3%AAn-tu%E1%BA%A5n-anh-335835242/) )\n\n- Filming and editing at 5PC.\n- 4 years of experience in video editing.\n\nTasks: \n\n- Filming and editing videos.\n\n**Nguyen Tien Hoang** ([https://www\\.facebook\\.com/vicente\\.bosque\\.39](https://www.facebook.com/vicente.bosque.39) )\n\n- Filming and KOL at 5PC.\n- 5 years of experience in filming and content creation.\n\nTasks: \n\n- KOL for YouTube videos.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"ADA exchange rate at the time of proposal: 0.4$\n\nThe project cost is calculated based on the Video Production Task Assignment including:\n\n**For 15 Long video \\(6 \\- 15 minutes\\)**\n\n- Content production (Research, translation, script writing) 3 staff x 15 videos x 12 hours / video x 16 ADA / hours = 8640 ADA\n- KOL (Presentation in front of the camera, conveying Cardano message): 1 staff x 15 videos x 8 hours / video x 42 ADA / hours = 5040 ADA\n- Video recording + editing (Filming, setting up lighting &amp; sound, editing): 2 staff x 15 videos x 8 hours / video x 32 ADA / hours = 7680 ADA\n- Project consultant and management (script review, Planning, progress tracking, Catalyst reporting): 150 ADA x 15 videos = 2250 ADA\n- Equipment rental, filming studio: 200 ADA x 15 = 3000 ADA\n- Promote 15 videos on YouTube and support the community for at least 3 months: 1500 ADA\n\n**For 15 Short video \\(1\\-2 minutes\\)**\n\n- Content production (Research, translation, script writing) 3 staff x 15 videos x 7 hours / video x 16 ADA / hours = 5040 ADA\n- KOL (Presentation in front of the camera, conveying Cardano message): 1 staff x 15 videos x 5 hours / video x 42 ADA / hours = 3150 ADA\n- Video recording + editing (Filming, setting up lighting; sound, editing): 2 staff x 15 videos x 4 hours / video x 32 ADA / hours = 3840 ADA\n- Project consultant and management (script review, Planning, progress tracking, Catalyst reporting): 100 ADA x 15 videos = 1500 ADA\n- Equipment rental, filming studio: 100 ADA x 15 = 1500 ADA\n- Marketing for 15 youtube videos and support the community for at least 3 months: 1500 ADA\n\nTotal project cost: 44640 ADA\n\nBudget allocation by milestone:\n\n- Milestone 1: Proposed cost for the first milestone, requires completion of the Action Plan and 10 videos, Allocation amount: 13392 ADA\n- Milestone 2: Proposed cost for the second milestone, requires completion and Development of 10 more videos, Allocation amount: 13392 ADA\n- Milestone 3: Cost Proposal for final milestone, requirement Complete 10 videos, provide closing video, closing report, Allocation Amount: 17856 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Project Cost Value for Cardano Ecosystem\n\nWe affirm that to effectively implement this series of articles &quot;Hoskinson's Cardano Journey&quot; is extremely complicated - the reason: Charles Hoskinson is the CEO, KOL of the Cardano ecosystem product itself, his statements are deeply philosophical, rich in philosophy, using many specialized, complex and difficult to understand terms, so our translation process takes a lot of time, effort and needs to be carefully reviewed by leading Blockchain experts.\n\nIn particular, 5PC is cherishing the desire to truly bring outstanding values ​​to the Vietnamese blockchain community, especially Cardano Vietnam, through education and spreading knowledge.\n\nThis series of 30 videos will help the Vietnamese Cardano community attract new members, encourage investors to participate and promote developers to choose Cardano as the platform for their projects. These are long-term benefits with strong expansion potential, contributing to building a sustainable Cardano ecosystem in Vietnam.\n\nOptimizing Project Costs\n\nThe budget is carefully built, ensuring optimization for each role in the project. This is a creative project that requires higher video quality than conventional marketing campaigns, so the participating team is selected based on strict criteria:\n\n5PC is a team with many years of experience in content creation, filming, editing and community building. Has helped many large web3 projects attract hundreds to thousands of users to use products and services regularly. Some outstanding projects: [Flagship Web3 Projects Supported by 5 Phút Crypto](https://5phutcrypto.io/flagship-web3-projects-supported-by-5-phut-crypto/)\n\n- Deep understanding of blockchain and the Cardano ecosystem to ensure accurate and engaging content.\n- Using professional studios and modern filming equipment to create high-quality videos that attract viewers.\n- All costs are adjusted to suit the Vietnamese market, ensuring effective use of budget while still achieving high quality.\n\nCompare salaries: Vietnam, International and Average\n\nDetailed labor costs and salary comparison are as follows:\n\nContent production: about $6.4/hour.\n\n- Vietnam: average salary for blockchain content writing positions for experienced people is about 30 million VND/month (160 hours), equivalent to $7/hour (1 USD = 27,000 VND). We pay $6.4/hour, a reasonable salary with high professional requirements (translation, Cardano research). (Source [Glassdoor](https://www.glassdoor.com/Job/vietnam-content-blockchain-jobs-SRCH_IL.0,7_IN251_KO8,26.htm))\n- International: According to Glassdoor, the salary for content creation in the US is about $20/hour. The project has a lower price ($6.4/hour), much more economical.\n\nKOL: about $16.8/hour.\n\n- Vietnam: KOLs in Vietnam (YouTube, TikTok) are usually paid $13-15/hour for video recording. The project pays $16.8, a reasonable price with high quality content. (KOLs are experienced and knowledgeable about Cardano). [Source Glassdoor](https://www.glassdoor.com/Job/vietnam-kol-jobs-SRCH_IL.0,7_IN251_KO8,11.htm)\n- International: KOLs in the US can be paid $50/hour. The project saves about 66%\n\nFilming + Editing: about $12.8/hour.\n\n- Vietnam: Professional video recording in Vietnam is about $12/hour. The project pays $12.8/hour, an average and reasonable price.\n- International: In the US, filming is about $30/hour. The project saves about 67%.\n\nEffective and Responsible Budget Management\n\n- 5PC has extensive experience in creating blockchain and cryptocurrency content in Vietnam, ensuring that the budget is managed effectively and transparently. The team is committed to using resources economically, with detailed monthly reports. 5PC members do this content not only for money, but also from trust, from knowledge, from the journey we accompany, demonstrated by the fact that 5PC is a team holding a large amount of ADA, we have become reputable Dreps in the community, so using the budget responsibly not only protects the project but also protects our own investment interests, creating a companion with the goal of the Cardano ecosystem.\n\nOutstanding value compared to similar projects at Catalyst. 5PC has researched similar projects funded in previous Funds.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Education","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1712}