{"pr_id":"019abe26-1e60-768f-b8ed-c27f78fc3b9b","title":"[5PC] Cardano Leaders: Vietnam's Crypto Future Unveiled","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"The Vietnamese community lacks educational content that is viral and spreads strongly to young people, making them susceptible to short-term trends and missing out on long-term value with Cardano.","solution":"Building a series of 9 high-quality educational podcasts in Vietnamese, together with advisor Do Manh Hung, to help Vietnamese investors and programmers deeply understand Cardano","proposer_name":"Hoang Van Minh","proposer_relevant_experience":"**Hoang Van Minh** ([https://www\\.linkedin\\.com/in/minh\\-5pc/\\)](https://www.linkedin.com/in/minh-5pc/))\n\n- Working in the financial sector since 2015 at Military Commercial Joint Stock Bank\n\n- Researching the blockchain sector in Vietnam since 2017\n\n- 6 years of experience in the field of content creation and investment\n\nTasks:\n\n- Control all stages in the implementation process.\n\n- Ensure the time and quality of the video are correct.\n\n- Monthly disbursement report\n\n**Nguyen Thi Kieu Oanh** ([https://www\\.linkedin\\.com/in/kieu\\-oanh\\-76aa65186](https://www.linkedin.com/in/kieu-oanh-76aa65186) )\n\n- Content Creator 5PC.\n\n- 4 years of experience in the field of content creation.\n\n- Popular influencer on YouTube channel 5 Minutes Crypto.\n\nTasks:\n\n- Write content and shoot videos.\n\n**Nguyen Thu Trang** ([https://www\\.linkedin\\.com/in/trangnguyen1996/](https://www.linkedin.com/in/trangnguyen1996/) )\n\nContent creator at 5PC\n\n- 4 years of experience in crypto investment\n\n- 7 years of experience in media and content production\n\nTask :\n\n- Research and produce simple, easy-to-understand content\n\n**Nguyen Tuan Anh** ([https://www\\.linkedin\\.com/in/nguy%C3%AAn\\-tu%E1%BA%A5n\\-anh\\-335835242/](https://www.linkedin.com/in/nguy%C3%AAn-tu%E1%BA%A5n-anh-335835242/) )\n\n- Filming and editing at 5PC.\n\n- 4 years of experience in video editing.\n\nTasks:\n\n- Filming and editing videos.\n\n**Nguyen Tien Hoang** ([https://www\\.facebook\\.com/vicente\\.bosque\\.39](https://www.facebook.com/vicente.bosque.39) )\n\n- Filming and KOL at 5PC.\n\n- 5 years of experience in filming and content creation.\n\nTasks:\n\n- KOL for YouTube videos.","url":null,"funds":29610,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"[5PC] Cardano Leaders: Vietnam's Crypto Future Unveiled","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Hoang Van Minh","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":29610,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":3,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"The Vietnamese community lacks educational content that is viral and spreads strongly to young people, making them susceptible to short-term trends and missing out on long-term value with Cardano.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Building a series of 9 high-quality educational podcasts in Vietnamese, together with advisor Do Manh Hung, to help Vietnamese investors and programmers deeply understand Cardano","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://5phutcrypto.io/flagship-web3-projects-supported-by-5-phut-crypto/","https://www.youtube.com/@5phutcrypto","https://t.me/Cardano_5PC_Chat"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Educational content posted on 5PC platforms includes:\n\n- 5PC Youtube Channel\n- 5PC Telegram Community\n- 5PC Vietnam Cardano Telegram Community\n- Fimi staking ADA Telegram community \nThe community can also track the progress of the proposal through the project's Regular Report. This is all public information that the community can query and verify.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Education","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Our proposal is aimed at the Vietnamese community of talented programmers and investors who are uncertain about which ecosystem to join and develop with. Through a series of in-depth podcasts, led by experienced advisors and broadcast on media channels with large viewership, we not only disseminate knowledge in the simplest and most understandable way but also strengthen the belief in Cardano's long-term vision. This is an essential foundation to promote sustainable integration between the Vietnamese community and the global Cardano network.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"We will create content, film, edit and finalize 9 video talks, led by experienced consultants and broadcast on media channels with large audiences, we not only convey knowledge in the simplest and easiest to understand way but also strengthen the belief in Cardano's long-term vision. This is the essential foundation to promote sustainable integration between the Vietnamese community and the global Cardano network.\n\n\n\nWe aim at 3 main audiences:\n\n1- WEB3 programmers\n\n2- Students studying programming, wanting to learn about blockchain technology\n\n3- Investors\n\n\n\nAfter broadcasting and posting podcasts on media channels with millions of views of 5 Minutes Crypto, we will support them to update their knowledge information about the Cardano ecosystem through the 5PC Cardano group on Telegram. Here, the community will be supported:\n\n1- Basic operations such as using wallets, staking, safe transactions for beginners\n\n2- Events, hackathons for programmers to participate in learning and experiencing\n\n3- Learning materials, programming materials\n\n4- Opportunity to propose ideas and build projects with Catalyst fund\n\n\n\nWe believe that with our experience and plans, we can attract hundreds of active members, from investors to talented programmers, to the ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"- The 9-episode podcast series will attract at least 700 new members to join the [5PC Cardano community](https://t.me/Cardano_5PC_Chat) and learn about Cardano.\n- Minimum 450 discussions on the videos\n- Minimum 72,000 views for the entire series","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We propose to build a series of 9 in-depth educational podcasts in Vietnamese, each episode is 15-30 minutes long, professionally produced and publicly released on YouTube. The host team is a group of people with deep knowledge about blockchain and Cardano, especially the participation of Advisor Do Manh Hung, who has researched, invested and accompanied Cardano since 2017 as an investor, SPO and community educator.\n\nWhy did we choose Advisor Do Manh Hung?\n\nAdvisor Do Manh Hung has researched and invested in Cardano since the early days of the project in 2017 and possesses extensive knowledge of finance and blockchain.\n\nHe has built a reputation with the Vietnamese Blockchain community as an investor, Stake Pool Operator, and educator, inspiring the Vietnamese community about Cardano. He has participated and received funding for many proposals through the Catalyst Project and community management.\n\nHighly appreciated by the Vietnamese Cardano community, Advisor Do Manh Hung regularly conducts livestreams to update information and explain Cardano technology to the Vietnamese community, motivating many members to participate and contribute to the ecosystem.\n\nIn-depth topics for the Education Podcast Series (planned):\n\n- How can Cardano change the world?\n- Positions to build a sustainable future with the Cardano ecosystem\n- How will Cardano and its partner chains develop in the next phase\n- From Shelley to Voltaire – The Evolution of Humanity\n- Core technology – Hydra, Leios, Mithril, etc. How it can change humanity\n- Latest updates on Cardano, hard fork, poor liquidity...\n- Privacy &amp; Performance with Midnight\n- On-chain governance: The era of true decentralization\n\nWe reach users through a system of communication channels with a large number of followers such as:\n\n- [5PC Youtube channel](https://youtube.com/c/5Ph%C3%BAtCrypto) (193,000 subscribers)\n- [5PC Telegram community](https://t.me/Fivemincryptoann) (over 63,000 members)\n- [5PC Cardano community](https://t.me/Cardano_5PC_Chat) (650 members)\n\nThe project not only provides knowledge but also contributes to shaping long-term thinking for investors, arousing the interest of potential developers and connecting the community.\n\nThis is not only a proposal to make 9 podcast episodes but also to create a discussion community, lifelong learning on telegram, providing information, knowledge and documents about the ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project will create a clear positive impact on the Vietnamese community and the Cardano ecosystem in general through education, orientation and community connection.\n\nFor the community:\n\nThe project will help the Vietnamese community better understand blockchain technology and how Cardano - one of the most popular and trusted blockchain platforms today - works. The series of 9 podcasts led by advisor Do Manh Hung will share perspectives, practical experiences and in-depth knowledge from someone who has accompanied Cardano since the early days. Viewers will have the right mindset about investing, developing and participating in the blockchain field - instead of just following short-term trends or projects focusing on marketing and token trading.\n\nFor the Cardano ecosystem:\n\nThe project helps spread the image of Cardano in Vietnam officially, attracting investors with long-term vision as well as talented Vietnamese developers who are willing to contribute to the ecosystem. At the same time, the dissemination of in-depth knowledge will help expand the network of operators, Dapp builders, and stake pool users who actively participate in governance in the future.\n\nTo measure the impact, the Project commits to producing and distributing 9 high-quality podcasts in 3 months and measuring the effectiveness both quantitatively and qualitatively:\n\nQuantitative indicators:\n\n- Attracting a minimum of 700 members to join the 5PC Cardano community\n- Comments: At least 450 comments (average 50 comments per episode).\n- Views: At least 72,000 views (minimum 8,000 views per episode).\n\nQualitative indicators: Collecting positive feedback from viewers through comments, messages, and continuous discussions on the project's Telegram groups.\n\nThe results will be uploaded to open communication channels, easy for the community to verify:\n\n- [5 Minute Crypto Youtube Channel](https://youtube.com/c/5Ph%C3%BAtCrypto)\n- [5 Minute Crypto Telegram Community](https://t.me/Fivemincryptoann)\n- [Cardano 5PC Vietnam Telegram Community](https://t.me/Cardano_5PC_Chat)\n\nAll figures will be updated and shared publicly through a transparent tracking board, making it easy for the community, sponsors and stakeholders to track progress and assess real-world impact.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"5 Minute Crypto has experience supporting many large cryptocurrency media projects in Vietnam. Some of our notable achievements include:\n\n- 3600 members join Zama Vietnam\n- More than 1700 KYC members on Binance Vietnam\n- More than 1100 people download, 595 people transact on OKX web3 wallet\n- More than 1300 people download the Moonwalk Fitness project web3 application\n- More than 870 people download and use the Grass extension\n- More than 3000 members join the depin DAWN project\n- More than 3000 members experience the Nodepay project\n\nSee details here: [Flagship Web3 Projects Supported by 5 Phút Crypto](https://5phutcrypto.io/flagship-web3-projects-supported-by-5-phut-crypto/)\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/5PC%20team%202.png)\n\nPhoto: Members of 5PC's community support team\n\nWe own the largest investment community in Vietnam, more than 10,000 investors and hundreds of active programmers with:\n\n- 193,000 [YouTube channel](https://youtube.com/c/5Ph%C3%BAtCrypto) subscribers. Below is a snapshot of monthly viewership, the 5PC Youtube channel is viewed by 137,200 people per month.\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/youtube%20metric%20users%205PC%201.jpg)\n\n- 403,000 [TikTok channel followers](https://www.tiktok.com/@5phut_crypto?_t=8UvpiqiEE66&_r=1). Below is a snapshot of monthly users (not views), 5PC tiktok channel has 1.3 million monthly viewers.\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/TikTok%20metric%20(2).jpg)\n\n- 63,000 members [Telegram 5PC members](https://t.me/Fivemincryptoann)\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/telegram%20metric.jpg)\n\n- [Cardano Vietnam Community](https://t.me/Cardano_5PC_Chat) with 650 members\n\nThe team has many years of experience in content production, in-depth translation, organizing seminars and community building. The successful implementation of 2 proposals at 2 funds: Fund11 and Fund12 with results exceeding KPI is a clear demonstration of execution capacity.\n\n- [Fund 11 with the video Why Cardano](https://www.catalystexplorer.com/en/proposals/5pc-cardano-education-video-on-tiktok-for-the-vietnamese-community-f11/details) - 8 TikTok videos reached 322,000 views, exceeding the target by 15% - affirming the ability to convey information in an attractive way. You can [watch the series here](https://vt.tiktok.com/ZSHTkPcW22vBP-Irpqn/).\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/tiktok%20why%20cardano%20series.jpg)\n\n- [Fund 12 with the Podcast series](https://www.catalystexplorer.com/en/proposals/5pc-cardano-journey-cardano-education-podcast-series-for-the-vietnamese-community-f12/details) attracted more than 86,000 views, exceeding the target by 50%. You can [watch the series here\\.](https://www.youtube.com/playlist?list=PLPouoDUOCcJvimnVNJKbXC_ArenPPItox)\n\n![](https://raw.githubusercontent.com/5phutcrypto/drep/refs/heads/main/podcast%20cardano%205PC.jpg)\n\n5PC has core values ​​that are consistent with Cardano:\n\nDirect value dissemination: Cardano does not depend on KOLs or hyped projects. Catalyst is a smart PR method - instead of spending money on individuals, Cardano conveys value to end users: SPO, DRep, DEV - those who work hard to build the ecosystem. 5PC is the ideal bridge for this mission.\n\nThe civilized and humane 5PC community: 5PC says no to advertising low-quality projects, does not put group interests above community risks.\n\nOptimal spreading opportunity: With a large number of members and easy-to-understand content, 5PC is the right choice to spread the value of the Cardano ecosystem to the Vietnamese community.\n\nWe approach the project according to a strict process:\n\n- Come up with ideas and work with blockchain experts to agree on the topic\n- Agree on the content to be discussed in each episode, write out the main content in advance, check the technological accuracy carefully.\n- Produce videos with approved scripts\n- Publish and promote on major community platforms.\n- Transparent tracking and reporting through public KPI files, updated regularly, for the community to verify progress.\n\nVerified authenticity through:\n\n- Specific KPIs on community participation, video volume, views, live discussion of content.\n- Open and transparent financial reporting system.\n- Proven experience from previous Catalyst projects and long-term community activities.\n\nFinal commitment with the highest confidence: 5PC is the perfect choice for this project due to its ability to turn complex ideas into vivid, accessible content, reinforcing the community's belief in the true value of Cardano - a blockchain that is undervalued compared to the infrastructure that Hoskinson, hundreds of engineers, SPOs and thousands of millions of people in the community own.\n\nWith its current capacity, extensive community network and commitment to transparency, 5PC is perfectly suited to execute this project with the highest level of reliability, efficiency and accountability.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Laying the Groundwork","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Kicking off the project with two consecutive podcasts helps create a strong viral effect, attracting attention from the beginning and establishing “growth momentum” for the following content. At the same time, feedback from the community during this phase will be used to optimize the content for the following episodes, ensuring relevance and maximum impact on viewers.\n\n\n\nOutput:\n\n\n\nFinalize and publish 3 high quality podcasts on YouTube, each video is 15–30 minutes long, focusing on fundamental and engaging topics of Cardano.\n\n\n\nStrong communication about these 3 podcasts through the entire existing channel system: YouTube 5 Minutes Crypto, Telegram communities, and related social media channels.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Target achievement for milestone results:\n\n- Minimum 150 new members join the [5PC Cardano community](https://t.me/Cardano_5PC_Chat)\n- Comments: Minimum 70 comments from the community, reflecting interest and discussion on the topic.\n- Views: 3 youtube videos reached 11,000 views","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The summary report link includes links to articles, videos posted on Youtube, statistics on group participants, views, comments. Images illustrate the indicators achieved according to previous commitments.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":8883,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Gaining Momentum","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This phase marks the transition from “introducing” to “deepening” the content, while significantly increasing the audience and engagement. The release of the next 3 episodes helps to shape the content brand, maintain the community’s interest and create a solid foundation for the project’s podcast episodes.\n\nThe output includes:\n\nCompleting and publishing 3 new podcasts on YouTube (episodes 3,4,5), each episode is 15–30 minutes long, delving into advanced Cardano topics such as Hydra, Mithril, Voltaire governance or Midnight.\n\nDeploying a synchronized communication campaign for the next 3 podcast episodes across YouTube, Telegram and social media channels, leveraging the resonance effect to increase reach.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Minimum 400 people join the [5PC Cardano community](https://t.me/Cardano_5PC_Chat) on telegram (Both M1 and M2)\n\n- Comments: A total of 6 videos on YouTube (both M1 and M2) with at least 250 comments, showing interest and active discussion.\n\n- Views: A total of 6 videos on YouTube (both M1 and M2) with 40,000 views.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The summary report link includes links to articles, videos posted on Youtube, statistics on group participants, views, comments. Images illustrate the indicators achieved according to previous commitments.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":8883,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Sustaining the Community","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone not only marks the completion of all content production, but also a time for the project to summarize, evaluate and maximize its impact. The release of 9 high-quality podcasts in 3 months will create a sustainable, easily accessible educational library that will serve as a long-term resource for the Vietnamese community and contribute to attracting new investors and developers to the Cardano ecosystem.\n\n\n\nOutputs include:\n\n\n\nFinalize and publish the last 3 podcasts on YouTube (episodes 7,8,9), each episode is 15–30 minutes long, focusing on strategic topics such as Cardano’s future forecast, potential ecosystem expansion, and inspiring stories from the community.\n\n\n\nDeploy a comprehensive communication campaign for all 9 podcasts across YouTube, Telegram, and social media channels, leveraging the resonance effect to increase educational content reach.\n\n\n\nThe project's final video highlights the implementation journey and results achieved.\n\n\n\nThe project completion report presents the overall progress, deliverables, achieved metrics and actual impact.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Minimum 700 new members join the 5PC Cardano community (both M1, M2 and M3)\n\n- Comments: A total of 9 YouTube videos (both M1, M2 and M3) have at least 450 comments, showing interest and active discussion.\n\n- Views: A total of 9 YouTube videos (both M1, M2 and M3) have reached 72,000 views.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The summary report link includes links to articles, videos posted on Youtube, statistics on group participants, views, comments. Images illustrate the indicators achieved according to previous commitments.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":11844,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Hoang Van Minh** ([https://www\\.linkedin\\.com/in/minh\\-5pc/\\)](https://www.linkedin.com/in/minh-5pc/))\n\n- Working in the financial sector since 2015 at Military Commercial Joint Stock Bank\n\n- Researching the blockchain sector in Vietnam since 2017\n\n- 6 years of experience in the field of content creation and investment\n\nTasks:\n\n- Control all stages in the implementation process.\n\n- Ensure the time and quality of the video are correct.\n\n- Monthly disbursement report\n\n**Nguyen Thi Kieu Oanh** ([https://www\\.linkedin\\.com/in/kieu\\-oanh\\-76aa65186](https://www.linkedin.com/in/kieu-oanh-76aa65186) )\n\n- Content Creator 5PC.\n\n- 4 years of experience in the field of content creation.\n\n- Popular influencer on YouTube channel 5 Minutes Crypto.\n\nTasks:\n\n- Write content and shoot videos.\n\n**Nguyen Thu Trang** ([https://www\\.linkedin\\.com/in/trangnguyen1996/](https://www.linkedin.com/in/trangnguyen1996/) )\n\nContent creator at 5PC\n\n- 4 years of experience in crypto investment\n\n- 7 years of experience in media and content production\n\nTask :\n\n- Research and produce simple, easy-to-understand content\n\n**Nguyen Tuan Anh** ([https://www\\.linkedin\\.com/in/nguy%C3%AAn\\-tu%E1%BA%A5n\\-anh\\-335835242/](https://www.linkedin.com/in/nguy%C3%AAn-tu%E1%BA%A5n-anh-335835242/) )\n\n- Filming and editing at 5PC.\n\n- 4 years of experience in video editing.\n\nTasks:\n\n- Filming and editing videos.\n\n**Nguyen Tien Hoang** ([https://www\\.facebook\\.com/vicente\\.bosque\\.39](https://www.facebook.com/vicente.bosque.39) )\n\n- Filming and KOL at 5PC.\n\n- 5 years of experience in filming and content creation.\n\nTasks:\n\n- KOL for YouTube videos.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"ADA rate at the time of proposal: 0.4$\n\nProject costs are calculated based on the Task Assignment which includes:\n\n- Content production: 3 individual x 9 podcasts x 24 hours (3 days)/podcast x 15 ADA/hour = 9720 ADA\n- Keynote speaker (Advisor): 1 individual x 9 podcasts x 24 hours (3 days)/podcast x 30 ADA/hour = 6480 ADA\n- Presiding speaker: 1 individual x 9 podcasts x 18 hours/podcast x 20 ADA/hour = 3240 ADA\n- Video recording: 2 individuals x 9 podcasts x 6 hours/podcast x 15 ADA/hour = 1620 ADA\n- Video editing: 2 individual x 9 podcasts x 10 hours/podcast x 15 ADA/hour = 2700 ADA\n- Project management and reporting back to the community: 200 ADA/podcast x 9 podcasts = 1800 ADA\n- Marketing and support community for 3 months: 600 ADA/months x 3 months  = 1800 ADA\n- Studio and equipment rental: 250 ADA/podcast x 9 podcasts = 2,250 ADA\n\nTotal project cost: 29,610 ADA\n\nThe proposed cost for each milestone is as follows:\n\n- The proposed cost for the first milestone, which requires the completion of the first 03 Podcast topics, is: 8883 ADA (30% of the total budget)\n- The proposed cost for the second milestone, which requires the completion of the next 03 topics, is: 8883 ADA. (30% of the total budget)\n- The proposed cost for the final milestone, which requires the completion of the last 03 topics, is: 11844 ADA (40% of the total budget)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Project Cost Value for the Cardano Ecosystem\n\nThis series of 9 video podcasts will help the Vietnamese Cardano community attract new members, encourage investors to participate, and encourage developers to choose Cardano as the platform for their projects. These are long-term benefits with strong expansion potential, contributing to building a sustainable Cardano ecosystem in Vietnam.\n\nOptimizing Project Costs\n\nThe budget is carefully built, ensuring optimization for each role in the project. This is an innovative project, requiring higher video quality than conventional marketing campaigns, so the participating team is selected based on strict criteria:\n\n5PC is a team with many years of experience in content creation, filming, editing, and community building. Has helped many large web3 projects attract hundreds to thousands of users to regularly use products and services. Some typical projects: [Flagship Web3 Projects Supported by 5 Phút Crypto](https://5phutcrypto.io/flagship-web3-projects-supported-by-5-phut-crypto/)\n\nIn-depth understanding of blockchain and the Cardano ecosystem to ensure accurate and engaging content.\n\nUsing professional studios and modern filming equipment to create high-quality videos that attract viewers.\n\nAll costs are adjusted to suit the Vietnamese market, ensuring effective use of budget while still achieving high quality.\n\nSalary comparison: Vietnam, International and Average\n\nDetailed labor costs and salary comparison are as follows:\n\nContent production: about $6/hour.\n\n- Vietnam: Average salary for an experienced blockchain content creator in Vietnam is about 30 million VND/month (Source: [Glassdoor](https://www.glassdoor.com/Job/vietnam-content-blockchain-jobs-SRCH_IL.0,7_IN251_KO8,26.htm)), equivalent to $7/hour (1 USD = 27,000 VND). We pay $6/hour, a reasonable salary with high professional requirements (translation, Cardano research).\n- International: According to Glassdoor, the salary for content creation in the US is around $20/hour. The project has a lower price ($5.6/hour), much more economical.\n\nKOL: around $12/hour.\n\n- Vietnam: KOLs in Vietnam (YouTube, TikTok) are usually paid $12-15/hour for video recording (Source [Glassdoor](https://www.glassdoor.com/Job/vietnam-kol-jobs-SRCH_IL.0,7_IN251_KO8,11.htm)) We pay $12, which is budget-friendly. (KOLs are experienced and knowledgeable about Cardano).\n- International: KOLs in the US can be paid $50/hour. The project saves about 65%\n\nFilming + Editing: around $6/hour.\n\n- International: In the US, filming is around $30/hour. The project saves about 80%. (Source [Glassdoor](https://www.glassdoor.com/Job/vietnam-quay-phim-jobs-SRCH_IL.0,7_IN251_KO8,17.htm))\n\nEffective and Responsible Budget Management\n\n5PC has extensive experience in creating blockchain and cryptocurrency content in Vietnam, ensuring that the budget is managed effectively and transparently. The team is committed to using resources economically, with detailed monthly reports. 5PC members do this content not only for money, but also for trust, for knowledge, for the journey we accompany, as evidenced by the fact that 5PC is a team that holds a large amount of ADA, we have become reputable Dreps in the community, so using the budget responsibly not only protects the project but also protects our own investment interests, creating a companion with the goal of the Cardano ecosystem.\n\nOutstanding value compared to similar projects at Catalyst. 5PC has researched similar projects funded in previous Funds.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Education","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1715}