{"pr_id":"019a9641-1dc6-79e3-888c-85a240015990","title":"GovCircle: Strengthening Cardano’s Constitutional Framework","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"No transparent, collaborative process exists for community consensus on Cardano’s text-based Constitution before on-chain voting.","solution":"GovCircle facilitates collaborative consensus on Cardano’s Constitution via opinion discussion, version history, Event Management and impact tracking.","proposer_name":"Sadegh Ghoroghi","proposer_relevant_experience":"# Team\n- **Omid Ajorlou\\- Technical Product Manager &amp; Software Architect**\n\nRole: Oversees project vision, technical architecture, and product management for the Constitution Panel MVP. Leads integration with Cardano’s governance ecosystem and coordinates community engagement.\n\nBackground: Master’s in Software Engineering, 12 years as a software architect, deep Cardano knowledge since 2017, thesis on decentralized identification (aligned with Cardano’s Identus), registered DRep ($crypto_oaj), and active in the Persian blockchain community with presentations at events like 9Jun, Web3 Startups, and AI Summit.\n\nContribution: Designs the platform’s technical architecture (backend using Java Spring, frontend framework), manages development timelines, and engages governance stakeholders (DReps, SPOs, CC members).\n\nLinkedIn: [https://www\\.linkedin\\.com/in/omidajorlou](https://www.linkedin.com/in/omidajorlou)\n\nGithub: [https://github\\.com/cryptooaj](https://github.com/cryptooaj)\n\nCommitment: Full-time availability, with 40 hours/week dedicated to GovCircle.\n\n- **Sadegh Ghoroghi\\- Software Engineer**\n\nRole: Develops backend infrastructure for the Constitution Panel.\n\nBackground: Seasoned Java Spring and enterprise banking systems engineer, specializing in blockchain since 2020 with a strong focus on the Cardano ecosystem. Experienced in Cardano governance, transaction architecture, staking systems, and integrating enterprise-grade solutions using cardano-node, cardano-cli, and Bloxbean stack.\n\nContribution: Implements backend logic for proposal submission, discussion threads, and data management, ensuring scalability and security.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/sadegh\\-ghoroghi\\-1649a01b7](https://www.linkedin.com/in/sadegh-ghoroghi-1649a01b7)\n\nGithub: [https://github\\.com/Sadeghg](https://github.com/Sadeghg)\n\nCommitment: Full-time availability, with 40 hours/week dedicated to GovCircle.\n\n- **Parisa Naderi \\- UI/UX Designer**\n\nRole: Designs the user interface and experience for the Constitution Panel, ensuring intuitive navigation and accessibility.\n\nBackground: Experienced in user-focused decentralized app design, designer of StoryChain (Web3 social media platform on Cardano).\n\nContribution: Creates and refines Figma prototypes (available via provided links), designs the tree-based constitutional structure interface, and incorporates community feedback for usability.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/parisa\\-naderi\\-m](https://www.linkedin.com/in/parisa-naderi-m)\n\nCommitment: Part-time, 20 hours/week, dedicated to UI/UX tasks.\n\n- **Mohammadreza Dehghani \\- Software Engineer**\n\nRole: Develops front-end of Constitution Panel using Next.Js\n\nBackground: Professional Full Stack Developer with a background in Java and modern front-end technologies, now focused on front-end delivery using Next.js to build secure, intuitive interfaces that seamlessly integrate blockchain\n\nLinkedIn: [https://www\\.linkedin\\.com/in/dehghani\\-reza](https://www.linkedin.com/in/dehghani-reza)\n\nGithub: [https://github\\.com/dehghani\\-reza](https://github.com/dehghani-reza)\n\nCommitment: Part-time, 30 hours/week for development and 20 hours/quarter for audits.","url":null,"funds":149902,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"GovCircle: Strengthening Cardano’s Constitutional Framework","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Sadegh Ghoroghi","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":149902,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":10,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"No transparent, collaborative process exists for community consensus on Cardano’s text-based Constitution before on-chain voting.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"GovCircle facilitates collaborative consensus on Cardano’s Constitution via opinion discussion, version history, Event Management and impact tracking.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://govcircle.gitbook.io/govcircle-docs/modules","https://govcircle.space/","https://www.figma.com/proto/OoXGJ0JSj6R6sD3iINLtT9/GovCircle?page-id=126%3A684&node-id=804-1714&viewport=-14353%2C5032%2C0.45&t=vLD7FTabit0pjf40-1&scaling=min-zoom&content-scaling=fixed&starting-point-node-id=804%3A1714","https://github.com/govcircle"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Demeter.run (Real-Time Blockchain Data Reads): Demeter.run is a hosted service for Cardano node infrastructure. These are crucial for accessing the latest blockchain state and indexing on-chain data without running a full node ourselves.  Demeter.run operates on a subscription model where we maintain an active account and API access. Blockfrost (On-Chain Data Reading via HTTP): Blockfrost is a third-party API service for querying Cardano blockchain data over HTTP, simplifying data retrieval for non-real-time queries and reducing infrastructure overhead. We have the required licenses and permissions through Blockfrost's free and paid tiers. BloxBean:‌ open-source tools and frameworks designed to accelerate blockchain development and simplify smart contract creation on Cardano. which consists of:Cardano Client Lib: A client library for Cardano in Java. This library simplifies the interaction with the Cardano blockchain from a Java application. MIT license.Yaci Devkit: A set of dev tools for development on Cardano. Accelerate your Cardano development with Yaci DevKit, the easy-to-use dev tools for creating local devnet and iterating with ease. MIT licenseYaci Store: A Cardano datastore implementation using Yaci. MIT licenseYaci: A Cardano Mini Protocols implementation in Java. MIT licenseMeshJS: Collection of comprehensive TypeScript libraries for blockchain development on Cardano. Apache-2.0 license","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"GovCircle is an open-source project by our team. All source code and documentation will be published publicly on GitHub under the Apache 2.0 License. This OSI-approved license allows anyone to use, modify, distribute, and build upon the project, with no proprietary IP or restrictions beyond standard attribution and license terms.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Governance","group":"Governance"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"GovCircle is a novel platform for Cardano, addressing the lack of transparent, collaborative consensus on the Constitution before on-chain voting. Unlike costly global workshops for the Interim Constitution or fragmented feedback (e.g YUTA’s Excel process), GovCircle streamlines community input aggregation and documentation. No prior Cardano tool offers a dedicated solution for consensus-building. It replaces resource-heavy or individualistic approaches with a scalable, transparent platform, ensuring community-driven constitutional updates, distinct from tools like GovTool.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"GovCircle’s MVP will demonstrate a fully functional Constitution Panel, enabling  engagement with Cardano’s Constitution. It  allows the community to propose and discuss amendments, visualize version differences, and track article validity.\n\n\n\nPrototyped in Figma (accessible via provided links), the MVP will be deployed as a web-based platform by project end, testable at a public URL. Community testing will involve submitting amendment proposals and providing feedback on usability. Other modules will be prototyped in Figma, with implementation post-feedback, outside this scope.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"GovCircle’s MVP will support 4 on-chain Constitution updates action in year 1, engaging 3711 users (990 DReps, ~2,721 SPOs, ~7 CC) based on Cardano’s governance metrics. Expect ~30 off-chain constitution opinion, with 40% of engaging users.\n\n228,105 delegators (1% of ~1,900 active on governance) will use GovCircle to inform DRep selection.\n\nMetrics align with ~990 DReps and ~3,181,072 Accounts with amount in recent Cardano. Community can test MVP at a public URL, submitting proposals and giving feedback.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"# Problem Perception\nCardano’s governance system, a cornerstone of its decentralized ecosystem, relies heavily on the Cardano Constitution to guide on-chain decision-making. However, the current process for engaging with the Constitution lacks a transparent, collaborative mechanism to aggregate community consensus before on-chain voting. Historically, the Interim Constitution was developed through over 60 costly global workshops by seed entities like IOG, requiring significant resources and time. Subsequent updates, such as the Version 2 proposal in Epoch 574, relied on fragmented methods like YUTA’s Excel-based feedback collection on platforms like X, which are inefficient and lack scalability. Without a dedicated platform, community members, DReps (Delegated Representatives), SPOs (Stake Pool Operators), and Constitutional Committee (CC) members struggle to propose, discuss, and refine constitutional amendments collaboratively. This results in either resource-intensive processes or disjointed, individualistic on-chain submissions, making consensus on text-based updates challenging and limiting community participation in Cardano’s governance evolution.\n\n# Proposed Solution\nGovCircle is a modular, web-based platform designed to address this gap by providing a transparent, scalable, and collaborative environment for community-driven consensus on Cardano’s Constitution before on-chain voting. The initial Minimum Viable Product (MVP) focuses on the Constitution Panel, a fully functional module that enables DReps, SPOs, CC members, and delegators to engage with the Constitution through structured amendment proposals, interactive discussions, version tracking, and impact analysis. The platform integrates with existing Cardano tools like GovTool for on-chain action submission and leverages open-source technologies for accessibility and scalability.\n\nThe **Constitution Panel** includes the following key functionalities:\n\n1. **Tree\\-Based Constitutional Structure:** Presents the Constitution in a hierarchical, user-friendly format, allowing easy navigation of articles and sections, with metadata like validity scores to highlight stable rules.\n2. **Amendment/Opinion:** Enables DReps and SPOs to propose structured amendments (e.g., create, delete, update, merge, split), shared via an Event Manager module for social platform integration (e.g., X) to explain rationales.\n3. **Interactive Discussion Module:** Provides a space for DReps, SPOs, CC members, and delegators to discuss opinion/amendments, fostering transparent consensus-building.\n4. **Version History Module:** Offers an interactive interface to visualize differences between Constitution versions, overcoming limitations of tools like GovTool or open-source diff checkers, especially as more versions emerge.\n5. **Action Checker Module:** Allows the Constitutional Committee to evaluate on-chain governance actions against constitutional articles, linking violations or approvals to specific articles and quantifying their impact (e.g., “ArticleII-Section1 blocked 4 actions”).\n6. **Validity Metrics:** Assigns scores to rules based on stability (unchanged across versions) and impact (actions blocked/passed), aiding the community in assessing rule effectiveness.\n\nThe MVP, prototyped in Figma (accessible via provided links), will be fully implemented as a web-based platform by the project’s end, available at a public URL for community testing. Other modules (Governance Actor Profile, Circle, On-Chain Voting) will be prototyped in Figma during the project but implemented post-feedback, outside this proposal’s scope.\n\n# Reasons for Approach\nGovCircle’s approach is driven by the need for a scalable, cost-effective alternative to resource-heavy workshops or fragmented feedback processes. Unlike the Interim Constitution’s workshop model, which required significant funding and logistics, or YUTA’s manual Excel-based feedback for Version 2, GovCircle centralizes and streamlines community input. By focusing on collaboration, it reduces barriers to participation, enabling broader engagement from Cardano’s global community. The platform’s integration with social platforms and GovTool ensures accessibility and alignment with Cardano’s governance ecosystem. The iterative development approach, starting with the Constitution Panel, allows for community feedback to refine functionality, ensuring the platform meets real-world needs.\n\n# Uniqueness of the Solution\nGovCircle is unique as Cardano’s first dedicated platform for constitutional consensus-building, addressing a gap where no comparable tool exists. Unlike funded efforts like GovTool (focused on on-chain voting) or the Interim Constitution’s workshop model, GovCircle offers a scalable, transparent solution that streamlines community input without requiring costly logistics or fragmented processes (e.g., YUTA’s Excel-based feedback). Its centralized platform for documenting discussions and aggregating consensus before on-chain voting is unprecedented, replacing resource-intensive or individualistic approaches with a community-driven, data-informed process.\n\nWho Will Benefit and Why It’s Important to Cardano\n\n**Beneficiaries**:\n\n- DReps and SPOs: Gain a structured platform to propose and refine amendments, enhancing their governance influence.\n- Constitutional Committee: Benefits from tools to evaluate actions against constitutional articles, improving decision-making.\n- Delegators: Make informed DRep selections based on transparent amendment discussions, strengthening governance participation.\n- Cardano Community: Accesses an inclusive platform to shape the Constitution, fostering trust and engagement.\n\n**Importance to Cardano:** GovCircle strengthens Cardano’s decentralized governance by enabling transparent, scalable consensus on the Constitution, a critical component of the Voltaire phase. It reduces barriers to participation, enhances trust in governance processes, and aligns with Cardano’s vision of community-driven decision-making. By facilitating effective constitutional updates, GovCircle ensures Cardano’s governance framework remains robust, adaptive, and inclusive, supporting the ecosystem’s long-term sustainability.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"# Value to the Cardano Community\nGovCircle will transform Cardano’s decentralized governance by providing a transparent, collaborative platform for consensus on the Cardano Constitution, addressing the inefficiency of resource-heavy workshops (e.g., 60+ global workshops for the Interim Constitution) and fragmented feedback processes (e.g., Excel-based feedback).\n\nThe Constitution Panel, GovCircle’s core MVP, enables ~990 DReps, ~2,721 SPOs, ~7 Constitutional Committee (CC) members, and ~228,105 delegators to propose, discuss, and refine amendments before on-chain voting, fostering inclusivity and transparency. This strengthens Cardano’s governance framework by:\n\n1. **Enhancing Community Participation:** GovCircle empowers 3,711 governance actors (990 DReps, ~2,721 SPOs, ~7 CC members) and ~228,105 delegators to shape the Constitution, lowering barriers compared to costly workshops or ad-hoc social media feedback, aligning with Cardano’s Voltaire phase.\n2. **Increasing Transparency and Trust:** By documenting amendment discussions transparently, GovCircle enables delegators to make informed DRep selections, enhancing trust in governance processes and ensuring the Constitution reflects community consensus.\n3. **Improving Governance Efficiency:** Supporting 4 on-chain Constitution updates in year 1, GovCircle streamlines consensus, reducing reliance on resource-intensive or fragmented methods, making governance scalable as Cardano grows.\n4. **Empowering Delegators: **~228,105 delegators can use GovCircle to evaluate DRep contributions, improving delegated governance quality and participation.\n5. **Strengthening Constitutional Stability:** By facilitating consensus-driven updates, GovCircle ensures the Constitution evolves robustly, supporting Cardano’s long-term governance sustainability.\n\n# Measuring Impact\nImpact will be measured using quantitative and qualitative metrics, tied to Cardano’s governance ecosystem:\n\n**Quantitative Metrics:**\n\n- On-Chain Updates: Facilitate 4 on-chain Constitution updates in year 1, with 80% of proposals from GovCircle’s consensus process, verifiable via GovTool.\n- User Engagement: Engage ~3,711 users based on Cardano’s ~990 DReps and ~3,181,072 total accounts, with ~2,721 SPOs reflecting high participation.\n- Off-Chain Activity: Generate ~30 off-chain constitution's opinions, with 40% engaging users actively contributing opinions/discussions.\n- Delegator Impact: Enable 228,105 delegators (1% of ~1.9M) to inform DRep selection, correlated with on-chain voting patterns.\n- Platform Usage: Target ~10,000 interactions (e.g., page views, Amendment/opinion submissions) at the public URL, based on Cardano community engagement trends.\n\n**Qualitative Metrics:**\n\n- Community Feedback: Collect surveys and discussion thread feedback on MVP usability and transparency, targeting 70% positive responses from testers.\n- Transparency Perception: Assess user trust in constitutional processes via workshop feedback, aiming for improved confidence.\n- DRep/SPO Satisfaction: Gather testimonials from ~50 DReps/SPOs on GovCircle’s effectiveness in streamlining amendments.\n\n# Sharing Outputs and Opportunities\nGovCircle’s outputs will be shared transparently to maximize community engagement:\n\n**Outputs Shared:**\n\n- MVP Access: The Constitution Panel MVP, deployed at a public URL, will allow community testing of proposal submissions and usability. Figma prototypes (via provided links) will be shared during development.\n- Consensus Documentation: Amendment discussion summaries will be published on the platform and shared via X (using Event Manager), targeting ~2,000 views.\n- Impact Reports: Catalyst reports will detail metrics and feedback, shared via GovCircle X Account to community.\n\n**With Whom:**\n\n- DReps, SPOs, CC Members: Engaged via outreach and workshops for MVP testing and feedback.\n- Delegators: Reached through X and Cardano X spaces to encourage platform use.\n- Cardano Community: Invited to contribute to code and prototypes.\n\n**Sharing Methods:**\n\n- Workshops: Host virtual/in-person workshops for ~100 participants to demo the MVP and collect feedback.\n- Social Media (X): Share updates and consensus summaries, targeting ~1,000 interactions.\n- Catalyst Reporting: Provide milestone-based reports to Catalyst, ensuring transparency.\n- Open-Source Repositories: Publish reports on GitHub for community access.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"# Existing Capabilities Demonstrating Suitability\nOur team’s diverse expertise, proven track record in Cardano’s ecosystem, and active community engagement position us as ideally suited to deliver GovCircle, a platform to strengthen Cardano’s constitutional governance through transparent, collaborative off-chain consensus. Our capabilities include:\n\n# Proven Cardano Experience\nSuccessfully launched and operated Cardano Stake Pool Operators (SPOs), demonstrating technical proficiency in Cardano’s infrastructure.\n\nDeveloped StoryChain, a Web3 social media platform on Cardano, submitted as a startup in British Columbia, Canada, showcasing end-to-end decentralized app development.\n\nDelivered a Cardano educational program in Farsi, expanding community knowledge and engagement.\n\nOmid’s active DRep role and presentations at high-profile events (e.g., 9Jun, Web3 Startups, AI Summit) establish credibility in Cardano’s governance and Persian blockchain communities.\n\n# Cardano Ecosystem Engagement\nStrong connections with Cardano community and a curated list of active governance participants, including CC members and DReps, ensuring collaboration with key stakeholders.\n\nParticipation in Cardano events, such as the upcoming Cardano Summit, to engage the community and gather feedback.\n\nEstablished Figma prototypes for the Constitution Panel (accessible via provided links), demonstrating early commitment to user-focused design.\n\n# Feasibility Validation Approach\nTo ensure GovCircle’s approach is feasible, we have implemented and planned the following steps:\n\n- **Prototyping and Design:** The Constitution Panel is already prototyped in Figma, with mockups available for community review, validating the user interface and experience. Remaining modules (Governance Actor, Circle, Voting) will be prototyped in Figma during the project, with implementation post-feedback, outside this scope.\n- **Iterative Development:** A phased approach includes developing the Constitution Panel MVP by Month 9, with early testing in Months 7-8 to incorporate community feedback. This ensures the platform meets governance needs.\n- **Community Testing:** The MVP will be deployed at a public URL, allowing 3,711 users (990 DReps, ~2,721 SPOs, ~7 CC members) to test proposal submissions and usability, with feedback collected via surveys and website's feedback.\n- **Code Audits:** We will collaborate with Cardano community experts, such as Phil_UPLC and Bloxbean developers, to audit the MVP’s codebase, ensuring technical reliability and security.\n- **Community Validation:** Engage a curated list of active governance participants (CC members, DReps) to validate the platform’s effectiveness in facilitating consensus, targeting feedback from ~20 governance actors.\n\n# Trust and Accountability in Fund Management\nTo manage funds with high levels of trust and accountability, we have established robust processes:\n\n- **Multi\\-Signature Wallet:** Funds will be managed via a multi-signature wallet requiring approvals from multiple team members (e.g., Omid Ajorlou, sadegh ghoroghi), ensuring no single point of control.\n- **Quarterly Financial Audits:** Mohammadreza Dehghani will conduct quarterly audits to verify fund allocation, with reports shared with the Catalyst community for transparency.\n- **Milestone\\-Based Reporting:** Quarterly reports will detail progress (e.g., MVP development, user engagement, on-chain updates), budget usage, and community feedback, published via Catalyst channels, Intersect forums, and X.\n- **Community Oversight:** Regular updates and feedback sessions via workshops and X will ensure community input on fund usage and project progress.\n\n# Why We Are Best Suited\nOur team’s combination of technical expertise (Java Spring, TypeScript, NextJS), Cardano-specific experience and deep community engagement (Persian blockchain leadership) uniquely positions us to deliver GovCircle. The successful delivery of StoryChain and Cardano educational programs demonstrates our ability to execute complex projects. Omid’s governance involvement as a DRep and event presentations further validates our understanding of Cardano’s constitutional needs. Collaborations with community auditors and governance actors ensure technical and functional alignment, while our transparent financial processes guarantee accountability.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Setup and Constitution Panel Prototype Finalization","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Complete project setup\n- Configure development server (back-end, front-end, Database, local-devnet)\n- Finalize requirements\n- Enhance the Constitution Panel’s Figma prototype to include all core functionalities (tree-based structure, amendment/opinion, discussion module,event management, version history)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Figma prototype reflects all core functionalities, validated by team review.\n- Backend and database pass a health check endpoint that confirms services are running.\n- Backend can query dummy/test data in the database successfully.\n- Git repository follows best practices (branching strategy, meaningful commits, clear README, proper folder structure).\n- Requirements document approved by at least 3 team members (Omid, Sadegh, mohammadreza) include UI Design, Database Design and User Flow Diagram","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Updated Figma prototype shared via public link, demonstrating the Constitution Panel’s design.\n- README with setup instructions\n- Running a test endpoint or that retrieves a sample record from the database returns expected data without errors.\n- Proper folder structure and code organization\n- Project plan and requirements document include UI Design, Database Design and User Flow Diagram published on GitHub for community review.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":23932,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Constitution Panel Development","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"start the Constitution Panel Development\n\n\n\n- get list of constitution On-Chain (Frontend and Backend Implementation)\n- User Authentication and Authorization (Frontend and Backend Implementation)\n- implementing the tree-based structure constitution (Frontend and Backend Implementation)\n- implement constitution verion history (Only Backend Implementation)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- **Constitution Panel Development Initiated:**\n        - Development environment is set up, with NextJS (frontend) and Java Spring/TypeScript (backend) frameworks configured and integrated, verified by a working test server.\n        - At least 90% of planned development tasks (e.g., repository setup, initial codebase) are initiated, tracked via GitHub project board.\n- **List of On\\-Chain Constitutions:**\n        - Backend retrieves and stores on-chain Constitution versions from Cardano’s blockchain, accessible via API.\n        - Frontend displays a list of Constitutions with basic metadata (e.g., version number, epoch), navigable by users.\n- **User Authentication and Authorization:**\n        - Backend implements secure authentication (e.g., MeshJS wallet connect) supporting at least 3 test user accounts with roles (e.g., DRep, SPO, CC member).\n        - Frontend provides a login interface and role-based access, with 100% successful login tests.\n- **Tree\\-Based Structure Constitution:**\n        - Backend implements data model for the Constitution, supporting all articles with nested sections, stored and retrievable via API.\n        - Frontend renders the tree-based structure, allowing users to expand/collapse articles/sections with 95% UI responsiveness.\n- **Constitution Version History \\(Backend\\):**\n        - Backend implements version history logic, storing differences between at least 2 Constitution versions (e.g., changes in articles/sections), with diff data retrievable via API.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- **Constitution Panel Development Initiated:**\n        - GitHub repository with initialized NextJS and Java Spring/TypeScript codebase, including setup documentation, publicly accessible, Bloxbean and other libraries integration.\n        - Test server deployed (private URL) verified by team (Omid, Sadegh, Mohammadreza).\n- **List of On\\-Chain Constitutions:**\n        - Backend API endpoint documentation (e.g., via Swagger) showing retrieval of on-chain Constitution versions, shared in Catalyst report.\n        - Frontend screenshot or video demo showing the Constitution list displayed, published on GitHub.\n- **User Authentication and Authorization:**\n        - Backend test report confirming successful authentication for 10 test users with defined roles, shared in Catalyst report.\n        - Frontend login interface demo (video or screenshots) showing role-based access, published on GitHub.\n- **Tree\\-Based Structure Constitution:**\n        - Backend API documentation showing retrieval of articles/sections, shared in Catalyst report.\n        - Frontend demo (video or screenshots) of the tree-based structure with expandable sections, published on GitHub.\n- **Constitution Version History \\(Backend\\):**\n        - Backend test report documenting version history for Constitution versions with diff data verified for accuracy, shared in Catalyst report.\n        - API endpoint documentation for version history retrieval, published on GitHub.\n\n\nAdditional Proof: Internal test report summarizing functionality (90% uptime, 100% test case pass rate for authentication and version history), shared via Catalyst report and GitHub. Codebase audited internally by Sadegh and Mohammadreza, with audit summary published.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":39900,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"finalize Constitution Panel Development","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Implement version history frontend and integrate with backend\n- Implement Opinion Module with amendments, discussion and event management\n- Integrate Action Checker module in constitution panel\n- Implement amendment action include Add, Delete, Update, Merge, Splite","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Version History Frontend: Frontend displays differences for Constitution versions, integrated with backend API, with 95% responsiveness.\n- Opinion Module: Module supports amendment/opinion proposals, discussion threads, and event sharing, with 100% functionality in tests.\n- Action Checker Integration: Module links governance actions to constitutional rules, quantifying impact (e.g., blocked actions), fully integrated.\n- Amendment Actions: Supports Add, Delete, Update, Merge, Split for at least 10 sample amendments, with 100% backend accuracy","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Version History Demo: Video/screenshots of frontend displaying version differences.\n- Opinion Module Demo: Video/screenshots of amendments, discussions, and event management.\n- Action Checker Demo: Video/screenshots showing integration and impact quantification.\n- Amendment Actions Test Report: Internal report confirming 10+ sample amendments for all types.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":59470,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Deployment and Closeout","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Finalize Constitution Panel MVP: Deployed Constitution Panel on public URL with fully functional interaction.\n- Final Figma Prototype of all GovCircle modules include On-chain voting, Circle, Governance Actor Profile\n- Audit Report: audit passed on GitHub.\n- Feedback Summary: Survey results (~10 responses) in Catalyst report.\n- Closeout Report: Detailed project outcomes and metrics.\n- Closeout Video: Summary of GovCircle’s impact and usage.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Final Constitution Panel MVP:**\n\n- Public URL supports ~30 off-chain opinions, with real users engaged, logged via analytics.\n- Fully functional interaction for amendment proposals, discussions, version history, and action checker, with 95% uptime and 100% test case pass rate.\n\n\n\n**Final Figma Prototype:**\n\n- Prototypes for On-chain Voting, Circle, and Governance Actor Profile modules completed, supporting core features (e.g., voting interface, circle discussions, profile management).\n- Validated by UI/UX designer (Parisa) for usability and alignment with Constitution Panel design.\n\n\n\n**Audit Report:**\n\n- Code audit confirms no critical security issues, with 100% of identified issues resolved.\n\n\n\n**Feedback Summary:**\n\n- ~10 survey responses collected, with 70%+ positive feedback on usability and transparency.\n\n\n\n**Closeout Report:**\n\n- Documents technical aspect of design and code, users engaged report, and future plan documentation.\n- Includes project outcomes, metrics, and lessons learned, meeting Catalyst reporting standards.\n\n\n\n**Closeout Video:**\n\n- covering Constitution Panel functionality, community impact, and governance contributions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Final Constitution Panel MVP:**\n\n- Public URL with analytics showing interactions (proposals, views, discussions), shared in Catalyst report.\n- Video demo of fully functional MVP (amendments, discussions, version history, action checker), published on GitHub.\n\n\n\n**Final Figma Prototype:**\n\n- Public Figma link showcasing prototypes for On-chain Voting, Circle, and Governance Actor Profile, shared in Catalyst report.\n\n\n\n**Audit Report:**\n\n- audit report published on GitHub, confirming passed audit.\n\n\n\n**Feedback Summary:**\n\n- Survey results (~10 responses) summarized in Catalyst report.\n\n\n\n**Closeout Report:**\n\n- Detailed report published via Catalyst, certified non-sensitive, covering metrics and outcomes.\n\n\n\n**Closeout Video:**\n\n- Video uploaded in Catalyst report.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":26600,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"# Team\n- **Omid Ajorlou\\- Technical Product Manager &amp; Software Architect**\n\nRole: Oversees project vision, technical architecture, and product management for the Constitution Panel MVP. Leads integration with Cardano’s governance ecosystem and coordinates community engagement.\n\nBackground: Master’s in Software Engineering, 12 years as a software architect, deep Cardano knowledge since 2017, thesis on decentralized identification (aligned with Cardano’s Identus), registered DRep ($crypto_oaj), and active in the Persian blockchain community with presentations at events like 9Jun, Web3 Startups, and AI Summit.\n\nContribution: Designs the platform’s technical architecture (backend using Java Spring, frontend framework), manages development timelines, and engages governance stakeholders (DReps, SPOs, CC members).\n\nLinkedIn: [https://www\\.linkedin\\.com/in/omidajorlou](https://www.linkedin.com/in/omidajorlou)\n\nGithub: [https://github\\.com/cryptooaj](https://github.com/cryptooaj)\n\nCommitment: Full-time availability, with 40 hours/week dedicated to GovCircle.\n\n- **Sadegh Ghoroghi\\- Software Engineer**\n\nRole: Develops backend infrastructure for the Constitution Panel.\n\nBackground: Seasoned Java Spring and enterprise banking systems engineer, specializing in blockchain since 2020 with a strong focus on the Cardano ecosystem. Experienced in Cardano governance, transaction architecture, staking systems, and integrating enterprise-grade solutions using cardano-node, cardano-cli, and Bloxbean stack.\n\nContribution: Implements backend logic for proposal submission, discussion threads, and data management, ensuring scalability and security.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/sadegh\\-ghoroghi\\-1649a01b7](https://www.linkedin.com/in/sadegh-ghoroghi-1649a01b7)\n\nGithub: [https://github\\.com/Sadeghg](https://github.com/Sadeghg)\n\nCommitment: Full-time availability, with 40 hours/week dedicated to GovCircle.\n\n- **Parisa Naderi \\- UI/UX Designer**\n\nRole: Designs the user interface and experience for the Constitution Panel, ensuring intuitive navigation and accessibility.\n\nBackground: Experienced in user-focused decentralized app design, designer of StoryChain (Web3 social media platform on Cardano).\n\nContribution: Creates and refines Figma prototypes (available via provided links), designs the tree-based constitutional structure interface, and incorporates community feedback for usability.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/parisa\\-naderi\\-m](https://www.linkedin.com/in/parisa-naderi-m)\n\nCommitment: Part-time, 20 hours/week, dedicated to UI/UX tasks.\n\n- **Mohammadreza Dehghani \\- Software Engineer**\n\nRole: Develops front-end of Constitution Panel using Next.Js\n\nBackground: Professional Full Stack Developer with a background in Java and modern front-end technologies, now focused on front-end delivery using Next.js to build secure, intuitive interfaces that seamlessly integrate blockchain\n\nLinkedIn: [https://www\\.linkedin\\.com/in/dehghani\\-reza](https://www.linkedin.com/in/dehghani-reza)\n\nGithub: [https://github\\.com/dehghani\\-reza](https://github.com/dehghani-reza)\n\nCommitment: Part-time, 30 hours/week for development and 20 hours/quarter for audits.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Total Budget: 149,902 ADA**\n\n(0.5 USD = 1 ADA)\n\n# **Cost Breakdown**\n- **Product Management:**\n\nCost: $20,000 (10 months × $2,000/month)\n\nADA: 40,000 ADA\n\nDescription: Full-time oversight by Omid Ajorlou for Design, Architecture, Project Management, milestones, and community engagement.\n\n- **Backend Developers:**\n\nCost: $20,000 (10 months × $2,000/month)\n\nADA: 40,000 ADA\n\nDescription: Sadegh Ghoroghi implements APIs, authentication, and version history.\n\n- **Frontend Developer:**\n\nCost: $16,000 (8 months × $2,000/month)\n\nADA: 32,000 ADA\n\nDescription: Mohammadreza Dehghani builds NextJS interface for Constitution Panel.\n\n- **UI/UX Designer:**\n\nCost: $6,500 (10 months × $650/month)\n\nADA: 13,000 ADA\n\nDescription: Parisa Naderi designs Figma prototypes and UI (30 hours/week).\n\n- **Server and Maintenance:**\n\n**Cardano node server: \\(preprod\\)**\n\nAWS EC2- 4 vCPU, 8 GiB RAM, 20 GiB gp3 SSD\n\nInstance: c6g.xlarge (4 vCPU, 8 GiB) 3‑yr\n\nRI (all-upfront): ~$558/yr.\n\nStorage: 20 GiB = ~$19.2/yr\n\nBandwidth: 1GB =  ~$300/mo\n\nCost = (558 + 19.2 +‌ 300) x 3 = ~$2,632\n\nADA: ~5,264\n\n**devlopment server:**\n\nAWS EC2- 4 vCPU, 8 GiB RAM, 32 GiB gp3 SSD\n\nInstance: c6g.xlarge (4 vCPU, 8 GiB) 3‑yr\n\nRI (all-upfront): ~$558/yr.\n\nStorage: 32 GiB = ~$30.72/yr\n\nBandwidth: 1GB =  ~$300/mo\n\nCost = (558 + 30.72 +‌ 300) x 3 = ~$2,666\n\nADA: ~5,332\n\n**Production server :**\n\nAWS EC2- 8 vCPU, 16 GiB RAM, 32 GiB gp3 SSD\n\nInstance: c5.2xlarge (8 vCPU, 16 GiB) 3-yr\n\nRI (all-upfront): ~$1576/yr.\n\nStorage: 32 GiB = ~$30.72/yr\n\nBandwidth: 2GB =  ~$777.6/mo\n\nCost = (1576 + 30.72 +‌ 777.6) x 3 = ~$7,153\n\nADA: ~14,306\n\n**Total Cost:** $12,451 ($7,000 for 24 months)\n\n**Total ADA:** 24,902\n\nDescription: hosting for MVP deployment and testing.\n\n# **Milestone Allocation**\n- **Milestone 1 \\(Month 1 \\- Month 2, 20%\\): 23,932 ADA‌**\n\nProduct Management: 8,000 ADA\n\nBackend Developers: 8,000 ADA\n\nUI/UX: 2,600 ADA\n\nServer Costs and devops: development server (5,332 ADA)\n\n- **Milestone 2 \\(Month 3 \\- Month 4 \\- Month 5, 50%\\): 39,900 ADA**\n\nProduct Manager: 12,000 ADA\n\nBackend Developers: 12,000 ADA\n\nFrontend Developer: 12,000 ADA\n\nUI/UX: 3,900 ADA\n\n- **Milestone 3 \\(Months 6 \\- Month7 \\- Month 8, 80%\\): 59,470 ADA**\n\nProduct Manager: 12,000 ADA\n\nBackend Developers: 12,000 ADA\n\nFrontend Developer: 12,000 ADA\n\nUI/UX: 3,900 ADA\n\nServer Maintenance and devops:  Production server (14,306 ADA) +‌ Cardano node (5,264 ADA)\n\n- **Milestone 4 \\(Month 9 \\- Month 10, 100%\\): 26,600 ADA**\n\nProduct Management: 8,000 ADA\n\nBackend Developers: 8,000 ADA\n\nFrontend Developer: 8,000 ADA\n\nUI/UX: 2,600 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"GovCranrcle is a strategic investment for the Cardano ecosystem, addressing a critical gap in the Voltaire phase: the absence of a transparent, collaborative off-chain platform for community consensus on the Cardano Constitution before on-chain voting. By delivering the Constitution Panel MVP, GovCircle enables 3,711 governance actors (990 DReps, ~2,721 SPOs, ~7 CC members) to propose, discuss, and refine constitutional amendments, facilitating ~30 off-chain opinions and supporting ~4 on-chain updates in year 1. This empowers ~228,105 delegators to make informed DRep selections, enhancing trust, participation, and decentralization in Cardano’s governance. Unlike costly global workshops (e.g., 60+ events for the Interim Constitution costing millions) or inefficient methods (e.g., YUTA’s Excel-based feedback for Version 2), GovCircle offers a scalable, user-friendly digital solution that streamlines consensus-building, reduces governance friction, and aligns with Cardano’s vision of community-led evolution. The open-source codebase and Figma prototypes for additional modules (On-chain Voting, Circle, Governance Actor Profile) ensure long-term value, enabling future development and community contributions.\n\nThe 149,902 ADA ($,0,000 at 0.5 USD = 1 ADA) budget is a cost-effective allocation, leveraging low-cost labor market to deliver high-quality blockchain expertise at rates significantly below global averages. The project’s impact—transforming constitutional governance for ~3,711 users and ~228,105 delegators—yields a high return on investment, far below typical governance platform development costs (e.g., $100,000+ for enterprise-grade solutions).\n\n**Cost Justification and Context**\n\nThe 149,902 ADA budget is meticulously allocated to ensure project success while maintaining cost efficiency. Costs are justified by aligning with or exceeding Middle East average wages for tech roles, reflecting the team’s specialized blockchain and Cardano expertise, and comparing favorably to global freelance rates. The breakdown is as follows:\n\n**Product Manager \\($20,000, 40,000 ADA, $2,000/month\\):**\n\nJustification: Omid Ajorlou’s role involves design, architecture, project management, and community engagement, requiring deep Cardano knowledge (e.g., DRep role, Intersect membership). Middle East average product manager salary is $24,000-$72,000/year (Glassdoor, 2025), or $2,000-$6,000/month. The $2,000/month rate is reasonable for a blockchain-specialized role, below US averages (~$10,000/month, Upwork). This ensures effective coordination across milestones, from Figma prototyping to MVP deployment.\n\nNeed: Critical for overseeing requirements, ensuring milestone delivery (e.g., Constitution Panel MVP), and engaging governance actors (e.g., workshops for ~100 participants).\n\n**Backend Developers \\($20,000, 40,000 ADA, $2,000/month\\):**\n\nJustification: Sadegh Ghoroghi implement APIs, authentication, and version history using Java Spring/TypeScript. Middle East average developer salary is $45,000-$70,000/year ($3,750-$5,830/month, Indeed, 2025), making $2,000/month per developer highly competitive for blockchain expertise. Global freelance rates for blockchain developers are $50-$150/hour (Upwork), or ~$8,000-$24,000/month full-time, showing significant savings.\n\nNeed: Essential for building core MVP functionalities (e.g., on-chain Constitution list, tree-based structure, amendment actions), ensuring technical reliability.\n\n**Frontend Developer \\($20,000, 40,000 ADA, $2,000/month\\):**\n\nJustification: Mohammadreza Dehghani builds the NextJS interface for the Constitution Panel. Middle East developer salaries range from $45,000-$46,909/year ($3,750-$3,909/month, Glassdoor, 2025), so 2,000/month is cost-effective for specialized NextJS skills. Global freelance rates for frontend developers are $30-$100/hour (~$4,800-$16,000/month full-time, Upwork), highlighting savings.\n\nNeed: Critical for user-facing features (e.g., version history frontend, opinion module), ensuring accessibility for ~3,730 users.\n\n**UI/UX Designer \\($6,500, 13,000 ADA, $650/month, 30 hours/week\\):**\n\nJustification: Parisa Naderi designs Figma prototypes and UI for the Constitution Panel and other modules. Middle East UI/UX designer salaries are $5,155-$9,600/year ($430-$800/month, Glassdoor, 2025), so $650/month reflects expertise for blockchain interfaces, still below global freelance rates ($25-$75/hour, ~$3,000-$9,000/month for 30 hours/week, Upwork).\n\nNeed: Vital for user-friendly design, ensuring intuitive interaction for governance actors and prototypes for future modules.\n\n**Server and Maintenance \\($12,451, 24,902 ADA for 36 months\\):**\n\nJustification: The $12,451 cost for 36 months ($346/month) is reasonable for AWS hosting a production web app for minimum ~3,730 users, running developement enviorment for 3 years.\n\nNeed: Critical for public URL hosting, supporting ~10,000 interactions and MVP functionality (e.g., amendment actions, action checker).\n\n**Value for Money:**\n\nCost Efficiency: Middle East lower cost of living allows salaries 50-80% below global averages (e.g., US product manager ~$120,000/year vs. $24,000/year for GovCircle), enabling a high-impact project at a fraction of typical blockchain development costs ($100,000-$500,000 for governance platforms, industry estimates).\n\nHigh ROI: The 149,902 ADA delivers a scalable MVP, open-source codebase, and prototypes for future modules, impacting ~3,711 users and ~228,105 delegators.\n\nAccountability: Funds are managed via a multi-signature wallet with quarterly audits by Omid Ajorlou and Sadegh Ghoroghi , ensuring transparency. Milestone reports detail progress (e.g., ~1,000 interactions in Milestone 3, ~10,000 in Milestone 4), with no sensitive data, per Catalyst rules.\n\nEcosystem Impact: GovCircle’s MVP reduces governance inefficiencies, strengthens community trust, and supports Cardano’s constitutional framework, with open-source deliverables enabling future enhancements.\n\n**Milestone Allocation:**\n\nMilestone 1 (Months 1-2, 20%, 23,932 ADA): Covers setup, hiring, and prototyping, ensuring early momentum.\n\nMilestone 2 (Months 3-5, 50% cumulative, 39,900 ADA): Funds core MVP development, critical for functionality.\n\nMilestone 3 (Months 6-8, 80% cumulative, 59,470 ADA): Supports testing, audits, and community engagement, ensuring usability.\n\nMilestone 4 (Months 9-10, 100% cumulative, 26,600 ADA): Finalizes deployment, prototypes, and closeout, maximizing impact.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Governance","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1716}