{"pr_id":"019ac2e4-98b8-7f8b-8e54-24ae03406923","title":"ADA Insight Hub: Tech - Dynamics - News","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"The Cardano ecosystem lacks a daily news aggregator, making it difficult to keep track of updates from multiple sources, resulting in missing out on important opportunities and information of the day.","solution":"Create a daily newsletter that aggregates information about the Cardano ecosystem, publishes it to Substack, and automatically emails it to subscribers Save time, easily track updates and build trust.","proposer_name":"Nguyen Thi Tuong Vy","proposer_relevant_experience":"1. Vy Nguyen Thi Tuong: Project Manager \n\nLink: [https://x\\.com/tuongvy\\_vivian](https://x.com/tuongvy_vivian)\n\nDescribe: She has 2 years of experience in building business strategies, customer care and negotiating cooperation, helping to expand the market for technology products/services. Experienced in managing digital platforms &amp; creative content for fanpages and deploying content on TikTok, Facebook; combined with multi-channel advertising campaigns, helping to increase brand awareness.\n\n1. Hoang Nguyen Duy: Content Management\n\nLink: [https://x\\.com/dhoangggg](https://x.com//dhoangggg)\n\nDescribe: He is an IT professional, has good knowledge of the blockchain field and is highly creative, which helps him do well in tasks such as coming up with ideas, producing and managing content about IT, AI, Blockchain for us. With more than 1 year of experience managing our TreViet community, he is the right person to share information about the project and support users.\n\n1. Phuong Nguyen Loan: Project Development &amp; Operations\n\nLink: [https://x\\.com/minhlaPhuongne](https://x.com/minhlaPhuongne)\n\nDescribe: With over 3 years of experience in the technology sector, I am passionate about exploring the latest innovations in blockchain and Artificial Intelligence (AI) that can be applied to everyday life, aiming to optimize work efficiency and enhance the community’s quality of life. Optimizing user experience” has always been my top priority when implementing community-focused projects. Project management &amp; development: Build plans, allocate tasks, manage timelines, control risks, and propose effective operational solutions. Business mindset &amp; operational optimization: Combine strategic business thinking with process improvements to ensure timelines, efficiency, and product quality.\n\nWith the support of more than 10 Bamboo team members with high expertise in Blockchain, DEV, video editing and content creation.","url":null,"funds":36000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"ADA Insight Hub: Tech - Dynamics - News","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Nguyen Thi Tuong Vy","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":36000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"The Cardano ecosystem lacks a daily news aggregator, making it difficult to keep track of updates from multiple sources, resulting in missing out on important opportunities and information of the day.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Create a daily newsletter that aggregates information about the Cardano ecosystem, publishes it to Substack, and automatically emails it to subscribers Save time, easily track updates and build trust.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://t.me/Cardano_ECO_VN","https://ada-bamboo.com/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"This proposal aims to provide daily aggregated news to the Cardano community for free through the Substack platform and a public archive of the entire news.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Education","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"- Target audience of this proposal: Cardano community members who need to stay updated with Cardano related news every day.\n- Approach: Through curated and summarized content distributed on Substack and email to subscribers. We will promote on Cardano community channels to attract readers.\n- Importance: Solving information fragmentation and Maintaining community trust.\n- We plan to attract more than 2k subscribers to our newsletter. This is possible as we have a community of more than 1k3 members and will expand in the future.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"- Publish 200+ daily newsletters summarizing information about the Cardano ecosystem.\n- Attract 2000+ daily newsletter subscribers through promotional activities.\n- Complete the implementation of a business plan to maintain a sustainable newsletter.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"- Completed 200+ high-quality newsletters sent to the community.\n- Minimum 2000 daily newsletter subscribers.\n- Achieved 40% email open rate (a measure of the percentage of subscribers who actually open and read an emailed newsletter, reflecting the quality of the content and appeal of the newsletter, higher than average)\n- Community response rate 4.5/5","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Tracking and aggregating information from various authoritative sources, including the Cardano Foundation, Input Output Global (IOG), Intersect, Governance, and individual dApp projects, is a major challenge for users. Information is often scattered across various blogs, news sites, and social media channels, requiring interested parties to actively search for it. This leads to several significant problems:\n\n- **Information overload:** Even with sources, users are faced with a huge amount of information, from in-depth technical reports to marketing messages. Distilling what is truly important is a major hurdle.\n- **Ineffective:** Users have to spend a lot of time and effort to collect comprehensive information, reducing productivity and the ability to promptly grasp important events.\n- **Incomplete information:** There is a risk of missing important updates from projects or specific aspects of the ecosystem due to the fragmentation of information.\n- **Barriers for Newcomers:** New users to the ecosystem feel overwhelmed and have difficulty keeping up with key developments. They easily miss important updates or access inaccurate information sources.\n- **Risk of missing out:** Developers, investors, and Stake Pool Operators (SPOs) need timely information to make decisions. Delays in updates can result in missed opportunities for partnerships, investments, or important technical upgrades.\n\nTo solve the above problem, Bamboo Media proposes to deploy “ADA Insight Hub: Tech - Dynamics - News” with project implementation steps including:\n\n- **Information Collection:** Bamboo Media uses our own specially developed AI engine to collect information from Cardano's official sources such as blogs, Twitter/X, Discord, YouTube and other platforms. The collected data may include posts, announcements, updates, videos (captions or descriptions), and other relevant content.\n- **Summary of information:** Our AI engine will pre-process the information, classify it into pre-defined topics (e.g. Technical Updates, Project News, Community Events, Market Analysis, etc.), filter out duplicate or irrelevant information that does not fit the newsletter criteria, summarize the content, reduce the information to its core points, and finally translate it into the languages of the user's choice.\n- **Proofreading and editing:** At this stage we have 2 steps, with step 1 being our AI Engine will be integrated with an automatic AI moderation and editing step. Then step 2 will have the participation of the editorial team to re-check the accuracy, correct errors and ensure the content is consistent with the criteria of the newsletter.\n- **Publishing and distribution:** We will post the newsletter to platforms that specialize in creating and posting newsletters like Substack and it will email the newsletter to its subscriber list.\n- **Feedback &amp; Improvement Loop:** Track email opens, clicks, unsubscribes; record feedback via email/Telegram; optimize content and sending time to improve the quality of newsletters.\n- **Newsletter introduction activities:** Not only will we be creating a quality newsletter, but we will have a dedicated team to pitch the project to many people in the community to convince them to subscribe to the newsletter, thereby increasing the value our offering creates.\n\n**Attract:**\n\n- **Cardano User Community:** This newsletter will be useful for anyone interested in the Cardano ecosystem, especially those who want to stay updated quickly and conveniently every day about important events and updates, saving them time compared to having to monitor many different news sources themselves.\n- **New users:** A high-quality, easy-to-understand newsletter would be a great starting point for those new to Cardano, helping them quickly grasp the core information without being overwhelmed by the current information fragmentation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"“ADA Insight Hub: Tech - Dynamics - News” will bring significant benefits to the Cardano ecosystem:\n\n- Maintaining trust in the community: Providing a centralized, trusted source of information about mainstream projects and organizations, making important information easily accessible to the community. This directly supports Cardano's goal of an informed and engaged community.\n- Increase knowledge and transparency: The newsletter helps the community quickly access authoritative information from the Cardano Foundation, IOG, Emurgo, Intersect, and major projects – organizations that play a role in the development, standardization, and commercial application of Cardano. This reduces the dependence on rumors and helps users understand technological advances.\n- Improve efficiency: Reduce time spent searching for information, helping the community focus on developing and using applications.\n- Increase awareness of the ecosystem: Introduce new projects and technological advances to the wider community.\n\n\n\n**Success Metrics:**\n\n- To assess the effectiveness and success of the project, a number of key metrics will be monitored and reported on a regular basis. These metrics include:\n- Number of newsletter subscribers: 2,000+ subscribers\n- Email Open Rate: >45% email open rate \n- Engagement: Number of likes, comments, and shares on Substack posts.\n- Community Feedback: > 4.5/5 user rating\n\n**Output:**\n\n- A summary article (400–600 words), including 3–7 featured stories summarized, translated and categorized by topic. Markdown/HTML format ready to post to Substack, forum or reshare.\n- Emails are sent daily to the entire subscriber list, including text content.\n- All results of the proposal implementation will be submitted to Project Catalyst's Milestone Module.\n- We will be introducing on social media platforms inside and outside the Cardano community so that anyone can easily and freely subscribe to receive the daily Cardano ecosystem newsletter.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Bamboo Media has the right elements to meet the requirements of this proposal. with the following capabilities:\n\n- **Cardano Community Building:** Establish and manage a community dedicated to researching the Cardano ecosystem with over 1k3 members. ([https://t\\.me/Cardano\\_ECO\\_VN\\)](https://t.me/Cardano_ECO_VN))\n- **Events and community activities:** We are active and actively participate in Cardano events in Vietnam with many roles such as organizer, speaker, media support, guest.\n\n![](https://psychescore.ada-bamboo.com/cms/wp-content/uploads/2025/11/psychescore_img_2-e1764133900709.webp)\n\n```\n                            Cooperate with Cardano Vietnam to organize an event to share about Cardano\n```\n- **Ambassador of major projects:** Our reputation is guaranteed by being ambassadors for projects on Cardano such as Emurgo, World Mobile Chain.\n- **Experience with Catalyst:** Our members have years of experience in most Catalyst roles and have completed 2 proposals at fund 11 and fund 13 specializing in on-chain data collection and AI applications to create chatbots to support Cardano governance training.\n- **Experience related to the proposal:** We have built a group of platforms dedicated to sharing information on the Cardano ecosystem for over 4 years of operation, we have shared thousands of posts about major events in the Cardano ecosystem. Hundreds of projects have been introduced, and dozens of major events have been shared with the community.\n    - Developing a chat bot to aggregate information about the Cardano ecosystem: [http://t\\.me/BBO\\_NotificationBot](http://t.me/BBO_NotificationBot)\n    - Channel specializing in sharing short information on Telegram:[https://t\\.me/duantrencardano](https://t.me/duantrencardano)\n    - The newsletter's website specializes in creating in-depth analysis articles:[https://ada\\-bamboo\\.com/](https://ada-bamboo.com/)\n    - Facebook channel to expand viewership:[https://www\\.facebook\\.com/profile\\.php?id=61555200494235](https://www.facebook.com/profile.php?id=61555200494235)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Newsletter Launch & Quality Control","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will be launching a newsletter that is open to early adopters. The main goal of this phase is to collect detailed and structured feedback from early adopters. This feedback will serve as the basis for making iterative improvements to improve the quality of content, optimize the interface, and provide the best user experience. This process ensures that the official newsletter meets the needs and expectations of the community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Consistent publishing: The newsletter should be released regularly, ensuring continuity throughout the testing phase.\n- High-quality feedback: Collect structured feedback from at least 100 beta testers.\n- Data-driven improvements: Make at least 10 major improvements to the newsletter, based on the analytics and feedback collected. These improvements could include changes to improve content quality, content format, or improve interactivity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- A minimum of 30 beta newsletters are published and sent daily to the testing team.\n- Detailed reports on beta tester feedback, including suggestions for improvements to content, format, and readability.\n- Finalize system refinement plans based on beta feedback.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":6000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Public Launch & Initial Community Growth","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will officially launch the Cardano Daily Newsletter to the public. This phase is focused on driving strong subscriber growth and increasing reader engagement. To achieve this goal, we will deploy multi-channel marketing and outreach campaigns, including:\n\n- Content Marketing: Publish high-quality articles, infographics, and videos to attract new users and retain existing readers.\n- Optimize newsletter based on public feedback.\n- Social Media Marketing: Actively promote the newsletter on major social media platforms such as X, Discord, and Telegram to reach a broader community.\n- Strategic Partnerships: Collaborate with projects, influencers, and partners in the Cardano ecosystem to expand reach.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The newsletter was successfully launched to the public and maintains a daily publication schedule with a minimum of 120 public newsletters published.\n- Proof of newsletter optimization from community feedback.\n- Achieve a goal of at least 1500 subscribers.\n- Achieve at least 2 partnerships with blockchain communities.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to archive of 120 public newsletters published and sent daily.\n- Link to newsletter optimization report from community feedback.\n- Link to initial subscriber growth data and engagement metrics.\n- Provide proof of collaboration with blockchain communities","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":24000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Sustainable Growth & Final Report","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Continue to optimize newsletters based on public feedback.\n- Execute marketing and outreach campaigns to drive subscriber growth and increase engagement.\n- Develop a long-term sustainability plan to ensure the project is self-sustaining after Catalyst funding ends.\n- Complete comprehensive evaluation of project results and final report.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Minimum 30 public newsletters are published and sent daily with continuous improvements.\n- Achieve a goal of at least 2000 free subscribers.\n- The sustainability plan is clearly presented with actionable steps.\n- Complete the final results report.\n- Complete the final report video.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to archive of 30 public newsletters published and sent daily.\n- Link to initial subscriber growth data and engagement metrics.\n- Detailed long-term sustainability plan, outlining potential revenue streams and operating strategy.\n- Link to the end of the report report.\n- Link to the end of the video report.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":6000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"1. Vy Nguyen Thi Tuong: Project Manager \n\nLink: [https://x\\.com/tuongvy\\_vivian](https://x.com/tuongvy_vivian)\n\nDescribe: She has 2 years of experience in building business strategies, customer care and negotiating cooperation, helping to expand the market for technology products/services. Experienced in managing digital platforms &amp; creative content for fanpages and deploying content on TikTok, Facebook; combined with multi-channel advertising campaigns, helping to increase brand awareness.\n\n1. Hoang Nguyen Duy: Content Management\n\nLink: [https://x\\.com/dhoangggg](https://x.com//dhoangggg)\n\nDescribe: He is an IT professional, has good knowledge of the blockchain field and is highly creative, which helps him do well in tasks such as coming up with ideas, producing and managing content about IT, AI, Blockchain for us. With more than 1 year of experience managing our TreViet community, he is the right person to share information about the project and support users.\n\n1. Phuong Nguyen Loan: Project Development &amp; Operations\n\nLink: [https://x\\.com/minhlaPhuongne](https://x.com/minhlaPhuongne)\n\nDescribe: With over 3 years of experience in the technology sector, I am passionate about exploring the latest innovations in blockchain and Artificial Intelligence (AI) that can be applied to everyday life, aiming to optimize work efficiency and enhance the community’s quality of life. Optimizing user experience” has always been my top priority when implementing community-focused projects. Project management &amp; development: Build plans, allocate tasks, manage timelines, control risks, and propose effective operational solutions. Business mindset &amp; operational optimization: Combine strategic business thinking with process improvements to ensure timelines, efficiency, and product quality.\n\nWith the support of more than 10 Bamboo team members with high expertise in Blockchain, DEV, video editing and content creation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The budget is divided into two main parts: personnel costs for each milestone and other costs. Rate 0.4$/ADA.\n\nMilestone 1: 1 months\n\n**Personnel costs:** 200h/month x 25ADA/h = 5000 ADA\n\nDescribe: Project Manager, content creator, Project Development &amp; Operations, Marketer estimated 200 working hours/month.\n\n**Other costs:** 1000 ADA/month\n\nInclude:\n\n- Software Registration: such as LLM API, hosting server, design tools, account registration.\n- Marketing &amp; Community Outreach through Community Engagement Initiatives &amp; Promotional Materials.\n- Provision for ADA price decline and unforeseen expenses.\n\nMilestone 2: 4 months\n\n**Personnel costs:** 200h/month x 4 x 25ADA/h = 20000 ADA\n\nDescribe: Project Manager, content creator, Project Development &amp; Operations, Marketer estimated 200 working hours/month\n\n**Other costs:** 1000 ADA/month x 4 = 4000 ADA\n\nInclude:\n\n- Software Registration: such as LLM API, hosting server, design tools, account registration.\n- Marketing &amp; Community Outreach through Community Engagement Initiatives &amp; Promotional Materials.\n- Provision for ADA price decline and unforeseen expenses.\n\nMilestone 3: 1 months\n\n**Personnel costs:** 200h/month x 25ADA/h = 5000 ADA\n\nDescribe: Project Manager, content creator, Project Development &amp; Operations, Marketer estimated 200 working hours/month.\n\n**Other costs:** 1000 ADA/month\n\nInclude:\n\n- Software Registration: such as LLM API, hosting server, design tools, account registration.\n- Marketing &amp; Community Outreach through Community Engagement Initiatives &amp; Promotional Materials.\n- Provision for ADA price decline and unforeseen expenses.\n\n**Total budget: 36000 ADA**","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The majority of the budget is used to pay salaries for staff, specifically project managers, content creator, project development & operations, marketer and other roles, with salaries 25 ADA /hour, equivalent $10/ hour (The exchange rate calculated at the time of proposal submission is 0.4 USD/ADA and salaries include tax payments in Vietnam).\n\n\n\nTo build a trusted information channel for the community, we propose a budget of 14.400$ for over 180 newsletters. This budget is equivalent to 80$ per newsletter. This budget will cover the entire complex and meticulous process, from content aggregation, compilation, editing to strong publishing and promotion. With each newsletter produced, we are directly providing accurate, in-depth and timely updates about Cardano, reaching thousands of users every day.\n\n\n\nSponsoring us will help save costs:\n\n- Search and recruit personnel with experience and knowledge of blockchain\n- It doesn't take much time to learn and research.\n- Office rental and equipment purchase costs","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Education","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1720}