{"pr_id":"019ac38f-705c-7d6a-a964-8a0f00010038","title":"Cardano Education Hub & University Tour Mongolia","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Mongolian students are entering crypto without proper education, leading to misinformation, financial risks, and very low awareness of Cardano’s technology and on-chain opportunities.","solution":"We will deliver Cardano lectures, workshops, and open-source learning materials across universities to help students gain blockchain skills and confidently start using Cardano on-chain.","proposer_name":"Hiisver","proposer_relevant_experience":"Project Lead – Temulun Khongorzul (aka Hiisver)\n\n\n\nTemulun is an experienced creative director and educator with more than eight years in the media and digital production industry. She has led large-scale visual communication projects, produced educational content, and delivered lectures at multiple institutions. She has extensive experience in Web3, blockchain communities, and youth engagement through her work in the NFT and Cardano ecosystems. Temulun previously organized university events, produced high-quality multimedia educational materials, and coordinated cross-team operations, ensuring reliable delivery of complex programs. She also owns the office space used as the Cardano Hub, guaranteeing logistical stability throughout the project.\n\n\n\n\n\n**Lecture & Education Specialists**\n\n\n\nA team of blockchain educators and curriculum developers will deliver university lectures and workshops. They bring experience in simplifying technical concepts for non-technical audiences, running hands-on demonstrations, and teaching blockchain fundamentals. Their past work includes university training programs, finance education, and public seminars on emerging technologies.\n\n\n\n\n\n**Media & Production Team \\(VISM Studio\\)**\n\n\n\nThe media team has over eight years of professional experience in video production, animation, design, and post-production. They will film and edit lecture content, create educational videos, and prepare open-source learning materials. Their portfolio includes documentaries, explainer videos, and event coverage for major organizations in Mongolia. This ensures all deliverables meet a polished, professional standard.\n\n\n\n\n\n**Logistics & Coordination Team**\n\n\n\nResponsible for scheduling university sessions, managing student registration, handling communication with university departments, and ensuring smooth execution during the lecture tour. The team has experience coordinating multi-campus educational programs and youth-focused events.\n\n\n\n\n\n**Marketing & Communications Team**\n\n\n\nHandles social media campaigns, public announcements, creative posters, and short-form content designed to reach students effectively. With strong knowledge of digital marketing and student engagement strategies, the team ensures high turnout and visibility across 10 universities.","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Cardano Education Hub & University Tour Mongolia","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Hiisver","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Mongolian students are entering crypto without proper education, leading to misinformation, financial risks, and very low awareness of Cardano’s technology and on-chain opportunities.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will deliver Cardano lectures, workshops, and open-source learning materials across universities to help students gain blockchain skills and confidently start using Cardano on-chain.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":{"links":[]},"sub_fields":null},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies. All activities, content creation, and university sessions can be delivered independently by our team.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All educational materials, lecture slides, videos, guides, and visual content produced by this project will be released as open-source. We will publish everything on GitHub and a public website under a Creative Commons CC BY 4.0 license, allowing anyone to use, adapt, and redistribute the content with attribution. No restrictions or proprietary limitations will be applied.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Community Outreach","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Our project targets Mongolian university students aged 18–25 one of the fastest-growing groups entering cryptocurrency without proper knowledge or guidance. This demographic is digitally active, highly curious about emerging technologies, and represents the next generation of builders, entrepreneurs, and innovators. However, due to the lack of structured blockchain education in Mongolia, most rely on unverified online sources, which leads to misinformation, financial risk, and very limited exposure to Cardano.\n\n\n\nWe will reach students through on-site university lectures, coordinated in partnership with 10 major institutions across Ulaanbaatar and regional centers. Each session includes a beginner-friendly introduction to blockchain, hands-on demonstrations, open Q&A, and guidance on safe wallet usage and on-chain participation. Our outreach strategy also includes social media campaigns, posters, student clubs, and collaboration with university departments to ensure maximum attendance.\n\n\n\nThis initiative matters to Cardano because Mongolia currently has almost no ecosystem presence, despite having a young population that is eager to adopt Web3 technologies. By bringing verified, open-source Cardano education directly to students, we establish foundational knowledge, introduce Cardano as a trustworthy platform, and prepare thousands of new users to take real on-chain actions such as creating wallets, staking ADA, minting NFTs, and joining community projects. Building this early-stage awareness and literacy is essential for Cardano’s long-term global reach and adoption.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"The project consists of several coordinated activities designed to educate, engage, and onboard Mongolian students into the Cardano ecosystem. Key activities include:\n\n\n\n- University Outreach Program – Conduct 10 in-person lectures across major universities, covering blockchain fundamentals, responsible crypto usage, and Cardano’s unique capabilities.\n- Workshops & Demonstrations – Provide practical sessions where students learn how to create wallets, explore Cardano tools, and understand basic on-chain actions.\n- Guest Speaker Sessions – Invite international and local experts to inspire students and share real-world perspectives on blockchain innovation.\n- Cardano Education Hub – Establish a temporary hub for content production, rehearsals, small-group tutorials, and incubator-style mentorship activities.\n- Open-Source Content Creation – Produce high-quality videos, lecture slides, guides, and short-form content, all released under open-source licenses.\n- Marketing & Awareness Campaigns – Promote the program through social media, posters, university channels, and student clubs to maximize reach.\n- Monitoring & Reporting – Track student attendance, engagement, and onboarding metrics, and publish a final impact report.\n- \n\nThese activities collectively establish Cardano as a credible and accessible technology for Mongolian youth.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"Success will be measured using both output metrics (what we deliver) and adoption-focused metrics (what impact it creates). Key success metrics include:\n\n\n\nOutput Metrics:\n\n\n\n- 10 university lectures completed\n- 5,000+ students reached\n- 10+ guest and expert sessions delivered\n- 20 educational videos and guides produced\n- 1 public GitHub repository published with all materials\n- 1 Cardano Education Hub operating for 6 months\n\n\n\nAdoption-Focused Metrics:\n\n\n\n- 500 new Cardano wallets created through guided sessions\n- 300 students completing a staking walkthrough\n- 200 students minting their first NFT on Cardano\n- 50 students joining Cardano communities, forums, or social groups\n- 10+ students expressing interest in ongoing incubator/learning tracks\n\n\n\nLong-Term Impact:\n\n\n\n- Establishing a reusable, open-source education library\n- Creating a sustainable pipeline of university-level Cardano learners\n- Building the foundation for future Cardano meetups, clubs, and research initiatives in Mongolia\n\n\n\nThese metrics ensure that the project delivers measurable educational value while actively moving students toward real on-chain engagement.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Our solution is to build a nationwide Cardano education and onboarding pipeline through a coordinated university lecture tour and the establishment of a Cardano Education Hub in Mongolia. The initiative directly addresses the lack of structured blockchain learning by providing students with verified information, practical training, and clear pathways for safe and meaningful engagement with Cardano.\n\n\n\nThe project begins with partnerships across 10 major universities, enabling us to deliver expert-led lectures on blockchain fundamentals, responsible cryptocurrency usage, and the unique features that distinguish Cardano from other ecosystems. Each session includes real demonstrations creating wallets, exploring dApps, understanding staking, and navigating Cardano tools so students are not only informed but also guided toward real on-chain actions.\n\n\n\nTo ensure long-term value, the project includes a dedicated Cardano Education Hub that operates as a creative and learning center for six months. The hub serves multiple purposes: preparing high-quality educational materials, producing open-source videos and guides, hosting small-group tutorials, and offering incubator-style mentorship for students who wish to pursue deeper involvement in Web3. This hub creates continuity beyond the lecture tour and becomes a foundation for future Cardano community development in Mongolia.\n\n\n\nAll educational outputs slides, lecture content, videos, worksheets, explainers, and workshop materials will be published openly under a CC BY 4.0 license. This ensures that universities, educators, and community groups can reuse and adapt the material without restrictions.\n\n\n\nOur solution directly addresses the identified problem by replacing misinformation with verified learning, providing a structured entry point into blockchain, and introducing Cardano as a credible, safe, and innovative platform for youth. By meeting students where they are inside their universities and giving them both knowledge and actionable steps, we establish the first large-scale Cardano adoption bridge in Mongolia.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project will create the first large-scale Cardano-focused education and onboarding initiative in Mongolia, directly expanding the ecosystem’s global reach. By delivering structured blockchain learning across 10 universities and making all content open-source, we introduce Cardano to thousands of young people who currently have no reliable access to Web3 education.\n\n\n\nThe impact extends beyond awareness. Through guided wallet creation, staking demonstrations, and hands-on sessions, students gain the confidence and practical skills required to take real on-chain actions. This builds a new pipeline of informed Cardano users, future builders, content creators, and potential entrepreneurs.\n\n\n\nThe open-source library of Mongolian-language videos, guides, and lecture materials will continue to benefit the region long after the project ends, enabling educators, clubs, and community groups to reuse and scale the knowledge. The Cardano Education Hub also provides a foundation for future meetups, innovation programs, and collaborations, helping establish a sustainable local presence for Cardano.\n\n\n\nBy empowering students with accurate information and actionable pathways, this project strengthens Cardano’s credibility, accessibility, and long-term adoption in a completely new geographic region.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our team combines strong educational, media production, event coordination, and blockchain knowledge, making us well-equipped to deliver a high-quality national outreach program. We have previous experience organizing university lectures, producing educational content, and managing logistics for large student audiences. Our media team has over eight years of experience producing professional videos, presentations, and marketing materials, ensuring all deliverables meet a high standard.\n\n\n\nA key element supporting feasibility is the dedicated Cardano Education Hub, located in Twin Tower 2, A Block, Ulaanbaatar. The project lead owns the office space, giving us full control over scheduling, equipment setup, content production, workshop hosting, and team operations. This eliminates rental risks, dependency on external venues, or potential delays, significantly increasing reliability and accountability.\n\n\n\nFeasibility will be validated through a clear project plan with measurable milestones: university confirmations, content preparation, lecture delivery, video production, and open-source publication. Attendance numbers, engagement metrics, and on-chain onboarding results will be tracked and reported publicly.\n\n\n\nWith a stable hub, experienced team, strong university partnerships, and a realistic six-month timeline, the project is fully capable of being delivered successfully and transparently.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Setup, University Agreements & Curriculum Finalization","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone produces all foundational components required to launch the national education program. Outputs include signed confirmations from participating universities, establishing formal agreements for delivering on-site Cardano lectures and workshops. A complete lecture curriculum will be finalized, including structured lesson plans, presentation slides, workshop activities, hands-on demo scripts, and speaker notes. The full schedule for the 10-university tour including dates, time blocks, and guest speaker availability will be prepared and confirmed.\n\n\n\nIn addition, the Cardano Education Hub located in Twin Tower 2 (A Block) will be fully set up as the central workspace for content creation, rehearsal, team coordination, and material storage. This milestone also outputs finalized logistics plans, team role documentation, communication templates, and internal tracking systems to ensure smooth execution of the next phases.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"For this milestone to be accepted, the project must demonstrate that the foundational structure for the entire program has been fully prepared and validated. At least six universities must provide written confirmation or email approval agreeing to host on-site lectures. The complete lecture curriculum—including slides, scripts, workshop activities, and demonstration flow—must be finalized and ready for delivery. The speaker lineup and scheduling plan for the entire 6-month program must be confirmed, including guest speakers.\n\n\n\nAdditionally, the Cardano Education Hub located in Twin Tower 2 (A Block) must be fully operational, equipped for content production, rehearsal, and coordination. All planning documents should reflect a clear timeline, logistics plan, risk assessment, and team role assignments. Completion of this milestone requires that the project is fully ready to begin outreach and execution without outstanding dependencies or uncertainties.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence for this milestone will include:\n\n\n\n- Signed confirmation letters or emails from at least six participating universities\n- Full lecture curriculum package (slides, outlines, scripts)\n- Completed workshop design documents\n- Final speaker list and event schedule\n- Photos or short video of the Cardano Hub (Twin Tower 2) prepared for operations\n- Internal planning files, timelines, and team assignment documents\n- All materials uploaded to GitHub or shared publicly for verification\n\n\n\nThis evidence demonstrates that the project infrastructure, partnerships, and content are fully ready for execution.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":8000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Marketing, Awareness & Student Registration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers all outreach and student-engagement activities needed to prepare for the national lecture tour. Outputs include a full digital marketing campaign across Facebook, Instagram, TikTok, and university social pages; professionally designed posters, announcement videos, and short-form promotional content. A functional student registration system will be launched, including signup forms, attendance-tracking sheets, and internal monitoring dashboards.\n\n\n\nThe team will also coordinate with university departments, student councils, and campus clubs to strengthen reach and ensure high turnout. Communications templates, schedules, and distribution plans will be finalized. This milestone ensures that the education tour is visible, accessible, and well-organized before lectures begin.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"For this milestone to be accepted, the marketing campaign must be live across all selected channels and reach a minimum of 2,000 students online. Posters and digital materials should be shared within all participating universities through their official communication channels. The registration system must be fully functional, collecting student information without errors and enabling attendance tracking for later milestones.\n\n\n\nPartnerships with at least five university departments or student organizations must be confirmed to assist with promotion. All outreach materials must match the approved curriculum and branding guidelines.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Screenshots of social media posts, ads, and analytics showing campaign reach\n- Copies of posters, digital graphics, and announcement videos\n- Active registration link + exported registration list\n- Emails or messages confirming university promotion\n- Documentation uploaded to GitHub or cloud folder (promo materials + campaign report)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":6000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"University Lecture Tour (10 Lectures)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers the core activity of the project: the national university lecture tour. Outputs include the successful delivery of 10 in-person Cardano education sessions across participating universities. Each lecture will cover blockchain fundamentals, responsible crypto use, and Cardano’s core features. Workshops and hands-on demonstrations will guide students through wallet creation, exploring tools, and understanding on-chain actions.\n\n\n\nGuest speaker sessions will be conducted to inspire students with real-world use cases. Attendance sheets, engagement data, and feedback forms will be collected at every event. Photo and video recordings will document the tour. All lecture slides, activity materials, and updated content will be prepared for later open-source release.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The milestone will be accepted once all 10 university lectures have been delivered in person, with documented attendance and engagement. A minimum of 5,000 students must be reached across all events. At least 300 students must successfully complete assisted wallet creation or participation in hands-on activities. Guest speakers must participate in the scheduled sessions, and all presentation materials must match the finalized curriculum.\n\n\n\nEach university must have attendance sheets, photos, videos, and feedback summaries to validate the event. All data must be collected and prepared for reporting.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Attendance sheets from all 10 universities\n- Photos and videos of each lecture/workshop\n- Copies of slides and teaching materials used\n- Feedback or reflection forms from students\n- Short report summarizing participation, questions, and outcomes\n- All files uploaded to GitHub / shared drive","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":22000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Content Production & Open-Source Publishing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone focuses on producing high-quality, reusable educational content based on the lecture tour. Outputs include recording, editing, and publishing at least 20 educational videos—covering lectures, explainers, recaps, and practical tutorials. All materials will be translated or subtitled in Mongolian.\n\n\n\nAn open-source resource package will be created including lecture slides, guides, worksheets, graphics, and templates. A public GitHub repository will be launched with organized folders, documentation, licensing (CC BY 4.0), and downloadable materials. A simple public-facing webpage or hub will showcase all content for student and educator access.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"At least 20 videos must be fully edited and publicly uploaded. All educational materials must be translated or subtitled for accessibility. The GitHub repository must be fully structured, containing all slides, guides, and workshop materials, and licensed correctly under CC BY 4.0.\n\n\n\nThe open-source package must be downloadable and easy for educators or students to reuse. Public announcements must be made to inform students and universities of the newly published content.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public GitHub repository link\n- Links to all videos uploaded to YouTube or equivalent\n- Screenshot of webpage/hub with all materials\n- Release notes summarizing files and licenses\n- Copies of resource pack (slides, handouts, guides)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":14000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Impact Report & Program Closure","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers the final evaluation and project completion package. Outputs include a detailed Impact Report summarizing attendance, engagement, learning outcomes, adoption rates, and student feedback. A financial transparency report will outline the use of funds.\n\n\n\nA dashboard or summary of on-chain onboarding data will be prepared, including wallet creation numbers, staking participation, and NFT minting results where applicable. A public announcement will share insights, results, and future recommendations. The final roadmap for continuing Cardano activities in Mongolia will also be documented.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The milestone will be considered complete when a full narrative impact report (PDF) is published, containing metrics from all universities and aggregated data from all activities. On-chain metrics such as number of wallets created, staking attempts, and practical engagement must be included.\n\n\n\nFinancial documentation must align with Catalyst requirements. The final roadmap must propose next steps for sustainability and future community growth. All reports must be publicly accessible.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Final Impact Report (PDF)\n- KPI Dashboard screenshots\n- Financial report summary\n- Public announcement or post\n- Roadmap document for future Cardano activities\n- Uploaded outputs to GitHub","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Project Lead – Temulun Khongorzul (aka Hiisver)\n\n\n\nTemulun is an experienced creative director and educator with more than eight years in the media and digital production industry. She has led large-scale visual communication projects, produced educational content, and delivered lectures at multiple institutions. She has extensive experience in Web3, blockchain communities, and youth engagement through her work in the NFT and Cardano ecosystems. Temulun previously organized university events, produced high-quality multimedia educational materials, and coordinated cross-team operations, ensuring reliable delivery of complex programs. She also owns the office space used as the Cardano Hub, guaranteeing logistical stability throughout the project.\n\n\n\n\n\n**Lecture & Education Specialists**\n\n\n\nA team of blockchain educators and curriculum developers will deliver university lectures and workshops. They bring experience in simplifying technical concepts for non-technical audiences, running hands-on demonstrations, and teaching blockchain fundamentals. Their past work includes university training programs, finance education, and public seminars on emerging technologies.\n\n\n\n\n\n**Media & Production Team \\(VISM Studio\\)**\n\n\n\nThe media team has over eight years of professional experience in video production, animation, design, and post-production. They will film and edit lecture content, create educational videos, and prepare open-source learning materials. Their portfolio includes documentaries, explainer videos, and event coverage for major organizations in Mongolia. This ensures all deliverables meet a polished, professional standard.\n\n\n\n\n\n**Logistics & Coordination Team**\n\n\n\nResponsible for scheduling university sessions, managing student registration, handling communication with university departments, and ensuring smooth execution during the lecture tour. The team has experience coordinating multi-campus educational programs and youth-focused events.\n\n\n\n\n\n**Marketing & Communications Team**\n\n\n\nHandles social media campaigns, public announcements, creative posters, and short-form content designed to reach students effectively. With strong knowledge of digital marketing and student engagement strategies, the team ensures high turnout and visibility across 10 universities.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**1\\. Human Resources — 17,000 ADA**\n\n\n\n- Lead Lecturer (10 sessions × rate) – 8,000 ADA\n- Guest Speakers (local/international, 4 sessions) – 4,000 ADA\n- Education Content Writers & Workshop Designers – 3,000 ADA\n- Project Assistants (coordination & onsite support) – 2,000 ADA\n\n\n\nSubtotal: 17,000 ADA\n\n\n\n**2\\. Program Implementation — 9,000 ADA**\n\n\n\n- Lecture Materials (slides, guides, workshop handouts) – 2,000 ADA\n- Design & Printing (posters, brochures, classroom materials) – 1,500 ADA\n- Student Kits (QR guides, info cards; no merch incentives) – 1,500 ADA\n- Curriculum documentation & script preparation – 4,000 ADA\n\n\n\nSubtotal: 9,000 ADA\n\n\n\n**3\\. Logistics & Operations — 11,000 ADA**\n\n\n\n- Inter-university transportation & travel – 4,000 ADA\n- Technical equipment rental (lights, cameras, audio when needed) – 3,000 ADA\n- Refreshments, crew operations, movement logistics – 2,000 ADA\n- Hub operations & utilities (Twin Tower 2 office owned → rent = 0) – 2,000 ADA\n- \n\nSubtotal: 11,000 ADA\n\n\n\n**4\\. Media Production — 14,000 ADA**\n\n\n\n- Video filming at all universities – 4,000 ADA\n- Video editing (20 educational videos) – 6,000 ADA\n- Photography & documentation – 2,000 ADA\n- Graphics, subtitles, animation for explainers – 2,000 ADA\n\n\n\nSubtotal: 14,000 ADA\n\n\n\n**5\\. Marketing & Communications — 5,000 ADA**\n\n\n\n- Social media campaigns (FB, IG, TikTok) – 2,000 ADA\n- Local promotion via university channels – 1,500 ADA\n- Poster design & distribution – 1,000 ADA\n- PR announcements & content scheduling – 500 ADA\n- \n\nSubtotal: 5,000 ADA\n\n\n\n**6\\. Administration & Reporting — 3,000 ADA**\n\n\n\n- Financial reporting & accounting – 1,500 ADA\n- Project documentation, compliance & audit prep – 1,000 ADA\n- Miscellaneous admin & supplies – 500 ADA\n- \n\nSubtotal: 3,000 ADA\n\n\n\n7. Contingency (5%) — 2,000 ADA\n\n\n\nUsed only for approved unexpected costs during the 6-month program.\n\n\n\nSubtotal: 2,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project provides strong value for money because it delivers nationwide educational impact, creates long-term reusable open-source materials, and establishes a sustainable Cardano presence in a country where the ecosystem is almost nonexistent today. With a budget of 60,000 ADA, the project reaches more than 5,000 university students directly resulting in a cost of roughly 12 ADA per student, which is significantly lower than traditional training or educational program costs.\n\n\n\nThe project does not require venue rental because the Cardano Education Hub is hosted in an office owned by the project lead. This eliminates a major expense category and allows more of the budget to be spent on meaningful activities such as lectures, content production, and student onboarding. The team also covers equipment, staffing efficiencies, and content development with minimal overhead, making the overall delivery highly cost-efficient.\n\n\n\nAll produced materials slides, videos, guides, workshop documents—are released as open source under CC BY 4.0, ensuring that the impact extends far beyond the initial 6-month program. Universities, teachers, clubs, and community builders can continue using and adapting the materials at zero cost.\n\n\n\nMost importantly, a significant portion of the budget directly supports hands-on user onboarding. Wallet creation sessions, staking explanations, and practical demonstrations ensure that funds translate into real adoption outcomes rather than passive awareness. By focusing on measurable, action-oriented impact, the project maximizes the return on each ADA spent and creates a scalable foundation for Cardano’s long-term growth in Mongolia and the broader region.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Community Outreach","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1722}