{"pr_id":"019ac34a-aebc-7694-8bc4-8b8819a1ec77","title":"Eko Chain; A Proof of Impact Protocol for Circular Economies","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"The $4.5T circular economy is crippled by trust gaps. Informal collectors are invisible/underpaid, brands face greenwashing risks, and manual verification doesn't scale. 90% of waste value is lost. ","solution":"A mobile protocol combining Edge AI for automated waste grading, CIP-68 Evolving NFTs for traceability, and Tokenized Plastic Credits to double collector income.","proposer_name":"Alfred Itodole","proposer_relevant_experience":"Core &amp; Technical Contributors\n\nProject Coordinator — Alfred Onuh Itodole\n\nHead of Business &amp; Partnership, Enactus ABU; Core Contributor, SingularityNET; Google Developer Group leader. Alfred coordinates project strategy, partnerships, stakeholder engagement, and pilot mobilisation. He will serve as the primary contact for Catalyst and manage milestones, community partnerships, and reporting.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/sirxalfred/](https://www.linkedin.com/in/sirxalfred/)\n\nAI/ML Project Lead — Kamal Aliyu\n\nLead AI/ML Engineer and system architect for the verification layer. Kamal will design and deliver the edge AI stack (model architecture, on-device inference workflows, OCR/liveness checks) and oversee ML integration, fraud detection, and performance optimisation.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/alkamal/](https://www.linkedin.com/in/alkamal/)\n\n· GitHub: [https://github\\.com/Alkamal01](https://github.com/Alkamal01)\n\nAI / Data Engineer — Stanley Nnamani\n\nStanley will lead dataset curation, model training pipelines, evaluation and productionisation of TensorFlow/TFLite models. He is responsible for data labelling, model QC, and the data feed to the public impact dashboard.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/stanley\\-nnamani/](https://www.linkedin.com/in/stanley-nnamani/)\n\n· GitHub: [https://github\\.com/StarMindz](https://github.com/StarMindz)\n\nBlockchain Architect &amp; Lead Developer — Mubarak Abdullateef\n\nResponsible for on-chain architecture, Plutus/Aiken smart contract development, CIP-68 implementation, policy management, and testnet/mainnet deployments. Mubarak will own security best practices, contract unit tests, and integration with the marketplace logic.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/mubarak\\-abdullateef/](https://www.linkedin.com/in/mubarak-abdullateef/)\n\nFrontend Lead / PWA Engineer — Bata Zoaka Bukar\n\nBuilds the collector PWA, verifier dashboard, wallet integrations (CIP-30), offline queue, and UX for low-literacy users. Bata ensures on-device inference integration and the optimistic UI/IndexedDB sync flows.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/bata\\-zoaka/](https://www.linkedin.com/in/bata-zoaka/)\n\nFull-Stack &amp; ML Integration Engineer — Muhammed Yuguda\n\nSupports backend indexer, API gateway, TFLite integration into the PWA, and dev-ops for CI/CD. Muhammed will implement the mock/microservice endpoints for prototype and assist with production indexer for mainnet pilot.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/yuguda/](https://www.linkedin.com/in/yuguda/)\n\n· GitHub: [https://github\\.com/Yuguda999](https://github.com/Yuguda999)\n\nCommunity &amp; Onboarding Manager — Alayande Daniel\n\nLeads pilot recruitment, verifier training, field logistics, and community engagement via the Enactus ABU network. Daniel will manage training curricula, pilot operations and community reporting.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/alayande\\-daniel\\-6a044417a/](https://www.linkedin.com/in/alayande-daniel-6a044417a/)\n\nAdvisors\n\nMr. Yusuf Bashir — CEO, KAD ICT HUB — strategic partner for tech acceleration, local incubation and stakeholder introductions. (X/Twitter: [https://x\\.com/YusufBashir](https://x.com/YusufBashir)\n\n)\n\nDr. Umar Sani Bebeji — Legal Advisor — regulatory compliance, local pilot legal frameworks and privacy guidance. (LinkedIn: [https://www\\.linkedin\\.com/in/umar\\-sani\\-bebeji\\-ph\\-d\\-4b963363/](https://www.linkedin.com/in/umar-sani-bebeji-ph-d-4b963363/)\n\n)\n\nStrategic Partner & Regenerative Accelerator — Project Genius Hub Project Genius Hub serves as the formal Regenerative Talent Accelerator and Knowledge Hub for this project. It provides the core Prisma/WADA regenerative development framework, the structured documentation pipeline, and the pre-vetted talent pool (leveraged for contingency planning). The Hub ensures the project remains deeply Place-Sourced (Zaria context) and maintains verifiable, transparent progress tracking. Website: [https://www\\.projectgenius\\.com\\.ng/](https://www.projectgenius.com.ng/) Documentation: [https://genius\\-alpha\\-seven\\.vercel\\.app/](https://genius-alpha-seven.vercel.app/)\n\n\n\nNetwork, Contingency &amp; Hiring Plan\n\nEnactus Network as talent pipeline: If any role becomes unavailable, we will recruit vetted graduates and students from Enactus ABU and the Unified Cardano Student Club Nigeria for rapid onboarding. We also maintain active contact lists at , PRISMA, WADA and Gimbalabs for urgent contractor sourcing.\n\nOutsourcing approach: Contracted roles (e.g., smart contract auditor, ZK/Privacy researcher) will be engaged through 30–60 day SOWs with LOIs provided to Catalyst as verifiable evidence.\n\nEvidence strategy: For each technical lead we will attach GitHub links (commits, repos), LinkedIn profiles, and where applicable an LOI confirming time allocation. We will include sample commits and initial testnet txs as deliverables to satisfy verifiability checks.","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Eko Chain; A Proof of Impact Protocol for Circular Economies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Alfred Itodole","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"The $4.5T circular economy is crippled by trust gaps. Informal collectors are invisible/underpaid, brands face greenwashing risks, and manual verification doesn't scale. 90% of waste value is lost. ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A mobile protocol combining Edge AI for automated waste grading, CIP-68 Evolving NFTs for traceability, and Tokenized Plastic Credits to double collector income.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://enactus-website-blue.vercel.app/","https://www.youtube.com/@enactus_abuzaria","https://ekochain.lovable.app/","https://docs.google.com/document/d/1jHW-4l-LTC5MsN736IHkRoPXZnJk_Dxan-Q4tdKKaLs/edit?usp=sharing","https://enactus.org/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies, that we can't handle","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Our outputs will be fully open source under the MIT License. The smart contracts (Aiken), frontend code (React/Next.js), and documentation will be published on the Enactus ABU GitHub repository. We believe this protocol should be a public good for the global circular economy.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"RWA","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Eko-Chain moves beyond simple \"track and trace\" to become a computational value engine for the informal economy. We are introducing four radical innovations that currently do not exist in the Cardano ecosystem:\n\n\n\n1. AI-Native \"Proof of Pickup\" (PoP): Current supply chain dApps rely on fallible human data entry. Eko-Chain integrates a custom-trained Edge AI (Computer Vision) model directly into the collector's mobile PWA.\n\n\n\nInnovation: The app \"sees\" the waste. It automatically classifies material (e.g., \"PET Bottle\"), estimates volume, and flags contamination before the transaction is signed. This creates an objective, algorithmic \"Proof of Quality\" attached to the NFT metadata, reducing fraud by 90% and reducing the need for expensive human auditors.\n\n\n\n2. Dual-Asset Tokenomics (Commodity + Credit): We are decoupling the \"physical value\" from the \"impact value.\" When a verified batch is minted, the smart contract creates two distinct assets:\n\n\n\nThe Commodity Token: Represents the physical plastic. Traded locally to recyclers.\n\n\n\nThe Plastic Credit Token: Represents the environmental offset (1kg diverted ocean plastic). This is sold globally to brands for ESG reporting.\n\n\n\nInnovation: This doubles the income for the poorest collectors, allowing them to earn from both the trash and the truth.\n\n\n\n3. Offline-First \"Optimistic\" Architecture: Internet in Zaria is unstable. A standard dApp fails if the connection drops.\n\n\n\nInnovation: We are building a \"Local-First\" architecture. Collectors sign transactions offline using their device's secure enclave. These are cryptographically queued and \"optimistically\" processed by the UI. When connectivity returns, the app batch-syncs to the Cardano blockchain in the background. This makes the UX feel instant, indistinguishable from Web2.\n\n\n\n4. DID-Based Reputation (The Trust Score): We are moving beyond \"anonymous wallets.\" We assign each collector a Decentralized Identifier (DID). As they successfully trade verified waste, their on-chain \"Trust Score\" grows. High-trust collectors eventually unlock \"Auto-Verification\" privileges, removing the bottleneck of human supervisors entirely.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"We will launch a Production-Grade Protocol on Mainnet that demonstrates the full \"Waste-to-Wealth\" lifecycle.\n\n\n\nThe Prototype will demonstrate:\n\n\n\nAI-Assisted Minting: A user points their phone at a pile of bottles. The app's AI draws a bounding box, identifies \"PET Plastic (95% Confidence),\" and populates the minting form automatically.\n\n\n\nThe \"Split\" Transaction: A recycler buys the physical waste for 50 ADA. The smart contract automatically splits the payment: 45 ADA to the collector, 2 ADA to the verifier, and 3 ADA to the protocol treasury.\n\n\n\nGlobal Plastic Credit Marketplace: A separate portal where a \"Brand\" (test user) can buy the \"Plastic Credit\" associated with that batch, retiring it on-chain to generate a \"Sustainability Certificate.\"\n\n\n\nOffline Sync: A demonstration of a collector logging 5 batches while in \"Airplane Mode,\" and seeing them all sync to the blockchain automatically upon reconnection.\n\n\n\nAccess:\n\n\n\nLive DApp: app.ekochain.xyz\n\n\n\nAI Demo: ai.ekochain.xyz (Upload a photo to test our waste classifier).\n\n\n\nExplorer: A custom \"Impact Explorer\" showing real-time map of waste collected in Zaria.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"1. Impact Metrics (The \"North Star\"):\n\n\n\nWaste Diverted: 50,000kg of plastic waste verified and traded on-chain during the pilot.\n\n\n\nCollector Income: Increase average collector earnings by 30% via the addition of Plastic Credits.\n\n\n\n2. On-Chain Metrics:\n\n\n\nVolume: 5,000+ Mainnet transactions (Minting, verifying, splitting, retiring credits).\n\n\n\nAdoption: 200+ Active Wallets (Collectors & Verifiers).\n\n\n\nToken Velocity: 50,000 ADA volume processed through the protocol contracts.\n\n\n\n3. Technical Metrics:\n\n\n\nAI Accuracy: Achieve >85% accuracy in material classification for the Computer Vision model.\n\n\n\nLatency: Reduce \"Time to Mint\" to <5 seconds on a 3G connection (via offline signing).","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**The Problem:** \n\nThe circular economy is broken by an &quot;Information Asymmetry.&quot; Brands want ethical recycled plastic but can't find it. Collectors have it but can't prove it. The current market is manual, predatory, and opaque.\n\nNo Data: 90% of African waste collection happens offline.\n\nNo Trust: Buyers discount prices because they fear contamination.\n\nNo Scale: Human verification is too slow and expensive for millions of micro-transactions.\n\n\n\n**The Solution:**\n\n Eko-Chain AI Protocol We are building the Operating System for the Informal Economy.\n\nComponent 1: The &quot;Smart&quot; Collector App (Edge AI) A mobile app that gives superpowers to waste pickers.\n\nAI Vision: Instantly grades waste quality.\n\nGeo-Fencing: Validates the &quot;Source&quot; (e.g., proving plastic came from a specific ocean-bound zone).\n\nWallet Abstraction: Users log in with FaceID/Bio. Keys are managed securely; they never see a seed phrase.\n\nComponent 2: The Protocol (Aiken Smart Contracts)\n\nCIP-68 Standards: Uses reference tokens to store mutable data (Status: Collected -&gt; Verified -&gt; Processed) without burning the token.\n\nMarketplace &amp; Escrow: A trustless exchange for trading bulk commodities.\n\nCredit Minter: Automatically mints a fractional &quot;Plastic Credit&quot; for every kg of verified waste.\n\nComponent 3: The Impact Dashboard A public portal for brands and government regulators to view the real-time &quot;Waste Map&quot; of the city, visualizing the flow of materials from street to factory.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"1. Economic Revolution for the Bottom Billion: We are unlocking a new asset class for the poor. By tokenizing \"Plastic Credits,\" we are essentially printing money from pollution. This puts ADA directly into the hands of the unbanked, creating a sticky, life-changing use case for Cardano in Africa.\n\n\n\n2. Solving the \"Greenwashing\" Crisis: For the first time, a brand can scan a bottle of shampoo and see the exact photo of the waste picker who collected the plastic, verified by AI and timestamped on Cardano. This is the \"Holy Grail\" of ESG.\n\n\n\n3. Massive Transaction Volume: This is high-velocity RealFi. A single Enactus chapter can generate more daily transactions than many DeFi protocols. Scaling this to the global Enactus network (35 countries) represents a potential 100x increase in Cardano's real-world utilization.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Based at Ahmadu Bello University in Zaria, Nigeria, our Enactus team is uniquely positioned to deliver this project.\n\n\n\nProven Operational Track Record: We are not an idea on paper. We are our own first customer. We already manage the real-world businesses, PUP Industries and Tompa Industries, that will serve as the pilot users for this dApp. We have existing production lines, supply chains, and a volunteer workforce.\n\n\n\nEmbedded Network: We have direct access to our target users: the collectors who supply our materials, the students who manufacture the products, and the local community who buys them. This allows for rapid prototyping and iteration.\n\n\n\nM&E and Reporting Excellence: The Enactus model requires rigorous measurement and reporting. We are experts at tracking KPIs and documenting progress, which aligns perfectly with Project Catalyst's accountability requirements.\n\n\n\nSteps to validate feasibility and maintain trust:\n\n\n\nPilot-First with Real Partners: We will begin by integrating our own ventures into the dApp, providing a real-world, low-risk environment to test every component.\n\n\n\nTransparent Development: All code will be developed in a public GitHub repository, and we will provide bi-weekly progress updates to the Cardano community.\n\n\n\nOn-Chain Audits: The very nature of our solution means that our progress will be auditable on-chain. Anyone can track the number of NFTs minted and the volume of transactions on our platform.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"AI Model Training & Protocol Architecture","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Collection and curation of 5,000+ high-quality labeled waste images covering diverse lighting, occlusions, and geographic contexts. Complete data augmentation pipeline, metadata schema, and verification checks. Training, hyperparameter tuning, and quantization of a TensorFlow Lite model optimized for mobile inference, including conversion pipeline, size/perf trade-off documentation, and reproducible training scripts. Finalize Aiken Smart Contract architecture with detailed minting logic, tokenomics, marketplace order flows, role-based permissions, and an initial contract test harness for deployment staging.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"AI model demonstrates >80% classification accuracy on a held-out test set, with F1-score, precision, and recall metrics reported per class; model inference latency and memory footprint fall within mobile deployment constraints; quantized TFLite artifact successfully loads and runs on at least two Android device models; smart contracts pass all unit and integration tests and conform to the documented minting and marketplace specifications.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public link to the open-source dataset and metadata manifest (e.g., HuggingFace dataset or equivalent) plus dataset license file; training logs, experiment tracking exports (loss/accuracy curves), reproducible training scripts and model checkpoints in the GitHub repo; downloadable TFLite model artifact with README; a short screen-recorded video demo of live AI inference on a mobile device; architecture diagrams and the Aiken contract ABI and test reports in the repository.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"App Development & Alpha Testing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Complete implementation of the Collector Progressive Web App (PWA) featuring the integrated AI camera workflow, offline-first data capture, local storage encryption, and background sync capabilities. Build the Verifier Dashboard with role-based access, batch verification tools, and reporting. Prepare CI/CD for deployment to Cardano Preprod Testnet and instrumentation for alpha telemetry. Recruit and onboard 20 student alpha testers and run structured test scenarios and feedback capture sessions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Collector PWA functions fully offline for capture, queuing, and local validation; robust sync correctly uploads queued transactions and media to the Testnet when connectivity resumes; end-to-end flows (capture → verify → mint/list) succeed in the Preprod environment; at least 20 alpha testers complete the assigned test plan and submit validated feedback forms; critical bugs are triaged and accepted or fixed before next release.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Publicly accessible Preprod Testnet URL(s) showing deployed endpoints and sample transactions; alpha test report containing tester demographics, completed task checklists, bug triage list, and synthesized feedback; annotated video demonstrating an offline capture followed by an offline-to-online sync and successful Testnet transaction; CI logs, deployment manifests, and screenshots of the Verifier Dashboard performing verification tasks.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":60000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mainnet Launch & The \"Zaria Pilot\"","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Final security-audited smart contracts deployed to Cardano Mainnet with documented migration and governance processes. Complete onboarding program for 100 local collectors, including training materials, field kits, and support channels. Launch of the “Plastic Credit” marketplace with listing, bidding, settlement, and reconciliation flows. Local outreach and operations plan executed for the Zaria Pilot, including logistics for collection, verification, and measurement.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Smart contracts pass formal audit and are deployed without critical issues; system records ≥1,000 verified Mainnet transactions fulfilling minting/listing/settlement flows; on-chain records verify at least 10,000 kg of waste collected and processed through the protocol; 100 collectors are actively onboarded, trained, and performing defined collection tasks; marketplace listings and first trades complete successfully on Mainnet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Published Mainnet policy IDs and contract addresses with explorer links to representative transactions; audit report and remediation log from third-party security reviewer; documented collector onboarding roster and training sign-offs; transaction ledger exports showing cumulative verified weight reaching or exceeding 10,000 kg; a short documentary-style “Zaria Pilot” video showing field operations, collector interviews, and end-to-end process footage.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Scaling & Open Source Release","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Release of the Eko-Chain SDK and templated deployment scripts, enabling other teams (e.g., Enactus groups) to clone, configure, and deploy the stack. Publish developer documentation, API references, example apps, and contribution guidelines. Produce a thorough Impact Report measuring environmental and social outcomes, plus a strategic roadmap and playbook for Pan-African expansion that includes partner engagement, localization, and funding models.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Complete, user-friendly developer documentation and SDK published in the repository with clear onboarding instructions; at least two Enactus teams have signed up to the onboarding waitlist and received initial orientation materials; impact measurement methodology verified and the Impact Report finalized; clear roadmap for scaling with milestones, staffing, and budget requirements for Pan-African rollout.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public Developer Docs URL and SDK release tag in GitHub; example deployment templates and a “quickstart” demo app; final Impact Report PDF with underlying data appendices and measurement methodology; list of two other Enactus teams on the waitlist along with onboarding emails or signed expressions of interest; roadmap document with timelines and resource allocation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Core &amp; Technical Contributors\n\nProject Coordinator — Alfred Onuh Itodole\n\nHead of Business &amp; Partnership, Enactus ABU; Core Contributor, SingularityNET; Google Developer Group leader. Alfred coordinates project strategy, partnerships, stakeholder engagement, and pilot mobilisation. He will serve as the primary contact for Catalyst and manage milestones, community partnerships, and reporting.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/sirxalfred/](https://www.linkedin.com/in/sirxalfred/)\n\nAI/ML Project Lead — Kamal Aliyu\n\nLead AI/ML Engineer and system architect for the verification layer. Kamal will design and deliver the edge AI stack (model architecture, on-device inference workflows, OCR/liveness checks) and oversee ML integration, fraud detection, and performance optimisation.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/alkamal/](https://www.linkedin.com/in/alkamal/)\n\n· GitHub: [https://github\\.com/Alkamal01](https://github.com/Alkamal01)\n\nAI / Data Engineer — Stanley Nnamani\n\nStanley will lead dataset curation, model training pipelines, evaluation and productionisation of TensorFlow/TFLite models. He is responsible for data labelling, model QC, and the data feed to the public impact dashboard.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/stanley\\-nnamani/](https://www.linkedin.com/in/stanley-nnamani/)\n\n· GitHub: [https://github\\.com/StarMindz](https://github.com/StarMindz)\n\nBlockchain Architect &amp; Lead Developer — Mubarak Abdullateef\n\nResponsible for on-chain architecture, Plutus/Aiken smart contract development, CIP-68 implementation, policy management, and testnet/mainnet deployments. Mubarak will own security best practices, contract unit tests, and integration with the marketplace logic.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/mubarak\\-abdullateef/](https://www.linkedin.com/in/mubarak-abdullateef/)\n\nFrontend Lead / PWA Engineer — Bata Zoaka Bukar\n\nBuilds the collector PWA, verifier dashboard, wallet integrations (CIP-30), offline queue, and UX for low-literacy users. Bata ensures on-device inference integration and the optimistic UI/IndexedDB sync flows.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/bata\\-zoaka/](https://www.linkedin.com/in/bata-zoaka/)\n\nFull-Stack &amp; ML Integration Engineer — Muhammed Yuguda\n\nSupports backend indexer, API gateway, TFLite integration into the PWA, and dev-ops for CI/CD. Muhammed will implement the mock/microservice endpoints for prototype and assist with production indexer for mainnet pilot.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/yuguda/](https://www.linkedin.com/in/yuguda/)\n\n· GitHub: [https://github\\.com/Yuguda999](https://github.com/Yuguda999)\n\nCommunity &amp; Onboarding Manager — Alayande Daniel\n\nLeads pilot recruitment, verifier training, field logistics, and community engagement via the Enactus ABU network. Daniel will manage training curricula, pilot operations and community reporting.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/alayande\\-daniel\\-6a044417a/](https://www.linkedin.com/in/alayande-daniel-6a044417a/)\n\nAdvisors\n\nMr. Yusuf Bashir — CEO, KAD ICT HUB — strategic partner for tech acceleration, local incubation and stakeholder introductions. (X/Twitter: [https://x\\.com/YusufBashir](https://x.com/YusufBashir)\n\n)\n\nDr. Umar Sani Bebeji — Legal Advisor — regulatory compliance, local pilot legal frameworks and privacy guidance. (LinkedIn: [https://www\\.linkedin\\.com/in/umar\\-sani\\-bebeji\\-ph\\-d\\-4b963363/](https://www.linkedin.com/in/umar-sani-bebeji-ph-d-4b963363/)\n\n)\n\nStrategic Partner & Regenerative Accelerator — Project Genius Hub Project Genius Hub serves as the formal Regenerative Talent Accelerator and Knowledge Hub for this project. It provides the core Prisma/WADA regenerative development framework, the structured documentation pipeline, and the pre-vetted talent pool (leveraged for contingency planning). The Hub ensures the project remains deeply Place-Sourced (Zaria context) and maintains verifiable, transparent progress tracking. Website: [https://www\\.projectgenius\\.com\\.ng/](https://www.projectgenius.com.ng/) Documentation: [https://genius\\-alpha\\-seven\\.vercel\\.app/](https://genius-alpha-seven.vercel.app/)\n\n\n\nNetwork, Contingency &amp; Hiring Plan\n\nEnactus Network as talent pipeline: If any role becomes unavailable, we will recruit vetted graduates and students from Enactus ABU and the Unified Cardano Student Club Nigeria for rapid onboarding. We also maintain active contact lists at , PRISMA, WADA and Gimbalabs for urgent contractor sourcing.\n\nOutsourcing approach: Contracted roles (e.g., smart contract auditor, ZK/Privacy researcher) will be engaged through 30–60 day SOWs with LOIs provided to Catalyst as verifiable evidence.\n\nEvidence strategy: For each technical lead we will attach GitHub links (commits, repos), LinkedIn profiles, and where applicable an LOI confirming time allocation. We will include sample commits and initial testnet txs as deliverables to satisfy verifiability checks.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Total: 200,000 ADA\n\n\n\n1. Technology & Development (100,000 ADA):\n\n\n\nSmart Contract Engineering & Security Audit: 40,000 ADA (Crucial for handling user funds).\n\n\n\nFrontend/PWA Development: 30,000 ADA.\n\n\n\nAI Model Training (Data labeling + Compute): 20,000 ADA.\n\n\n\nBackend/Indexer Infrastructure: 10,000 ADA.\n\n\n\n2. Operations & Pilot (60,000 ADA):\n\n\n\nHardware: Purchase of 20 low-cost Android smartphones for collector onboarding: 15,000 ADA.\n\n\n\nLogistics: Transport/Data for pilot team in Zaria: 15,000 ADA.\n\n\n\nEducation: Training workshops for 100 students: 20,000 ADA.\n\n\n\nLegal: Framework for Plastic Credits compliance: 10,000 ADA.\n\n\n\n3. Project Management & Marketing (40,000 ADA):\n\n\n\nProject Admin & Reporting: 20,000 ADA.\n\n\n\nMarketing & \"Impact Documentary\" production: 20,000 ADA.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Funding the R&D for a new sector on Cardano. For 200k ADA, you get:\n\n\n\nA Novel AI-Protocol: The first open-source AI waste classifier for Cardano.\n\n\n\nA New Asset Class: The architecture for \"Tokenized Plastic Credits.\"\n\n\n\nReal-World Volume: A system designed to generate millions of transactions, not just speculation. This is a seed investment in the infrastructure that will allow Cardano to dominate the African supply chain market.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"RWA","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1725}