{"pr_id":"019ac251-25ad-79c2-8910-9193c6eac15d","title":"Walkers - Whub: Gamified Challenges for Mass Adoption!","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Drive real growth and push beyond the limits of existing communities!  Cardano adoption is limited as users lack engaging, gamified experiences that attract Web2 and cross chain communities. ","solution":"A Walk2Earn app turning every step into fun rewards! Using gamification and GameFi, it drives Cardano adoption while engaging Web2 and cross-chain users seamlessly","proposer_name":"Ivana Zafirovski","proposer_relevant_experience":"**Ivana Zafirovski \\- Founder of Walkers**\n\n[https://x\\.com/Ivanaarch](https://x.com/Ivanaarch)\n\n[https://www\\.linkedin\\.com/feed/](https://www.linkedin.com/feed/)\n\nCoordinating the team and making sure our community get the best out of the project. Apart from user benefits and coordination of all activities, she is the designer of all social media content. Master degree Architect by proffesion\n\n**Ruben Duarte \\- Head of Marketing and Growth**\n\n[https://x\\.com/RuduarteD](https://x.com/RuduarteD)\n\n[https://www\\.linkedin\\.com/in/ruben\\-duarte\\-8a71314a/](https://www.linkedin.com/in/ruben-duarte-8a71314a/)\n\nHe is passionate about web3, with over 10 years of experience in partnerships, marketing ideas and project management. His experience is related to IT and he have worked in some government and banking companies and important multinationals\n\n**André Morais \\- Software engineer**\n\n[https://x\\.com/andrefmmorais](https://x.com/andrefmmorais)\n\n[https://www\\.linkedin\\.com/in/andre\\-moniz\\-morais/](https://www.linkedin.com/in/andre-moniz-morais/)\n\nSoftware engineer with a master’s in Computer Science and a passion for creating high-quality software. As a startup founder, he enjoys turning ideas into reality. When he's not coding, he enjoys fitness, cooking, and writing—always driven by the desire to build and create.\n\n**Olie Merza \\- Lead Artist**\n\n[https://x\\.com/OlieMerza](https://x.com/OlieMerza)\n\nOlie is a graphic designer and illustrator from the Philippines. He has more than a decade of experience working in the garments industry focusing on printed graphics. His works were featured in various exhibits both in his country and abroad.\n\n**Karlo Kelecic \\- Artist**\n\nConcept artist/Illustrator. Currently freelancing on projects, worked in startups, founded startups and ran his own agencies. He have experience in art development as a generalist. Focused on digital painting, 2D illustration, Houdini for procedural animation, environments 3D and VFX.\n\nKey skills: Procreate, Photoshop, Houdini, After Effects, Illustrator and Vectonator. Studied applied arts and design, philosophy and art academy in Zagreb. Started to work as junior designer in 2009. Created his own workshops about comic books, concept art and VR.\n\n**Bojan Mitevski \\- UX/UI and Motion Graphics**\n\n**[https://www\\.bojanmitevski\\.com/](https://www.bojanmitevski.com/)**\n\nZealous visual designer who freelances for clients worldwide and specializes in UI/UX, websites, mobile apps, and motion graphics design. He is passionate about working on creative designs, overcoming challenges, and solving real users' problems that help companies scale.\n\n**Diogo Menezes \\- 3D Designer** -\n\n[https://x\\.com/\\_\\_SEZENEM](https://x.com/__SEZENEM)\n\nInterior and product designer who worked with some of the best Architecture offices in Portugal with almost 10 years in the business. Currently working with Architects and designers, Menezes uses 3D software to create and develop what was once in the paper, usually working with Archviz and product visualization.\n\n**Unlimited Solutions** - Main Developers &amp; Architects\n\n**Noma Tokenomics** - Tokenomics,Economy creation and Audit - [https://noma\\.pro/](https://noma.pro/)\n\n**Motionalley studio** - Branded animations and illustrations - [https://www\\.motionallystudio\\.com/](https://www.motionallystudio.com/)\n\n**Abhiwan** - Mobile app developers - [https://www\\.abhiwan\\.com/](https://www.abhiwan.com/)\n\n**Yepple Ink** - Blockchain developments and services","url":null,"funds":82700,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Walkers - Whub: Gamified Challenges for Mass Adoption!","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Ivana Zafirovski","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":82700,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":8,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Drive real growth and push beyond the limits of existing communities!  Cardano adoption is limited as users lack engaging, gamified experiences that attract Web2 and cross chain communities. ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A Walk2Earn app turning every step into fun rewards! Using gamification and GameFi, it drives Cardano adoption while engaging Web2 and cross-chain users seamlessly","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.walkerscardano.xyz/","https://whubapp.xyz/","https://play.google.com/store/apps/details?id=com.walkers.walkerscnft&pli=1","https://apps.apple.com/mk/app/walkerscnft/id6450308902","https://github.com/WalkersApp"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"We recognize the value of transparency and collaboration that open source projects bring. However, certain parts of our code provide essential advantages that we need to protect as part of our core technology.\nAll Walkers platforms, tools, app, and technologies are protected under the Walkers Proprietary IP License.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"GameFi","group":"GameFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Walkers is the first and only Walk2Earn ecosystem on Cardano, and what makes Whub truly stand out is how it turns real-world locations into a global challenge space.\n\nInstead of just tracking steps or simple fitness goals like most apps, Walkers takes Move-to-Earn a step further by combining geolocation mapping, social competition, and a creator-driven challenge system.\n\nWith Whub, we’re mapping walking spots all around the world — from parks and trails to sports centers and popular city routes.\n\n**These places become active arenas where users can jump into or create challenges of all kinds:**\n\n• **Physical** — step goals, distance missions, location-based activities\n\n• **Social** — team challenges, group milestones, community-driven goals\n\n• **Creative** — photo challenges, content tasks, idea-based competitions\n\n• **Mental** — puzzles, trivia, and problem-solving contests\n\nIt’s a lot more than a fitness tracker. It’s a location-powered challenge network where everyday places turn into competitive, social, and creative spaces.\n\nWhat really sets Whub apart is that anyone can create their own challenge. \n\nUsers can set entry fees, pick prize pools, form teams, and even host location-based competitions. \n\nBy combining movement, exploration, creativity, social interaction, and rewards, Whub creates something completely new a global, geolocation-based challenge platform on Cardano.\n\nThis makes Walkers not only unique, but genuinely first-of-its-kind, and it puts Cardano at the center of the most innovative movement-based challenge ecosystem in Web3.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"**MVP Status**\n\nThe core of this idea is already live. Our **MVP** consists of two functional products: the Walkers App and Whub.\n\nApp Store:\n\n[https://apps\\.apple\\.com/mk/app/walkerscnft/id6450308902](https://apps.apple.com/mk/app/walkerscnft/id6450308902)\n\nPlay Store:\n\n[https://play\\.google\\.com/store/search?q=WalkersCNFT&amp;c=apps&amp;hl=en](https://play.google.com/store/search?q=WalkersCNFT&c=apps&hl=en)\n\n**Whub App in MVP version:**\n\n[https://whubapp\\.xyz/](https://whubapp.xyz/)\n\nThe Walkers App is fully launched on iOS and Android, tracking daily steps, goals, and user activity with a growing user base and proven engagement for almost 3 years.\n\nWhub is also live, and we’ve already started mapping real walking spots, parks, trails, and popular routes around the world.\n\nTogether, these two products form a working foundation for the Challenge Platform. Users can already walk, track progress, join the ecosystem, and explore mapped locations  which means the next step is simply building the challenge layer on top of tools we’ve already developed and tested.\n\nThis allows us to move fast, reduce development risk, and deliver the Challenge Platform efficiently, using live infrastructure that’s been running and improving **since 2023\\.**","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"The success of **Whub** will mainly be measured by how often people use it and how many challenges they join, create, and complete. Since we already have an active Walkers user base and steady daily activity, we expect a natural wave of early adoption once Whub challenges go live. As users start joining physical, social, and creative challenges—and especially once creators begin setting their own entry fees and prize pools—we’ll see regular microtransactions forming the core activity of the platform.\n\n\n\nThis also gives every creator the possibility to generate their own income from the challenges they create, which we expect will attract even more users over time.\n\n\n\nA realistic goal for the first year is reaching around 10,000–20,000 microtransactions per month, depending on user growth and overall participation. We’re starting with the existing Walkers community, which now has around 2,000 daily active users, and then expanding step-by-step as more people discover the challenge system.\n\n\n\nThe aim isn’t overnight explosive growth, but steady and sustainable adoption. Over time, as more users explore mapped locations and take part in daily challenges, Whub has the potential to become a widely used, community-driven challenge layer within the Walkers ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The global Move-to-Earn (Walk2Earn) fitness apps market is rapidly expanding, generating approximately USD 670 million in revenue in 2024 and projected to grow to USD **1\\.8 billion by 2030**, with a robust CAGR of 17.7%. This demonstrates that the intersection of wellness, gamification, and blockchain-based rewards is not only viable but a rapidly growing opportunity.\n\n**Walkers App** is strategically positioned to capture and lead in this market by offering an innovative, rewarding, and immersive experience that bridges traditional fitness engagement with the emerging Web3 ecosystem.\n\nOur mission is to drive mass adoption of Cardano by creating a platform that seamlessly integrates walking, community interaction, and economic engagement through our Walk2Earn and Engage2Earn models already developed.\n\nWalkers goes beyond traditional fitness apps by turning everyday activity into valuable rewards while fostering community growth and participation.\n\n**Daily activity of walkers app users \\- holders:**\n\n[https://drive\\.google\\.com/file/d/1tfvBZS98UvY\\-zjdyCfSNckdx129TsjuL/view?usp=sharing](https://drive.google.com/file/d/1tfvBZS98UvY-zjdyCfSNckdx129TsjuL/view?usp=sharing)\n\n**Free users of Walkers App:**\n\n[https://drive\\.google\\.com/file/d/1l9qtL1RXc8uVYh5xFqx\\-\\_T\\-NIWOOadDi/view?usp=sharing](https://drive.google.com/file/d/1l9qtL1RXc8uVYh5xFqx-_T-NIWOOadDi/view?usp=sharing)\n\n**Walkers partnerships network:**\n\n[https://drive\\.google\\.com/file/d/1\\-mBuAFkwSXEe2TxVL0seUnWa86Rv\\_gNZ/view?usp=sharing](https://drive.google.com/file/d/1-mBuAFkwSXEe2TxVL0seUnWa86Rv_gNZ/view?usp=sharing)\n\nWalkers began as a self-funded project, and since launch, we have continuously delivered and grown every day! Starting in **August 2022**!\n\nThe Walkers App officially launched on the App Store and Google Play in August 2023 and has already undergone 15 major upgrades, enhancing functionality, user experience, and ecosystem features:\n\n[https://play\\.google\\.com/store/apps/details?id=com\\.walkers\\.walkerscnft&amp;pli=1](https://play.google.com/store/apps/details?id=com.walkers.walkerscnft&pli=1)\n\n[https://apps\\.apple\\.com/mk/app/walkerscnft/id6450308902](https://apps.apple.com/mk/app/walkerscnft/id6450308902)\n\nAs part of the Walkers ecosystem, we have built:\n\nA Single Staking platform for our native currency [https://earn\\.yepple\\.io/walkers](https://earn.yepple.io/walkers)\n\nAn Airdrop tool for NFTs, CNTs, and CNFTs, open to all Cardano, enabling constant buybacks and supporting a sustainable token economy: [https://wairdrops\\.xyz/](https://wairdrops.xyz/)\n\nWe have also begun mapping real-world locations through Whub, creating immersive gamification experiences that engage users in walking challenges while driving mass adoption on Cardano: [https://whubapp\\.xyz/](https://whubapp.xyz/)\n\nWith each update, partnership, and gamified feature, Walkers continues to expand its user base, enhance engagement, and strengthen the Cardano adoption.\n\nOur most significant collaboration has been joining the **Google Cloud for Startups program – Scale Tier, where we were approved for $200k** in credits for early-stage support. This collaboration provides us with extensive infrastructure benefits,which is helping us scale and grow our user base on Cardano.\n\n[https://x\\.com/WalkersCNFT/status/1908161850312646941](https://x.com/WalkersCNFT/status/1908161850312646941)\n\n[https://cloud\\.google\\.com/startup/early\\-stage](https://cloud.google.com/startup/early-stage)\n\n**What makes Walkers Unique:**\n\n**Innovative Tokenomics and Economy**\n\nWalkers rewards users with $WLK, as well as partner tokens and airdrops, ensuring sustainable growth.\n\nUsers level up through activity and engagement, and at level 5, they can exchange points for tokens or real-world rewards, including gift cards, subscriptions, and NFTs.\n\nOur carefully designed economy ensures stability, longevity, and continuous user motivation, differentiating Walkers from other fitness apps that lack token sustainability.\n\n**Partnership\\-Driven Ecosystem**\n\nWe actively integrate projects from Cardano and other blockchains, creating a networked reward system that grows the community and enhances adoption.\n\nStrategic collaborations with brands in health, sports, and lifestyle sectors connect digital engagement with real-world utility, ensuring users remain active and invested in the platform.\n\n**Gamification**\n\nWalkers transforms walking into an interactive and immersive experience through globally mapped walking spots.\n\nUsers can , participate in missions, and collect rewards usable in both the game and real life, creating a fun, motivating, and rewarding ecosystem.\n\nGroup challenges and social features enhance engagement, encouraging users to interact, compete, and collaborate, while strengthening the community.\n\n**Seamless Web2\\-to\\-Web3 Onboarding**\n\nFree users can create profiles and start earning basic rewards, gradually integrating into the blockchain economy.\n\nWalkers offers an accessible entry point for Web2 users, educating and engaging them in Web3 through rewards, NFT integration, and tokenized incentives, bridging the gap between mainstream users and Cardano adoption.\n\n**Marketing, Events, and Community Engagement**\n\nWe regularly host airdrop campaigns for a wide range of Cardano projects ahead of their sales, mints, or presales. These campaigns use Engage2Earn tasks inside the Walkers App, connected directly with social APIs, allowing projects to build real holders and generate daily microtransactions while users complete simple engagement tasks.\n\nIn addition to this, we organize walking challenges, marathons, and social campaigns that help raise awareness, attract new users, and strengthen community participation. Our collaborations with major brands and community-led initiatives provide strong visibility and steady, long-term growth.\n\nEvery step taken by our users not only supports a healthier lifestyle but also contributes to the growth of the Cardano ecosystem, creating real, measurable impact through daily activity.\n\n**Milestones and Continuous Development:**\n\nSocial Features – XP-based challenges, missions, and social interaction to enhance community engagement.\n\nGrowing Partnerships – Continuous onboarding of brands and projects to expand ecosystem utility and reward diversity.\n\nBy combining physical activity, social interaction, gamified challenges, and blockchain-based rewards, Walkers creates a sustainable, fun, and engaging platform that encourages users to adopt Cardano naturally.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**The success of our project, Walkers, will bring different value to the Cardano in several ways:**\n\n- **Diverse Partnerships:** Collaborating with various projects on Cardano and extending to other blockchains enhances the interconnectedness of the Cardano. These partnerships can lead to shared opportunities, cross-promotion, and a network effect, benefiting the broader Cardano Community. In the Walkers eco-system, partnerships actively utilize their tokens, creating a mutually beneficial relationship.\n- **Mass Adoption on Cardano:** With innovative Walk2Earn and Engage2Earn model and fostering a unique combination of health, GameFi, and community engagement, Walkers aims to attract a significant user base to the Cardano blockchain. The introduction of real-life rewards adds an extra layer of motivation for users to actively engage with the Walkers app and participate in the Walkers eco-system. This reward system, coupled with in real life programs, extends the appeal to Web2 users, encouraging them to integrate the Walkers app into their routines.Furthermore, our strategic approach involves implementing referral programs, providing an opportunity for everyone to earn. This initiative is designed to catalyze mass adoption on the Cardano blockchain.\n- **Economic Engagement:** The Walkers ecosystem fosters active economic participation through rewards, strategic partnerships, and affiliate programs. This approach benefits individual users while simultaneously strengthening the Walkers ecosystem.Through Airdrop campaigns within the Walkers App, we boost engagement for other Cardano projects, rewarding users not only with our native currency ($WLK) but also with other CNT's. By guiding users from Web2 and other blockchain ecosystems to create wallets, we enable them to earn additional token rewards, motivating active participation within the Cardano blockchain.Our streamlined onboarding process ensures a seamless transition, making it simple and intuitive for users to enter the Cardano blockchain while engaging with a rewarding, gamified experience.\n- **Innovation and User Engagement:** Walkers introduces an engaging GameFi experience and a unique approach to combining physical activity, socialization, and gaming. This innovation contributes to the diversity of applications on Cardano, attracting users with different interests and preferences.\n\n**Measuring Impact:**\n\n- **User Growth:** Tracking the increase in Walkers app users, especially those new to Cardano, provides a tangible metric for the success of our mass adoption efforts.\n- **Community Participation:** Monitoring the active involvement of partnership project holders, affiliates, and users in the Walkers ecosystem serves as an indicator of economic engagement and community building.\n\n**Sharing Outputs and Opportunities:**\n\n- **Regular Updates:** Providing regular updates through official channels, social media, and community forums to share milestones, new features, and partnerships.And Leaderboards in Walkers App\n- **Educational Initiatives:** Conducting educational content to inform about the benefits and opportunities within the Walkers ecosystem.\n- **Collaborative Events:** Participating in collaborative events, conferences, and forums within the Cardano to showcase Walkers success\n- **Community Engagement:** Actively engaging with the community through open communication channels, feedback sessions, and incorporating community suggestions into the project's roadmap.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Cardano Involvement:** Walkers has been an part of the Cardano ecosystem since its inception on August 28, 2022. This longstanding presence signifies our dedication to and alignment with the principles of the Cardano blockchain.\n\n**Founder's Expertise:** As the founder, my four-year involvement in the Cardano, coupled with active investments, attests to a deep understanding of the blockchain space. This experience contributes to informed decision-making and strategic development.\n\n**Team Expertise:** Our team, mirroring the active investment practices of our founder within numerous projects in the Cardano ecosystem, boasts a deep understanding of the blockchain landscape. Our collective expertise spans across software development, marketing, and artistic design. This diverse skill set positions us strongly to execute the intricacies of the second phase of our roadmap. The wealth of experience within our team significantly enriches our decision-making processes, fostering strategic development and guaranteeing the success and innovation of our ongoing endeavors.\n\n**App Launch and Upgrades:** The unveiling of the Walkers App on August 28, 2023, signifies a milestone in our development journey. Accessible on Play Store and App Store, the Walkers App has undergone continuous refinement with 15 updates since its initial launch.\n\n[https://play\\.google\\.com/store/apps/details?id=com\\.walkers\\.walkerscnft&amp;pli=1](https://play.google.com/store/apps/details?id=com.walkers.walkerscnft&pli=1)\n\n[https://apps](https://apps).apple.com/mk/app/walkerscnft/id6450308902]([https://apps\\.apple\\.com/mk/app/walkerscnft/id6450308902\\)](https://apps.apple.com/mk/app/walkerscnft/id6450308902))\n\n**To ensure the sustainability of our ecosystem, we have built a comprehensive suite of platforms around the Walkers App:**\n\n**Single Stake and Liquidity Staking for our main currency:** [https://earn\\.yepple\\.io/walkers](https://earn.yepple.io/walkers)\n\n**WAirdrop Tool** for NFTs, CNTs, and ADA, open to all Cardano users and free for creators and founders: [https://wairdrops\\.xyz/](https://wairdrops.xyz/)\n\n**WRaffles Platform** for community giveaways and engagement: [https://www\\.walkersraffles\\.xyz/](https://www.walkersraffles.xyz/)\n\n**Whub** – Gamified mapping of worldwide famous walking spots: [https://whubapp\\.xyz/](https://whubapp.xyz/)\n\n**Feedback Integration:** Actively seeking feedback from our user base, demonstrates our commitment to user-centric development. Continuous refinement based on valuable user suggestions ensures that the app and all our DApps meet user expectations and delivers a seamless experience.\n\n**Proven Track Record:** Walkers has already launched its app on the Play Store and App Store, with an established user base. This tangible proof of concept underscores our capability to effectively manage and deploy resources.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"UX/UI Design","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Home Page / Dashboard \\(200 hours\\)**\n\n- Hero Section: Highlight current top challenges, featured community challenges, and special event banners. Users should immediately see the excitement and potential rewards upon entering the platform.\n- Quick Access Buttons: Prominent buttons for “Join Challenge,” “Create Challenge,” and “View Leaderboard” for easy navigation.\n- Progress Overview: Display users personal challenge progress, rankings, and rewards to motivate them to take action. Ensure consistency in design elements for a seamless user experience.\n- Challenge Categories:\n\nPhysical Challenges, Creativity Challenges, Social &amp; Community Challenges.\n\nOnboarding: Sign-up screen in the Walkers app (redirect users to the free userbase login process with an email and alphanumerical code)\n\n- Navigating Challenges: Allow users to filter by categories,popularity and Geolocation based.\n- Challenge Card Details: Show challenge details on dedicated cards.\n- Join Challenge Page: Options to join challenges;\n- Bet on Yourself Feature: Users can bet on their own ability, winning rewards based on their skill in specific challenges.\n- Create a Challenge (for Creators): A section where creators can earn from participation fees in challenge categories.\n- Leaderboards: Display user progress and rankings in physical challenges and leaderboards screens within the app.\n- Whub user profile screens\n- Geolocation-Based Leaderboards: Leaderboards ranked by the number of created challenges and the volume of both digital and real-world visitors\n\n**Design Consistency \\(100 hours\\)**\n\n- Ensure a unified visual style across Walkers App and Whub\n- Maintain seamless user experience with intuitive navigation\n- Apply consistent branding, icons, and UI elements","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Detailed Mockups:** Provide mockups for visualization\n\n\n\n**Wireframes and User Flow Diagrams:** Create wireframes and flow diagrams \n\n\n\n**Feedback Iterations:** Revise mockups based on internal reviews and feedback from the Walkers community","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Improved User Engagement:** Measure increased user engagement \n\n**Positive User Feedback:** Collect feedback from users during testing phases to gauge satisfaction with the enhanced UX/UI.\n\n**Visual Consistency:** Ensure a consistent visual language across all new screens for a cohesive user experience.\n\n\n\n**Iterate on mockups based on internal reviews and feedback of community \\(40 hours\\)**","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20400,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Backend Development and API Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will build the backend foundation required to power Walkers and Whub, covering all critical systems such as game mechanics, user account management, geolocation services, and missions/challenges.\n\nOur focus is on delivering an architecture that is both scalable and secure, ensuring smooth performance as the user base grows.\n\n**Core Components \\(100 hours\\)**\n\n- **Server\\-Side Architecture:** Develop a robust backend that manages user accounts, location-based tracking and real-time gameplay updates.Challenges logic and designed for scalability to support thousands of concurrent users.\n\n**API Integrations \\(120 hours\\)**\n\nConnect with third-party services to enable dynamic features, including challenges and missions, geolocation services and social integrations (e.g., X 'Twitter' APIs).\n\n- **Data Security:** Implement enterprise-grade protocols to protect user information. Secure login systems.\n\n**Database Design and integrations \\(100 hours\\)**\n\n- **Database Design:** Create a resilient and scalable database to handle user profiles, XP, rewards, and transaction histories. Number of challenges created. Number of challenges user participated/won. Geolocations rankings. Ensure seamless synchronization with the app frontend to provide a smooth, real-time user experience\n\n**Integrate payment options for challenges creators and participation\\(200 hours\\)**\n\n**Set up rewards and fee allocation systems\\(100 hours\\)**\n\n**User Testing and bug fixes in Whub \\(40 hours\\)**","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Backend systems must support all game mechanics, user management, and data storage, with performance tests showing the ability to handle expected loads.\n\nAPIs for challenges with real-time data updates working correctly.\n\nData security protocols in place","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Testing reports for API integration and data handling, showing minimal latency and successful data exchanges.\n\nBackend documentation and server architecture diagrams.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":36300,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Frontend Development for Whub","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Whub Interface Development \\(200 hours\\)**\n\nIntegrate challenges,missions and user profile in Whub that allows users to access key features such as missions and challenges progress, and account management.\n\nEnsure smooth synchronization with mobile app.\n\nBegin development of core frontend features for the Whub, including user registration, challenge browsing,geolocations browsing and leaderboard access.\n\nImplement responsive layouts to ensure compatibility across various screen sizes.\n\nIntegrate backend APIs to provide dynamic data, such as real-time challenge updates, user profiles, and reward tracking.\n\nFocus on optimizing performance, ensuring fast load times, smooth transitions, and user-friendly interactions.\n\nImplement mobile-specific features like push notifications for challenge reminders.\n\n**Real\\-Time Data Syncing \\(100 hours\\)**\n\nImplement a system where users can seamlessly transition between devices, with their game progress and items syncing in real time across the mobile app and web platform.\n\n**Responsive Design and Accessibility \\(100 hours\\)**\n\nEnsure the user interface is fully responsive and accessible to a broad range of users, following design and development best practices.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Whub interface development completed, with full synchronization to the mobile app.\n\nAll platforms tested for performance, security, and usability, with minimal bugs and smooth operation across devices.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Whub new version launch with complete feature parity with mobile apps.\n\nUser testing reports with feedback from beta users.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":18000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Marketing and Promotions Enhancement for GameFi Revolution","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Brand Awareness Campaign :**\n\nDevelop captivating marketing materials to showcase the unique features and immersive experience of the Whub GameFi platform.\n\nLaunch targeted advertising campaigns across digital channels to raise awareness and attract new users.\n\n**Partnerships with Healthy Food,Sport Brands:**\n\nForge strategic alliances with renowned brands in the health and sports sectors, aligning with Walkers mission of promoting wellness and fitness.\n\nCollaborate on co-branded marketing initiatives and promotional campaigns to amplify brand visibility and attract a wider audience.\n\n**Engaging Social Media Campaigns :**\n\nDesign and execute dynamic social media campaigns to engage existing users\n\nLeverage user-generated content and interactive challenges to foster user participation and community interaction.\n\n**Whub and Gamification Promotion:**\n\nHighlight user achievements and leaderboard standings through engaging promotional content.\n\nEncourage healthy competition and motivate users to strive for excellence by showcasing top performers and rewarding milestone achievements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Brand Awareness:** Measure the reach and engagement of marketing campaigns through metrics such as impressions, clicks, and conversions.\n\n**Partnership Impact:** Evaluate the success of brand partnerships based on metrics such as brand visibility, user engagement, and conversion rates.\n\n**Social Media Engagement:** Monitor social media metrics including likes, shares, comments, and user-generated content to assess campaign effectiveness and community engagement.\n\n**Interaction:** Analyze user interaction with leaderboard promotions, including click-through rates, leaderboard views, and user participation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Marketing Analytics Report:** Provide a comprehensive report detailing the performance of marketing campaigns, including key metrics and insights.\n\n**Partnership Agreements:** Present documentation of partnership agreements and collaborative marketing initiatives with healthy food and sport brands.\n\n**Social Media Engagement Metrics:** Provide analytics data showing the engagement and impact of social media campaigns on user interaction and community engagement.\n\n**Interaction Data:** Showcase user interaction data from promotions, demonstrating user engagement and participation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":8000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Ivana Zafirovski \\- Founder of Walkers**\n\n[https://x\\.com/Ivanaarch](https://x.com/Ivanaarch)\n\n[https://www\\.linkedin\\.com/feed/](https://www.linkedin.com/feed/)\n\nCoordinating the team and making sure our community get the best out of the project. Apart from user benefits and coordination of all activities, she is the designer of all social media content. Master degree Architect by proffesion\n\n**Ruben Duarte \\- Head of Marketing and Growth**\n\n[https://x\\.com/RuduarteD](https://x.com/RuduarteD)\n\n[https://www\\.linkedin\\.com/in/ruben\\-duarte\\-8a71314a/](https://www.linkedin.com/in/ruben-duarte-8a71314a/)\n\nHe is passionate about web3, with over 10 years of experience in partnerships, marketing ideas and project management. His experience is related to IT and he have worked in some government and banking companies and important multinationals\n\n**André Morais \\- Software engineer**\n\n[https://x\\.com/andrefmmorais](https://x.com/andrefmmorais)\n\n[https://www\\.linkedin\\.com/in/andre\\-moniz\\-morais/](https://www.linkedin.com/in/andre-moniz-morais/)\n\nSoftware engineer with a master’s in Computer Science and a passion for creating high-quality software. As a startup founder, he enjoys turning ideas into reality. When he's not coding, he enjoys fitness, cooking, and writing—always driven by the desire to build and create.\n\n**Olie Merza \\- Lead Artist**\n\n[https://x\\.com/OlieMerza](https://x.com/OlieMerza)\n\nOlie is a graphic designer and illustrator from the Philippines. He has more than a decade of experience working in the garments industry focusing on printed graphics. His works were featured in various exhibits both in his country and abroad.\n\n**Karlo Kelecic \\- Artist**\n\nConcept artist/Illustrator. Currently freelancing on projects, worked in startups, founded startups and ran his own agencies. He have experience in art development as a generalist. Focused on digital painting, 2D illustration, Houdini for procedural animation, environments 3D and VFX.\n\nKey skills: Procreate, Photoshop, Houdini, After Effects, Illustrator and Vectonator. Studied applied arts and design, philosophy and art academy in Zagreb. Started to work as junior designer in 2009. Created his own workshops about comic books, concept art and VR.\n\n**Bojan Mitevski \\- UX/UI and Motion Graphics**\n\n**[https://www\\.bojanmitevski\\.com/](https://www.bojanmitevski.com/)**\n\nZealous visual designer who freelances for clients worldwide and specializes in UI/UX, websites, mobile apps, and motion graphics design. He is passionate about working on creative designs, overcoming challenges, and solving real users' problems that help companies scale.\n\n**Diogo Menezes \\- 3D Designer** -\n\n[https://x\\.com/\\_\\_SEZENEM](https://x.com/__SEZENEM)\n\nInterior and product designer who worked with some of the best Architecture offices in Portugal with almost 10 years in the business. Currently working with Architects and designers, Menezes uses 3D software to create and develop what was once in the paper, usually working with Archviz and product visualization.\n\n**Unlimited Solutions** - Main Developers &amp; Architects\n\n**Noma Tokenomics** - Tokenomics,Economy creation and Audit - [https://noma\\.pro/](https://noma.pro/)\n\n**Motionalley studio** - Branded animations and illustrations - [https://www\\.motionallystudio\\.com/](https://www.motionallystudio.com/)\n\n**Abhiwan** - Mobile app developers - [https://www\\.abhiwan\\.com/](https://www.abhiwan.com/)\n\n**Yepple Ink** - Blockchain developments and services","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Milestone 1: UX/UI Design**\n\nHome Page / Dashboard (200 hours)\n\nDesign Consistency (100 hours)\n\nIterate on mockups based on internal reviews and feedback of community: (40 hours)\n\n**Total: 340 hours**\n\n-UX designer average hourly rate - 60 ADA\n\n-UI designer average hourly rate - 60 ADA\n\n**$ADA 20400**\n\n**Milestone 2:Backend Development and API Integration**\n\nCore Components (100 hours)\n\nAPI Integrations (120 hours)\n\nDatabase Design and integrations (100 hours)\n\nIntegrate payment options for challenges creators and participation (200 hours)\n\nSet up rewards and fee allocation systems (100 hours)\n\nUser Testing and bug fixes in Whub (40 hours)\n\n**Total: 660 hours**\n\n-Software developer average hourly rate - 55 ADA\n\n**$ADA 36300**\n\n**Milestone 3:Frontend Development for Whub**\n\nWhub Interface Development (200 hours)\n\nReal-Time Data Syncing (100 hours)\n\nResponsive Design and Accessibility (100 hours)\n\n**Total: 400 hours**\n\nFrontend developer average hourly rate - 45 ADA\n\n**$ADA 18000**\n\n**Milestone 4:Marketing and Promotions Enhancement for GameFi Revolution**\n\nMarketing: 8 months x 1000 ADA\n\n**$ADA 8000**\n\nGrand Total: **$ADA 82700**\n\nADA/$0,4 and hourly rates according [https://www\\.payscale\\.com/](https://www.payscale.com/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Walkers is evolving through active community involvement, where our members help shape the future of the project. We see Walkers expanding to other blockchains, with the main goal of driving mass adoption on Cardano.\n\nWe’re focused on providing real value for users while promoting Cardano’s widespread use. That’s why we’ve designed Walkers to be accessible, not just to those familiar with web3, but also to newcomers who may not have any prior experience with crypto too. Our app’s user-friendly design helps make this transition smooth and easy for everyone.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"GameFi","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1728}