{"pr_id":"019a9f7a-f7d1-7cf1-b758-5c138d873524","title":"[Spidex] AI-Powered Risk Analysis Tool for Cardano DeFi","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Lack of a comprehensive, easy-to-understand risk assessment tool makes Cardano DeFi users vulnerable to significant asset losses, and creates a gap to fill to protect and strengthen ecosystem trust.","solution":"Develop Spidex Sentinel – an AI-powered dashboard that provides comprehensive risk analysis across contracts, markets, and communities, delivering risk scores and early warnings for Cardano users.","proposer_name":"Alex","proposer_relevant_experience":"This proposal is part of a limited set of submissions by our team. For Fund 15, we are submitting a total of 02 proposals, ensuring each is unique, focused, and aligned with Cardano’s ecosystem growth.\n\n1. Project Management Team (Executive team)\n\n**Mr\\. Alex \\- Marketing Manager**\n\n- 5+ years driving growth for early-stage and scaling startups in tech and digital services.\n- Experienced in brand building, performance marketing, and growth hacking to rapidly acquire and retain users.\n- Skilled in digital channels (SEO, SEM, social media ads, content strategy) and community-led marketing to boost brand visibility.\n- Strong track record in product launch campaigns, turning MVPs into market-ready products with measurable traction.\n- Data-driven decision-maker, using analytics tools (Google Analytics, Meta Business Suite, HubSpot) to optimize CAC and LTV.\n- Comfortable working in lean teams, wearing multiple hats across brand, acquisition, and partnerships.\n- Passionate about creating brand narratives that resonate with tech-savvy, early-adopter audiences.\n- LinkedIn: [https://www\\.linkedin\\.com/in/phunguyen16072001/](https://www.linkedin.com/in/phunguyen16072001/)\n\n**Mr Marcus \\- Operations Manager**\n\n- 3+ years managing operations in fast-paced, high-growth startup environments.\n- Skilled in process design, workflow optimization, and scaling operations from small teams to nationwide reach.\n- Hands-on experience with project management (Jira, Trello, Notion) and lean operations to maximize efficiency with limited resources.\n- Strong background in vendor management, resource allocation, and cross-functional coordination between tech, product, and marketing.\n- Comfortable managing remote and hybrid teams, ensuring alignment and timely delivery in agile sprints.\n- Adept at setting up SOPs, tracking KPIs, and using real-time dashboards to monitor performance.\n- Driven by a builder’s mindset, solving bottlenecks quickly and enabling teams to scale without sacrificing quality.\n- LinkedIn: [https://www\\.linkedin\\.com/in/nguyen\\-thi\\-quynh\\-anh\\-0743b42b9/](https://www.linkedin.com/in/nguyen-thi-quynh-anh-0743b42b9/)\n\n**Mr\\. Simon \\- Graphic Designer**\n\n- Experienced in creative design, with 3+ years in blockchain branding.\n- Designed visual assets for 30+ Web3 events, including pitch decks, social media campaigns, and other marketing materials.\n- Telegram: @simonle1707\n- Behance: [https://www\\.behance\\.net/simonle1707](https://www.behance.net/simonle1707)\n\n**2\\. Product Development Team \\(Programming team\\)**\n\n**Mr\\. David \\- Project Manager**\n\n- Develops scalable backend systems using Go, Node.js, and JavaScript.\n- Bridges development and operations through DevOps practices and CI/CD automation.\n- Contributed to 5+ blockchain integration projects, enhancing data integrity and transparency.\n- Serves as mentor and team lead, onboarding and coaching junior engineers with a focus on code review, clean architecture, and agile delivery.\n- Passionate about emerging technologies, actively explores Go performance tuning, Kubernetes orchestration, and blockchain tooling to support clients in finance, retail, and healthcare sectors.\n- LinkedIn: [https://www\\.linkedin\\.com/in/xuantrong\\-vu/](https://www.linkedin.com/in/xuantrong-vu/)\n\n**Mr\\. Bevis \\- Blockchain Engineer**\n\n- 6+ years of experience in blockchain technology and backend development.\n- Senior-level expertise in Solidity, EVM, and various blockchain platforms.\n- Skilled in backend frameworks ExpressJS and NestJS.\n- Proficient with AWS services, microservices architecture, and Kubernetes for building robust, scalable solutions.\n- Strong technical background with a proven track record of delivering high-quality, reliable solutions.\n- Based in Hanoi, Vietnam, passionate about connecting with professionals and exploring opportunities in blockchain and backend development.\n- LinkedIn: [https://www\\.linkedin\\.com/in/bevis\\-thai\\-bao\\-hoang\\-83bb231bb](https://www.linkedin.com/in/bevis-thai-bao-hoang-83bb231bb)\n\n**Mr\\. Daniel \\- Product Manager**\n\n- 6+ years of experience delivering high-quality, scalable, and maintainable solutions.\n- Fullstack expertise: Golang, Node.js, React.js, Vue.js – from complex backend services to modern, responsive web apps.\n- Extensive cloud experience with AWS (AWS Certified Solutions Architect – Associate) and Google Cloud Platform (GCP).\n- Skilled in microservices architecture, Docker containerization, and Kubernetes (K8s) orchestration.\n- Combines a passion for clean code with a DevOps mindset, bridging development and operations for efficient, reliable systems.\n- Committed to continuous learning and collaborating with forward-thinking teams to create impactful solutions.\n- LinkedIn: [https://www\\.linkedin\\.com/in/trung\\-duy/](https://www.linkedin.com/in/trung-duy/)\n\n**Mr\\. Subete \\- AI Engineer**\n\n- Experienced in AI-powered solutions within fintech and blockchain domains, delivering scalable and secure systems.\n- Strong backend expertise with NestJS, PostgreSQL, MongoDB, Apache Kafka, and Redis.\n- Proven track record in team leadership, mentoring developers, and driving high-performance engineering teams.\n- Skilled in designing and optimizing data pipelines, event-driven architectures, and real-time transaction systems.\n- Adept at integrating AI models into fintech and blockchain platforms to enhance fraud detection, risk assessment, and user experience.\n- Currently serving as Backend Engineer at SOTATEK., JSC, contributing to mission-critical projects for global clients.\n- Passionate about bridging AI innovation with financial technology to create reliable, future-ready solutions.\n- LinkedIn: [https://github\\.com/xuantoan02](https://github.com/xuantoan02)\n\n**2\\. Advisor Team**\n\n**Mr\\. Long Nguyen – Founder &amp; CEO of Minswap**\n\n- Ex-Amazon software engineer\n- Built Minswap, Cardano’s #1 DEX by TVL, with fair-launch tokenomics.\n- Contributor to Jenkins, Kubernetes, Prometheus.\n- Oversaw security audits, mainnet launch, partnerships (e.g., SingularityNET).\n- Advocate for decentralization &amp; SPO support\n- Twitter: [https://x\\.com/longminswap](https://x.com/longminswap)\n\n**Mr\\. James \\- Founder of Sky3 Team**\n\n- 5+ years of experience in the blockchain industry\n- Founder and advisor for 10+ Web3 projects across DeFi, NFTs, and infrastructure\n- Twitter (X): [https://x\\.com/James\\_Sky3team](https://x.com/James_Sky3team)\n\n**Mr\\. Buck Nguyen \\- Admin of CASIA\\- Cardano Asia Team**\n\n- Founder of Cardano Asia Team:\n- Founder of Cardano Asia Tiktok Channel\n- Co-founder of Cardano4Good - NPOs fundraising platform\n- Co-founder of DRep TV Hub - Cardano Governance Hub to connect DRep &amp;lt;&amp;gt; delegators\n- Project Catalyst - the world’s largest decentralized innovation platform\n- Funded proposers since Fund 9-13\n- Various roles in the ecosystem (CR/MR/Challenge Team)\n- Cardano Governance:\n- DRep Pioneer training core -team\n- Constitution delegate of Vietnam 2024 (back-up)\n- Others:\n- Emurgo Academy Ambassador\n- Cardano Blockchain Certified Associate (CBCA)\n- Cardano long-term community builder (Cardano Eastern Asia- [CASIA]: Vietnam, Japan, Korea)\n- X: [https://x\\.com/asiacnft](https://x.com/asiacnft)\n\nTo ensure delivery capacity across multiple projects, additional external headcount will be recruited if this proposal is funded.","url":null,"funds":180000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"[Spidex] AI-Powered Risk Analysis Tool for Cardano DeFi","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Alex","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":180000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":7,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Lack of a comprehensive, easy-to-understand risk assessment tool makes Cardano DeFi users vulnerable to significant asset losses, and creates a gap to fill to protect and strengthen ecosystem trust.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Develop Spidex Sentinel – an AI-powered dashboard that provides comprehensive risk analysis across contracts, markets, and communities, delivering risk scores and early warnings for Cardano users.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://app.spidex.ag/","https://spidex.ag/","https://spidex-ai.gitbook.io/spidex-ai-docs","https://x.com/Spidex_ag","https://t.co/GmKMAEQLql"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Spidex Sentinel depends on multiple external sources, including Cardano node APIs, DEX APIs, data streams, and third-party AI services.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Spidex AI will release selected open-source components for community review and contribution, including: anonymized on-chain datasets, public technical documentation, and selected analysis tools.\n\nThe trained AI models, internal databases, and certain critical backend components will remain proprietary and closed to ensure security and prevent unauthorized exploitation.\n\nIn the future, we will consider publishing some additional components.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"AI","group":"Development & Tools"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Spidex Sentinel is the first AI-powered, multi-layer risk analysis dashboard dedicated to the Cardano DeFi ecosystem. Unlike existing tools that focus on isolated data sets or raw blockchain metrics, Sentinel combines:\n\n\n\n- AI-based Smart Contract Auditing for Plutus code\n- Market & Liquidity Risk\n- Community & Sentiment Intelligence\n\n\n\nThese layers are integrated into a single composite risk score and embedded directly into Spidex AI’s chatbot to receive actionable insights instantly - a leap forward in accessibility, depth, and real-time adaptability for Cardano DeFi participants.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The MVP will showcase a fully functional Spidex Sentinel integrated into the Spidex AI app includes:\n\n\n\n- AI trained on Plutus code to detect vulnerabilities and check mint/honeypot risks.\n- Assesses liquidity, holder,... (this feature already exists in Spidex AI and will be enhanced for greater accuracy and effectiveness).\n- NLP scans X and Telegram to detect narratives, track Attention Index, evaluate KOLs, and identify bots/FUD.\n\n\n\nCurrently, Spidex AI core chatbot and data processing pipeline are operational. The Sentinel risk analysis tool planned for the first step.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"- Users: Reach 50+ tester engaging with the Sentinel feature within 3 months of launch.\n- Queries: Process at least 500+ risk analysis requests via chatbot in the first quarter.\n- Coverage: Automatically scan at least 50% of newly created tokens on Cardano within 24 hours of deployment.\n- Accuracy: Achieve accuracy in identifying high-risk tokens compared to independent audit reports.\n- Ecosystem impact: Significantly reduce the number of rug pulls or exploits among tokens flagged by Sentinel.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**A\\. PROBLEM**\n\nWe have identified three key issues that are directly impacting the user experience and safety in Cardano DeFi:\n\n**1/ Liquidity and capital on the Cardano network are declining faster than the market average**\n\nAccording to Messari’s Q1/2025 report, Cardano’s TVL dropped by 29% compared to the previous quarter, down to $319.3 million, while the average decline across the DeFi market was 26%.\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-16_231519.png)\n\n[\\(Source: Messari\\) Cardano TVL Chart – Q1/2025](https://messari.io/report/state-of-cardano-q1-2025)\n\n**Impact**: The TVL decline exceeding the market average indicates that Cardano is facing stronger capital outflows, leading to higher liquidity risks, greater price volatility, increased susceptibility to manipulation even with small trading volumes, and a heightened risk of large-scale sell-offs.\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-16_231154.png)\n\n[\\(Source: Messari\\) Cardano Metrics Overview](https://messari.io/report/state-of-cardano-q1-2025)\n\n**2/ Investors are shifting towards high\\-risk trading without adequate analytical tools**\n\nDaily trading volume on Cardano DEXs rose from 7% in 2024 to 39% of the total market in June 2025. Notably, a large portion of this activity is concentrated in highly volatile memecoins.\n\n![](https://coingape.com/wp-content/uploads/2025/06/DEX-CEX-1.jpeg)\n\n[\\(Source: Congape\\) DEX Volume Growth Chart](https://coingape.com/brandtalk/research/crypto-market-reverses-q1-decline-with-19-gain-bitcoin-outpaces-gold-coingape-q2-2025-report/)\n\n**Impact**: Investors face greater risks from highly volatile tokens, yet current tools do not provide sufficient actionable insights, early warnings, or in-depth analysis to help protect capital.\n\n**3/ Difficulty in tracking community, media, and social behavior signals quickly and effectively**\n\nDeFi-related information on platforms like X, Telegram, and community forums is often chaotic, containing shilling, FUD, and misinformation, making it easy for investors to be manipulated.\n\n(Source: [SSRN](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5144847))\n\n**Impact**: urrent analytics in the Cardano ecosystem are unable to automatically detect emerging trends, measure attention, assess KOL credibility, or cover a broad range of datasets/assets. This creates information asymmetry, putting retail investors at a disadvantage compared to early trend adopters.\n\n**B\\. SOLUTION: Spidex Sentinel \\- AI\\-Powered Risk Analysis Tool for Cardano DeFi**\n\n![](https://file.hstatic.net/200001051317/file/sentiment.jpg)\n\nTo address these challenges, we propose** Spidex Sentinel – a comprehensive risk analytics dashboard integrated directly into the Spidex AI application**, built on three core analytical pillars:\n\n![](https://file.hstatic.net/200001051317/file/social_post_-_79__1_.webp)\n\n**1/ Smart Contract Analysis \\(AI\\-powered Audit\\)**\n\nWe will develop AI auditing capabilities trained specifically on Plutus code (leveraging OpenAI, Llama, Claude), enabling the system to analyze complex contract structures and automatically detect patterns linked to common vulnerabilities.\n\n- **Plutus Contract Scan:** Automatically detect known security vulnerabilities and exploitable functions.\n- **Mint Policy &amp; Honeypot Analysis: **Verify whether the token mint policy is locked to prevent uncontrolled inflation and detect potential honeypots.\n\n**2/ Market &amp; Liquidity Risk Analysis**\n\nThis module evaluates the financial stability of a token. It extends Spidex AI’s existing capabilities, enhancing precision and early-warning functions for investors.\n\n- **Liquidity Analysis: **Check liquidity lock status and duration.\n- **Holder Concentration Analysis:** Flag tokens where a small number of wallets hold a large share of supply, increasing the risk of price manipulation.\n- **Dump Risk Radar:** Assess unrealized profits of traders to predict selling pressure.\n\n**3/ Community &amp; Social Risk Analysis**\n\nThis is our key differentiator. We will deploy advanced Natural Language Processing (NLP) models to scan platforms like X, Telegram, and Cardano community forums via key APIs to extract relevant keywords and analyze thousands of discussions to:\n\n- **Story Detection:** Identify emerging narratives or unsustainable hype campaigns (shilling).\n- **Attention Index: **Track mention frequency and sentiment (positive/negative) across social channels.\n- **KOL Evaluation: **Automatically identify KOLs discussing the token and assess their credibility based on historical performance, while also detecting sudden spikes in bot activity or FUD campaigns.\n\n**C\\. Demo &amp; How It Works**\n\n_Step 1 — Ask_\n\nThe user searches for a token on the Spidex Chatbot using natural language: “How does Spidex Sentinel evaluate token X?”\n\n_Step 2 — Analyze \\(3 Layers\\)_\n\n- Layer 1 · AI Smart Contract Audit (Plutus)\n- Layer 2 · Market &amp; Liquidity Risk\n- Layer 3 · Community &amp; Social Risk (NLP)\n\n_Step 3 — Output_\n\nThe AI responds in natural language with a consolidated risk score (1–100, color-coded &amp; Positive / Neutral / Negative label), and a detailed report including explanations and visual evidence.\n\n![](https://file.hstatic.net/200001051317/file/social_post_-_82__1_.jpg)\n\nThrough this approach, Spidex Sentinel directly addresses the problems of information asymmetry and risk in DeFi, delivering Cardano users a fully evaluated, automated, easy-to-understand, and seamless information experience within Spidex AI.\n\n**C\\. IMPLEMENTATION ROADMAP**\n\n**1/ Master Plan**\n\nTo ensure effective execution, we have defined four main phases for the project:\n\nWithin the scope of this proposal, we will focus from Milestone 1 (Details please view in the Implementation Plan).\n\nWe will maintain a detailed 7-month Master Plan, with all milestones aligned to this timeline.\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-16_115453.png)\n\n[\\(More Details: Master Plan\\)](https://docs.google.com/spreadsheets/d/1BWTgIO20jLbNxxXdRlqH7WmqXloZSr8JTisotJXsTS4/edit?gid=1573645900#gid=1573645900)\n\nThis Master Timeline will serve as the primary reference for tracking progress, ensuring that every workstream from product development and AI model training to marketing campaigns and evaluatio, remains on track and fully synchronized.\n\n**2/ Statement of Milestones \\(SOM\\) Preparation**\n\nIn alignment with Catalyst Fund 15 guidelines, our Statement of Milestones (SOM) is prepared in advance, with input and support from Cardano Ambassador Mrs Ha. This approach ensures:\n\n- **Transparency &amp; Clarity** – The plan is fully aligned with Catalyst standards, making our project roadmap clear and traceable for all stakeholders.\n- **Ease of Review** – Community Reviewers (CR) can quickly assess the deliverables, timelines, and budget allocation for each milestone.\n- **Performance Assurance** – Our projected completion percentage for each milestone consistently exceeds the corresponding budget percentage, demonstrating delivery efficiency and accountability.\n\n[\\(More Details: SOM\\)](https://docs.google.com/spreadsheets/d/1BWTgIO20jLbNxxXdRlqH7WmqXloZSr8JTisotJXsTS4/edit?gid=2143973706#gid=2143973706)\n\nFurthermore, our final milestone meets the Catalyst minimum threshold of 15% of total project scope, achieving 20%, which provides additional assurance of sustained delivery until project close-out.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**A\\. Quick Comparison**\n\n![](https://file.hstatic.net/200001051317/file/quick_comarision_cf324ea5619642e380b53f2ac0be2f7a.webp)\n\nCurrently, monitoring tools such as Xerberus support Cardano but remain focused on basic analytics and have not yet integrated AI for automated risk assessment. Meanwhile, tools on BSC such as Dexcheck.AI provide advanced risk analysis but do not serve the Cardano community, creating a gap that Spidex Sentinel is designed to fill.\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-16_093309.png)\n\n[Table: Quick Comparison – Current Tools vs\\. Spidex Sentinel \\(SWOT\\)](https://docs.google.com/spreadsheets/d/1BWTgIO20jLbNxxXdRlqH7WmqXloZSr8JTisotJXsTS4/edit?gid=1097186309#gid=1097186309)\n\nCompared to existing tools, Spidex Sentinel is the pioneering solution for Cardano, integrating AI to detect risks quickly, providing reliable data, and enabling users to make smarter investment decisions.\n\n**B\\. IMPACT**\n\nSpidex Sentinel will generate measurable and positive impact across the Cardano ecosystem, aligning with the core evaluation criteria of Catalyst.\n\n- **For users**: Minimize capital loss from scams/honeypots and enhance the ability to self-assess before trading.\n- **For the Cardano ecosystem:** Improve DeFi trust and safety, attract new users, reduce scam incidents that damage Cardano’s reputation, and potentially increase Total Value Locked (TVL).\n- **For developers:** By open-sourcing the core models, we provide a valuable resource for other DApp builders on Cardano, enabling them to integrate or build on our technology to strengthen the security of their own applications.\n\n**C\\. Projected Quantitative Impact Metrics**\n\n1/ Coverage &amp; Technical Performance\n\n- Sentinel is expected to automatically scan at least 50% of new Cardano tokens within 24 hours of creation.\n- Sentinel’s AI model is projected to achieve accuracy in classifying risky vs. safe tokens after the training phase.\n\n2/ Ecosystem Risk Reduction\n\n- Reduce approximately 20% of scam tokens in Cardano DeFi during the first year through fast scanning and automated risk analysis.\n\n3/ Adoption &amp; User Growth\n\n- Increase 3% in active DeFi users within six months due to enhanced trust and transparent decision-support tools.\n- Generate chatbot risk analysis queries per month.\n- Achieve 80% positive feedback rating from users on tool usefulness and reliability.\n\n4/ Ecosystem Impact (Cardano-wide)\n\n- Contribute to a increase in Cardano TVL in the first year by reinforcing user confidence.\n- Result sharing: Publish monthly aggregated data and public risk reports for the Cardano community.\n\n**D\\. Sentinel Demo**\n\nAs Sentinel’s features are not yet live, we will showcase both a demo version of Spidex Sentinel and reference data from Dexcheck.AI on BSC to illustrate how AI can detect risky tokens, issue alerts, and support safer decision-making. This demonstrates the real-world impact Sentinel can bring to the Cardano ecosystem.\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-16_083955.png)\n\n_Demo: Spidex Sentinel \\(current mockup\\)_\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-16_092525.png)\n\n_Illustration: Dexcheck\\.AI on BSC_","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"The Spidex AI team possesses the full range of skills and expertise required to execute the project effectively.\n\n**1/ Strengths &amp; Professional Expertise**\n\n- AI &amp; Machine Learning: Proficient in building AI models based on existing AI frameworks such as OpenAI, Lama, GPT, and Grok X to analyze smart contract code structures and develop anomaly detection models for on-chain data.\n- Blockchain Development: Experienced in collecting and processing real-time data from the Cardano blockchain through features already integrated into Spidex AI, such as liquidity analysis, top holders, token distribution, and transaction behavior.\n- DeFi Product Development: Successfully deployed the Spidex AI On-chain Analysis Chatbot, demonstrating the capability to combine AI technology with products that directly serve Cardano users.\n\n**2/ Team Members**\n\n- AI Engineers: 5+ years of experience in training GNN, anomaly detection, and NLP models.\n- Blockchain Developers: 4+ years of experience developing dApps and integrating Cardano data.\n- Project Managers: 8+ years of experience coordinating technology and AI product development projects.\n- Marketing Managers: 4+ years of experience in blockchain marketing, collaborating with industry KOLs, and managing blockchain project communities.\n- Product Managers: 6+ years of experience in managing tech products, creating roadmaps, and coordinating technical teams.\n- Operations Managers: 5+ years of experience in running technology projects, optimizing processes, and managing resources.\n- Graphic Designers: 4+ years in creating branding, UI/UX, and marketing visuals for blockchain, AI and technology products.\n\n**3/ Transparent Management Process**\n\n- Clear Accountability: The Project Manager oversees overall coordination, the Lead Engineer supervises code and AI model quality, and Data Specialists ensure data accuracy.\n- Monitoring Process: Each milestone includes progress reports, test results, and proof of completion before moving to the next phase.\n- Public Reporting: Monthly updates will be shared with the Catalyst community, including progress reports, test results, and transparent budget usage by category.\n\n**4/ Risk &amp; Mitigation Plan**\n\nTo ensure the successful development and deployment of Spidex Sentinel on the Cardano network, we have identified key technical and operational risks along with clear mitigation and backup strategies. The following Risk &amp; Mitigation Plan outlines how we will proactively manage these challenges.\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-17_141029.png)\n\n[\\(More Details: Risk &amp; Mitigration Plan\\)](https://docs.google.com/spreadsheets/d/1BWTgIO20jLbNxxXdRlqH7WmqXloZSr8JTisotJXsTS4/edit?gid=1438603406#gid=1438603406)\n\nWe are committed to delivering Spidex Sentinel on time, with high quality, and with real value for the Cardano community. This confidence comes from strong technical expertise, an experienced team, and a transparent development process. In addition, the system is designed with contingency measures and redundancy across data sources, nodes, and AI models, ensuring resilience and reliability under real-world conditions. As a result, Spidex Sentinel minimizes downtime, preserves data integrity, and strengthens long-term trust within the ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Data Collection & AI Model Training","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Core Dataset\n\n\t(1) Labeled dataset of Plutus smart contracts categorized as Positive / Neutral / Negative based on security and risk levels.\n\n\t(2) Dataset of Cardano tokens including on-chain metrics (liquidity, volume, holders, age, TVL, market cap).\n\n\t(3) Sentiment dataset from Twitter/Telegram posts about tokens, with trustworthiness labels.\n\n- UI/UX design created in Figma.\n- Feature Description Table detailing all platform features.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Dataset includes at least 500 Plutus contract samples, 100 Cardano tokens with complete on-chain metrics, and 300 labeled social media posts.\n- UI/UX design approved internally.\n- Feature Description Table finalized and aligned with the approved UI/UX design.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public link to datasets (CSV/XLSX) on Spidex AI Sheets.\n- Figma design link accessible to reviewers (read-only mode).\n- PDF of Feature Description Table uploaded to Spidex AI Docs","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":54000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Marketing Campaign & Public Beta Launch","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Feature Release Notes describing new features, test scope, and user instructions.\n- Marketing materials including social media posts, demo videos, banners, and infographics.\n- Public Beta launch on app.spidex.ag.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Release Notes are published on official channels (X, Discord, website).\n- Marketing campaign is deployed across at least 2 channels (X, Discord,...) reaching a minimum of 5,000+ impressions with an engagement rate ≥ 5%.\n- Public Beta maintains ≥ 99% uptime for 2 consecutive week.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Screenshot/PDF of Release Notes published on official channels.\n- Marketing report (PDF) with list of channels, reach, and engagement metrics.\n- Public Beta demo video.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":54000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Platform Evaluation & Improvement","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Public Launch of Spidex Sentinel v1.0 on app.spidex.ag, including at least 3 core features:    \n\n\t(1) AI-powered Smart Contract Audit\n\n\t(2) Market &amp; Liquidity Risk Analysis\n\n\t (3) Community &amp; Social Risk Analysis\n\n- User Feedback Report\n- Improvement Plan v1.1: roadmap document updated based on usage data and feedback.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Official public launch of Spidex Sentinel v1.0 on app.spidex.ag.\n- Collection and analysis of ≥50  user feedback entries.\n- Improvement Plan v1 .1 finalized and published publicly on Spidex AI Docs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public link to app.spidex.ag with v1.0 release.\n- PDF report of user feedback (50+ entries).\n- Improvement Plan v1.1 published on Spidex AI Docs.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":36000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Close-out & Handover","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Final Close-out Report (PDF) including:\n\n\n\n  + Achievements compared to KPI targets,\n\n\n\n  + 3-month post-launch Risk Analysis Report,\n\n\n\n  + Impact evaluation on the Cardano community,\n\n\n\n  + Proposals for next development phase (v2.0).\n\n- Project Close-out Video (5-10 minutes): introduction, feature demo, results, and v2.0 roadmap.\n- Public Repository: all project documentation (docs, reports, related source code) published on Spidex AI Docs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Report and video published on the official X account @Spidex_ag and Spidex AI Docs.\n- 3-month post-launch risk analysis report published publicly with at least 2 real case studies.\n- All previous milestones completed and accepted at 100%.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- YouTube link to the project close-out video (5–10 minutes).\n- PDF link to the Final Close-out Report (including 3-month Risk Analysis Report).\n- Public repo/documentation fully accessible on Spidex AI Docs.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":36000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"This proposal is part of a limited set of submissions by our team. For Fund 15, we are submitting a total of 02 proposals, ensuring each is unique, focused, and aligned with Cardano’s ecosystem growth.\n\n1. Project Management Team (Executive team)\n\n**Mr\\. Alex \\- Marketing Manager**\n\n- 5+ years driving growth for early-stage and scaling startups in tech and digital services.\n- Experienced in brand building, performance marketing, and growth hacking to rapidly acquire and retain users.\n- Skilled in digital channels (SEO, SEM, social media ads, content strategy) and community-led marketing to boost brand visibility.\n- Strong track record in product launch campaigns, turning MVPs into market-ready products with measurable traction.\n- Data-driven decision-maker, using analytics tools (Google Analytics, Meta Business Suite, HubSpot) to optimize CAC and LTV.\n- Comfortable working in lean teams, wearing multiple hats across brand, acquisition, and partnerships.\n- Passionate about creating brand narratives that resonate with tech-savvy, early-adopter audiences.\n- LinkedIn: [https://www\\.linkedin\\.com/in/phunguyen16072001/](https://www.linkedin.com/in/phunguyen16072001/)\n\n**Mr Marcus \\- Operations Manager**\n\n- 3+ years managing operations in fast-paced, high-growth startup environments.\n- Skilled in process design, workflow optimization, and scaling operations from small teams to nationwide reach.\n- Hands-on experience with project management (Jira, Trello, Notion) and lean operations to maximize efficiency with limited resources.\n- Strong background in vendor management, resource allocation, and cross-functional coordination between tech, product, and marketing.\n- Comfortable managing remote and hybrid teams, ensuring alignment and timely delivery in agile sprints.\n- Adept at setting up SOPs, tracking KPIs, and using real-time dashboards to monitor performance.\n- Driven by a builder’s mindset, solving bottlenecks quickly and enabling teams to scale without sacrificing quality.\n- LinkedIn: [https://www\\.linkedin\\.com/in/nguyen\\-thi\\-quynh\\-anh\\-0743b42b9/](https://www.linkedin.com/in/nguyen-thi-quynh-anh-0743b42b9/)\n\n**Mr\\. Simon \\- Graphic Designer**\n\n- Experienced in creative design, with 3+ years in blockchain branding.\n- Designed visual assets for 30+ Web3 events, including pitch decks, social media campaigns, and other marketing materials.\n- Telegram: @simonle1707\n- Behance: [https://www\\.behance\\.net/simonle1707](https://www.behance.net/simonle1707)\n\n**2\\. Product Development Team \\(Programming team\\)**\n\n**Mr\\. David \\- Project Manager**\n\n- Develops scalable backend systems using Go, Node.js, and JavaScript.\n- Bridges development and operations through DevOps practices and CI/CD automation.\n- Contributed to 5+ blockchain integration projects, enhancing data integrity and transparency.\n- Serves as mentor and team lead, onboarding and coaching junior engineers with a focus on code review, clean architecture, and agile delivery.\n- Passionate about emerging technologies, actively explores Go performance tuning, Kubernetes orchestration, and blockchain tooling to support clients in finance, retail, and healthcare sectors.\n- LinkedIn: [https://www\\.linkedin\\.com/in/xuantrong\\-vu/](https://www.linkedin.com/in/xuantrong-vu/)\n\n**Mr\\. Bevis \\- Blockchain Engineer**\n\n- 6+ years of experience in blockchain technology and backend development.\n- Senior-level expertise in Solidity, EVM, and various blockchain platforms.\n- Skilled in backend frameworks ExpressJS and NestJS.\n- Proficient with AWS services, microservices architecture, and Kubernetes for building robust, scalable solutions.\n- Strong technical background with a proven track record of delivering high-quality, reliable solutions.\n- Based in Hanoi, Vietnam, passionate about connecting with professionals and exploring opportunities in blockchain and backend development.\n- LinkedIn: [https://www\\.linkedin\\.com/in/bevis\\-thai\\-bao\\-hoang\\-83bb231bb](https://www.linkedin.com/in/bevis-thai-bao-hoang-83bb231bb)\n\n**Mr\\. Daniel \\- Product Manager**\n\n- 6+ years of experience delivering high-quality, scalable, and maintainable solutions.\n- Fullstack expertise: Golang, Node.js, React.js, Vue.js – from complex backend services to modern, responsive web apps.\n- Extensive cloud experience with AWS (AWS Certified Solutions Architect – Associate) and Google Cloud Platform (GCP).\n- Skilled in microservices architecture, Docker containerization, and Kubernetes (K8s) orchestration.\n- Combines a passion for clean code with a DevOps mindset, bridging development and operations for efficient, reliable systems.\n- Committed to continuous learning and collaborating with forward-thinking teams to create impactful solutions.\n- LinkedIn: [https://www\\.linkedin\\.com/in/trung\\-duy/](https://www.linkedin.com/in/trung-duy/)\n\n**Mr\\. Subete \\- AI Engineer**\n\n- Experienced in AI-powered solutions within fintech and blockchain domains, delivering scalable and secure systems.\n- Strong backend expertise with NestJS, PostgreSQL, MongoDB, Apache Kafka, and Redis.\n- Proven track record in team leadership, mentoring developers, and driving high-performance engineering teams.\n- Skilled in designing and optimizing data pipelines, event-driven architectures, and real-time transaction systems.\n- Adept at integrating AI models into fintech and blockchain platforms to enhance fraud detection, risk assessment, and user experience.\n- Currently serving as Backend Engineer at SOTATEK., JSC, contributing to mission-critical projects for global clients.\n- Passionate about bridging AI innovation with financial technology to create reliable, future-ready solutions.\n- LinkedIn: [https://github\\.com/xuantoan02](https://github.com/xuantoan02)\n\n**2\\. Advisor Team**\n\n**Mr\\. Long Nguyen – Founder &amp; CEO of Minswap**\n\n- Ex-Amazon software engineer\n- Built Minswap, Cardano’s #1 DEX by TVL, with fair-launch tokenomics.\n- Contributor to Jenkins, Kubernetes, Prometheus.\n- Oversaw security audits, mainnet launch, partnerships (e.g., SingularityNET).\n- Advocate for decentralization &amp; SPO support\n- Twitter: [https://x\\.com/longminswap](https://x.com/longminswap)\n\n**Mr\\. James \\- Founder of Sky3 Team**\n\n- 5+ years of experience in the blockchain industry\n- Founder and advisor for 10+ Web3 projects across DeFi, NFTs, and infrastructure\n- Twitter (X): [https://x\\.com/James\\_Sky3team](https://x.com/James_Sky3team)\n\n**Mr\\. Buck Nguyen \\- Admin of CASIA\\- Cardano Asia Team**\n\n- Founder of Cardano Asia Team:\n- Founder of Cardano Asia Tiktok Channel\n- Co-founder of Cardano4Good - NPOs fundraising platform\n- Co-founder of DRep TV Hub - Cardano Governance Hub to connect DRep &amp;lt;&amp;gt; delegators\n- Project Catalyst - the world’s largest decentralized innovation platform\n- Funded proposers since Fund 9-13\n- Various roles in the ecosystem (CR/MR/Challenge Team)\n- Cardano Governance:\n- DRep Pioneer training core -team\n- Constitution delegate of Vietnam 2024 (back-up)\n- Others:\n- Emurgo Academy Ambassador\n- Cardano Blockchain Certified Associate (CBCA)\n- Cardano long-term community builder (Cardano Eastern Asia- [CASIA]: Vietnam, Japan, Korea)\n- X: [https://x\\.com/asiacnft](https://x.com/asiacnft)\n\nTo ensure delivery capacity across multiple projects, additional external headcount will be recruited if this proposal is funded.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Total budget proposed in this proposal: 180,000 ADA (2% risk management of over total budget)\n\n![](https://cdn.hstatic.net/files/200001096506/file/e44d2f70-0cee-46a1-8dd5-dd72e60ea776.jpg)\n\n(More Details: [Budget Caculation\\)](https://docs.google.com/spreadsheets/d/1BWTgIO20jLbNxxXdRlqH7WmqXloZSr8JTisotJXsTS4/edit?gid=1753890959#gid=1753890959)\n\n**1\\.Budget allocation**\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-15_104606.png)\n\n(More Details:Budget Allocation)\n\n- 50% for product development\n- 30% for marketing activity\n- 18% for personnel expense.\n- 2% for Risk management\n\n**2\\. Personnel expenses**\n\nWith the desire to have the opportunity to contribute to supporting Cardano, Catalyst to grow stronger, we will strive to work with a salary 14-57% lower than the average salary in the market. (please see salary benchmarking below)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The cost of the Spidex Sentinel project is considered reasonable and cost-effective when compared both to local engineering salaries and to similar AI audit projects on other blockchains:\n\n1. Salary Benchmarking in the local country\n\nWe keep 14%-57% savings on personnel cost for the team member's hourly rate\n\n![](https://file.hstatic.net/200001051317/file/screenshot_2025-08-15_104128.png)\n\n[\\(More Details: Salary benchmarking\\)](https://docs.google.com/spreadsheets/d/1BWTgIO20jLbNxxXdRlqH7WmqXloZSr8JTisotJXsTS4/edit?gid=2036657352#gid=2036657352)\n\n\n\n**Overview**\n\n- Our budget Allocation mainly focused on Product development (50%), Marketing Activity Expense (30%)\n- Consider the team allocation at different levels of the project org chart\n- Cardano Ecosystem is an emerging industry, and we need to have the proper induction and training for the new members.\n- Risk management (2%)\n\nThis proposal brings exceptional value to the Cardano treasury. We are not only building a feature for a single application, but also creating a fundamental public good that enhances security for the entire DeFi ecosystem.\n\n- High ROI for the Community: This investment has the potential to prevent millions of ADA in losses for users by helping them avoid scam projects. The return on investment, in terms of protecting community assets, is substantial.\n- Driving Sustainable Growth: By making DeFi safer, we help attract and retain new users, contributing to the long-term and sustainable growth of Cardano, benefiting all ADA holders.\n- Cost Efficiency: We are building on top of the existing Spidex AI infrastructure, which significantly reduces costs and development time compared to starting from scratch. The requested budget is reasonable and primarily focused on the technical expertise needed to build complex AI models.\n\nInvesting in Spidex Sentinel is not just an investment in a product, but an investment in the trust, security, and reputation of the entire Cardano ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"AI","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1730}