{"pr_id":"019ac030-5fac-7b02-897e-012d6ad3a830","title":"Walkers - WAirdrops: One platform, endless drops ","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"The first tool that lets you launch social-task airdrop campaigns and instantly distribute ADA, NFTs, tokens, and multitoken baskets to unlimited wallets, unlimited supplies, and unlimited users","solution":"A tool that lets creators run scalable social task airdrops, distributing ADA, NFTs, and tokens to unlimited users with zero setup complexity.","proposer_name":"Ivana Zafirovski","proposer_relevant_experience":"Ivana Zafirovski - Founder of Walkers\n\n[https://x\\.com/Ivanaarch](https://x.com/Ivanaarch)\n\n[https://www\\.linkedin\\.com/feed/](https://www.linkedin.com/feed/)\n\nCoordinating the team and making sure our community get the best out of the project. Apart from user benefits and coordination of all activities, she is the designer of all social media content. Master degree Architect by proffesion\n\nRuben Duarte - Head of Marketing and Growth\n\n[https://x\\.com/RuduarteD](https://x.com/RuduarteD)\n\n[https://www\\.linkedin\\.com/in/ruben\\-duarte\\-8a71314a/](https://www.linkedin.com/in/ruben-duarte-8a71314a/)\n\nHe is passionate about web3, with over 10 years of experience in partnerships, marketing ideas and project management. His experience is related to IT and he have worked in some government and banking companies and important multinationals\n\nAndré Morais - Software engineer\n\n[https://x\\.com/andrefmmorais](https://x.com/andrefmmorais)\n\n[https://www\\.linkedin\\.com/in/andre\\-moniz\\-morais/](https://www.linkedin.com/in/andre-moniz-morais/)\n\nSoftware engineer with a master’s in Computer Science and a passion for creating high-quality software. As a startup founder, he enjoys turning ideas into reality. When he's not coding, he enjoys fitness, cooking, and writing—always driven by the desire to build and create.\n\nOlie Merza - Lead Artist\n\n[https://x\\.com/OlieMerza](https://x.com/OlieMerza)\n\nOlie is a graphic designer and illustrator from the Philippines. He has more than a decade of experience working in the garments industry focusing on printed graphics. His works were featured in various exhibits both in his country and abroad.\n\nKarlo Kelecic - Artist\n\nConcept artist/Illustrator. Currently freelancing on projects, worked in startups, founded startups and ran his own agencies. He have experience in art development as a generalist. Focused on digital painting, 2D illustration, Houdini for procedural animation, environments 3D and VFX.\n\nKey skills: Procreate, Photoshop, Houdini, After Effects, Illustrator and Vectonator. Studied applied arts and design, philosophy and art academy in Zagreb. Started to work as junior designer in 2009. Created his own workshops about comic books, concept art and VR.\n\nBojan Mitevski - UX/UI and Motion Graphics\n\n[https://www\\.bojanmitevski\\.com/](https://www.bojanmitevski.com/)\n\nZealous visual designer who freelances for clients worldwide and specializes in UI/UX, websites, mobile apps, and motion graphics design. He is passionate about working on creative designs, overcoming challenges, and solving real users' problems that help companies scale.\n\nDiogo Menezes - 3D Designer -\n\n[https://x\\.com/\\_\\_SEZENEM](https://x.com/__SEZENEM)\n\nInterior and product designer who worked with some of the best Architecture offices in Portugal with almost 10 years in the business. Currently working with Architects and designers, Menezes uses 3D software to create and develop what was once in the paper, usually working with Archviz and product visualization.\n\nUnlimited Solutions - Main Developers &amp; Architects\n\nNoma Tokenomics - Tokenomics,Economy creation and Audit - [https://noma\\.pro/](https://noma.pro/)\n\nMotionalley studio - Branded animations and illustrations - [https://www\\.motionallystudio\\.com/](https://www.motionallystudio.com/)\n\nAbhiwan - Mobile app developers - [https://www\\.abhiwan\\.com/](https://www.abhiwan.com/)\n\nYepple Ink - Blockchain developments and services","url":null,"funds":93600,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Walkers - WAirdrops: One platform, endless drops ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Ivana Zafirovski","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":93600,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":8,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"The first tool that lets you launch social-task airdrop campaigns and instantly distribute ADA, NFTs, tokens, and multitoken baskets to unlimited wallets, unlimited supplies, and unlimited users","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A tool that lets creators run scalable social task airdrops, distributing ADA, NFTs, and tokens to unlimited users with zero setup complexity.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://wairdrops.xyz/","https://www.walkerscardano.xyz/","https://play.google.com/store/apps/details?id=com.walkers.walkerscnft&pli=1","https://apps.apple.com/mk/app/walkerscnft/id6450308902","https://github.com/WalkersApp"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"We recognize the value of transparency and collaboration that open source projects bring. However, certain parts of our code provide essential advantages that we need to protect as part of our core technology. \nAll Walkers platforms, tools, app, and technologies are protected under the Walkers Proprietary IP License. ","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Community","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"**WAirdrops** is already a live, actively used tool that continues to gain traction among Cardano founders and creators. \n\n[https://wairdrops\\.xyz/](https://wairdrops.xyz/)\n\nWe originally built it to solve a problem inside the Walkers App: distributing monthly rewards to over 1,000 wallets while covering expensive distribution fees. These fees force many creators to limit or delay rewards, shorten campaign periods, or reduce engagement. This is why most projects distribute rewards **quarterly or even bi\\-yearly**—to avoid the high cost of large-volume transactions.\n\nWAirdrops removes these constraints entirely. It is the first completely **free** Cardano tool that enables creators to launch **ADA, NFT, and CNT airdrop campaigns** to unlimited wallets with unlimited supplies and zero fees. This allows founders to redirect resources back into development, product growth, and community building, instead of spending funds on distribution overhead.\n\nWith the proposed upgrade, creators gain the ability to run **fully automated social\\-task campaigns \\(Twitter/X, Discord\\)** directly from the dashboard. Participants complete tasks, earn badges, collect points and XP, and progress through leaderboards ending with automatic distribution through the claim portal.\n\nThis upgrade also introduces **multitoken baskets**, allowing creators to airdrop multiple tokens, NFTs, and assets in a **single unified claim**. This significantly increases distribution flexibility and allows more creative reward structures, cross-project collaborations, and package-style airdrops that were not possible before.\n\n**What makes WAirdrops truly innovative and unmatched on Cardano:**\n\n- It transforms airdrops into gamified marketing systems, boosting user engagement, holder growth, and viral participation.\n- It enables massive high-frequency airdrops, unlocking thousands of microtransactions per campaign—activity that projects previously avoided because of fees.By removing costs entirely, it encourages creators to drop rewards weekly or even daily, dramatically increasing on-chain microtransaction volume.\n- It supports ADA, CNTs, NFTs, and now multitoken baskets, all from one simple dashboard—something no other tool on Cardano offers.\n- It provides instant access to a verified, active user base, including more than 2,000 daily Walkers App users, ensuring immediate adoption.\n- It unifies social tasks, quests, badges, XP, leaderboards, and distribution, creating a full end-to-end campaign environment unlike any existing airdrop tool.It empowers founders to run unlimited, scalable airdrops that encourage long-term user engagement rather than one-off drops.\n\n\n\nNo existing Cardano product combines free, unlimited multi-asset airdrops, social task automation, gamification, multitoken baskets, and high-volume microtransaction generation inside a single platform. WAirdrops opens a new pathway for ecosystem growth, creator freedom, and continuous on-chain activity that has never existed before.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"A **fully functional MVP** already proves the concept. WAirdrops removes the barriers that prevent creators from executing regular airdrops, increases on-chain activity through frequent microtransactions, and eliminates delays in distributing rewards.\n\nThe MVP is live and available here: [https://wairdrops\\.xyz/](https://wairdrops.xyz/)\n\nWAirdrops is currently an open platform that anyone can use. Since launch, multiple airdrops have been successfully completed, and its usage continues to grow. Creators are already using it to distribute ADA, CNTs, and NFTs with a simple and intuitive setup process.\n\nSetting up an airdrop is straightforward: creators can upload WL wallets or add them manually, attach the original asset image via policy ID, and set start and end dates. All distribution history is stored for full transparency, and any unclaimed tokens can be withdrawn by creators once the campaign ends.\n\n[https://drive\\.google\\.com/file/d/1T2OtlRz85zQr0HeKHj7tKVmxmFTk\\_MSB/view?usp=sharing](https://drive.google.com/file/d/1T2OtlRz85zQr0HeKHj7tKVmxmFTk_MSB/view?usp=sharing)\n\n[https://drive\\.google\\.com/file/d/1qPwh5k2YH0YYUWvRf8orpj8u48dclcXE/view?usp=sharing](https://drive.google.com/file/d/1qPwh5k2YH0YYUWvRf8orpj8u48dclcXE/view?usp=sharing)\n\nWith this proposed upgrade, we will also integrate token basket distributions, allowing creators to drop multiple assets in a single campaign.\n\nFor users, the experience is effortless. When they connect their wallet, they can instantly see all active airdrops and supplies they are eligible for. This makes participation simple, clear, and rewarding.\n\n**Walkers is already powering airdrop campaigns** for many projects ahead of their presales, NFT mints, or major announcements. Through these campaigns we promote partner projects to the entire Walkers user base while onboarding new users into the Walkers ecosystem. \n\n[https://drive\\.google\\.com/file/d/1vH76oMcW8BY8Pv7ZN4e91ZlQo8FxLdqT/view?usp=sharing](https://drive.google.com/file/d/1vH76oMcW8BY8Pv7ZN4e91ZlQo8FxLdqT/view?usp=sharing)\n\n\n\nWith **2,000 daily active users** 40% coming from web2 we have repeatedly onboarded new holders into the projects using our services and generated significant microtransactions through social-connected campaigns.\n\nWith this upgrade, creators will gain the ability to run full social-task airdrop campaigns:\n\n- customizable tasks\n- integration with all relevant socials\n- leaderboards\n- XP and points\n- badges for completed actions\n\nand automated reward claiming through the WAirdrops platform\n\nThis creates a complete, gamified campaign system made for both creators and users designed to scale engagement and maximize on-chain activity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"The success of this platform will be measured by the volume of **microtransactions** it generates. With Walkers rapidly growing user base currently 2,000 daily active users along with planned expansion to other chains, Midnight integration, and simplified Web2 onboarding, we anticipate usage to scale rapidly. \n\nAs more projects adopt the platform to run campaigns and reward their communities, we aim to achieve **20,000 microtransactions/month** within the first year after full release, with strong potential for continuous growth and long-term expansion. The initial focus is on the Walkers App user base, with the potential to grow to millions of users within a few years.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**The challenge most Cardano projects \\(companies\\) face is that distributing tokens, ADA, or NFTs to a large community of users is both technically complex and financially draining\\. Every transaction costs fees, and when projects try to reward hundreds or thousands of wallets, the costs quickly become unsustainable\\. As a result, many teams either limit their airdrops, stretch them over long periods, or abandon them altogether which reduces user trust, engagement, and overall growth\\.**\n\nWAirdrop solves this problem by introducing the first free airdrop platform on Cardano, specifically designed for creators and projects of all sizes.\n\n**Unlike existing solutions that charge projects high costs to send tokens, WAirdrop flips the model:**\n\nCreators pay nothing to run airdrops\n\nUsers pay a small claim fee when they collect their rewards.\n\nThis ensures the system is sustainable, fair, and removes the financial barrier for projects to engage their communities.\n\n**What makes WAirdrop unique is the all\\-in\\-one capability:**\n\nProjects can airdrop ADA, CNTs, NFTs, and multiple-token baskets from a single platform.\n\nDistribution can be done to unlimited wallets and unlimited supply amounts, with full on-chain transaction history for transparency.\n\nA built-in withdrawal function allows creators to easily reclaim any unclaimed tokens or NFTs.\n\n**In addition, WAirdrop is not just a distribution tool it is a marketing engine\\.**\n\nCreators will be able to set up full airdrop campaigns directly from the platform, linking them with Walkers App tasks (engagement activities) with more socials API integrations. This transforms airdrops from simple token drops into engagement campaigns that drive both community growth and user participation. \n\n**The impact is two\\-fold:**\n\nFor creators and projects – no longer limited by budget, they can scale community rewards, loyalty programs, and rewards distributions without worrying about transaction costs.\n\nFor the Cardano blockchain – every campaign creates more wallet activity, more token transactions, and more engaged communities, boosting the entire chain’s adoption and usage.\n\nA functional MVP already proves the concept. With Walkers, we have successfully executed airdrop campaigns for over 20 projects, both before token TGE and during key activities. By making airdrops accessible, scalable, and tied to real engagement tools, WAirdrop removes a major barrier to community-driven growth and lays the groundwork for stronger, more sustainable ecosystems.\n\n[https://wairdrops\\.xyz/](https://wairdrops.xyz/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"WAirdrop is designed not only to help individual projects but to strengthen the entire Cardano blockchain,by solving one of its most persistent challenges: **efficient and scalable token distribution\\.**\n\nBy making airdrops **free** for creators and sustainable for users, WAirdrop encourages more projects to actively engage their communities and launch rewards programs without being constrained by high transaction costs or technical complexity.\n\n**Key impacts include:**\n\nIncreased On-Chain Activity\n\nEvery airdrop involves token transfers, claims, and interactions with smart contracts. This drives measurable on-chain activity, increasing wallet usage and demonstrating real utility for ADA, NFTs, CNTs, and other tokens. High on-chain engagement\n\n**Boosted Community Engagement**\n\nBy linking airdrops with Walkers App tasks and social API's , WAirdrop transforms token distribution into interactive, gamified campaigns.\n\nThis encourages users to engage more deeply with projects, creating communities that are more likely to hold tokens, participate in governance, and support future initiatives.\n\n**Support for Emerging Projects**\n\nMany small and mid-sized projects on Cardano struggle to fund large airdrops. WAirdrop removes this barrier, allowing any project to reward its community and grow its user base efficiently.\n\nThis inclusivity helps diversify the ecosystem, bringing in new ideas, tokens, and applications that increase Cardano’s overall value proposition.\n\n**Education and Adoption**\n\nAs more users participate in airdrop campaigns, they become familiar with wallets, smart contracts, and token interactions, lowering the barrier to entry for Cardano adoption.\n\nIntegration with apps like Walkers introduces Web2 users to blockchain through gamified experiences, expanding the audience beyond existing crypto enthusiasts.\n\n**Long\\-Term Ecosystem Growth**\n\nSustainable, large-scale airdrops increase liquidity and circulation of tokens, supporting market activity.\n\nBy connecting rewards to real engagement , WAirdrop encourages continuous interaction, helping projects retain users over time and contributing to a healthier, more resilient ecosystem.\n\nIn summary, **WAirdrop accelerates Cardano adoption, strengthens community engagement, and supports both established and emerging projects by providing a scalable, free, and user\\-friendly airdrop solution\\. This directly contributes to Cardano’s growth, visibility, and long\\-term ecosystem sustainability\\.**","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Cardano Involvement:** Walkers has been an part of the Cardano ecosystem since its inception on August 28, 2022. This longstanding presence signifies our dedication to and alignment with the principles of the Cardano blockchain.\n\n**Founder's Expertise:** As the founder, my four-year involvement in the Cardano, coupled with active investments, attests to a deep understanding of the blockchain space. This experience contributes to informed decision-making and strategic development.\n\n**Team Expertise:** Our team, mirroring the active investment practices of our founder within numerous projects in the Cardano ecosystem, boasts a deep understanding of the blockchain landscape. Our collective expertise spans across software development, marketing, and artistic design. This diverse skill set positions us strongly to execute the intricacies of the second phase of our roadmap. The wealth of experience within our team significantly enriches our decision-making processes, fostering strategic development and guaranteeing the success and innovation of our ongoing endeavors.\n\n**App Launch and Upgrades:** The unveiling of the Walkers App on August 28, 2023, signifies a milestone in our development journey. Accessible on Play Store and App Store, the Walkers App has undergone continuous refinement with 15 updates since its initial launch.\n\n[https://apps\\.apple\\.com/mk/app/walkerscnft/id6450308902](https://apps.apple.com/mk/app/walkerscnft/id6450308902)\n\n[https://play\\.google\\.com/store/search?q=walkerscnft&c=apps&hl=en](https://play.google.com/store/search?q=walkerscnft&c=apps&hl=en)\n\nTo ensure the sustainability of our ecosystem, we have built a comprehensive suite of platforms around the Walkers App including **MVP** of **WAirdrops** platform : [https://wairdrops\\.xyz/](https://wairdrops.xyz/)\n\n**Feedback Integration:** Actively seeking feedback from our user base, demonstrates our commitment to user-centric development. Continuous refinement based on valuable user suggestions ensures that the app and all our DApps meet user expectations and delivers a seamless experience.\n\n**Proven Track Record:** Walkers has already launched its app on the Play Store and App Store, with an established user base. This tangible proof of concept underscores our capability to effectively manage and deploy resources.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Creator Airdrop Campaign Design & Planning UX/UI design","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Home Page / Dashboard \\(200 hours\\)**\n\n\n\n- Design a comprehensive workflow for creators to launch airdrop campaigns that include multiple token types, task-based engagement with socials API's integrations, ensuring scalability for unlimited users.\n- Prepare UX/UI mockups of the campaign creation portal and dashboard with detailed specifications for claim tracking, engagement analytics, and campaign management.\n- UX/UI design for user badges, achievements, and leaderboards \n\n\n\n**Design Consistency \\(100 hours\\)**\n\n\n\n- Ensure a unified visual style\n- Maintain seamless user experience with intuitive navigation\n- Apply consistent branding, icons, and UI elements","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Detailed Mockups:** Provide mockups for visualization\n\n**Wireframes and User Flow Diagrams:** Create wireframes and flow diagrams\n\n**Feedback Iterations:** Revise mockups based on internal reviews and feedback from the Walkers community","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Improved User Engagement:** Measure increased user engagement\n\n\n\n**Positive User Feedback:** Collect feedback from users during testing phases to gauge satisfaction with the enhanced UX/UI \n\n\n\n**Visual Consistency:** Ensure a consistent visual language across all new screens for a cohesive user experience\n\n\n\n**Iterate on mockups based on internal reviews and feedback of community \\(40 hours\\)**","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20400,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Backend Development and API Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Core Components \\(300 hours\\)**\n\n- Implement connection between airdrop campaigns and Walkers App tasks, allowing user activity (app tasks) to be tracked and linked to WAirdrops\n- Separate leaderboards for every campaign\n- Create dashboard features for creators to monitor task completions, engagement, and claim eligibility\n- Design and implement backend logic to handle multi-token drops,supporting batch distribution to unlimited wallets\n- Include full logging, claim tracking, and withdrawal functionality for unclaimed tokens\n- Build analytics and reporting tools for creators to monitor Airdrops\n\n**API Integrations \\(120 hours\\)**\n\n- Connect with third-party services to enable dynamic features, including adding tasks from every type and social integrations (e.g., X 'Twitter' APIs)\n\n**Database Design and integrations \\(100 hours\\)**\n\n- Database Design: Create a resilient and scalable database to handle user profiles, XP, rewards,badges and transaction histories. Number of airdrop campaignes created. Number of airdrops user participated/eligable. Leaderboards.\n\n**User Testing and bug fixes in WAirdrops \\(40 hours\\)**","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Campaigns successfully recognize and validate Walkers App task completions and social actions for reward eligibility\n- Real-time tracking of tasks, claims, and engagement reflected in the dashboard.\n- Multi-token drops executed correctly in testnet, with proper claim tracking and withdrawals functional.\n- Backend supports batch token distribution at scale without errors.\n- Transaction history tracking\n- Data security protocols in place","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Demonstration of test campaigns with multiple users completing app tasks and claiming tokens successfully\n- Screenshots and logs showing social API integration and task tracking functionality\n- Backend documentation and server architecture diagrams","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30800,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Frontend Development for WAirdrops","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**WAirdrops Interface Development for Users \\(100 hours\\)**\n\nDesigning and implementing a clean, intuitive interface that allows users to easily participate in airdrops, track rewards, and navigate all platform features.\n\n**WAirdrops Interface Development for Creators \\(100 hours\\)**\n\nDesigning and implementing a clean, intuitive interface that allows creators to easily create airdrop campaigns, select badges for achievements, track rewards, and navigate all platform features.\n\n**Real\\-Time Data Syncing \\(100 hours\\)**\n\nEnsuring live updates for airdrop campaigns, token balances, and user participation so that all data is accurate and immediately reflected across the platform.\n\n**Responsive Design and Accessibility \\(100 hours\\)**\n\nMaking the platform fully responsive across all devices and accessible to users with varying needs, guaranteeing a smooth experience for everyone.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Users can seamlessly participate in airdrops, track rewards, and navigate the platform, while creators can easily create campaigns, assign badges, and monitor performance\n- Real-time data syncing ensures all actions and balances update instantly, and the platform is fully responsive and accessible across devices","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Screenshots and screen recordings of user and creator interfaces, successful test campaigns, logs showing real-time updates, device testing for responsiveness, and QA/accessibility reports confirming all features function as intended","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":18000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Production Deployment, Monitoring & Documentation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Full Platform Deployment \\(100 hours\\)**\n\n- Deploy WAirdrops in production, supporting unlimited creator campaigns, multi-token drops, task-linked engagement, and social media validation\n- Verify stability, security, and scalability for concurrent users and campaigns\n\n**Documentation &amp; Training Materials \\(80 hours\\)**\n\n- Provide detailed user manuals and step-by-step guides for creators to launch campaigns independently\n- Create training videos, FAQs, and onboarding materials to ensure smooth adoption\n\n**Monitoring &amp; Analytics Tools \\(100 hours\\)**\n\n- Implement real-time analytics for campaign performance, user engagement, and token distribution.\n- Add error handling, alert systems, and token claim tracking to maintain reliability and transparency","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Platform stable, functional, and accessible by creators.\n- Users able to claim tokens/NFTs for completed tasks and campaigns without errors.\n- Users able to claim multiple tokens\n- Creators able to track campaignes and Airdrops created","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Live platform demonstration with active campaigns, analytics dashboards, and user feedback confirming usability and functionality.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15400,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Marketing and Promotions Enhancement","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Develop and implement marketing campaigns to increase awareness and adoption of WAirdrops\n\n\n\n- Integrate promotional tools within the platform (e.g., banners, notifications, social media)\n\n\n\n- Design user engagement features event announcements, and campaign highlights\n\n\n\n- Coordinate campaigns with Cardano projects and partners to boost visibility","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Marketing campaigns are live and accessible to all users\n- Promotional features within WAirdrops function correctly (notifications, banners)\n- Social media sharing and integration tools are fully operational\n- Campaign performance metrics (clicks, engagement, microtransactions) are trackable and accurate","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Screenshots and recordings of active campaigns and in-platform promotional tools\n- Analytics reports demonstrating campaign reach and user engagement\n- QA verification that all marketing features are working as intended\n- Documentation of performance","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":9000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Ivana Zafirovski - Founder of Walkers\n\n[https://x\\.com/Ivanaarch](https://x.com/Ivanaarch)\n\n[https://www\\.linkedin\\.com/feed/](https://www.linkedin.com/feed/)\n\nCoordinating the team and making sure our community get the best out of the project. Apart from user benefits and coordination of all activities, she is the designer of all social media content. Master degree Architect by proffesion\n\nRuben Duarte - Head of Marketing and Growth\n\n[https://x\\.com/RuduarteD](https://x.com/RuduarteD)\n\n[https://www\\.linkedin\\.com/in/ruben\\-duarte\\-8a71314a/](https://www.linkedin.com/in/ruben-duarte-8a71314a/)\n\nHe is passionate about web3, with over 10 years of experience in partnerships, marketing ideas and project management. His experience is related to IT and he have worked in some government and banking companies and important multinationals\n\nAndré Morais - Software engineer\n\n[https://x\\.com/andrefmmorais](https://x.com/andrefmmorais)\n\n[https://www\\.linkedin\\.com/in/andre\\-moniz\\-morais/](https://www.linkedin.com/in/andre-moniz-morais/)\n\nSoftware engineer with a master’s in Computer Science and a passion for creating high-quality software. As a startup founder, he enjoys turning ideas into reality. When he's not coding, he enjoys fitness, cooking, and writing—always driven by the desire to build and create.\n\nOlie Merza - Lead Artist\n\n[https://x\\.com/OlieMerza](https://x.com/OlieMerza)\n\nOlie is a graphic designer and illustrator from the Philippines. He has more than a decade of experience working in the garments industry focusing on printed graphics. His works were featured in various exhibits both in his country and abroad.\n\nKarlo Kelecic - Artist\n\nConcept artist/Illustrator. Currently freelancing on projects, worked in startups, founded startups and ran his own agencies. He have experience in art development as a generalist. Focused on digital painting, 2D illustration, Houdini for procedural animation, environments 3D and VFX.\n\nKey skills: Procreate, Photoshop, Houdini, After Effects, Illustrator and Vectonator. Studied applied arts and design, philosophy and art academy in Zagreb. Started to work as junior designer in 2009. Created his own workshops about comic books, concept art and VR.\n\nBojan Mitevski - UX/UI and Motion Graphics\n\n[https://www\\.bojanmitevski\\.com/](https://www.bojanmitevski.com/)\n\nZealous visual designer who freelances for clients worldwide and specializes in UI/UX, websites, mobile apps, and motion graphics design. He is passionate about working on creative designs, overcoming challenges, and solving real users' problems that help companies scale.\n\nDiogo Menezes - 3D Designer -\n\n[https://x\\.com/\\_\\_SEZENEM](https://x.com/__SEZENEM)\n\nInterior and product designer who worked with some of the best Architecture offices in Portugal with almost 10 years in the business. Currently working with Architects and designers, Menezes uses 3D software to create and develop what was once in the paper, usually working with Archviz and product visualization.\n\nUnlimited Solutions - Main Developers &amp; Architects\n\nNoma Tokenomics - Tokenomics,Economy creation and Audit - [https://noma\\.pro/](https://noma.pro/)\n\nMotionalley studio - Branded animations and illustrations - [https://www\\.motionallystudio\\.com/](https://www.motionallystudio.com/)\n\nAbhiwan - Mobile app developers - [https://www\\.abhiwan\\.com/](https://www.abhiwan.com/)\n\nYepple Ink - Blockchain developments and services","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Milestone 1 – Campaign Design and Planning \\- UX/UI**\n\nHome Page / Dashboard (200 hours)\n\nDesign Consistency (100 hours)\n\nIterate on mockups based on internal reviews and feedback of community: (40 hours)\n\n**Total: 340 hours**\n\n-UX designer average hourly rate - 60 ADA\n\n-UI designer average hourly rate - 60 ADA\n\n**$ADA 20400**\n\n**Milestone 2:Backend Development and API Integration**\n\nCore Components (300 hours)\n\nAPI Integrations (120 hours)\n\nDatabase Design and integrations (100 hours)\n\nUser Testing and bug fixes in WAirdrops (40 hours)\n\n**Total: 560 hours**\n\n-Software developer average hourly rate - 55 ADA\n\n**$ADA 30800**\n\n**Milestone 3 – Frontend Development for WAirdrops**\n\nWAirdrops Interface Development for Users (100 hours)\n\nWAirdrops Interface Development for Creators (100 hours)\n\nReal-Time Data Syncing (100 hours)\n\nResponsive Design and Accessibility (100 hours)\n\n**Total: 400 hours**\n\nFrontend developer average hourly rate - 45 ADA\n\n**$ADA 18000**\n\n**Milestone 4 – Production Deployment, Monitoring and Documentation**\n\nFull Platform Deployment (100 hours)\n\nDocumentation and Training Materials (80 hours)\n\nMonitoring &amp; Analytics Tools (100 hours)\n\n**Total: 280 hours**\n\n-Software developer average hourly rate - 55 ADA\n\n**$ADA 15400**\n\n**Milestone 5 – Marketing and Promotions Enhancement**\n\nMarketing: 9 months x 1000 ADA\n\n**$ADA 9000**\n\n\n\n**Grand Total: $ADA 93600**\n\nADA/$0,4 and hourly rates according [https://www\\.payscale\\.com/](https://www.payscale.com/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"WAirdrop offers outstanding value by giving creators a free, fully integrated, and scalable platform to launch airdrop campaigns, connect with app-based tasks, and engage unlimited users without expensive barriers. With the ever-growing volume of microtransactions on Cardano, including powerful onboarding tools, the platform ensures seamless reach and impact for every campaign.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Community","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1731}