{"pr_id":"019abdda-f8ed-7ec6-83a7-6c0a26098880","title":"Innovation: First End-to-End Peer Review Platform on Cardano","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Today’s academic peer review lacks transparency, incentives, and trust—leading to delays, bias, and reviewer fatigue.","solution":"We’ll develop a Cardano-based MVP for decentralized peer review with on-chain transparency, reviewer rewards, reputation tracking, and academic integrations like ORCID and DOIs.","proposer_name":"Agnostica, Ltd.","proposer_relevant_experience":"Agnostica brings a cross-functional team with deep expertise in blockchain product development, academic research, and user-centered design. This project is led by Alex James, founder of Agnostica—a research consultancy focused on bridging scholarly insight with emerging blockchain applications. Alex is a seasoned product manager with a proven track record delivering both decentralized and SaaS-based tools across multiple ecosystems.\n\n\n\nDeFi Product Leadership: Alex has led product development for Ultra Capital, a non-custodial DeFi yield token frontend built on Stellar, offering users simple access to tokenized yield strategies. He also managed the product roadmap for USDC Swap, a cross-chain stablecoin swap platform. In both cases, Alex directed efforts across smart contract integration, user experience, and go-to-market readiness. These projects required secure backend infrastructure, scalable architecture, and thoughtful onboarding flows for both crypto-native and general users.\n\n\n\nSaaS and UX at Scale: As a Product Manager with Raw.bot, Alex oversaw development of popular Slack-based productivity apps—including BirthdayBot and TimeBot—now used by tens of thousands of teams, with hundreds of thousands of users ldwide. These apps are recognized for their intuitive UX, enterprise-grade reliability, and seamless integration into complex workplace environments.\n\n\n\nDevelopment Capacity On Standby: Drawing from this track record, Alex will bring the same vetted developers and designers from these prior projects into this Cardano initiative. These collaborators include full-stack engineers familiar with blockchain architectures (including Cardano’s Plutus/Haskell tooling), front-end dApp specialists, and experienced designers with a focus on intuitive, low-friction UX. With funding in place, this team is prepared to begin MVP development immediately.\n\n\n\nAcademic and Research Leadership:\n\nDr. Robert Danielson (Co-Founder, Research Lead) is a PhD researcher with over a decade of academic experience. He has authored 25+ peer-reviewed publications, managed nearly $2M in research funding, and served on multiple editorial boards. He brings firsthand understanding of peer review pain points and scholarly infrastructure needs. In this project, Robert leads content design, academic standards integration (ORCID, DOI, etc.), and user validation through outreach to academic beta testers. His grant experience ensures responsible fund use and reporting.\n\n\n\nIn short, Agnostica combines technical readiness, academic insight, and delivery experience. We have the team, infrastructure, and research foundation to execute a usable, testnet-deployed MVP that addresses real problems in academic publishing—and to do so with quality, speed, and community alignment.","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Innovation: First End-to-End Peer Review Platform on Cardano","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Agnostica, Ltd.","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Today’s academic peer review lacks transparency, incentives, and trust—leading to delays, bias, and reviewer fatigue.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We’ll develop a Cardano-based MVP for decentralized peer review with on-chain transparency, reviewer rewards, reputation tracking, and academic integrations like ORCID and DOIs.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://github.com/agnostica-global/decentralized-peer-review-f13-open-access","https://agnostica.global","https://www.linkedin.com/in/alexander-james/","https://scholar.google.com/citations?user=ShZt80kAAAAJ&hl=en","https://peerchain.io"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Yes, the MVP will be fully open source under the MIT license. Future versions may explore hybrid licensing models, but this initial prototype will be public, auditable, and community-accessible.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Business Services","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"**Pioneering Cardano’s DeSci Solution:**\n\n\n\nOur MVP would be the first purpose-built, end-to-end peer-review system running entirely on Cardano, filling a gap no current project covers. The closest prior effort was PubWeave, an ambitious “full-stack” ecosystem that attempted to blend Cardano smart contracts, Arweave storage, an NFT marketplace, and a DAO-funded treasury. PubWeave’s broad scope—treasury mechanics, token-holder dividends, cross-chain components, and a full open-science NFT market—created significant architectural complexity and, to date, limited real-world adoption.\n\nOur approach learns from that experience. Instead of trying to launch every layer at once, we focus on one critical workflow: peer review itself. We keep all core logic—submission logs, review hashes, ADA rewards—on Cardano, use a single decentralized-storage layer for manuscripts, and integrate seamlessly with academic norms (ORCID, DOIs). By narrowing scope and prioritizing user-friendly UX, we deliver a lean, test-net MVP that researchers can use immediately, de-risking the path to a production journal while showcasing Cardano’s strengths in transparency and micro-incentives.\n\nComparison with Existing DeSci Platforms: In the broader DeSci space, projects like ResearchHub (Ethereum) have demonstrated demand for crypto-enabled peer review by rewarding reviewers with tokens and making reviewer reports openly available. ResearchHub’s growth (backed by notable funders and highlighted in Nature) shows the promise of tokenized scientific communities. However, it remains a Web2/Ethereum hybrid and faces challenges integrating with academia’s formal systems (e.g. indexing, institutional recognition). Other blockchain efforts such as Orvium (Ethereum) attempted to replicate entire journals on-chain with token rewards, but creating new “decentralized journals” without impact factor has hindered academic uptake. Our innovation lies in combining the best of these approaches on Cardano: we implement on-chain logging of the peer review process and ADA-based reviewer rewards, while seamlessly integrating with academic workflows like ORCID identity and DOI indexing. This will be Cardano’s first platform that delivers a full submission-to-publication cycle with immutable audit trails, open peer review visibility, and built-in incentives. Just as importantly, we prioritize strong UX design – single sign-on via ORCID and minimal crypto jargon – so that the platform feels like a natural extension of current publishing practices. By aligning with familiar academic tools and norms (a feature few existing DeSci platforms offer), our idea is highly innovative in making decentralized peer review practically accessible to researchers. In short, while others have explored blockchain in science, this proposal will be unprecedented in Cardano’s ecosystem for delivering a working, user-centric peer review dApp that bridges scholarly communities and blockchain technology.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"**Scope of the MVP:**\n\n\n\nThe prototype will demonstrate the entire peer review workflow on Cardano’s testnet, from manuscript submission through to publication. It will consist of a web-based dApp (open source) that anyone can access via a browser. The MVP includes both on-chain components (to ensure transparency) and off-chain components (for storage and usability):\n\n\n\n**Submission and Storage:**\n\n\n\nAuthors will log in (using ORCID) and submit manuscripts through a web interface. Each submission is stored in decentralized storage (e.g. IPFS) and generates a unique content hash. The platform records a proof-of-submission on the Cardano blockchain – a transaction containing the manuscript’s hash, timestamp, and author ID – creating a tamper-proof, time-stamped record. This serves as an immutable “receipt” that the community can verify on a Cardano explorer.\n\n\n\n**Open Peer Review Workflow:**\n\n\n\nEditors (or moderators) on the testnet platform can invite reviewers and manage the review process through an intuitive dashboard. Reviewers, upon invitation, authenticate via ORCID (linking their academic identity to the platform) and can accept or decline review assignments in the UI. Accepted reviewers then access the manuscript and submit their peer review reports through a structured form. The full text of each review is stored off-chain (e.g. on IPFS for scalability), but a cryptographic hash of the review and its metadata is recorded on-chain to timestamp it and prove its integrity. During the active review phase, content is kept confidential to the parties involved, but once a final decision is made, the system will open up the reviews for transparency. Reviewers can choose to reveal their names or stay anonymous publicly (the platform will honor anonymity choices by displaying “Reviewer A”, etc., while still internally linking ORCID identities for credit). The MVP thus showcases an open peer review model where, after editorial decision, the reviews are published alongside the article for anyone to read.\n\n\n\n**Decisions and Publication:**\n\n\n\nEditors record decisions (accept, reject, or request revisions) through the platform. Each editorial decision is also logged as an immutable blockchain record, linking the outcome to the submission ID and timestamp. If a manuscript is accepted, the platform will mark it as published: the final article (PDF/HTML) is made openly accessible, and the system will register or attach a Digital Object Identifier (DOI) to the published paper. This means even at MVP stage, outputs are citable in standard academic format. The published article’s page will display its DOI and all associated peer review reports, providing readers with insight into the review process (a level of transparency absent in traditional journals). All published content and reviews remain pinned in decentralized storage (IPFS) for permanence, and the platform will provide direct links or transaction IDs so users can verify on-chain records of submissions and reviews (e.g. “Submission recorded on Cardano at tx XYZ”).\n\n\n\n**Incentives and Wallet Integration:**\n\n\n\nA core feature the MVP will demonstrate is the reviewer incentive mechanism. Each reviewer who completes a review within guidelines and timeframes will automatically receive a micro-payment reward in ADA. The MVP uses Cardano’s native asset (ADA) for simplicity – no new token is required. Reviewers will connect a Cardano testnet wallet to their profile (or have one auto-generated for them) so the system can deliver these rewards. Upon submitting a review, if it’s approved by the editor, the platform triggers a testnet transaction sending the predefined ADA reward to that reviewer’s address. Every reward disbursement is transparently recorded (with links between review IDs and payment txns) for auditability. The MVP web interface will let users see their “claimable ADA” or rewards earned in their dashboard, and if a user hasn’t connected a wallet yet, the system will securely hold their reward until they do so. This demonstrates a full incentive loop on Cardano: if you do the work, you immediately see on-chain compensation.\n\n\n\n**Accessing the MVP:**\n\n\n\nThe prototype will be deployed on Cardano’s public testnet (Preprod or equivalent) and accessible via a standard web browser. Users will simply visit the dApp’s URL and log in using “Login with ORCID” (redirecting to ORCID’s OAuth, then back to the dApp). They can then create or connect a Cardano testnet wallet; for ease of testing, the MVP may auto-provision an internal wallet for each user (hiding cryptographic complexity) or guide users to use a browser wallet extension. All code will be open-sourced on GitHub, so the community and Catalyst members can review the implementation and even run their own instance. The testnet site will be accompanied by documentation so that anyone interested can try out a full submission and peer review cycle with test data.\n\n\n\nIn summary, the MVP will be a live, interactive demonstration on Cardano’s testnet – not just a static demo. By the proposal’s completion, anyone in the community can access the platform in their browser, submit a dummy manuscript, act as a reviewer, and observe the on-chain records and incentive payouts in real time. This accessibility and openness are key to building trust and gathering feedback in preparation for a future mainnet launch.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"We will define clear, measurable indicators to gauge the MVP’s success during the testnet pilot. Key performance indicators (KPIs) include both on-chain metrics (quantitative) and early user engagement signals (quantitative and qualitative):\n\n\n\nExample KPI table (draft targets)\n\n• 10–15 test submissions logged on Cardano testnet\n\n• 25–30 peer-review reports recorded and rewarded on-chain\n\n• ≤ 4-week average decision time (≥ 50 % faster than typical journals)\n\n• 25–30 unique ORCID-linked users engaged in pilot\n\n• 2–3 articles fully published with open reviews & DOI\n\n• ≥ 80 % positive user-experience rating in pilot survey\n\n\n\n**Submissions Recorded On\\-Chain:**\n\nThe number of manuscripts submitted and logged on the Cardano blockchain during the pilot (aiming for a minimum of X test submissions). Success is having multiple real or test academic papers go through the system, demonstrating end-to-end usage. For example, we will track “X submissions recorded on-chain” as a metric in the final report.\n\nPeer Reviews Completed On-Chain: The count of peer review reports submitted and immutably recorded. We target Y reviews in total (roughly 2–3 reviews per submission on average). This shows reviewer engagement. In the pilot report we will note “Y reviews were recorded on-chain” as evidence of active participation.\n\n\n\n**Average Review Turnaround Time:**\n\nThe average time from submission to initial editorial decision (calculated from on-chain timestamps). Target: an average turnaround of 21 – 28 days (≈ 3 – 4 weeks)—well below traditional journals’ 8 – 16-week cycle. For instance, if we record ≈ 24 days, that is ≈ 60 – 75 % faster than conventional peer-review timelines, a clear efficiency gain we’ll highlight in results.\n\n\n\n**Active User Participation:**\n\nThe number of unique users participating, measured by ORCID-linked accounts created and distinct testnet wallets used. A successful pilot might see dozens of academics (or community testers) onboarded. This metric indicates whether the UX and onboarding (ORCID sign-in, etc.) are effective in attracting users. We also track how many invited reviewers accept assignments versus decline, as a measure of engagement.\n\n\n\n**On\\-Chain Transactions and ADA Rewards:**\n\nThe total count of Cardano transactions generated by the platform (submission logs, review logs, reward payouts) and the total amount of testnet ADA distributed as reviewer rewards. A healthy number of transactions (each tied to a real user action) will show that the MVP is driving on-chain activity. For example, every completed review triggers an ADA micropayment, so we expect N reward transactions executed. We will verify that 100% of eligible reviews resulted in on-chain rewards, confirming the incentive mechanism’s reliability.\n\n\n\n**Published Articles with Open Reviews:**\n\nAt least one full cycle completed – i.e. an article that was submitted, peer-reviewed, and “published” on the testnet platform with its DOI and open peer review reports visible. This serves as a capstone success criterion: it proves the concept works end-to-end. More is better (we aim for several), but even one real example of a paper and its reviews on-chain is a powerful validation of the model.\n\n\n\n**User Feedback and Satisfaction:**\n\nQualitative but crucial – feedback from pilot users (authors, reviewers, editors) collected via surveys or interviews. Metrics here include the percentage of participants who report a positive experience or would recommend the platform. For instance, if &gt;80% of pilot users say the process was as good as or better than traditional peer review, that’s a success indicator. We will also log any repeated use (e.g., a reviewer who completes multiple reviews) as a sign of satisfaction.\n\n\n\n**Academic Interest and Follow\\-on Adoption:**\n\nIndicators of interest beyond the pilot, such as number of inquiries from researchers or journals, or expressions of interest from academic groups to run additional trials. Success might be measured by partnerships or MOUs for the next phase (for example, a university journal club agreeing to test the system). While harder to quantify, an early sign of impact would be if Cardano’s open science initiative gains mention in academic circles or conferences as a result of this MVP.\n\n\n\nTogether, these 6–8 KPIs will give a balanced picture of the MVP’s performance. We will capture the raw on-chain data (transactions count, timestamps) as well as off-chain user metrics, and include them in our final Catalyst report. By transparently reporting outcomes – e.g. “X submissions and Y reviews were recorded on-chain, with an average turnaround of Z days” – we not only satisfy Catalyst requirements but also build credibility with the academic community by openly evaluating what the pilot achieved. These metrics will guide any needed improvements and help justify subsequent funding or partnerships for scaling the platform.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Our solution directly tackles the well-documented pain points of the scholarly peer review process – opacity, lack of incentives, and misalignment with academic workflows – by leveraging Cardano’s blockchain for transparency and integrating features that fit researchers’ needs. Below is how the MVP’s design addresses each challenge:\n\n\n\n**Transparency and Accountability:**\n\nTraditional peer review operates behind closed doors; authors and the community often never see the content or rationale of reviews, leading to mistrust in editorial decisions. To solve this, our platform logs every critical event (submission, review, decision) on Cardano’s public ledger, creating an immutable audit trail. Each review report, once a paper is published, is opened to the public alongside the article – bringing sunlight into the process that is usually opaque. This means authors can actually read the feedback that led to the decision, and the community can verify that proper process was followed. At the same time, we preserve fairness: reviewers can choose to stay anonymous publicly (to encourage honest critiques without fear) while still getting internal credit. Editors’ final decisions are also recorded immutably, preventing any after-the-fact alterations. By having a permanent, tamper-proof record, the system introduces accountability for both reviewers and editors that doesn’t exist in the status quo. If disputes arise, there’s a clear evidence trail, and our platform even plans for an appeals mechanism where authors can request reconsideration of decisions – a process that will itself be tracked for transparency. In short, the solution makes peer review transparent but controlled: all key actions are verifiable on-chain, thereby restoring trust in the integrity of review outcomes.\n\n\n\n**Incentives and Recognition for Reviewers:** \n\nA fundamental problem today is the lack of reward or recognition for peer reviewers, who donate substantial time with little credit. This leads to reviewer fatigue, slow turnaround, and an imbalanced workload falling on a small group of overburdened reviewers. Our MVP changes the incentive structure by rewarding reviewers with ADA micropayments and reputation points for each completed review. By receiving tangible rewards (even small amounts) and building a publicly visible reputation, reviewers are no longer “volunteering into a void” – their contributions are acknowledged and recorded. This not only motivates timely, high-quality reviews (since only satisfactory reviews earn the reward) but also helps distribute the workload: more researchers may volunteer to review when there’s an extrinsic reward, easing the burden on the usual unpaid volunteers. Over time, a robust on-chain reputation can highlight the contributions of diligent reviewers, potentially allowing them to get academic credit in hiring or promotion (our design will enable exporting one’s peer review record to traditional profiles, e.g. ORCID, for formal recognition). The platform thereby recognizes reviewers as first-class contributors in scholarly publishing, addressing the historic imbalance. An additional benefit of incentives is speeding up the process – with rewards and reputation at stake, reviewers have reason to accept assignments and submit feedback on time, helping to reduce delays in peer review. By aligning incentives properly, we aim to cultivate a virtuous cycle: better and quicker reviews, more engaged reviewers, and editors who can more easily find willing reviewers, all of which improve the efficiency of the ecosystem.\n\n\n\n**Integration with Academic Workflows:** \n\nMany past attempts in decentralized science faltered because they expected researchers to adopt entirely new workflows or blockchain-specific tools. We avoid this pitfall by integrating with the tools and standards academics already use. First, we support ORCID single sign-on – researchers can log in with their existing ORCID credentials, linking their identity in a way universities recognize. This means a reviewer’s contributions on our platform can be definitively tied to their real-world academic profile (resolving the credit issue), and it spares users from managing yet another login. Second, each accepted paper will be assigned a DOI, just like any journal article. This ensures that work published via our platform is easily citable and discoverable in libraries and indexes, which is crucial for academic acceptance. We also store content in standard formats (PDF/HTML) and plan to make metadata compatible with indexing services. Third, the user experience is designed to be familiar and easy: the interface resembles a journal submission system or conference management system that researchers know, and we hide blockchain complexity under the hood. For example, the dApp can automatically handle wallet creation or provide upfront testnet ADA, so a user isn’t confronted with blockchain fees or seed phrases just to participate. By minimizing crypto-jargon and “speaking academia’s language”, we greatly lower the barrier to entry. This integration-first approach was strongly informed by our interviews with academics, who stressed that any new system must fit into their existing practices or it will be ignored. Our solution is therefore built to slot into scholars’ workflows: use your ORCID, get a DOI for your paper, cite it as usual, and even export your peer review activity to your CV. This makes the decentralized platform not a radical departure but rather a natural extension of current academic publishing – except now the process is faster, fairer, and more transparent.\n\n\n\n**Quality, Moderation and Academic Rigor:**\n\nEnsuring that a decentralized system maintains high scholarly standards is another key part of our solution. We address this by incorporating roles for Editors and Moderators who oversee the quality of submissions and reviews. The platform will have an editorial interface where editors can screen submissions (to prevent spam or non-academic content) and evaluate submitted reviews for constructiveness. If a review is subpar (e.g., too short or inappropriate), the editor can send it back for revision or even withhold the reward until it meets the guidelines, ensuring that incentives don’t come at the cost of quality. Additionally, by logging everything on-chain, any misconduct (like plagiarism or abusive reviews) is traceable, and community moderation can be applied if necessary (with logs of any moderator actions kept for accountability). The platform’s smart integration with identity also helps here: because reviewers log in with ORCID, even if they choose to be anonymous publicly, the system knows their real identity – this accountability discourages bad behavior. We also implement an appeal mechanism for authors, which adds a layer of fairness: authors who feel a decision was unfair can request additional review or moderator oversight, rather than being helpless when facing a bad or biased reviewer. All these measures align with academic norms (journals too have editors and appeals) while using blockchain to bolster trust. Ultimately, our solution doesn’t remove humans from the loop – it augments their roles with better tools. By combining human judgment (editors to maintain rigor) with transparent technology (blockchain records and automated incentives), we create a balanced system that addresses workload and fairness concerns without sacrificing quality. The result is a peer review process that is transparent, fair, and efficient – something that can improve scholarly communication while preserving the core values of academia.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**Driving On\\-Chain Activity and Utility:**\n\n\n\nThis project will showcase Cardano’s capabilities in a novel domain, driving meaningful on-chain activity beyond finance. Each submitted manuscript, review, and reward in our platform corresponds to transactions or metadata on Cardano, increasing network usage in a productive way. By implementing dozens or even hundreds of on-chain operations tied to a real-world use case (scientific publishing), the MVP will stress-test and demonstrate Cardano’s throughput for a public good. Importantly, using ADA as the incentive currency gives real utility to Cardano’s native asset within an academic context – reviewers receive ADA and can use it, highlighting Cardano’s value transfer strengths. Unlike many crypto experiments that issue speculative tokens, our approach uses ADA directly, which showcases Cardano’s core functionality as a reliable transaction and micro-payment platform. If successful, the number of transactions (and eventually smart contract interactions) from an open science platform on Cardano could grow significantly, contributing to network adoption and fee volume in the long run. In short, we’re broadening Cardano’s utility by applying it to the global enterprise of knowledge creation.\n\n\n\n**Showcasing Innovation in Open Science:**\n\nThe decentralized peer review MVP positions Cardano at the forefront of blockchain-for-science innovation. While Ethereum has seen notable DeSci projects, Cardano will now have a flagship example of how its technology can support transparent, community-driven research processes. This is a strong signal to both the crypto community and academia that Cardano is not just a “financial” chain but a platform for solving institutional and societal challenges. Our project directly aligns with Cardano’s reputation for rigorous, research-backed development. (Indeed, Cardano itself was built on peer-reviewed academic research\n\n– now it will enable peer review for academia, completing a virtuous circle.) By delivering a working solution that academics can interact with, we provide a proof-of-concept that Cardano is suitable for serious, mission-driven applications. We anticipate this will draw positive attention: early adopters in the open science movement, organizations looking for trustworthy blockchain solutions, and even media coverage in tech or science outlets noting “Cardano’s blockchain being used to improve peer review.” The MVP can be proudly presented to both the Cardano community and the academic world as a blueprint for innovation in scientific publishing. Such visibility helps strengthen Cardano’s brand as a blockchain for public goods and institutional credibility.\n\n\n\n\n\n**Public Goods and Institutional Credibility:**\n\n\n\nCardano has always emphasized a vision of social impact and academic rigor, which this project exemplifies. By tackling a well-known problem in academia – the inefficiencies of peer review – with Cardano technology, we reinforce the perception that Cardano is a platform for positive change. This contributes to Cardano’s institutional credibility: universities and research institutions are more likely to engage with a blockchain that actively supports academic initiatives. If professors and researchers start using (or even just hearing about) a Cardano-based peer review system, it opens the door for broader conversations about using Cardano in education, research data management, and beyond. Additionally, this project underscores Cardano’s commitment to open-source and community-driven development (the whole MVP is open source, aligning with the academic ethos of knowledge sharing). Supporting an open science tool elevates Cardano’s brand as the blockchain of choice for open knowledge and collaboration. This can differentiate Cardano in the crowded blockchain space as one that isn’t just about DeFi or NFTs, but also about solving real-world coordination problems like scientific peer review.\n\n\n\n\n\nFinally, the success of this MVP could catalyze further development on Cardano in the DeSci and educational domains. It lowers the barrier for future proposals by providing a working codebase and lessons learned. Other teams might build on our open-source framework to create decentralized conference management systems, grant review platforms, or integrate our peer review records with Cardano’s identity systems. Increased development and experimentation strengthen the ecosystem overall. In summary, funding this proposal doesn’t just deliver one product – it seeds an entire new area of utility for Cardano, one that aligns with the platform’s values and showcases its strengths (security, transparency, community governance) to a global audience of academics and knowledge-seekers.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Proven Track Record in Catalyst: \n\n\n\nThis proposal is a direct continuation of an earlier Catalyst-funded research initiative, which means much of the groundwork is already done. The team leveraged the prior funding to deeply understand the problem and de-risk the solution. Over the past year, we conducted an extensive analysis of the scholarly publishing landscape and emerging DeSci platforms, producing a comprehensive report “The State of Decentralized Publishing 2025”. In it, we surveyed 20+ projects (from academic-focused platforms like Orvium and PubWeave to decentralized journalism and content networks) to learn from their architectures, successes, and pitfalls. We also engaged directly with the target user base – interviewing academics, editors, and reviewers – to gather insights into their pain points and what they would want in a new system. These efforts culminated in defining clear user requirements and identifying best practices (e.g. the need to integrate with ORCID, the importance of aligning with academic incentive structures). In short, the team comes into Fund 15 with a validated problem understanding and a community-informed solution approach, rather than starting from scratch.\n\n\n\nClear Plan and Specifications: \n\n\n\nAnother outcome of the prior Catalyst project is that we already have a detailed blueprint for the MVP. We delivered a Functional Requirements Document that enumerates every key feature of the platform, from ORCID login to on-chain logging to DOI integration, effectively serving as the product spec for development. This document (attached to the proposal) ensures that all technical components and user stories are well thought-out and can be directly translated into engineering tasks. Additionally, we formulated a 12-month roadmap for implementation, breaking the work into phases with milestones. For example, Phase 1 covers final design and proof-of-concept, Phase 2 implements core on-chain functions (submission logging, wallet integration), Phase 3 introduces the incentives and open review features in a beta release, and Phase 4 focuses on polishing the UI, documentation, and running a pilot with users. By Month ~6 we plan to have an “alpha” with submission and review transactions working on testnet, by Month ~9 a feature-complete beta on Cardano testnet with at least one real article processed, and by Month 12 the refined MVP and final reports delivered. This phased roadmap is not just theoretical – it’s grounded in the research insights and technical choices we’ve made (for instance, using Cardano transaction metadata for logging to avoid unnecessary complexity in early stages). The clear timeline and milestones show that the team has a realistic execution plan, with progress measurable at each step. We have also identified potential risks (e.g., user onboarding challenges, integration issues) and have mitigation strategies (like providing testnet ADA to users, or simplifying the UI based on user feedback in the pilot). This preparation gives us high confidence in the feasibility of delivering the MVP as promised.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 1: Foundation – Research Integration & System Design","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A finalized MVP requirements document mapping research insights to platform features; a complete system architecture design (hybrid on-chain/off-chain approach using Cardano and IPFS); development infrastructure set up (Cardano testnet node and decentralized storage node configured); initial UI/UX mock-ups for key user flows (submission, review, publication); and an on-chain proof-of-concept transaction on Cardano testnet validating a dummy manuscript submission.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The requirements and architecture documentation are reviewed and cover all identified needs (transparency, incentive alignment, workflow integration). The Cardano testnet and IPFS environment are operational (able to store and retrieve sample content). A successful test transaction is visible on the Cardano testnet (recording a hash and metadata for a dummy submission). Key user flows are captured in wireframes and validated to be intuitive for academics (e.g. “Login with ORCID” -> “Submit manuscript” -> “Assign reviewers” -> “Publish with reviews”).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Links to the requirements and design documents; a Cardano testnet transaction ID or screenshot showing the dummy submission record on-chain; screenshots or prototypes of the UI wireframes for the main user journeys; and repository logs or setup notes confirming the testnet/IPFS environment configuration.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 2: Core Development – Building the MVP Platform","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"An alpha version of the platform back-end and front-end implementing core functionality. This includes user authentication via ORCID OAuth (academics can log in with ORCID credentials, creating a linked user profile); a manuscript submission module (web form to upload a paper with metadata); integration with decentralized storage (e.g. IPFS) to save manuscripts; and on-chain transaction logging of submission data on the Cardano testnet. By this stage, a rudimentary UI allows a user to complete a submission and receive confirmation, and the system records the submission immutably on-chain.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A test user can log in through ORCID and submit a manuscript through the platform. Upon submission, the file is successfully stored on IPFS and a Cardano testnet transaction is created containing the submission’s hash and metadata (timestamp, author ID, etc.). The submission confirmation is displayed in the UI, and the transaction can be verified on a Cardano explorer (proving the on-chain record). The core smart-contract/transaction logic for recording submissions (and the foundational code for reviews) is complete and unit-tested by the team. The platform can handle multiple submissions in sequence without errors, demonstrating stability of the core workflow.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Demo video or screenshots showing the end-to-end submission process (ORCID login -> file upload -> confirmation message). Links to Cardano testnet transaction details for one or more sample submissions (showing hashes and metadata on-chain). An IPFS content hash link that retrieves the stored manuscript file. Link to the code repository or commit history highlighting implementation of ORCID login, submission handling, and blockchain integration.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 3: Beta Launch – Incentives, Open Review, and Pilot Testing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A feature-complete MVP deployed on Cardano testnet, introducing the peer-review workflow and incentive mechanisms. Key deliverables include implementation of the reviewer assignment and review submission workflow (an editor can assign reviewers to a manuscript, and reviewers can submit their review reports through the platform); an open peer review display for published papers (the submitted reviews are published alongside the article, with options for reviewer anonymity or attribution); an automated ADA reward mechanism for reviewers on testnet (upon an editor’s approval of a review, a predefined ADA micropayment is triggered to the reviewer’s wallet); and a basic reviewer reputation system (e.g. points or badges accruing for each completed review on the user’s profile). This phase also delivers a closed beta test: onboarding a small group of ~5–10 academics (authors, reviewers, an editor) to use the platform in a pilot publication of at least one article. Feedback and usage data from this beta test are collected for analysis.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The end-to-end peer review cycle functions correctly on the test platform. An editor is able to assign a reviewer to a test submission; the reviewer completes a review via the platform, which is stored off-chain (IPFS for content) and logged on-chain (hash/metadata on Cardano). Once the editor marks the review as satisfactory, the system automatically disburses a testnet ADA reward to that reviewer’s wallet (verified by a testnet transaction). The reviewer’s profile is updated to reflect the new review (e.g. an incremented review count or badge). At least one scholarly article has moved through the full process — from submission to peer-reviewed publication with open reviews visible — by the end of this phase. The pilot users confirm the workflow is understandable and report any issues; their feedback is documented. System reliability is demonstrated under this limited user load, and any critical bugs from the pilot are identified for fixing.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A published example article on the test platform that includes the article content and its peer review reports (screenshots or a live link). Cardano testnet transaction records showing a review event (hashed proof of review) and the corresponding ADA reward payment to a reviewer’s address. Screenshot of a user’s dashboard or profile showing the reputation metric (e.g. number of reviews completed or badge earned). A summary report of the closed beta/pilot, including participant feedback, observed system performance, and a list of suggested improvements. Link to the updated code repository highlighting features added in this phase (review workflow, open review display, incentives, reputation system).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 4: Pilot Completion – Refinement & Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A refined and polished MVP platform incorporating pilot feedback, plus integration with standard academic infrastructure. In this phase the team will implement UI/UX improvements for better usability (e.g. improved navigation, help tooltips, email notifications for assignments), address any critical bugs or pain points identified in the beta, and ensure security and scalability of the solution. The platform will also integrate academic standards by assigning DOI(s) to the first published paper(s) and ensuring metadata compliance for indexing (so that published research on the platform can be recognized in academic databases). Additional deliverables include a complete set of user documentation (guides for authors, reviewers, editors) and updated technical documentation in preparation for open-sourcing. Finally, a detailed go-live deployment plan is drafted, covering the steps to move the system from testnet to mainnet and operational considerations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All major usability issues identified during the pilot are resolved, and the user interface is validated by testers as easy to navigate for non-crypto-savvy academics by the end of Month 11. The platform demonstrates academic integration by publishing at least one article with an official DOI and open peer reviews attached, with metadata that can be indexed or searched (e.g. Google Scholar meta tags in place). A basic security review is completed (no known show-stopper security vulnerabilities; test transactions and accounts remain secure) and performance tests indicate the system can handle expected load (e.g. multiple concurrent submissions/reviews) without degradation. The documentation is completed and reviewed – including a user manual and technical docs (API references, architectural diagrams, smart contract details) – enabling external contributors or auditors to understand the system. A mainnet transition plan is in place, listing the required configurations, funding for the reward pool, and any legal/compliance checks for launching rewards on mainnet. (This plan aligns with the roadmap’s call for preparing documentation and a go-live strategy in the final phase.)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Before-and-after comparisons or user testing results demonstrating improved UX (for example, feedback from pilot users confirming that new UI changes resolved prior issues). A recorded demonstration or screenshot of a published article on the platform showing its DOI and the accompanying peer review section. Documentation files or links (e.g. a published documentation site or GitHub README/wiki) covering how to use the platform and how it is built. Results of any security/performance testing (e.g. a summary of a code audit or load test report). The written mainnet deployment plan or checklist, ready for execution.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":11,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Milestone 5: Mainnet Readiness & Project Close-Out","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The project’s final deliverable is a mainnet-ready MVP and the successful conclusion of all project work. All features developed on testnet are now prepared to deploy on Cardano mainnet (with any necessary adjustments). Smart contract or transaction scripts for on-chain actions are deployed or ready to deploy on mainnet, and the platform is configured for a production environment. The team will perform a limited launch or final simulation on mainnet to ensure everything works with real ADA (this could be an internal dry-run or a small public pilot on mainnet). Additionally, all project documentation is finalized and the codebase is ready for open-source release (if applicable). The Catalyst final report and close-out documentation are completed, summarizing the project outcomes and budget usage. This milestone also includes any remaining tasks such as team handover, training materials for future maintainers, and using the contingency fund to resolve last issues. Essentially, the product is validated and handed off in a state ready for broader adoption beyond Catalyst.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The platform is connected to the Cardano mainnet (or a final-stage test) and demonstrates core functionality with real transactions – for example, a test submission or review on mainnet yielding an on-chain record and an ADA reward to a connected wallet. All system components (front-end, back-end, blockchain interactions) run smoothly in the live environment, mirroring the stability seen on testnet. The final Catalyst report is submitted, containing links to the open-source code repository and documentation, and outlining the results achieved versus the initial plan. The project is formally closed with all deliverables met, and the team has provided any necessary knowledge transfer or next-step recommendations to the community. The MVP is ready for a broader pilot on Cardano mainnet, marking 100% completion of the project’s scope and setting the stage for future scaling (as noted in the roadmap, the next step after the MVP would be a larger mainnet rollout).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A link or transaction hash on Cardano mainnet showing a representative operation (e.g. a “proof-of-submission” or reward payment transaction from the MVP smart contract) – or a final testnet run if a full mainnet launch is scheduled shortly after. Public communication or an launch announcement indicating the platform’s readiness (could be a blog post or demo video showcasing the MVP on mainnet). The open-source code repository link and published documentation (for example, a GitHub repository with an MIT license and a complete README/user guide). The submitted Catalyst completion report (PDF or accessible link) and close out video confirming that the project has been completed in accordance with the proposal.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Agnostica brings a cross-functional team with deep expertise in blockchain product development, academic research, and user-centered design. This project is led by Alex James, founder of Agnostica—a research consultancy focused on bridging scholarly insight with emerging blockchain applications. Alex is a seasoned product manager with a proven track record delivering both decentralized and SaaS-based tools across multiple ecosystems.\n\n\n\nDeFi Product Leadership: Alex has led product development for Ultra Capital, a non-custodial DeFi yield token frontend built on Stellar, offering users simple access to tokenized yield strategies. He also managed the product roadmap for USDC Swap, a cross-chain stablecoin swap platform. In both cases, Alex directed efforts across smart contract integration, user experience, and go-to-market readiness. These projects required secure backend infrastructure, scalable architecture, and thoughtful onboarding flows for both crypto-native and general users.\n\n\n\nSaaS and UX at Scale: As a Product Manager with Raw.bot, Alex oversaw development of popular Slack-based productivity apps—including BirthdayBot and TimeBot—now used by tens of thousands of teams, with hundreds of thousands of users ldwide. These apps are recognized for their intuitive UX, enterprise-grade reliability, and seamless integration into complex workplace environments.\n\n\n\nDevelopment Capacity On Standby: Drawing from this track record, Alex will bring the same vetted developers and designers from these prior projects into this Cardano initiative. These collaborators include full-stack engineers familiar with blockchain architectures (including Cardano’s Plutus/Haskell tooling), front-end dApp specialists, and experienced designers with a focus on intuitive, low-friction UX. With funding in place, this team is prepared to begin MVP development immediately.\n\n\n\nAcademic and Research Leadership:\n\nDr. Robert Danielson (Co-Founder, Research Lead) is a PhD researcher with over a decade of academic experience. He has authored 25+ peer-reviewed publications, managed nearly $2M in research funding, and served on multiple editorial boards. He brings firsthand understanding of peer review pain points and scholarly infrastructure needs. In this project, Robert leads content design, academic standards integration (ORCID, DOI, etc.), and user validation through outreach to academic beta testers. His grant experience ensures responsible fund use and reporting.\n\n\n\nIn short, Agnostica combines technical readiness, academic insight, and delivery experience. We have the team, infrastructure, and research foundation to execute a usable, testnet-deployed MVP that addresses real problems in academic publishing—and to do so with quality, speed, and community alignment.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Core development** (140,000 ADA ≈ 63,000 USD)\n\n- Assumes roughly 900 developer hours at ~70 USD/hour across:\n    - Smart contract / on-chain dev (Cardano tx flows, reward logic, logging)\n    - Backend APIs and integration (ORCID, storage, DOI registration, auth)\n    - Front-end dApp (submission UI, review dashboard, editor tools, wallets UX)\n- This is roughly:\n    - 0.75–1.0 FTE engineer for 12 months, or\n    - A small pod (e.g., 1 backend/contract dev + 1 front-end dev) at lower part-time capacities.\n\n\n**PM and research leads** (28,000 ADA ≈ 12,600 USD)\n\n- Modest compensation for Alex and Robert, primarily in:\n    - Product management, roadmap oversight, backlog refinement.\n    - Translating prior research into concrete user stories and acceptance criteria.\n    - Academic alignment (ORCID/DOI workflows, reviewer norms, editorial processes).\n    - Stakeholder and pilot-user engagement, plus Catalyst reporting.\n- This corresponds to roughly 180–200 combined hours across the 12-month period (e.g., ~0.1–0.15 FTE each), which is intentionally lean and keeps most budget pointed at build.\n\n\n\n**UX, QA and testing** (10,000 ADA ≈ 4,500 USD)\n\n- Covers UX/design passes and structured testing, including:\n    - Wireframes and interaction design beyond the initial FRD.\n    - At least one dedicated usability review cycle with academics / early testers.\n    - QA cycles for key flows: submission, review, editor decision, reward payout.\n- Approximately 60–70 hours of UX/QA at ~70 USD/hour, potentially split between a UX designer and a QA/test engineer**\\.**\n\n\n\n**Infrastructure and subscriptions** (6,000 ADA ≈ 2,700 USD)\n\n\n\n**E**stimated for the 12-month period:\n\n- Application hosting and containers (e.g., cloud VM/container, load-balanced test env).\n- Decentralized storage pinning or gateway services (e.g., IPFS pinning provider).\n- CI/CD and monitoring tools (build pipelines, error tracking, uptime).\n- Small costs associated with auth/integration (e.g., ORCID sandbox/test, email delivery).\n\nThis is deliberately conservative; if infra comes in cheaper, funds can be shifted toward extra dev hours or additional testing cycles while keeping scope intact.\n\n\n\n**Pilot reviewer incentives** (2,000 ADA ≈ 900 USD)\n\n- Reserved explicitly for testnet pilot participants:\n    - Micro-rewards in ADA for completing real reviews in the MVP pilot.\n    - Demonstrates the incentive model end-to-end (assignment → review → on-chain reward).\n- This aligns with your preference to set aside ~2,000 ADA and keeps us within Catalyst rules (no arbitrary giveaways; rewards are tied to real user actions in the prototype)**\\.**\n\n\n\n**Contingency**   (14,000 ADA ≈ 6,300 USD)\n\n- Around 7% of total budget, used only if needed for:\n    - Unplanned integration work (e.g., DOI / storage / wallet edge cases).\n    - Extra dev hours if something proves more complex than expected.\n    - Additional testing or security review if time permits.\n- If not spent, this effectively becomes extra runway for development or UX polishing, all still within the same MVP scope.\n\n![](https://i.imgur.com/G3aKNQC.jpeg)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"**Why this is a good use of 200,000 ADA**\n\n\n\nThis proposal converts funds directly into a working, open-source prototype on Cardano testnet that solves a real coordination problem in academia (peer review) while driving measurable on-chain activity (submission logs, review logs, reward payouts). Nearly all budget goes to build—developer time—rather than overhead. Alex and Robert take modest compensation and focus on product direction, research alignment, and reporting.\n\n\n\n**Costs are lean and market\\-realistic**\n\n\n\n- Core engineering is budgeted at ~900 hours at ~$70/hr—a conservative rate for experienced web3/full-stack work (typical freelance rates for comparable skills commonly range ~$80–$150/hr).\n- PM/Research lead time is intentionally limited; UX/QA is scoped to essential passes only.\n- Infra is kept minimal (testnet hosting, IPFS pinning, CI/CD).\n- A small 2,000 ADA pool validates the reward loop with real pilot users.\n- A ~7% contingency handles integration unknowns without scope creep.\n\n\n\n**High leverage for Cardano**\n\n\n\nEvery feature is designed to be reusable by other Cardano builders:\n\n\n\n- ORCID sign-in adapter and DOI hooks for academic identity/citations.\n- A simple on-chain schema for timestamped review events.\n- A micro-payout module for ADA incentives tied to verifiable actions.\n- Clear docs and scripts so the community can fork and extend.\n\n\n\n**Low risk, clear deliverables**\n\n\n\nWe aren’t starting from zero—we’re building on completed research, defined functional requirements, and a published roadmap. Success is testable: X submissions, Y reviews, N reward txns, at least one end-to-end publication with open reviews. If ADA’s price moves, we flex hours—not scope—to stay on target.\n\n\n\n**Net result**\n\n\n\nFor ~$90k equivalent, Cardano gets: a public, open-source dApp; a demonstrated real-world use case beyond finance; reusable components other teams can adopt; and early academic partners to help iterate toward mainnet. That is strong value per ADA and a credible path to sustained on-chain usage and ecosystem growth.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Business Services","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1733}