{"pr_id":"019ac18f-dd4e-7089-833a-be61742923c6","title":"Sundial’s Bitcoin-Aware Plutus Smart Contracts","event_id":15,"objective":37,"objective_title":"Cardano Partners: Tier-1 Enterprise Integrations","summary":"Bitcoin lacks a trustless way to earn yield, leaving holders to choose between custodial wrapped bridges or opaque off-chain schemes, with no secure path for native BTC to participate in n-chain DeFi.","solution":"Bitcoin-Aware Plutus gives smart contracts authenticated BTC state, enabling trustless, non-custodial BTC yield strategies with outcomes enforced and verified on-chain.","proposer_name":"Sheldon Hunt","proposer_relevant_experience":"This proposal is led by Sundial, with selective involvement from experienced Cardano ecosystem contributors as needed. Sundial delivers the core research, cross-chain architectural work, Bitcoin primitive integration, Plutus execution-layer extensions, prototype development, and mainnet deployment.\n\n\n\nSome protocol-specific integration tasks may be subcontracted to trusted Cardano developers once pilot protocols are chosen in Milestone 1.\n\n\n\nSundial has extensive experience in UTxO architecture, L2 rollup design, Bitcoin interoperability, and deterministic smart contract systems. This provides the required foundation to safely extend Plutus applications with authenticated Bitcoin state.\n\n\n\n**Sundial**\n\nRole: Lead Applicant, Research, Engineering & Delivery\n\n\n\n- Acts as the Catalyst proposal owner, responsible for milestone delivery, reporting, and cross-team coordination.\n- Leads institutional interviews and requirements mapping with BTC holders and existing Sundial partners.\n- Owns the cross-chain systems architecture, defining how authenticated Bitcoin events map into Sundial’s execution layer and Plutus semantics.\n- Implements the Bitcoin primitive integration, including header-chain processing, UTxO verification, Taproot condition evaluation, and the Bitcoin-state correctness pipeline.\n- Designs and validates the Bitcoin-aware Plutus data interface, ensuring deterministic behavior and compatibility with existing Plutus execution expectations.\n- Oversees pilot protocol integrations, guiding partner teams through adoption of the new interface.\n- Manages mainnet deployment, technical documentation, release preparation, and ecosystem communication.\n- Coordinates technical feedback cycles with Cardano developers, institutional partners, and auditors.\n\n\n\nTeam Lead: Sheldon Hunt\n\nContributors: Sundial’s core architecture, engineering, and product teams.\n\n\n\n**Plutus Contributors \\(Consultative Role During Milestone 2\\)**\n\nDuring Milestone 2, the project will include consultations with members of the Plutus core development community:\n\n\n\n- Review the interface design for conceptual alignment with future Plutus directions.\n- Offer informal design critiques to ensure Bitcoin events integrate cleanly into the existing and future functional execution model.\n\n\n\nThese contributors are not a dependency for delivery; rather, they serve as an expert sounding board to ensure the interface is future-proof and ecosystem-aligned.\n\n\n\n**External Contributors \\(Contracted as Needed\\)**\n\nOnce the two pilot Cardano DeFi protocols are selected, certain tasks may be subcontracted to ecosystem developers already familiar with those protocols:\n\n\n\n- pilot integration wiring,\n- protocol adapter creation,\n- off-chain indexing or transaction-building support.\n\n\n\nContracted contributors will be chosen for their familiarity with the specific DeFi architectures involved, ensuring efficient and reliable execution without unnecessary onboarding overhead.\n\n\n\nNo additional vendors or external systems are required. Sundial maintains full control over design, implementation, testing, and deployment.","url":null,"funds":700000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Sundial’s Bitcoin-Aware Plutus Smart Contracts","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Sheldon Hunt","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an Incorporated entity or a Consortium?","description":"Are you submitting this proposal as an Incorporated entity or a Consortium?","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 250,000 and $ADA 750,000","format":null,"answer":700000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Bitcoin lacks a trustless way to earn yield, leaving holders to choose between custodial wrapped bridges or opaque off-chain schemes, with no secure path for native BTC to participate in n-chain DeFi.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Bitcoin-Aware Plutus gives smart contracts authenticated BTC state, enabling trustless, non-custodial BTC yield strategies with outcomes enforced and verified on-chain.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.sundialprotocol.com/","https://github.com/sundial-protocol/sundial-monorepo"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"This project is deliberately structured to be low-dependency, high-impact, relying on well-understood Bitcoin and Cardano primitives while keeping all critical engineering work fully within Sundial’s control. The design avoids reliance on wrapped assets, external relayer networks, or bespoke multisig systems, ensuring that delivery is predictable and independent of third-party bottlenecks. Core Dependencies Sundial L2 environment The Bitcoin-aware Plutus extensions are developed and deployed directly within Sundial’s execution layer, which already aligns structurally with the UTxO model used by both Bitcoin and Cardano.   Bitcoin full node / header verification pipeline Required for authenticated access to Bitcoin headers, Merkle proofs, and Taproot spend conditions. This relies on standard Bitcoin infrastructure and does not introduce new trust assumptions.   Cardano Plutus execution semantics The design maintains compatibility with existing Plutus behavior. Consultation with members of the Plutus core development team may be sought where helpful to ensure conceptual consistency and future-proof interface design, but no direct dependency is introduced.   Two Cardano DeFi protocols Selected during the research phase for pilot integrations to validate real-world developer workflows and demonstrate Bitcoin-driven logic in practice.   Institutional interview participants Sundial’s existing institutional contacts and prospective BTC partners, who have agreed in principle to participate in research, feedback cycles, and pilot evaluations. Non-Dependencies No multisig custody The system relies solely on Bitcoin-native Taproot and UTxO primitives; no federated key management is required.   No centralized relayers or external bridging networks Bitcoin state is consumed through directly authenticated proofs, removing reliance on trusted intermediaries.   No third-party oracle dependence All Bitcoin data incorporated into Sundial is locally validated and deterministic.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","description":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","format":null,"answer":"All infrastructure outputs will be fully open-source under MIT licence, and available on Github.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Smart Contracts","group":"Smart Contracts"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your established collaborations.","description":"Please provide your rationale for your established collaborations.","format":null,"answer":"Solv — Institutional BTC Yield Partner\n\nWebsite: [https://solv\\.finance/](https://solv.finance/)\n\n\n\nSundial is collaborating with Solv, a leading institutional BTC yield provider generating over $5M in annual revenue through structured Bitcoin yield products and institutional-grade on-chain financial instruments. Solv works with funds, desks, and professional allocators, and has a proven track record of secure, compliant BTC yield delivery.\n\n\n\nRole in the Project:\n\nSolv will serve as Sundial’s primary institutional validation partner for Bitcoin-aware Plutus logic, providing real-world BTC yield requirements, risk parameters, liquidation thresholds, and operational constraints. Their expertise in designing safe BTC yield strategies ensures that Sundial’s Bitcoin-Aware Plutus extension is aligned with what institutional allocators actually need.\n\n\n\nNature of Collaboration:\n\n- Institutional advisory on BTC-backed yield architecture\n- Participation in design reviews, pilot integrations, and evaluation of Bitcoin-triggered contract logic\n- Testing and feedback on institutional UX and compliance needs\n- Input into yield-related primitives (collateral ratios, settlement rules, risk constraints)\n\n\n\nSolv’s involvement ensures Sundial’s BTC-aware interface is not theoretical—it is aligned with an active, revenue-generating institutional partner serving real BTC clients.\n\n\n\nIf required, further collaboration details can be provided confidentially to the Catalyst team.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe funding commitments.","description":"Please provide your rationale for your funding commitments.","format":null,"answer":"Solv has committed non-financial but material support to this project through engineering involvement, institutional requirements mapping, and participation in pilot integrations. While no direct financial contribution is made to the Catalyst budget, Solv is committing:\n\n- Engineering advisory time (estimated equivalent value: ~$50,000 USD)\n- Institutional testing and validation resources\n- Access to their BTC product design frameworks\n- Participation in integration cycles during Milestones 4–6\n\n\n\n\n\nThis commitment is substantial and reflects Solv’s commercial interest in launching safe, non-custodial BTC yield strategies on Cardano through Sundial’s Bitcoin-aware Plutus interface.\n\n\n\nSolv’s institutional engagement reduces risk, accelerates institutional adoption, and ensures the final output meets the standards of a yield provider with over $5M/year revenue.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your key performance metrics.","description":"Please provide your rationale for your key performance metrics.","format":null,"answer":"To measure success, Sundial will track KPIs that directly reflect institutional readiness and the ability for Cardano DeFi to safely attract BTC capital:\n\nPrimary KPIs\n\n1. Institutional Partner Validation Count:\n- Target: 1 major partner confirmed (Solv) + 2 additional institutional reviewers\n- Why it matters: Demonstrates real-world institutional acceptance of the Bitcoin-aware interface.\n2. BTC Yield Strategy Compatibility:\n- Target: Solv BTC yield strategies mapped to Plutus-compatible triggers\n- Why it matters: Ensures Cardano DeFi can support real BTC capital inflows.\n\n3)Protocol Integration KPIs:\n\n- 2 Cardano DeFi protocols integrated and functioning with authenticated BTC state\n- Why it matters: Validates practical utility beyond research.\n1. Developer Adoption Metrics:\n- SDK downloads\n- Documentation visits\n- Number of external teams experimenting with BTC-aware primitives\n- Why it matters: Measures ecosystem interest and potential for long-term expansion.\n\nContext &amp; Importance\n\nThese KPIs directly measure whether the project’s outputs can:\n\n- Support real institutional BTC flows\n- Enable revenue-generating partners like Solv to deploy BTC strategies on Cardano\n- Expand Cardano’s cross-chain expressiveness and liquidity surface\n- Create practical, reusable infrastructure that protocols can adopt immediately\n\nBy anchoring metrics to institutional usage, integration success, and BTC flow readiness, the KPIs ensure this proposal delivers measurable value beyond technical implementation.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"This project extends Sundial’s execution environment with a Bitcoin-aware Plutus interface that allows smart contracts to read authenticated Bitcoin state directly without multisig custody, federated nodes, centralized relayers, or external oracles.\n\nThe goal is to enable Plutus contracts to consume verified Bitcoin headers, Merkle proofs, Taproot spending conditions, and time-locked events as native inputs, allowing developers to write logic that reacts deterministically to Bitcoin activity.\n\nBy treating Bitcoin data as read-only state available inside Sundial’s Plutus engine, dApps gain the ability to trigger collateral actions, automate settlements, validate deposits, and execute conditional flows based solely on proven Bitcoin events. This approach integrates seamlessly with Sundial’s L2 architecture: the embedded Bitcoin verifier supplies state, and Plutus scripts treat it as a guaranteed, deterministic input. No changes are required to Bitcoin or Cardano itself, and all verification happens inside Sundial using well-defined interfaces.\n\nTo ensure compatibility, we design the extension so that existing Plutus semantics remain unchanged, while adding new data channels for externally verified Bitcoin facts. This prevents fragmentation and ensures that any Plutus contract - current or future - can operate on Bitcoin data without rewriting core logic. Developers can integrate BTC-aware operations by referencing structured state objects exposed as Plutus-level primitives.\n\nThe system enforces fully deterministic behavior: a Bitcoin event is either proven and available to Plutus or entirely excluded, with no intermediate or ambiguous states. For BTC depositors and institutional users, this guarantees that Sundial cannot invent Bitcoin activity or alter position outcomes, as every trigger originates from a locally verified header chain and authenticated proofs. This creates predictable behavior for users, preserves full self-custody for large BTC holders, and provides developers with a consistent, long-term interface for integrating Bitcoin-driven logic into DeFi strategies, lending flows, game mechanics, and settlement systems.\n\nBy propagating Bitcoin proofs directly into Plutus, Sundial becomes the first environment where native BTC can drive on-chain programmable logic without ever leaving the Bitcoin network, an essential requirement for high-value participants.\n\n\n\n**What We Will Build**\n\n\n\n**Expressiveness Evaluation and Selection**\n\nEvaluate six Cardano DeFi protocols to map which types of Bitcoin-derived inputs (headers, timelocks, transaction proofs, spend conditions) directly enable or unlock new strategy types, identifying which data structures best fit existing and future use cases.\n\n\n\n**Unified and General Plutus Extensions**\n\nDesign a backward-compatible extension of the Plutus execution environment that exposes Bitcoin-verified state as native read-only primitives while ensuring long-term compatibility with future Plutus versions and the overall Cardano execution model.\n\n\n\n**Development and Testing**\n\nImplement, integrate, and validate the Bitcoin-aware Plutus extensions within Sundial’s execution environment. This includes end-to-end testing of Bitcoin verification paths, Plutus-level data exposure, deterministic contract execution, and compatibility with existing DeFi patterns. The goal is to confirm correctness, performance, and developer usability under real network conditions.\n\n\n\n**Open Framework Release**\n\nPublish the full architecture, SDKs, documentation, and integration guides as an open framework. This enables other builders to adopt the same Bitcoin-aware Plutus model with minimal friction, ensuring reuse across the wider Cardano and UTxO developer ecosystem.\n\n\n\n**Institutional Research and User Interviews**\n\nConduct structured interviews with large BTC holders, trading desks, and custody institutions to define acceptable risk, control boundaries, and required guarantees for Bitcoin-aware programmability.\n\n\n\n**Cardano Developer Interviews**\n\nEngage with Cardano DeFi teams, Plutus engineers, and infrastructure providers to identify developer expectations, preferred patterns, and pain points in integrating external data sources into Plutus-based systems.\n\n\n\nThis project delivers a Bitcoin-aware Plutus interface for Sundial, allowing dApps to read authenticated Bitcoin state directly and enabling programmable BTC-driven behavior without wrapping, custody, or trusted intermediaries.\n\n\n\nFor the Cardano DeFi ecosystem, this capability introduces authenticated access to Bitcoin activity and external UTxO-chain liquidity, enabling entirely new categories of cross-chain financial primitives while preserving existing Plutus semantics. By providing secure, deterministic, fully on-chain visibility into Bitcoin state, the design expands the expressive and economic scope of Cardano-native applications and opens the door to participation from large-scale BTC capital.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project establishes the foundation for Bitcoin-integrated, institutionally acceptable DeFi on Cardano ecosystem, enabling smart contracts to operate on authenticated Bitcoin events without wrapped assets, custodial relayers, or multisig intermediaries. By introducing a predictable, verifiable interface between Bitcoin and Plutus, it equips Cardano DeFi with the technical assurances needed for high-value users and professional market participants to engage with on-chain strategies involving native BTC.\n\nToday, Cardano DeFi is constrained by its isolation from external liquidity and the absence of reliable, verifiable cross-chain signal handling. By supplying deterministic Bitcoin state to Plutus contracts, this initiative removes those barriers and allows Cardano-based protocols to build new financial products driven by the largest pool of crypto capital. \n\nThe result is a step-change in Cardano’s expressive and economic capability, expanding its user base beyond typical DeFi participants to include allocators, vault designers, structured product desks, and institutional Bitcoin holders.\n\n\n\n**1\\. Enabling Bitcoin\\-Native Capital to Enter Cardano DeFi**\n\nSundial’s verified-Bitcoin interface allows BTC holders to engage with Cardano-based financial logic while retaining full Bitcoin-layer custody. This lowers the operational and regulatory friction traditionally associated with cross-chain exposure and gives institutions a path to access Cardano’s smart contract ecosystem without onboarding synthetic assets or relying on custodial bridges. With authenticated Bitcoin data available directly to Plutus, Cardano becomes viable for BTC-backed strategies, allowing new capital to flow into lending markets, automated execution engines, or hedged yield structures with clear, on-chain auditability.\n\n\n\n**2\\. Expanding Cardano DeFi Into a Cross\\-Chain Product Platform**\n\nThe framework transforms Cardano’s DeFi capabilities by allowing protocols to incorporate verifiable external state without redesigning their execution logic. This increases the range of financial behaviors Plutus contracts can express and enables the creation of new product categories that depend on Bitcoin activity, settlement conditions, or time-locked guarantees. Developers can innovate without constructing custom cross-chain bridges or oracle systems, accelerating experimentation and creating a richer ecosystem of financial products that reach beyond Cardano’s native liquidity base.\n\n\n\n**3\\. Streamlined User Experience With Deterministic State**\n\nFor end users, Bitcoin-aware Plutus contracts unify multiple networks into a single, predictable execution model grounded in the determinism of the UTxO paradigm. Because both Bitcoin and Cardano use UTxO-based state machines, the system can expose proven Bitcoin events to Plutus in a form that behaves identically to native on-chain inputs. Users benefit from strict determinism: a Bitcoin event is either fully proven and available to a contract or omitted with no intermediate or uncertain states. This removes the ambiguity and race conditions typical of account-based cross-chain systems, reduces mental overhead for users, and eliminates reliance on probabilistic or stateful relayers. The result is a consistent interaction model where advanced users and institutions can trust settlement conditions and deploy more sophisticated strategies driven directly by authenticated Bitcoin-layer events.\n\n\n\n**4\\. Ecosystem\\-Wide Advantages**\n\nBecause the design is modular and reusable, Cardano protocols can adopt the Bitcoin-aware model with minimal adaptation. This expands the economic surface area of the ecosystem:\n\n- DeFi developers gain a standardized interface for integrating Bitcoin state.\n- Protocols can attract new users and external liquidity without altering their core logic.\n- The broader ecosystem gains access to capital sources traditionally constrained to Bitcoin-native platforms.\n\n\n\nThis initiative strengthens Cardano’s position as a cross-chain execution environment capable of supporting high-value financial logic while preserving decentralization and security.\n\n\n\n**5\\. Long\\-Term Strategic Value**\n\nThe project delivers lasting benefits beyond the initial implementation. As the interface becomes widely adopted:\n\n- Sundial can scale Bitcoin-based flows and broaden its risk-managed yield systems.\n- Cardano DeFi protocols can incorporate Bitcoin triggers and liquidity without custom engineering.\n- Institutional users gain a durable technical pathway to operate within Cardano-based financial systems.\n\n\n\nThe result is a sustainable expansion of Cardano’s economic landscape, driven by native BTC participation and an execution environment capable of supporting long-term institutional adoption.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Team Strength &amp; Experience**\n\nThis project is delivered by Sundial ([https://www\\.linkedin\\.com/company/sundial\\-protocol](https://www.linkedin.com/company/sundial-protocol) - founded by [https://www\\.linkedin\\.com/in/sheldonhunt\\),](https://www.linkedin.com/in/sheldonhunt),) an experienced engineering team with deep specialization across Cardano’s eUTxO model, optimistic rollup architecture, Bitcoin network internals, and the Plutus execution environment. The team has spent years designing UTxO-native scaling systems, cross-chain verification mechanisms, and non-custodial liquidity frameworks, giving them the technical breadth required to implement Bitcoin-aware Plutus functionality with rigor and precision. Sundial’s work focuses on bridging Bitcoin and Cardano without wrapped assets, trusted relayers, or multisigs - aligning perfectly with the requirements of this proposal.\n\n**Sundial’s Role**\n\nSundial is developing an L2 architecture designed to bring Bitcoin-native liquidity into Cardano through trust-minimized, UTxO-based mechanisms, enabling BTC to participate in DeFi while remaining fully self-custodied on Bitcoin.\n\nThe team is already implementing core components needed for institutional BTC strategies - authenticated header-chain tracking, Taproot-based spending logic, UTxO-level event extraction, and deterministic settlement flows. These capabilities provide the technical base for secure BTC-backed operations without wrapped assets or custodial intermediaries.\n\nThis proposal builds directly on that foundation by extending Sundial’s Bitcoin-state infrastructure from partner-specific yield strategies to a general-purpose interface available to all Cardano DeFi protocols. Instead of serving isolated institutional flows, authenticated Bitcoin events become standardized, deterministic inputs that any protocol can integrate - enabling lending platforms, structured vaults, trading systems, and future UTxO-native applications to incorporate real Bitcoin activity safely and predictably.\n\nAs part of the project, Sundial will lead institutional research, define the cross-chain architecture for Bitcoin-aware execution, integrate the new capabilities into its L2 environment, and deliver full documentation and validation.\n\nBecause Sundial already works directly with institutional BTC holders, the design remains grounded in real operational and security requirements, ensuring the resulting system is both technically sound and aligned with the needs of high-value participants while unlocking ecosystem-wide BTC programmability for Cardano.\n\n**Technology Foundation**\n\nThe proposal leverages a strong alignment between Bitcoin’s UTxO model and Cardano’s eUTxO model, giving this project a natural structural advantage:\n\n- Both networks use immutable UTxO state, enabling deterministic replay and formal verification.\n- Bitcoin’s block headers, Merkle proofs, and Taproot spending conditions map cleanly to Plutus’s functional execution semantics.\n- Sundial’s design is already aligned with Bitcoin’s core primitives, including UTxO structure, Taproot spending logic, and ongoing trust-minimized bridging efforts between Bitcoin and Cardano. This compatibility makes exposing authenticated Bitcoin events to Plutus a natural extension of the system rather than a major architectural shift.\n- This architectural compatibility minimizes integration friction: Bitcoin data can be exposed to Plutus contracts as native, read-only state objects without introducing side effects or mutability concerns.\n\nThis compatibility makes exposing authenticated Bitcoin events to Plutus a natural extension of the system rather than a major architectural shift.\n\n**Feasibility &amp; Validation Approach**\n\nTo ensure reliable delivery, the project follows a staged and verifiable development plan:\n\nGrounded Research\n\n- Conduct structured interviews with five institutional BTC holders already in Sundial’s pipeline.\n- Evaluate six Cardano DeFi protocols to understand required Bitcoin inputs and integration points.\n- Select two protocols for pilot integrations to validate usability and technical fit.\n\nCollaborative Design\n\n- Define architectural interfaces for exposing authenticated Bitcoin events within Sundial’s execution environment.\n- Coordinate with the Plutus core development team to ensure the design aligns with current Plutus semantics and future roadmap directions.\n- Produce prototypes demonstrating how Bitcoin-derived state is presented to Plutus-based applications.\n- Review prototypes with Cardano protocol developers to validate technical correctness and integration clarity.\n- Engage institutional users to verify that the proposed interfaces meet real-world requirements and operational expectations.\n\nIncremental Implementation\n\n- Integrate an authenticated Bitcoin header-chain and proof-verification component into Sundial’s execution layer.\n- Expose Bitcoin state objects to Plutus scripts as deterministic read-only primitives.\n\nTesting &amp; Validation\n\n- Conduct full-cycle testing on testnet with protocol partners and institutional test accounts.\n- Validate correctness, determinism, throughput, and execution behavior under real usage patterns.\n\nMainnet Launch\n\n- Deploy the Bitcoin-aware Plutus capability as a production-ready feature.\n- Release developer guides and integration specifications tailored to Cardano DeFi teams.\n- Ensure the system aligns with Sundial’s production rollout and institutional integration roadmap.\n\n\n\n**Track Record &amp; Ecosystem Commitment**\n\nThe Sundial team participates actively in Cardano’s technical ecosystem and delivers foundational components for L2 scaling, UTxO-based bridging, and modular verification systems. Its work emphasizes open, reusable infrastructure that benefits DeFi protocols, institutions, and developers alike. This combination of technical capability, institutional access, and ecosystem alignment ensures the project can be executed efficiently and with measurable impact for Cardano’s long-term growth.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Institutional Research & Requirements Mapping","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Summary of institutional interviews outlining BTC trust boundaries, risk expectations, and programmability needs.\n- Evaluation matrix of six Cardano DeFi protocols and required Bitcoin-derived inputs.\n- Initial mapping of deterministic Bitcoin signals into UTxO/Plutus-ready structures.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Five institutional interviews completed with documented insights.\n- Six DeFi protocols assessed with clear relevance scoring for BTC data needs.\n- Draft schema produced for Bitcoin event types consumable by Plutus.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Published research summary and protocol evaluation report.\n- Public AMA recording and accompanying community feedback notes.\n- Blog or media article outlining findings and inviting wider discussion.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":70000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cross-Chain Execution & Interface Design","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Bitcoin event interface specs (headers, proofs, Taproot data, UTxO metadata).\n- Plutus-facing data layer design and prototype interface flows.\n- Validation flows aligned with institutional requirements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Interfaces match Plutus semantics and are reviewed by core Plutus engineers.\n- Cross-chain event mapping prototypes function as deterministic, read-only inputs.\n- Institutional and protocol-builder feedback incorporated into final designs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Published architectural documentation and prototype specs.\n- Feedback report from Plutus team and ecosystem engineers.\n- AMA + public article summarizing design and capturing community input.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":105000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Bitcoin Primitive Integration & Internal Prototyping","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Integrated Bitcoin primitives (headers, Merkle proofs, Taproot checks) in Sundial’s execution layer.\n- Prototype interfaces exposing deterministic BTC event streams to Plutus.\n- Proof-of-state correctness logic implemented.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Bitcoin data ingested deterministically and verifiably within the eUTxO model.\n- All BTC event proofs validate against an authenticated header chain with no trusted assumptions.\n- Internal prototypes demonstrate replay-safe, Plutus-accessible BTC event inputs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Prototype repos showing validated BTC ingestion and proof logic.\n- Internal test reports demonstrating deterministic behavior and replay safety.\n- Technical brief documenting Bitcoin-to-eUTxO mapping and verification model.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":210000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Pilot Protocol Integrations","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Bitcoin-aware primitives integrated into two Cardano DeFi protocols.\n- Functional BTC-triggered logic paths (collateral, settlement, timing).\n- Institutional tester feedback incorporated into refinements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Protocols can reliably consume authenticated Bitcoin state.\n- BTC-based triggers execute deterministically and safely within protocol rules.\n- Institutional reviewers confirm usability, correctness, and compliance readiness.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Pilot integration repos showing full BTC-state consumption flows.\n- Test logs validating trigger execution and contract safety.\n- Summary report from institutional testing sessions.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":70000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Comprehensive Testing & Ecosystem Review","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Full-system test suite covering all Bitcoin-aware components.\n- Finalized integration docs, migration guides, and interface specs.\n- Independent third-party security audit of Bitcoin-state pipeline.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Deterministic replay, proof verification, and reorg-handling validated.\n- Bitcoin finality mapped correctly into deterministic UTxO semantics.\n- Ecosystem and institutional reviewers confirm usability and correctness.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Comprehensive QA report, including replay, reorg, and finality tests.\n- Validation logs demonstrating safe propagation of Bitcoin chain updates.\n- Updated documentation set and production-ready interface specs.\n- Published third-party security audit with findings and fixes.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":140000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #6","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mainnet Release & Public Integration Framework","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Production-ready Bitcoin-aware interface deployed to Sundial mainnet\n- Public integration documentation, patterns, and examples\n- Institutional onboarding and review package\n- Close out video for the Catalyst team and community","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Mainnet interface demonstrates stable, deterministic BTC event consumption\n- Documentation enables third-party DeFi teams to integrate without support\n- Institutional reviewers confirm readiness for onboarding","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Mainnet release package (binaries/scripts) and deployment logs\n- Published developer docs and integration guides\n- Final announcement + institutional onboarding summary\n- A video presentation of the close out report","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":70000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"This proposal is led by Sundial, with selective involvement from experienced Cardano ecosystem contributors as needed. Sundial delivers the core research, cross-chain architectural work, Bitcoin primitive integration, Plutus execution-layer extensions, prototype development, and mainnet deployment.\n\n\n\nSome protocol-specific integration tasks may be subcontracted to trusted Cardano developers once pilot protocols are chosen in Milestone 1.\n\n\n\nSundial has extensive experience in UTxO architecture, L2 rollup design, Bitcoin interoperability, and deterministic smart contract systems. This provides the required foundation to safely extend Plutus applications with authenticated Bitcoin state.\n\n\n\n**Sundial**\n\nRole: Lead Applicant, Research, Engineering & Delivery\n\n\n\n- Acts as the Catalyst proposal owner, responsible for milestone delivery, reporting, and cross-team coordination.\n- Leads institutional interviews and requirements mapping with BTC holders and existing Sundial partners.\n- Owns the cross-chain systems architecture, defining how authenticated Bitcoin events map into Sundial’s execution layer and Plutus semantics.\n- Implements the Bitcoin primitive integration, including header-chain processing, UTxO verification, Taproot condition evaluation, and the Bitcoin-state correctness pipeline.\n- Designs and validates the Bitcoin-aware Plutus data interface, ensuring deterministic behavior and compatibility with existing Plutus execution expectations.\n- Oversees pilot protocol integrations, guiding partner teams through adoption of the new interface.\n- Manages mainnet deployment, technical documentation, release preparation, and ecosystem communication.\n- Coordinates technical feedback cycles with Cardano developers, institutional partners, and auditors.\n\n\n\nTeam Lead: Sheldon Hunt\n\nContributors: Sundial’s core architecture, engineering, and product teams.\n\n\n\n**Plutus Contributors \\(Consultative Role During Milestone 2\\)**\n\nDuring Milestone 2, the project will include consultations with members of the Plutus core development community:\n\n\n\n- Review the interface design for conceptual alignment with future Plutus directions.\n- Offer informal design critiques to ensure Bitcoin events integrate cleanly into the existing and future functional execution model.\n\n\n\nThese contributors are not a dependency for delivery; rather, they serve as an expert sounding board to ensure the interface is future-proof and ecosystem-aligned.\n\n\n\n**External Contributors \\(Contracted as Needed\\)**\n\nOnce the two pilot Cardano DeFi protocols are selected, certain tasks may be subcontracted to ecosystem developers already familiar with those protocols:\n\n\n\n- pilot integration wiring,\n- protocol adapter creation,\n- off-chain indexing or transaction-building support.\n\n\n\nContracted contributors will be chosen for their familiarity with the specific DeFi architectures involved, ensuring efficient and reliable execution without unnecessary onboarding overhead.\n\n\n\nNo additional vendors or external systems are required. Sundial maintains full control over design, implementation, testing, and deployment.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Milestone 1: Institutional Research & Requirements Mapping (Month 2)\n\nBudget: 70,000 ADA\n\n- Institutional Research & Interviews with 5 BTC Holders : 25,000 ADA\n- Cardano Protocol Evaluation (6 Projects) & Mapping Integration Needs : 35,000 ADA\n\nBitcoin–Plutus Requirements Analysis : 10,000 ADA\n\nMilestone 2: Cross-Chain Execution & Interface Design (Month 4)\n\n- Budget: 140,000 ADA\n- Bitcoin Event Interface Specification (headers, proofs, Taproot primitives) : 45,000 ADA\n- Plutus-Facing Data Layer Design: 45,000 ADA\n- Prototype Architectural Mapping + Validation Flows : 50,000 ADA\n\nMilestone 3: Bitcoin Primitive Integration & Internal Prototyping (Month 6)\n\nBudget: 210,000 ADA\n\n- Header-Chain Processing & Authenticated Sync Implementation : 70,000 ADA\n- Implementation of UTxO Verification + Taproot Spending Condition Evaluation : 55,000 ADA\n- Deterministic Bitcoin Event Stream Prototyping : 40,000 ADA\n- Proof-of-Bitcoin-State-Correctness Core Logic & Internal Testing : 35,000 ADA\n- Technical Documentation: Primitive Mapping to eUTxO Semantics : 10,000 ADA\n\nMilestone 4: Pilot Protocol Integrations (Month 7)\n\nBudget: 70,000 ADA\n\n- Integration of Bitcoin-Aware Inputs into Two Cardano DeFi Protocols : 15,000 ADA\n- Validation of BTC-Triggered Contract Logic : 35,000 ADA\n- Institutional Testing Sessions & Data Collection : 15,000 ADA\n- Integration Review & Refinement Cycles : 5,000 ADA\n\nMilestone 5: Comprehensive Testing, Security Audit & Ecosystem Review (Month 8)\n\nBudget: 140,000 ADA\n\n- Full-System Determinism & Replay Testing Across BTC → Sundial → Plutus : 40,000 ADA\n- Bitcoin Reorg Handling & Finality-Mapping Validation : 25,000 ADA\n- Ecosystem Review Sessions with Cardano Builders + Institutional Testers : 20,000 ADA\n- Documentation, Migration Guides, and Technical References : 20,000 ADA\n- Improvements made in response to the security audit, including remediation steps, design adjustments, and post-fix validation: 35,000 ADA\n\nMilestone 6: Mainnet Release & Public Integration Framework (Month 9)\n\nBudget: 70,000 ADA\n\n- Mainnet Deployment of Bitcoin-Aware Execution Layer : 30,000 ADA\n- Public Documentation, Developer Guides & Examples : 20,000 ADA\n- Institutional Onboarding, Coordination & Final Validation : 20,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The proposal concentrates resources on concrete, high-leverage outcomes that meaningfully expand Cardano’s DeFi capabilities:\n\n\n\n- Introduces authenticated, deterministic Bitcoin-state access to the Plutus execution environment.\n- Enables Cardano protocols to operate with external liquidity and cross-chain triggers without custodial bridges.\n- Provides a developer-ready integration model validated with real institutional users.\n- Leverages Sundial’s active ecosystem involvement to ensure adoption and long-term relevance.\n\n\n\nWith clear milestones, deliverables, and institutional alignment, the project delivers measurable progress while maximizing the impact of the requested budget.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead applicant is a verified legal business entity.","description":"Legal Entity:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead org has a ≥2-year track record, and the consortium collectively has ≥$5M in verifiable annual revenue.","description":"Track Record & Revenue:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of collaboration with a qualified Tier-1 enterprise is provided.","description":" Tier-1 Collaboration:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is for mature R&D or integration, not an early-stage concept or core infrastructure.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of a mature product is provided, with a clear integration plan if not already on Cardano.","description":"Mature Product & Path:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that all key partners, including the Tier-1 collaborator, are clearly identified.","description":"Partner Identification:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that a clear statement of the partner's in-kind or financial contributions is included.","description":"Partner Commitment:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable references (e.g., LinkedIn, portfolio) for key team members.","description":"Verifiable Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear KPIs for adoption (e.g., transaction volume, user growth). Forecast for projected on-chain transaction volume is provided with adequate justification.","description":"Measurable Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that delivery is ≤ 12 months with clear milestones.","description":"Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a co-marketing or community engagement plan to amplify Cardano's visibility.","description":"Visibility & Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal budget is for future work only, not for completed tasks. No incentives, giveaways, private treasuries and regranting are included in the budget.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1300118","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Smart Contracts","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1734}