{"pr_id":"019ab75c-72c4-767a-a54a-aeee523e6eed","title":"Entropic - Open Source Cardano Treasury AI Risk-Analyst","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano lacks tools to show how different funding strategies and ADA’s volatility affect treasury risk, leaving voters and DReps without quantitative support for resilient funding decisions.","solution":"Photrek builds a treasury risk analyst using coupled-entropy to evaluate funding strategies via scenario forecasts and risk metrics, guiding treasury decisions impacted by currency volatility.","proposer_name":"Photrek, Inc.","proposer_relevant_experience":"**_Photrek_**, a team with extensive experience in complex decision systems and blockchain governance, leads this project. On the administrative and oversight side, Megan Hess and Dr. Kenric Nelson provide leadership, strategic direction, and project governance. Igor Oliveira leads the technical team to drive continued development. Supporting the project’s community engagement and communications efforts, Inés Gaviña will facilitate feedback gathering and ensure clear, effective outreach. Together, this team combines strong leadership, technical expertise, and community focus to launch this project successfully.\n\n\n\nM. Sc Igor Oliveira serves as an algorithm developer, scientist and collaborative partner at **_Photrek, _**Inc**_\\._**, conducting research in complex systems, socioeconophysics, machine learning,  quantum computing, and evolutionary dynamics. He graduated summa cum laude with a Bachelor of Science in Materials Physics and also has a Master of Science in Physics. Igor served as a community teaching assistant for the MITx course 6.86x: Machine Learning with Python, achieving exceptional performance. His team won Brazil's first quantum computing hackathon, sponsored by IBM and Itaú Unibanco, to solve a portfolio optimization problem. He co-founded the first Society of Physics Students (SPS) chapter in Latin America, promoting outreach events that bridged physics research and community engagement.\n\n[https://www\\.linkedin\\.com/in/igorgibernoot/](https://www.linkedin.com/in/igorgibernoot/) \n\n\n\nDr. Kenric Nelson is Founder and President of **_Photrek_**, Inc., which is developing novel approaches to Complex Decision Systems, including dynamics of cryptocurrency protocols, sensor systems for machine intelligence, robust machine learning methods, and novel estimation methods. He served on the Cardano Catalyst Circle governance council and is leading a revitalization of Sociocracy for All’s @work circle. Prior to launching Photrek, Nelson was a Research Professor with Boston University Electrical & Computer Engineering (2014-2019) and Sr. Principal Systems Engineer with Raytheon Company (2007-2019). He has pioneered novel approaches to measuring and fusing information. His nonlinear statistical coupling methods have been used to improve the accuracy and robustness of radar signal processing, sensor fusion, and machine learning algorithms. His education in electrical engineering includes a B.S. degree Summa Cum Laude from Tulane University, an M.S. degree from Rensselaer Polytechnic Institute, and a Ph.D. degree from Boston University. His management education includes an Executive Certificate from MIT Sloan and participation in NSF’s I-Corp. \n\n[https://www\\.linkedin\\.com/in/kenric\\-nelson\\-ph\\-d\\-7495b77/](https://www.linkedin.com/in/kenric-nelson-ph-d-7495b77/)\n\n\n\nMegan Hess, Treasurer & Benefits Officer at **_Photrek_**, Inc. With 5+ years of experience in the Cardano ecosystem, Megan has led initiatives for startups like Wada and DIT in Cameroon, as well as managing a family farm in Cameroon. Currently, she serves as Vice Chair on Intersect’s Budget Committee. Megan first collaborated with Photrek on their F4 Catalyst project, \"Diversifying Voting Influence,\" and has been selected to lead the Photrek Cardano Circle, where she is committed to driving innovation and supporting decentralized governance and risk intelligence. With a Bachelor’s degree in Physics from the University of Denver and a background in teaching math and physics, Megan excels in communication, team facilitation, and applying sociocratic principles to her management style. Living between the US and Cameroon for the past 6 years with her family, Megan brings a global perspective and a commitment to driving innovation in decentralized governance for the Cardano ecosystem.\n\n[https://www\\.linkedin\\.com/in/megan\\-hess\\-5b853292/](https://www.linkedin.com/in/megan-hess-5b853292/) \n\n\n\nCommunity Engagement and Communications:\n\nInés Gaviña; BA in Literature, University of Buenos Aires. Writer and journalist at Cointelegraph en Español. I help projects and companies design narrative strategies to enhance the impact of their actions.\n\n[https://linktr\\.ee/inesgav](https://linktr.ee/inesgav) \n\n[https://www\\.linkedin\\.com/in/in%C3%A9s\\-gavi%C3%B1a\\-57425a56/](https://www.linkedin.com/in/in%C3%A9s-gavi%C3%B1a-57425a56/)","url":null,"funds":162000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Entropic - Open Source Cardano Treasury AI Risk-Analyst","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Photrek, Inc.","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":162000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":7,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano lacks tools to show how different funding strategies and ADA’s volatility affect treasury risk, leaving voters and DReps without quantitative support for resilient funding decisions.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Photrek builds a treasury risk analyst using coupled-entropy to evaluate funding strategies via scenario forecasts and risk metrics, guiding treasury decisions impacted by currency volatility.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.arxiv.org/pdf/2511.17684","https://youtu.be/XqYTQfQeMrE?t=29460","https://www.scientia.global/dr-kenric-nelson-modelling-the-extreme-a-new-technique-for-training-risk-aware-artificial-intelligence/","https://www.photrek.io/ai-projects"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Our project needs access to reliable on-chain and market data for training and running the CVI models on real Cardano treasury and market conditions. For on-chain treasury and funding data, we will utilize the Cardano indexing infrastructure (e.g., DB Sync) and open-data services, such as ADAspending.com, as convenient endpoints. For market data (ADA and major cryptocurrencies), we will utilize public APIs from providers such as Yahoo Finance, CoinMarketCap and CoinGecko.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"The project will be fully open source.\nPhotrek utilizes a GNU GPL 3.0 license for software development projects, which requires users of the software to maintain their code as open source. ","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Governance","group":"Governance"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Currently, no machine learning technique can learn a system with severe heavy-tail distributions, where even the variance is undefined. For instance, the distributions of log returns for Ada, Bitcoin, Ethereum, Binance Coin, and Dogecoin exhibit extremely volatile behavior and undefined variance.\n\n\n\nThe unique ability of **_Photrek’s_** novel Coupled Variational Inference models to learn extreme distributions is a significant breakthrough with practical applications. Our tool enables the management of Cardano treasury risk exposure, delivers realistic financial forecasts, and assists DReps and voters in making funding decisions that support the financial resilience of the Cardano ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The Photrek treasury risk analyst platform ([https://www\\.photrek\\.io/ai\\-projects/entropic\\-treasury\\-risk\\-analist](https://www.photrek.io/ai-projects/entropic-treasury-risk-analist) ) will provide an open data source tool for generating forecasts for the Cardano treasury, simulating the impact of funding strategies for DReps and voters, and delivering risk metrics such as volatility indicators and healthy Net change limits. The platform enhances governance and facilitates informed funding decision-making.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Minimal Metrics of success for the treasury risk analyst platform:\n\n- Total number of hits to the website: 5,000\n- Number of Cardano Wallets connected: 1,000\n- Number of shares on specialized media websites: 5\n\n\n\n**_Photrek_** will provide monthly articles that communicate the project's evolution for the Cardano Forum, Substack, and Medium.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The **_Photrek_** team performed extensive novel research, enabling the accurate modeling and generation of complex real-world crypto data by exploring coupled entropy and its applications in Coupled Variational Inference (CVI) models [1-2]. The CVI framework generates probability distributions over potential future outcomes, enabling governance agents, such as voters and DReps, to assess the likelihood and severity of extreme events under various funding decisions, beyond the average scenario.\n\n\n\n**By conditioning CVI models on the current market and treasury state \\(recent return history, funding allocations, and treasury exposure\\), it is possible to sample realistic future paths of ADA prices and treasury cash flows\\. **From these paths, we compute distributions for key risk quantities, such as future volatility indicators over a specified time period, maximum drawdown, the probability of breaching a reserve threshold, and the impact of different funding schedules on treasury resilience. We present the results in a web risk platform where treasury actors, voters, and DReps can compare alternative funding scenarios and verify their quantitative risk impact. The platform allows users to explore the following capabilities:\n\n\n\n- **Treasury stress tests**: simulate future ADA prices and treasury value path distributions and estimate the probability of severe drawdowns or treasury shortfalls.\n- **Vote\\-impact simulations:** enable voters and DReps to compare different funding or allocation strategies and assess how each scenario affects the probability of future treasury stress.\n- **Price, Volume and Volatility indicators:** from ADA and other relevant cryptocurrencies, as well as the Cardano treasury, in addition to the size and frequency of extreme drawdowns in a given scenario and time period. \n- **Anomaly detection**: Identifies transactions that significantly diverge from the empirical distribution, helping to detect attacks and scams.\n\n\n\nThe objective of the platform is to support human decision-makers in making informed, high-value decisions, thereby strengthening the Cardano governance. \n\n\n\nThe Coupled Volatility Inference framework defines a family of robust physics-informed generative models, including the coupled-entropy variational autoencoder (CVAE) and the coupled generative adversarial network (CGAN). In particular, (CVAE) has already been successfully applied to learn, reconstruct, generate, and analyze real-world cryptocurrency distributions of Ada, Bitcoin, Ethereum, Dogecoin, Solana, and Binancecoin. In this proposal, the **_Photrek_** team prioritizes the CVAE, whose architecture is naturally suited for conditional scenario generation, an excellent capability for treasury risk analysis. As a possible extension in later stages, **_Photrek_** may also consider using a coupled generative adversarial network to enrich the system's generative capabilities.\n\n\n\n**Data Ingestion**\n\n\n\nTo train our CVI models, the platform ingests two main classes of data: on-chain treasury funding data (Catalyst treasury balances, funded proposal allocations and historical payout events) and market data (crypto asset prices and volumes). On-chain data can be accessed via Cardano DB Sync or open-data platforms such as ADAspending.com endpoints, reducing duplication effort and strengthening the broader analytics ecosystem. We retrieve crypto market data from reputable price and volume feeds such as Yahoo Finance, CoinMarketCap, or similar providers. Photrek includes a dedicated data ingestion layer that preprocesses these heterogeneous data sources into a unified time-series and event database suitable for training and running the coupled-entropy CVI models.\n\n\n\nThe **_Photrek_** open-source analyst engine will display its outputs via a REST API, allowing governance tools to query scenario results, such as risk metrics, volatility indicators, and simulations of how different allocation strategies may affect the treasury's stress. In addition to the friendly web interface for voters and DReps, the API enables downstream integration, allowing Cardano governance platforms to incorporate risk indicators into their user flows.\n\n\n\n**Risk Profiles**\n\n\n\nGenerally, different governance agents exhibit varying levels of risk tolerance. To accommodate the different risk sensitivities of users, **_Photrek_** introduces Risk Profiles for probabilistic inference assessment [3-5]. This methodology allows for the interpretation of  the probabilistic output of the CVI through different lenses of risk sensitivity by tuning the nonlinear statistical coupling parameter K [5]:\n\n- **Decisive \\(K\\<0\\): **An optimistic, confident view, useful for agile, short-term operational decisions where the cost of being \"wrong\" on the low side is acceptable.\n- **Accurate/Neutral \\(K=0\\):**  Unbiased, central tendency of the probabilistic forecast, offering the most probable outlooks.\n- **Robust \\(K\\>0\\)**: A conservative, stress-tested perspective that accounts for extreme, low-probability events. Crucial for long-term strategic planning and resilience against black swan events.\n\n\n\nTuning the risk profile empowers decision-makers to select the appropriate financial perspective based on their specific risk appetite, personal strategies and operational context that better suits them\n\n\n\n\n\n**References**\n\n\n\n[1] Nelson, Kenric. “On the Uniqueness of the Coupled Entropy.” arXiv preprint arXiv:2511.17684 [cond-mat.stat-mech], November 21, 2025.\n\n[2] Nelson, K. P., et al. (2025). Variational inference optimized using the curved geometry of coupled free energy. arXiv preprint arXiv:2506.09091.\n\n[3] Nelson, K. P., et al. (2011). A risk profile for information fusion algorithms. Entropy, 13(8), 1518–1532.\n\n[4] Nelson, K. P. (2014). Reduced perplexity: Uncertainty measures without entropy. In Recent Advances in Info-Metrics. arXiv.\n\n[5] Nelson, K. P. (2017). Assessing probabilistic inference by comparing the generalized mean of the model and source probabilities. Entropy, 19(6), 286.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Real-world financial data, such as the log returns from digital asset markets like ADA, Bitcoin, Ethereum, and others, often exhibit heavy-tailed distributions (see Figures 1 and 2), characterized by infinite variance and rare black swan events that disproportionately affect financial stability. As shown in Figure 2, traditional machine-learning methods typically assume Gaussian distributions and linear causality, which fail to capture and model the behavior of real-world financial market data and crypto assets. The lack of practical analysis tools capable of handling high-volatility data leaves the Cardano community and ecosystem unprepared for the risk of black swan events and their impact on the treasury. Moreover, the absence of robust inference methods does not allow proper analysis of how potential funding allocations caused by voters and DReps may affect the treasury’s resilience.\n\n\n\n![](https://iili.io/fB54Yns.png)\n\n**Figure 1\\.** Extreme volatile Daily log returns of Ada and Bitcoin over the years.\n\nRare, extreme events are real and costly. The Cardano community has been suffering from the impacts of extremely low-frequency but high-impact risks that  directly affect ADA holders, protocols, and the treasury itself:\n\n- ADA’s deep drawdowns in past cycles to Cardano.\n- Users losing millions after investing in a “stable” asset that later loses value.\n- Industry shocks such as major stablecoin depegs and exchange failures.\n\n\n\n![](https://iili.io/fB7HXDb.png)\n\n**Figure 2\\.** (a)Samples and (b)Reconstruction generated by the traditional generative model VAE  of the ADA distribution of log-returns, failing to capture the tails of the distribution.\n\n\n\n![](https://iili.io/fB7JtCx.png)\n\n**Figure 3\\.** (a)Samples and (b)Reconstruction generated by CVAE capturing the extreme risks contained in the ADA distribution of log-returns.\n\n\n\nBecause the treasury and governance layer lacks a dedicated, heavy-tail-aware risk system to anticipate and visualize the impact of such regime shifts on long-term funding capacity, Cardano's treasury decisions are currently made in an environment where extreme ADA price swings are real but not quantitatively modeled. This leads to a structural risk: funding policies may be too aggressive in euphoric markets and too conservative in stressed markets, with no shared, data-driven view of how likely severe drawdowns or shortfalls really are. Moreover, DReps and voters decide on funding allocation amounts and proposals without seeing the quantitative risk impact of their choices.\n\n\n\nThe **_Photrek_** engine provides treasury and governance actors with an efficient method to quantify risks for ADA and treasury exposures, leveraging the unique capabilities of our new approach to design machine learning systems that can model heavy-tailed returns and scenario paths explicitly, as illustrated in Figure 3. Our project helps Cardano establish the culture and infrastructure necessary to anticipate and mitigate these risks by providing the Cardano community and ecosystem with a risk-aware, open, and explainable layer for treasury planning and governance.\n\n\n\nWith our CVI models, it is possible to simulate “if we fund this slate at this level, under current conditions, what happens to treasury risk?”. Thus, voters and DReps can:\n\n- Compare conservative vs aggressive funding choices in terms of shortfall probabilities and tail risk;\n- Justify their votes along with clear, transparent, and quantifiable risk metrics;\n- Communicate why a particular allocation is prudent or why a more ambitious slate carries higher systemic risk.\n\n\n\nThis can enhance the quality and transparency of governance discussions, making it easier for the community to understand trade-offs quantitatively.\n\n\n\nA current governance challenge is how to properly determine the net change limit, that is, how much the treasury can spend without taking an unacceptable risk of jeopardizing future funding capacity. The CVI models can contribute to providing a robust estimate of the net change limit by considering a given cap on net treasury outflows per period and estimating the probability of reserve breaches and severe drawdowns. This allows governance to calibrate net change limits that respect a given risk tolerance (e.g., “choose the largest net outflow such that the probability of breaching X ADA within 1 year stays below 5%”). We emphasize that the tool does not replace governance, but supports it by providing a risk surface on which parameters can be openly justified, debated, and tuned. In practical terms, this reduces the likelihood that Cardano overcommits funds in a bull market and finds itself underfunded during an extended drawdown.\n\n\n\nBy deploying an efficient risk-aware tool at the governance layer, Cardano sends a strong signal: it is a chain that takes quantitative risk and long-term sustainability seriously. This increases confidence among long-term stakeholders and institutional participants who care about treasury robustness, demonstrating that Cardano’s governance is responsible in terms of the risks it undertakes. Ultimately, improved financial transparency and efficient risk forecasting, combined with strong governance, may attract more investment to the Cardano ecosystem. Although this proposal focuses on the Cardano treasury, the same risk engine can later support dApps and web3 businesses that hold ADA treasuries and want volatility-aware planning.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**_Photrek_** has a proven track record of delivering high-quality governance tools within the Cardano ecosystem, as well as partnerships with IOG and the Singularity NET community. Recently, Photrek successfully delivered the initial Cardania AI Agent, which received positive community feedback for its relevance in this phase of Cardano governance. Our team combines domain expertise in Cardano governance, risk analysis algorithms, Developers, UX/UI, Marketing, and AI integration to support the Cardano Treasury AI Risk-Analyst MVP.\n\n\n\nSince 2020, **_Photrek_** has delivered dozens of successful projects for the Cardano and SingularityNET communities, advancing AI and governance capabilities. In addition to that, the **_Photrek_** team has been actively involved and participating in relevant conferences for the Cardano community:\n\n- Nelson presented a paper on the Coupled Variational Inference at the AGI-25 Conference in Reykjavík, Iceland.\n- Nelson presented a paper on the uniqueness of coupled entropy at the 2025 Nonextensive Statistical Mechanics in Yerevan, Armenia.\n- Attieh participated in the treasury discussion at the pre-conference for the 2025 Cardano Summit in Berlin, Germany.\n- Nelson and Attieh participated in the Beneficial AGI conference in Istanbul, Turkey.\n- Hess spoke on panel with other Intersect budget committee members and Charles Hoskinson at RareEvo's Governance Day in Las Vegas\n\n\n\n**Disclaimer about _Photrek’s_ research on Alternative Voting:**\n\n\n\nWhile **_Photrek_** was a research subcontractor to IOG for the F11 “Alternative Voting Methods” proposal, we were neither involved in nor invited to review the implementation of alternative voting for Fund 14. The IOG Catalyst Team managed all implementation decisions and execution. **_Photrek_** shares the community's concerns about the implementation, and we will continue to work constructively with all Cardano participants in high-quality outcomes. Based on our own research, we have consistently emphasized the need for voting design to focus on improving the fair pricing of influence. Through fair pricing of influence, which is the origin of the quadratic rule, better community decisions are possible. [https://medium\\.com/@photrek/what\\-happened\\-with\\-quadratic\\-voting\\-in\\-catalyst\\-f14\\-and\\-what\\-we\\-can\\-learn\\-9ce7b6c394ea](https://medium.com/@photrek/what-happened-with-quadratic-voting-in-catalyst-f14-and-what-we-can-learn-9ce7b6c394ea)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Onboarding & Initial Data Ingestion","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Milestones are updated and approved on the Catalyst Milestone Module. \n- Team contracts set up an internal project management framework.\n- Detailed specifications document describing:\n    - Initial prioritization of risk metrics.\n    - Data requirements and schema for treasury and market data.\n- Initial data ingestion pipeline:\n    - Historical ADA price and volume.\n    - Historical treasury balances and funding events.\n    - Data stored in a clean format, ready for initial CVI training.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- All project milestones defined and submitted in the Catalyst Milestone Module and approved.\n- A public Specifications PDF Document that:\n    - Describes MVP scope, risk metrics, core user flows and initial UX design.\n    - Describes the data schema and data sources used in the prototype.\n-  Training Dataset (time series and events) in a documented format suitable for model training.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public specifications document link.\n- Code repository containing preprocessed data stored ready for initial CVI training.\n- Links to non-technical communication articles sharing progress for the Cardano Forum, Substack, and Medium aimed at voters, DReps and community members.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":" CVI Core Architecture and Initial Training","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Functional Initial CVI Codebase. Proof-of-Concept Trained Coupled Variational Inference (CVI) Model. \n- Initial validation results assessing the performance of the CVI model.\n- Basic latent-space visualizations and qualitative interpretation.\n- Detailed Model Architecture Document.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- CVI Model Implementation: A functional version-controlled CVI codebase is established.\n- Proof-of-Concept Training Run: Successful completion of an initial training run of the CVI's model on the dataset prepared in Milestone 1, with documented convergence behavior.\n- Initial Latent Space Visualization and Interpretability: Generation of basic visualizations of the learned latent space, illustrating how the model learns distinct financial regimes or volatility states. \n- Model Architecture Document. A technical document describing:\n    - Network architecture, activation functions, and regularization choices.\n    - Hyperparameters and training protocol.\n- Quantitative assessments of the CVI model validation results in reconstructing empirical data showing improved performance relative to traditional models as a baseline.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Code repository with CVI model implementation.\n- Training logs and saved model checkpoints.\n- PDF Document containing model architecture and initial validation results.\n- Links to non-technical communication articles sharing progress for the Cardano Forum, Substack, and Medium aimed at voters, DReps and community members.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Probabilistic Forecasting & Risk Metrics MVP","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Probabilistic forecasting engine that generates Monte Carlo scenarios for treasury value paths and crypto prices and volumes.\n- MVP implementation of risk metrics:\n    - Treasury stress tests (drawdown, reserve-breach probabilities).\n    - At least one vote-impact scenario example.\n    - Price, Volume and Volatility indicators from the Cardano treasury and relevant cryptocurrencies, \n- MVP Risk Profile Visualization (Decisive/Neutral/Robust).\n- MVP validation and calibration report for reliability.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Probabilistic Forecast Generation: The CVI system generates Monte Carlo simulations of:\n    - Treasury value paths under at least one funding schedule.\n    - Future ADA prices, volume and volatility indicators.\n    - Risk metrics such as the distribution of max drawdown over a given horizon and the probability of breaching a specified threshold.\n-  Risk Profile Visualization MVP: An interactive, simple web UI allowing a user to:\n    - Switch between at least three risk profiles (e.g., Decisive, Neutral, Robust).\n    - See how these choices change projected ranges for treasury value and risk indicators.\n- Initial Validation & Calibration Report:\n    - Backtest comparison of probabilistic forecasts vs historical data over a time period, indicating where the model performs well and where it needs improvement.\n    - Initial calibration assessment for at least 1 event type (e.g, “breach reserve X within 1 year”). \n- Testers' Feedback: At least three community testers (e.g., DReps, Catalyst participants, or governance tool builders) review the MVP and provide feedback on whether the risk metrics and charts are clear and understandable. Key feedback points are documented.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Updated code repository with CVI model implementation, including risk metrics and profiles.\n- Initial simple web UI interactive visualization tool prototype.\n- MVP validation and PDF calibration report. \n- Links to non-technical communication articles sharing progress for the Cardano Forum, Substack, and Medium aimed at voters, DReps and community members.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":49000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Automated Data Ingestion & Governance Web Platform MVP","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Automated data ingestion pipelines for:\n    - On-chain treasury / Catalyst funding data (via DB Sync and/or ADAspending.com APIs).\n    - Market data (ADA relevant cryptos from providers such as Yahoo Finance or CoinGecko).\n    - Unified time-series/event database that updates on a scheduled basis. \n- Web-based MVP dashboard:\n    - Scenario configuration.\n    - Display of key risk metrics outputs.\n    - Vote-impact simulations.\n- REST API endpoints exposing core risk metrics for integration with governance tools.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Automated On-Chain Data Ingestion. \n    - Periodically retrieves treasury balances and funding events via an open-data source. \n    - Preprocess and store the data.\n-  Automated Market Data Ingestion.\n    - Periodically retrieves ADA price/volume from a reputable provider.\n    - Merges this data with the on-chain dataset to maintain an up-to-date training/inference dataset.\n- Web Dashboard MVP. A deployed web interface that:\n    - Allow users to select from a set of funding scenarios and display risk metrics for each scenario.\n    - Allows switching between risk profiles (Decisive / Neutral / Robust) and updates the displayed ranges.\n- Public REST API. At least one documented API endpoint that allows external tools to query Risk metrics for a given scenario.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Source code for ingestion pipelines and documentation.\n- Deployment link for the dashboard.\n- API documentation.\n- Short demo video showing end-to-end platform usage.\n- Links to non-technical communication articles sharing progress for the Cardano Forum, Substack, and Medium aimed at voters, DReps and community members.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":29500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Product Delivery & Close-Out Report","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Refined interactive web dashboard and risk engine ready for community use.\n- Complete open-source codebase and technical documentation available on a public repository.\n- The final comprehensive PDF project report is easily understandable to both technical and non-technical community members.\n- An engaging demo video that showcases the platform, explaining its purpose and limitations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Refined Dashboard & Engine:\n    - Basic user guidance or FAQ for DReps/voters.\n    - Achieves a minimum internal satisfaction score (e.g.,≥70%) from testers across roles (dev, governance, non-technical users).\n- Complete codebase published under GNU GPL 3.0.\n- Final Comprehensive Report:\n    - Summarizes methodology, experiments, and model performance.\n    - Discusses calibration and limitations of the risk estimates.\n    - Recommendations for using the tool in treasury and governance processes.\n    - Potential future extensions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Final Comprehensive PDF Report understandable for the general Cardano community.\n- Public GitHub repository link.\n- Deployment link to the dashboard.\n- Demo video link.\n- Links to non-technical communication articles sharing progress for the Cardano Forum, Substack, and Medium aimed at voters, DReps and community members.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":17500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**_Photrek_**, a team with extensive experience in complex decision systems and blockchain governance, leads this project. On the administrative and oversight side, Megan Hess and Dr. Kenric Nelson provide leadership, strategic direction, and project governance. Igor Oliveira leads the technical team to drive continued development. Supporting the project’s community engagement and communications efforts, Inés Gaviña will facilitate feedback gathering and ensure clear, effective outreach. Together, this team combines strong leadership, technical expertise, and community focus to launch this project successfully.\n\n\n\nM. Sc Igor Oliveira serves as an algorithm developer, scientist and collaborative partner at **_Photrek, _**Inc**_\\._**, conducting research in complex systems, socioeconophysics, machine learning,  quantum computing, and evolutionary dynamics. He graduated summa cum laude with a Bachelor of Science in Materials Physics and also has a Master of Science in Physics. Igor served as a community teaching assistant for the MITx course 6.86x: Machine Learning with Python, achieving exceptional performance. His team won Brazil's first quantum computing hackathon, sponsored by IBM and Itaú Unibanco, to solve a portfolio optimization problem. He co-founded the first Society of Physics Students (SPS) chapter in Latin America, promoting outreach events that bridged physics research and community engagement.\n\n[https://www\\.linkedin\\.com/in/igorgibernoot/](https://www.linkedin.com/in/igorgibernoot/) \n\n\n\nDr. Kenric Nelson is Founder and President of **_Photrek_**, Inc., which is developing novel approaches to Complex Decision Systems, including dynamics of cryptocurrency protocols, sensor systems for machine intelligence, robust machine learning methods, and novel estimation methods. He served on the Cardano Catalyst Circle governance council and is leading a revitalization of Sociocracy for All’s @work circle. Prior to launching Photrek, Nelson was a Research Professor with Boston University Electrical & Computer Engineering (2014-2019) and Sr. Principal Systems Engineer with Raytheon Company (2007-2019). He has pioneered novel approaches to measuring and fusing information. His nonlinear statistical coupling methods have been used to improve the accuracy and robustness of radar signal processing, sensor fusion, and machine learning algorithms. His education in electrical engineering includes a B.S. degree Summa Cum Laude from Tulane University, an M.S. degree from Rensselaer Polytechnic Institute, and a Ph.D. degree from Boston University. His management education includes an Executive Certificate from MIT Sloan and participation in NSF’s I-Corp. \n\n[https://www\\.linkedin\\.com/in/kenric\\-nelson\\-ph\\-d\\-7495b77/](https://www.linkedin.com/in/kenric-nelson-ph-d-7495b77/)\n\n\n\nMegan Hess, Treasurer & Benefits Officer at **_Photrek_**, Inc. With 5+ years of experience in the Cardano ecosystem, Megan has led initiatives for startups like Wada and DIT in Cameroon, as well as managing a family farm in Cameroon. Currently, she serves as Vice Chair on Intersect’s Budget Committee. Megan first collaborated with Photrek on their F4 Catalyst project, \"Diversifying Voting Influence,\" and has been selected to lead the Photrek Cardano Circle, where she is committed to driving innovation and supporting decentralized governance and risk intelligence. With a Bachelor’s degree in Physics from the University of Denver and a background in teaching math and physics, Megan excels in communication, team facilitation, and applying sociocratic principles to her management style. Living between the US and Cameroon for the past 6 years with her family, Megan brings a global perspective and a commitment to driving innovation in decentralized governance for the Cardano ecosystem.\n\n[https://www\\.linkedin\\.com/in/megan\\-hess\\-5b853292/](https://www.linkedin.com/in/megan-hess-5b853292/) \n\n\n\nCommunity Engagement and Communications:\n\nInés Gaviña; BA in Literature, University of Buenos Aires. Writer and journalist at Cointelegraph en Español. I help projects and companies design narrative strategies to enhance the impact of their actions.\n\n[https://linktr\\.ee/inesgav](https://linktr.ee/inesgav) \n\n[https://www\\.linkedin\\.com/in/in%C3%A9s\\-gavi%C3%B1a\\-57425a56/](https://www.linkedin.com/in/in%C3%A9s-gavi%C3%B1a-57425a56/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Budget breakdown by category:\n\n- Engineering\t ₳ 56,700\n- Community Engagement\t ₳ 32,400\n- Testers\t ₳ 16,200\n- Computing Resources\t ₳ 16,200\n- Program Management\t ₳ 32,400\n- Contingency\t ₳ 8,100\n\n\n\nTotal\t ₳ 162,000","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Currently, Cardano’s treasury operates under extreme market volatility and complex on-chain dynamics without specialized tools to quantify risk or evaluate the impact of alternative funding strategies. This is a general problem in finance: As McKinsey & Company and other consultancies have highlighted, poor cash-flow forecasting and risk management can lead to persistent “cash drag” from excess liquidity and missed investment opportunities. Deloitte’s CFO Signals surveys likewise report that forecast accuracy remains one of the top concerns for CFOs, with even modest improvements viewed as having high potential value.\n\n\n\nBy investing in our AI treasury risk analyst, Cardano has the opportunity to address a structural weakness: the inability of voters, DReps, and treasury agents to assess the quantitative risk impact of their funding decisions accurately. Even modest improvements in avoiding over-aggressive allocation in vulnerable periods, or in recognizing when additional risk is acceptable, can preserve a significant portion of the treasury.\n\n\n\nHence, the project improves governance quality per ADA spent. DReps and voters gain transparent, scenario-based risk metrics they can reference when explaining and justifying their votes. This increases accountability and trust in the stewardship of community funds,  making Cardano more attractive to developers, projects, and external partners.\n\n\n\n**_Photrek_** employs competitive pricing methods that deliver the highest value to our customers and support our team members in achieving fulfilling lives. Our rates are based on self-employment in the US & Canada. The rates take into account the employment overheads of the resources contracted. The amounts are calculated for each milestone based on the estimated hours required to complete it. For example, the chart for engineering and scientific salaries in the Commonwealth of Massachusetts is provided here:  [https://www\\.mass\\.gov/guides/salary\\-and\\-compensation\\.](https://www.mass.gov/guides/salary-and-compensation.)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Governance","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1736}