{"pr_id":"019a74ef-9d2d-7599-a302-bc9681815736","title":"Giveth: Quadratic funding, 7K+ Projects & 25K+ Donors","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano lacks mature crowdfunding and innovative tools to support the ecosystem and global high-impact organizations, especially for projects where blockchains widely outperform traditional finance.","solution":"Integrate Cardano into Giveth, unlocking a battle-tested crowdfunding and quadratic funding platform with $5M+ USD in donations, and bringing 7K+ projects and 25K+ donors into the Cardano ecosystem.","proposer_name":"Giveth Association","proposer_relevant_experience":"- Gardner Loulan -  dApp Development &amp; Project Lead\n    - Twitter: [https://x\\.com/gardner](https://x.com/gardner)\n    - Linkedin: [https://www\\.linkedin\\.com/in/glou](https://www.linkedin.com/in/glou)\n    - Github: [https://github\\.com/GardnerLou](https://github.com/GardnerLou)\n    - Past experience: Gardner is a 3x founder whose career began at MTV and NBC, where he and his teams earned various Emmy nominations and awards. He was instrumental in building the first successful short-form video platform, scaling it to $19 million in ARR with partners including The Wall Street Journal, WWE, Shaquille O'Neal and Fortune 500 companies. With over a decade of experience within web3, he has helped launch companies like CUBE3.AI and is currently the cofounder of Unicorn.eth and a dApp development lead at Giveth.io\n- Griff - Founder\n    - Twitter: [https://x\\.com/thegrifft](https://x.com/thegrifft)\n    - Github: [https://github\\.com/GriffGreen](https://github.com/GriffGreen)\n    - Past experience: Cofounder of Giveth, Commons Stack, General Magic, Praise Pairwise, unicorn.eth &amp; dappnode. Community manager for TheDAO, led the crisis response effort for TheDAO Hack and first Parity Multisig Hack from every angle, co-founder of the White Hat Group and led the creation of Token Engineering Commons. Advisor for PolygonID, PolygonHermez, brightID, and steward for Gitcoin, ENS, Arbitrum &amp; Optimism.\n- Jake - Growth Lead\n    - Twitter: [https://x\\.com/GivJake](https://x.com/GivJake)\n    - Github: [https://github\\.com/SnakeGH](https://github.com/SnakeGH)\n    - Past experience: 12+ years of experience within the web2 corporate America business development arena combined with 3+ years of business development, partnerships, and fundraising efforts in web3 with Giveth and General Magic. Proven track record of crafting and executing strategic plans that align with organizational goals, resulting in substantial business growth and increased market share\n- Cotabe – Partnerships Lead\n    - Twitter: [https://x\\.com/Cotabe](https://x.com/Cotabe)\n    - Github: [https://github\\.com/Cotabe](https://github.com/Cotabe)\n    - Past experience: Web3 grants specialist who secured $1.5M+ in funding for 10+ projects across Optimism, Arbitrum, and Polygon. Experienced in end-to-end grant management, MEV mitigation, public goods funding, and Web3 onboarding. Contributor to Giveth and Shutter DAOs, and delegator on Optimism, Arbitrum, ZKSync, and EigenLayer. Passionate about Regenerative Finance and making Web3 fair and accessible.\n- Marko - Design Lead\n    - Twitter: [https://x\\.com/markoprljic](https://x.com/markoprljic)\n    - Github: [https://github\\.com/markoprljic](https://github.com/markoprljic)\n    - Past experience: 25+ years as a designer between traditional and web3 initiatives. Marko contributed to companies like EPH (the largest newspaper in Croatia) and then in web3 with the likes of Consensys, as well as to General Magic, Giveth, Token Engineering Commons, and The Commons Stack. Marko was also a Fellow of Panvala.\n- Freshelle - Accounting &amp; Finance Steward\n    - Twitter: [https://x\\.com/FreshelleT](https://x.com/FreshelleT)\n    - Github: [https://github\\.com/freshelle](https://github.com/freshelle)\n    - Past experience: 6 years of experience as Accounting Lead for Web3 initiatives like Giveth, General Magic, Praise and Pairwise, as well as almost 2 years of experience as an Audit Associate for Deloitte.\n- Kresimir Katusic  - Fullstack Engineer\n    - Github: https://github.com/kkatusic\n    - LinkedIn: https://www.linkedin.com/in/kkatusic/\n    - Past experience: 7 Years working as a backend developer, divided into 4 years in the web2 industry for Koombea in e-commerce and mobile applications, and 3 years building robust web3 backend integrations with the blockchain and smart contracts for Giveth and General Magic.","url":null,"funds":150000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Giveth: Quadratic funding, 7K+ Projects & 25K+ Donors","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Giveth Association","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":150000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano lacks mature crowdfunding and innovative tools to support the ecosystem and global high-impact organizations, especially for projects where blockchains widely outperform traditional finance.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Integrate Cardano into Giveth, unlocking a battle-tested crowdfunding and quadratic funding platform with $5M+ USD in donations, and bringing 7K+ projects and 25K+ donors into the Cardano ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://giveth.io","https://github.com/Giveth","https://x.com/Giveth","https://linktr.ee/givethio"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"GPLv3 License","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Financial Services","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"The Cardano ecosystem has only a few projects focused on crowdfunding like Socious and Teiki. Socious, the most mature, has gone live with a pilot and 172 projects, but it’s focused on 501(c)3 compliance and milestone-based models, while Giveth, active since 2016 with $5M+ in donations across 7K+ projects and 25K+ donors, already has a mature set of products including QF rounds, decentralized verification, AI-driven allocation, and a token economy rewarding impact and decentralized project curation. Giveth also enables any fundraiser while prioritizing verified public goods with zero fees.\n\n- **Unique features:**\n    - Zero-fee crowdfunding.\n    - Quadratic Funding.\n    - GIVbacks: Reward programs.\n    - GIVeconomy: Philanthropy-centered token economy.\n    - Causes: AI capital allocation.\n    - DeVouch: Decentralized verification.\n- **High\\-level collaborations\\.**\n    - Polygon, Arbitrum, EF, Stellar, Gitcoin, etc.\n    - We are scoping a blockchain agnostic UNDP QF round.\n- **High probability of adoption\\.**\n    - User base of 7.3K+ projects, 25K+ donors.\n    - Scoping Cardano-focused marketing, BizDev efforts and feedback loops to iterate and engage the community\n- **Experience and industry leadership\\.**\n    - Leading crypto crowdfunding platform since 2016.\n    - Pioneer in Quadratic Funding: 16 rounds completed with nearly 1 million USD in matching funds distributed.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The MVP will showcase Cardano’s use case for low-cost, borderless, and transparent donations, enabling global supporters to fund projects instantly, driving ecosystem growth and real-world impact.\n\n\n\n\n\n**Expected deliverables\\.**\n\n- Full Cardano integration into Giveth for seamless, zero-fee ADA, stablecoin and other Cardano assets donations\n- Permissionless project creation to receive donations in ADA, Cardano Stablecoins and other key assets.\n- Fully on-chain, integrated donation flow in Giveth UX\n- Business Development and marketing efforts to promote the adoption of Cardano on Giveth from the Cardano community, the Giveth community and future stakeholders.\n\n\n\n\n\n**Impact \\(So what\\.\\.\\)**\n\n- **Empower Cardano projects\\.** Let Cardano projects easily raise money from their community with zero fees inside Giveth’s simple interface.\n- **Experiment on Cardano with Quadratic Funding:** We will host at least 1 Quadratic Funding round with eligibility for Cardano projects to bo st adoptions We are scoping a QF round for the SDG blockchain accelerator, a UNDP projects to grow blockchain enabled development projects, Cardano has the larges  representation of projects.\n- **Enable the Cardano community to give**. Provide the Cardano community with a direct way to support impact projects anywhere in the world, fully transparent and on-chain.\n- **Bring new users\\.** Open the door for over 7.3K verified projects and 25K donors on Giveth to explore and fund Cardano, boosting adoption and real ecosystem growth.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"The following are our target KPIs in 12 months.\n\n\n\n- **On\\-chain \\(Cardano\\):**\n    - 1,000+ ADA donation txs;\n    - 500+ unique donors;\n    - ₳15,000+ donated;\n    - 100+ projects receiving ADA.\n\n\n\n- **Off\\-chain:**\n    - Integration live;\n    - 1-3 Quadratic Funding rounds with eligibility for Cardano donations;\n    - 100+ projects add Cardano;\n    - a comprehensive multi-channel campaign with multiple activations (tweets, social posts, blog, email, Spaces);\n    - 99%+ uptime in Q4.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We propose integrating Cardano into Giveth, a leading Web3-native crowdfunding and quadratic funding platform for public goods established in 2016 with 5M+ USD in total donations and a global community of 7K+ projects and 24K+ unique donors.\n\n![](https://i.imgur.com/dpiiyn3.png)\n\nGiveth.io is an open-source, radically transparent crowdfunding and quadratic funding platform that empowers changemakers and donors to co-create the future of public goods without intermediaries, added fees, or technical barriers. With a smooth, user-friendly UX, quadratic funding embedded and zero-fee donations, Giveth is a great tool to grow blockchain ecosystems. Anyone can launch a verified impact project and start fundraising in crypto within minutes. Donors, in turn, can be rewarded for giving through the GIV token, making generosity both meaningful and rewarding.\n\nGiveth will bring its infrastructure and experience running Quadratic Funding (QF) rounds to ADA holders and the Cardano ecosystem. QF is a democratic, scalable mechanism that matches funding in function of the amount of money it’s donated and the number of individual people making donations, and therefore incentivizes community engagement and donations. The more people donate to a project, the more matching funds it receives.\n\nIn other words, Quadratic Funding aligns the stakeholders’ incentives to grow ecosystems. Sponsors seed the round, but it’s the community that drives where the funding flows. The following table shows the actions and benefits for each stakeholder.\n\n![](https://i.imgur.com/bpNZbPG.jpeg)\n\n*Repeated donations, including donations to only one project, carry less impact from the matching fund due to Cluster Mapping, a Sybil-resistant method.\n\nThis model maximizes visibility, funding volume, and ecosystem engagement. To illustrate the value of Quadratic Funding, here are the average results from our firsy 12 QF rounds:\n\n- **Duration: 2 weeks**\n- **Unique donors: 690**\n- **Donations: 1,829**\n- **Crowdfunded: $36,614 USD**\n- **Number of projects funded: 92**\n- **Crowdfunded\\-to\\-matching pool ratio\\*: 65%**\n\n*On average, community donations during the rounds equaled 65% of the matching pool amounts. This means that for every 1 USD in the pool, donors contributed an additional 0.65 USD worth of donation, effectively increasing the total funding by the same proportion.\n\n\n\n![](https://i.imgur.com/pP3rNyq.png)\n\n\n\nOnce live, Giveth will be able to host Cardano-powered Quadratic Funding rounds for diverse purposes:\n\n- Ecosystem development, such as supporting Cardano builders or niche focus areas like RWA, stablecoins or infrastructure.\n- Impact organizations, for example, a Food Security QF round in partnership with UNDP.\n- Specialized partner use cases within the Cardano network.\n\nAs a flagship use case, Giveth aims to host a Quadratic Funding (QF) round in collaboration with the United Nations Development Programme (UNDP) to support 50 projects coming from the SDG Blockchain acceleration program, where Cardano is the most represented blockchain, with 25%+ projects built on Cardano.\n\nGiveth already passed Due Diligence with UNDP, upon confirmation, the Cardano community would steer the matching funds of the UNDP QF round through their donations to high-impact projects. This demonstrates the immediate utility of this integration while building lasting infrastructure for future Cardano use. If the project doesn't goes through the Cardano Community will still steer the funds of other 1-3 QF rounds in 2026.\n\n**Scope of the Integration**\n\nThis project will integrate Cardano into Giveth, enabling 24/7 fundraising in ADA, stablecoins (USDA, DJED, iUSD) and other Cardano assets. With over 7,300 projects and 25,500 unique donors already on Giveth, current projects will be able to add a Cardano address in just a few clicks, while new Cardano projects can set up and start fundraising in under 5 minutes.\n\n**Key Elements:**\n\n- Giveth Integration: Seamless Cardano donations for all Giveth projects, with easy Cardano setup for projects.\n- Boost via QF Rounds: Cardano integration will enable donations eligible for matching in at least one Quadratic Funding round, ideally the one being negotiated with UNDP, the largest UN agency, showcasing how Cardano can improve global aid delivery in collaboration with top institutions. The target would be to make Cardano donations eligible in three Quadratic Funding Rounds in the next 12 months.\n- Marketing &amp; Comms: Multi-channel outreach (tweets, social posts, blogs, email campaigns, and live Spaces) to drive awareness and participation.\n- Business Development: This integration is scoped to go beyond only a prototype. We want to create real traction, bring Giveth projects to the Cardano ecosystem, attract new Cardano native projects and encourage donations. We are scoping to add Cardano donation eligibility to three quadratic funding rounds. But we will go beyond and dedicate BizDev resources to ensure not only the success of the implementation, but also adoption.\n\n**Success stories\\.**\n\n**QF Rounds:**\n\n- GIV Earth  – Giveth’s first environment-focused round, in the Summer of 2024, on Celo attracted 3,000+ donations from nearly 800 donors. Community contributions totaled 120% of the matching pool’s value, demonstrating strong donor engagement and impact amplification. (More info [https://blog\\.giveth\\.io/giv\\-earth\\-qfround\\-results\\-wrap\\-up\\-88560225d1ce\\)](https://blog.giveth.io/giv-earth-qfround-results-wrap-up-88560225d1ce))\n- Build on Polygon – Our largest ecosystem-focused QF round distributed $200K to Polygon builders, with 206 projects participating. The round drew 3,200+ unique donors and $160K in community contributions, 80% of the pool’s value. (More info [https://forum\\.giveth\\.io/t/buidl\\-on\\-polygon\\-qf\\-rounds\\-results\\-jan\\-15\\-24\\-2024/1340\\)](https://forum.giveth.io/t/buidl-on-polygon-qf-rounds-results-jan-15-24-2024/1340))\n\n**Projects:**\n\n- Palestine Children’s Relief Fund (PCRF) – $350K+ raised from 1,800+ donors to deliver crucial medical relief and humanitarian aid in Palestine.\n- Defend Roman Storm – $320K+ raised from 2,600+ donors to support legal defense efforts for writing open source code and decentralized protocols.\n- Diamante Luz – $80K+ raised to advance regenerative living and permaculture in Costa Rica.\n- DappNode – $46K+ raised to support decentralized infrastructure for running blockchain nodes, demonstrating the use case for blockchain builders.\n\nLooking forward, Giveth aims to deepen its work with large impact-driven entities like UNDP and other UN agencies with which we are already in conversations, to host more high-profile Quadratic Funding rounds that address pressing global challenges. At the same time, we see great potential to collaborate with organizations within the Cardano ecosystem to highlight and support builders, innovators, and grassroots initiatives. This would not replace any existing Cardano funding programs but instead serve as a complementary, community-driven funding mechanism that gives visibility and support to smaller projects that might otherwise be overlooked, strengthening the overall Cardano ecosystem.\n\nThrough this integration, Cardano becomes a first-class citizen in a powerful, future-facing platform for funding public goods.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"# 1. Use of Cardano for Donations and Fundraising (Adoption).\nBy integrating Cardano into Giveth, this project enables any of the 7,300+ listed projects to fundraise in ADAand other Cardano assets and invites 25K+ donors to use Cardano for impact. Furthermore, it unlocks the possibility of Cardano projects to permissionlessly fundraise from the Cardano community 24/7. Finally, it also unlocks the possibility to do quadratic funding in Cardano with an experienced partner that has run over 15 QF rounds with Sybil-resistant mechanisms from inception and with a strong community of donors.\n\n**Impact Metrics**\n\n✅ Minimum: 50 projects add a Cardano donation address\n\n🌟 Target: 100+ projects\n\n✅ Minimum: 100 unique Cardano donors\n\n🌟 Target: 500+ donors\n\n✅ Minimum: 500 ADA donation txs\n\n🌟 Target: 1,000+ ADA donation txs\n\n✅ Minimum: ₳5,000 donated\n\n🌟 Target: ₳15,000+ donated\n\n*Based on our experience and considering the proposed incentive program, we believe these targets are both ambitious and realistically achievable.\n\n# **2\\. Visibility \\(For projects and the Cardano ecosystem as a whole\\)\\.**\nGiveth has ongoing partnerships and rounds with major players like Ethereum, Base, Solana, Stellar, Optimism, Polygon, Gitcoin, and now UNDP. Cardano will now join that list and benefit from co-marketing, visibility, and the alignment with projects like UNDP. Cardano projects will gain increased exposure to the wider Giveth community, especially during QF rounds when participation and awareness spike.\n\n# **3\\. Ecosystem Growth\\.**\nBeyond enabling donations, Giveth provides Cardano projects with an immediate 24/7 fundraising channel, particularly relevant for early-stage projects. They can raise funds both from their own communities and in a leveraged way through QF rounds, multiplying the impact of every donation. This ongoing visibility and access to matching pools helps drive sustained growth in the Cardano project ecosystem.\n\n\n\nAll impact will be tracked, documented, and shared publicly:\n\n- On-chain data: all transactions are auditable via Cardano block explorers\n- Impact report: A comprehensive report will be published post-round and shared:\n    - On the Giveth blog\n    - On the Cardano Forum\n    - In Catalyst reporting channels","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"![](https://i.imgur.com/1EUHm6C.png)\n\nThis is not Giveth’s first rodeo. Giveth has a proven record integrating new bockchains, 11 in total, 9 EVM equivalent and 2 non-EVM, with a few more integrations on the pipeline. Here are some of Giveth’s key stats:\n\n- 7K+ projects\n- 25K+ unique donors\n- 5M+ donated to projects\n- 11 blockchains integrated (EVM + non-EVM chains)\n- 16 successful QF rounds with Optimism, Polygon, Gitcoin, Stellar, and others\n\nGiveth will deliver:\n\n- Platform integration for Cardano-native donations.\n- Smooth and Secure end-to-end donation UX on Cardano.\n- Transparent fund flows and community onboarding.\n- A project that goes beyond prototype and is aimed for high performance (see impact metrics on the previous answer)\n- Built-in Accountability Mechanisms\n    - On-chain donations and disbursements\n    - We will add Cardano to our Public Giveth dashboard ([https://stats\\.giveth\\.io/\\)](https://stats.giveth.io/))\n    - Impact report and blog post shared with Cardano Forum and Catalyst","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cardano Testnet Integration for ADA & Stablecoins","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Objective:** Enable donations in ADA, stablecoins and other Cardano assets on Giveth in testnet.\n\n**Outputs:**\n\n- ADA and stablecoin donation options are available in the Giveth testnet environment.\n- Stablecoin price fetching and display are integrated into the donation flow.\n- Testnet-ready project pages showing ADA and stablecoin donation options.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Functional front-end ADA donation flow in the testing environment with good usability.\n- Cardano appears correctly on project pages, in the verification flow, the donation table, and the donation modal.\n- The ADA price feed is active and reflected in the UI where required.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Testing environment live on Vercel, demonstrating the full Cardano donation flow (staging URL / screenshots).\n- GitHub commits/PRs showing implemented features.\n- Screen recordings or screenshots of the donation modal, project page, and donations table.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mainnet Launch & Marketing Campaign","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Objective**: Deploy ADA and Cardano assets donation flow on Cardano mainnet and promote adoption.\n\n**Outputs:**\n\n- ADA, USDA, and other Cardano assets donation flow live on the Giveth mainnet and an option to add Cardano tokens via our backend will be enabled.\n- Sign in with Cardano enabled, similar to our Solana integration.\n- Add support for Quadratic Funding integration.\n- Marketing campaign executed to promote new Cardano donation options and for projects to add a Cardano address.\n- At least 15 social posts across Twitter, Instagram, Facebook, and LinkedIn.\n- One live event (e.g., Twitter Space or webinar) introducing the feature to the community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The ADA and Cardano assets donation flow is functioning on testnet and mainnet.\n- Donation verification includes Cardano addresses and succeeds for sample donations.\n- Pilot projects can accept ADA and other Cardano assets donations end-to-end.\n- Cardano activity integrated on the Giveth dashboard ([https://stats\\.giveth\\.io/\\)](https://stats.giveth.io/).)\n- Filtering for Cardano is activated on the platform and the dashboard.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Live ADA, stables, and other assets donation flow on giveth.io\n- Public GitHub release and tagged commits at https://github.com/Giveth.\n- Transaction hashes demonstrating ADA and other digital assets in donations on testnet/mainnet.\n- Project pages showing Cardano donation addresses.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"First Quadratic Funding round and adoption strategy.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Objective:** Gain adoption from projects and donors in Cardano and showcase Quadratic Funding as an effective tool to multiply funding volume, increase project visibility, and engage stakeholders from the Cardano ecosystem.\n\n\n\n**Outputs:**\n\n\n\n- First Quadratic Funding round finalized with all funds delivered.*\n- Verified participation data and on-chain proof of rewards.\n- Enable Cardano projects to participate in at least one QF round.\n\n\n\n\n\n*Note: No funding from the current budget will be used for the matching pool. Therefore, there will be no regranting. We will look for sponsors to participate in the matching pool of the QF round and make donations in Cardano, eligible to boost the adoption of the Cardano integration.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Successful completion of at least one Quadratic Funding round.\n- Verifiable on-chain proof for all transactions involved in the rounds, including individual donations, matching calculations, and reward disbursements, accessible via the Giveth UI and Cardano blockchain explorers.\n- Active participation from a minimum of 10 Cardano-based projects in at least one QF round.\n- Demonstrated adoption metrics showing an increase in donor engagement, with at least 50 unique donors contributing to the rounds, verified through wallet addresses and transaction logs.\n- User feedback mechanism implemented.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- A detailed post, including comprehensive distribution statistics such as total funds raised, matched amounts, and per-project allocations.\n- Links to on-chain transaction hashes for all incentive distributions with additional links to explorers like CardanoScan or other blockchain explorers allowing independent verification.\n- Summaries of recipient projects and donors.\n- Feedback report with action items for improvement.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Scale performance & Reporting","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Objective:** Deliver on transparent KPIs and publish a final project report.\n\n\n\n**Outputs:**\n\n- Growth of the Giveth Cardano user base.\n- Data compilation and analysis to form insights.\n- Analysis of marketing and BizDev reach and impact.\n- Public report summarizing project outcomes, lessons learned, and recommendations for scaling.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The final report must include detailed statistics by month or round, including the number of projects onboarded, total donors, total donations, both in terms of USD amount and the number of transactions. As well as, user feedback and an analysis of the adoption growth.\n- Achievement of minimum KPIs, aiming to achieve the target KPIs, before any payout is approved to ensure alignment with successful Cardano implementation.\n\nKPIs:\n\n✅ Minimum: 50 projects add a Cardano donation address\n\n🌟 Target: 100+ projects\n\n✅ Minimum: 100 unique Cardano donors\n\n🌟 Target: 500+ donors\n\n✅ Minimum: 500 ADA donation txs\n\n🌟 Target: 1,000+ ADA donation txs\n\n✅ Minimum: ₳5,000 donated\n\n🌟 Target: ₳15,000+ donated","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- A report on the achievement of the KPIs with robust documentation.\n- Publication of the comprehensive report on the Giveth.io blog, including embedded charts, graphs, and data visualizations for the KPIs and growth metrics.\n- Project close-out reports with quantitative and qualitative data, summarizing the insights of the project execution and adoption. Following Project Catalyst requirements\n- Project Close Out Video demonstrating the product, KPIs, and insights, following Project Catalyst requirements.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"- Gardner Loulan -  dApp Development &amp; Project Lead\n    - Twitter: [https://x\\.com/gardner](https://x.com/gardner)\n    - Linkedin: [https://www\\.linkedin\\.com/in/glou](https://www.linkedin.com/in/glou)\n    - Github: [https://github\\.com/GardnerLou](https://github.com/GardnerLou)\n    - Past experience: Gardner is a 3x founder whose career began at MTV and NBC, where he and his teams earned various Emmy nominations and awards. He was instrumental in building the first successful short-form video platform, scaling it to $19 million in ARR with partners including The Wall Street Journal, WWE, Shaquille O'Neal and Fortune 500 companies. With over a decade of experience within web3, he has helped launch companies like CUBE3.AI and is currently the cofounder of Unicorn.eth and a dApp development lead at Giveth.io\n- Griff - Founder\n    - Twitter: [https://x\\.com/thegrifft](https://x.com/thegrifft)\n    - Github: [https://github\\.com/GriffGreen](https://github.com/GriffGreen)\n    - Past experience: Cofounder of Giveth, Commons Stack, General Magic, Praise Pairwise, unicorn.eth &amp; dappnode. Community manager for TheDAO, led the crisis response effort for TheDAO Hack and first Parity Multisig Hack from every angle, co-founder of the White Hat Group and led the creation of Token Engineering Commons. Advisor for PolygonID, PolygonHermez, brightID, and steward for Gitcoin, ENS, Arbitrum &amp; Optimism.\n- Jake - Growth Lead\n    - Twitter: [https://x\\.com/GivJake](https://x.com/GivJake)\n    - Github: [https://github\\.com/SnakeGH](https://github.com/SnakeGH)\n    - Past experience: 12+ years of experience within the web2 corporate America business development arena combined with 3+ years of business development, partnerships, and fundraising efforts in web3 with Giveth and General Magic. Proven track record of crafting and executing strategic plans that align with organizational goals, resulting in substantial business growth and increased market share\n- Cotabe – Partnerships Lead\n    - Twitter: [https://x\\.com/Cotabe](https://x.com/Cotabe)\n    - Github: [https://github\\.com/Cotabe](https://github.com/Cotabe)\n    - Past experience: Web3 grants specialist who secured $1.5M+ in funding for 10+ projects across Optimism, Arbitrum, and Polygon. Experienced in end-to-end grant management, MEV mitigation, public goods funding, and Web3 onboarding. Contributor to Giveth and Shutter DAOs, and delegator on Optimism, Arbitrum, ZKSync, and EigenLayer. Passionate about Regenerative Finance and making Web3 fair and accessible.\n- Marko - Design Lead\n    - Twitter: [https://x\\.com/markoprljic](https://x.com/markoprljic)\n    - Github: [https://github\\.com/markoprljic](https://github.com/markoprljic)\n    - Past experience: 25+ years as a designer between traditional and web3 initiatives. Marko contributed to companies like EPH (the largest newspaper in Croatia) and then in web3 with the likes of Consensys, as well as to General Magic, Giveth, Token Engineering Commons, and The Commons Stack. Marko was also a Fellow of Panvala.\n- Freshelle - Accounting &amp; Finance Steward\n    - Twitter: [https://x\\.com/FreshelleT](https://x.com/FreshelleT)\n    - Github: [https://github\\.com/freshelle](https://github.com/freshelle)\n    - Past experience: 6 years of experience as Accounting Lead for Web3 initiatives like Giveth, General Magic, Praise and Pairwise, as well as almost 2 years of experience as an Audit Associate for Deloitte.\n- Kresimir Katusic  - Fullstack Engineer\n    - Github: https://github.com/kkatusic\n    - LinkedIn: https://www.linkedin.com/in/kkatusic/\n    - Past experience: 7 Years working as a backend developer, divided into 4 years in the web2 industry for Koombea in e-commerce and mobile applications, and 3 years building robust web3 backend integrations with the blockchain and smart contracts for Giveth and General Magic.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"₳150,000 in total.\n\nSplit into the following way:\n\n- ₳90,000 for development.\n    - Front-end and UI/UX design – ₳35,000: Branding and smooth Cardano donation flow for optimal donor experience.\n    - Cardano integration into Giveth platform – ₳65,000: Full backend &amp; frontend implementation enabling seamless ADA and stablecoin donations.\n        - Phase 1 (₳45,000):\n            - Native ADA donations only\n            - Draft donation automation\n            - Core backend features\n            - Basic frontend integration\n            - Cardano wallet support\n        - Phase 2 (₳20,000):\n            - Cardano Native Tokens\n            - Advanced UI polish\n            - Edge case handling\n- ₳25,000 for Marketing, Operations and Business Development.\n    - Marketing, BD, operations and reporting - ₳25,000: Launching and adoption marketing campaigns, Business Development to promote adoption and look for sponsors for the matching pool of a QF round, team coordination, tracking, and transparent updates.\n- ₳35,000 QF round execution (PMs, Dev work, design, marketing and operations).\n    - Round communications (emails, X spaces, social posts, guides, graphics). ₳6,000\n    - Round setup, project curation and round operation. ₳9,000\n    - User support, issue management &amp; Feedback collection. ₳5,000\n    - Sybil &amp; fraud analysis. ₳9,000\n    - Dev support. ₳6,000","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This is not just the average high-risk prototype. Giveth is an organization established in 2016 with a platform trusted by 7.3K+ projects and 25.4K+ donors that has been used to distribute almost 5.4 M USD and is one of the most renowned public good funding platforms in the crypto space with key ongoing partnerships with the leading protocols including: Ethereum, Solana, Base, Optimism, Polygon, Gitcoin, Endooment and now traditional impact organizations like UNDP and the Elton John Foundation. \n\n\n\nThis grant unlocks permanent Cardano-native crowdfunding and quadratic funding infrastructure. It enables seamless, fee-free donations on Cardano with a simple and safe UX, and activates both the Cardano community and new users across impact and public good ecosystems.\n\n\n\nTo accelerate adoption and engagement, we will launch marketing campaigns, strategic BD efforts within the Cardano ecosystem and include Cardano in a QF round. These initiatives are designed to onboard a critical mass of Cardano activity on Giveth quickly. This creates early momentum, increases visibility, and helps establish Cardano as an attractive, accessible donation option from the start.\n\n\n\nMoreover, we have intentionally set the last milestone to be performance-based to align our incentives with the success of Giveth integration to Cardano, tying funding to the achievement of ambitious KPIs. \n\nIn the short term, this integration will potentially be used in a high-visibility, UNDP-sponsored Quadratic Funding round, enabling Cardano to showcase its utility and impact. In the long term, Cardano becomes a default donation option for Giveth-hosted campaigns. As well as a go-to platform for Cardano projects to crowdfund 24/7 and a capital allocation mechanism to host quadratic funding rounds for the Cardano ecosystem.\n\n\n\nThis is infrastructure for real-world adoption, brand visibility, and value flow into Cardano built on a proven platform with immediate use cases and long-term benefits.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Financial Services","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1740}