{"pr_id":"019abda7-a83d-7402-ab25-330407e47f7d","title":"Marketing and Onboarding with a Universal Product Market Fit","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Marketing and Onboarding with a Universal Product. One that represents what the blockchain is. Positive income for the Treasury. Lasts Generations. Art + Engineering. Tangible Utility. End-User Value","solution":"A Product Specific to Cardano's Epochs. Global Reach and Universal in nature. Manifest the chain in a tangible timepiece that anyone can see and understand. A walking marketing tool in every continent","proposer_name":"Chronoracle","proposer_relevant_experience":"Chronoracle will work with the manufacturers to create the sample,\n\nThe manufacturing teams will be confirmed and order placed within the first 3 months\n\nChronoracle will also contact Cardano related Hubs and marketing teams to confirm where to send the samples.\n\nChronoracle has a binding agreement to uphold the integrity of the Cardano community, its Brand and Image\n\nChronoracle is also under additional oversight due to policy and regulation given the securities licensing of the Founder. IE there will not likely ever be a token launch.\n\nAny ICO type of investment, for example, is many times prohibited or regulated selling for a certain period of time...Sales and other outside business related ventures for Chronoracle are monitored.","url":null,"funds":20000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Marketing and Onboarding with a Universal Product Market Fit","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Chronoracle","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":20000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Marketing and Onboarding with a Universal Product. One that represents what the blockchain is. Positive income for the Treasury. Lasts Generations. Art + Engineering. Tangible Utility. End-User Value","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A Product Specific to Cardano's Epochs. Global Reach and Universal in nature. Manifest the chain in a tangible timepiece that anyone can see and understand. A walking marketing tool in every continent","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://chronoracle.com","https://x.com/chronoracle","https://www.youtube.com/@Chronoracle"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Chronoracle will work with a United States or Swiss based manufacturer to create the sample for the epoch related watches.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Yes the concept and process will be transparent. Others will be able to see how the watches are created. Including a video with how to create their own. The product is a universal one and applies to all. The focus will be to create a globally inclusive product. \n\nPart of the proposal is to create a video of how to create an epoch watch on your own. For this we have selected opensource Watch Movements(calibers) so anyone can participate in making it. This principle is throughout our philosophy. ","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Marketing","group":"Events & Marketing"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"**Who:**\n\nOur target is people from every country. Of all ages.\n\nFrom those with deep pockets to those without a wallet.\n\nPeople looking to learn about blockchain and understand the inputs and outputs as well as the OG developers\n\nWatchmakers, Collectors, Enthusiasts of Web 3, Horology, (the study of time).\n\nSPO's, DREPS, CC members, Founding entities and the rest of the Cardano Community\n\n**How:**\n\n**A strategic selection of recipients for the sample\\. Sending the Samples to areas with great impact\\.**\n\nSending the sample watches to Hub's, Watch Clubs Deep Rooted and like-minded institutions as well as a select few influencers.\n\nContact will also be through\n\nIn person and at events, both for Web3 as well as in the world of watches.\n\nOnline via social media, spaces, discords","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"Creating the Sample watch\n\nDistributing Samples to each continent and polling for demand\n\n\n\nDoing an auction or raffle to drive demand and return some of the proceeds to the Cardano Treasury\n\n\n\nSharing the watch with Horological/Watch related clubs, societies, at conventions","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"Spreading the concept of Ouroboros and Time into the Watch with Meaning and Capturing the virtues of Cardano in the product with Utility\n\nHaving an affordable product for the masses\n\nCreating demand\n\nHaving a product that creates Income for the treasury\n\nHaving a measurable return for new wallets, sales and increase of transactions\n\nGetting the Watch featured in a press/plublication\n\nSending the Watch to Hubs to educate and potentially for income","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Cardano has qualities that deserve a spotlight in the same sentence as time itself. It has the uptime, top of the line engineering, consensus, art and utility.\n\n\n\nSee our Sample design [https://www\\.chronoracle\\.com/catalyst\\-fund\\-15](https://www.chronoracle.com/catalyst-fund-15.)\n\nThe watch will likely look very close to this concept with similar materials and measurements. \n\nWe should lean on these characteristics and manifest it into a product that can generate positive returns for the Treasury for generations to come. Income that spreads across all continents, with products inspired from every corner of the world.\n\nWatches fit this mission and with it everything we admire about the research based blockchain we follow each moment of the day, across all time zones.\n\nCardano epochs provide a unique sort lesson of look at how we can tell time. Epochs are a universal type of measurement and transcends the time zones, uniting those who wear the watch and follow the chain.\n\nThe epoch related watches are built with longevity in mind. Is a great marketing and educational tool and tells a story about Cardano, how Cardano has its own time and what that all means and represents. Easily be able to share with others when the next Epoch is for Cardano. A reminder to get paid, to vote, to join your favorite community meetings. To Celebrate the Uptime that we value so much and to share this information in a lasting representation of the blockchain in physical form.\n\nThese products typically carry and keep value, based on the concepts of limited supply commodities. A functional piece of engineering and utility with an input and an output. Ouroboros. Can be integrated into the chain through RWA's, tokenization and also through digital means to help verify time in a decentralized way.\n\nFirst we are starting with a basic concept and product. One inclusive and universal when it comes to function and utility. The watch will be a simple way to track of the Cardano Epoch cycle. It also comes with an important message, a reminder to reset and touch grass and to keep what is most important in life in the front of our mind.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The aim is to create a first of its kind product, using the Cardano logo or Logo insprired design.\n\nNever before has there been a watch that applies to all timezones, syncing each person to a common focus that is Cardano.\n\nCreate a watch that withholds the quality of the blockchain in its engineering and materials but is also cost effective and affordable to the community.\n\nOur price point will likely end up between $500-$1000 for the watch. depending on demand and cost of production.\n\nMost of this cost will be due to the quality of the materials rather than a markup. This is to set a standard for how the community should approach Branded products with the benefactor being the end-user and the Cardano Treasury.\n\nGassroots Marketing\n\nEnd-User Value\n\nA Global Product, one that can be sold in every country.\n\nA Universal Product, one single product that can be used by any person.\n\nA product specific to Cardano Epochs-no jumping ship with this idea\n\nPotential Lasting and Impactful Income for the Cardano Treasury\n\nAn Educational Tool that represents Cardano's tech in physical form.\n\nOnboarding to with a simple purchase.\n\nA product that can increase transaction volume given RWA, tokenization integration. Or verifying time through our blockchain consensus mechanisms and nodes.\n\nA platform to inspire founding entities to come together or compete using this universal product that is already a major market in US, Switzerland, Japan, HK\n\nAlso to attract a very passionate global community that consists of those in the watch market. A very high level of commerce and exchange surrounds this market, has deep roots and community members that truly align with web3, specifically Cardano. Engineers, artists, collectors, small and large businesses, commodities and precious metals. Onboarding these enthusiast is great way to bring in a parallel world. For partnerships, innovating, and to help breach the firmament of the current bubble while creating value.\n\nHave recognition for contributing to the Horological community, study of time.\n\nTo gift the samples to Diamond District Influencers, Watch Society and get a recognition for passing on innovative ideas and value that is material and in the non material.\n\nThis project has a long term vision to make Cardano recognized as the best option in tech to provide the feed for our world's clock, in computers, phones, etc.\n\nTo be able to sponsor sporting events, hackathons or conferences as the official time provider. A simple universal concept but one that holds great meaning and prestige.\n\nMarketing with measurable returns and global reach","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Over the last 15 months we have worked on creating an epoch related watch. An approach that focuses on already available, opensource solutions, low barrier to entry products but still have the same respect and appeal that we expect in a reliable blockchain.\n\nWe created a prototype with this in mind. A solution that turns a simple watch into an epoch countdown with a small adjustment. We chose not to reinvent the wheel for the first iteration and so that we can share with others how to repurpose their own watch to do the same. The result is a low cost solution to test the product for demand without needing to create a custom movement that is built specific for epochs. Though this is in the pipeline.\n\nWe contacted dozens of watch manufacturers, for over a year to learn about pricing, materials, considered tariff costs and price per unit. The goal of course to find a proper fit for representing much more than just a ticker.\n\nAfter narrowing down the options for manufacturing, we found a handful of options in either the USA or Switzerland. The ability to integrate Cardano technology into the product, like tokenization was discussed and is not an issue for the manufacturers.\n\nThe capability to scale for the manufactures is not an issue.\n\nThe manufacturers also follow standards when it comes to quality and produce a verification and guarantee for these standards.\n\nAll options also offer a guaranteed service on products for quality control, and offer the world-class prestige for manufacturing watches.\n\nWe have shared this idea in person with lots of community members, including at constitutional workshops, Rare Evo 2025 and on a handful of Cardano related X spaces, discords and between a couple of developer teams. Having a transparent and honest approach throughout we feel this is an endeavor that can easily be tracked to see the progress and product flow.\n\nChronoracle also has another layer of oversight on it being that the founder must report all activities to the founder's employer. This high level of oversight due to the fact that any outside business activities with Chronoracle need to be reported due to the financial licenses that the founder has. Meaning, (but not limited to) Any sort of  token launch or even the involvement with an ICO, for example, could result in arbitration and is in most cases strictly forbidden or bound to restrictive selling. So to put it lightly, there is no other way Chronoracle would be seeking to raise funds through any sort of token launch or shady business. Sometimes legacy can actually help protect the best interest of an anonymous decentralized organization like Cardano.\n\nSales for products, if demand is great enough for a large quantity order will benefit the Cardano treasury through a royalty or transparent onchain contract.\n\nChronoracle also has a binding responsibility to represent the community and Brand of Cardano in the best way possible. Chronoracle is proud to be able to work on this product and use Cardano branding with the respect it deserves.\n\nThe process will be transparent with updates throughout.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Creating Mechanical Samples","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This is the majority of where the funds will be going for the proposal. for material costs of the sample.\n\nThe watch will be a date watch, so the user can still tell their local time but also see how many days are left until the next epoch and also see the epoch day.\n\nWorking with one of our prescreened manufacturers, will create 3 to potentially 10 sample watches that can be distributed.\n\nThe intention of upholding the Cardano Logo standards or inspired design with clear distinction. We will either will be using a Bare Metal Dial, Mother of Pearl with a Blue Lapis stone. Or go with an enamel or Porcelain, All great options for the Logo and is cost effective while preserving value.\n\nA manually wound or automatic movement. Case between 8-10mm.\n\nSize of the case will range between 37 and 39mm. A high grade stainless steel. Universal in appeal, sleek and has the characteristics of the Cardano blockchain within it. Like a transparent back, a subtle reminder to touch grass, and the bare metal.\n\nCreating a watch sample that is ready for a larger order of production typically ranges between $12,000-$18,000, depending on the movement selected and customization of the date wheel.\n\nThe aim will be to send sample watches to a Cardano related hub on each continent. and to get the watch in the hands of those who work the Cardano related events and conferences both in web3 and in the world of watches.\n\nChronoracle will keep 1 for the forseeable future.\n\nDonate to America's Oldest Watch Guild, The Horological Society of NY est. 1866.\n\nIf there are extra after sending the watch to Hubs, Society and Diamond district Influencer. We will either auction or raffle sample(s). Proceeds will flow back to the Treasury.\n\nThis can be used for educating about the Cardano blockchain, epochs, input and output and to get a measure of potential demand and feedback from the community\n\nSpecifically this milestone would be complete the contract with the manufacturer to\n\nproduce 3-10 items","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The terms of the sample agreement with the watch manufacturer will be transparent\n\nTo be able to see the costs and materials and terms of the guarantee, delivery dates.\n\nIt will likely take 7-12 months for the samples to be completed and shipped.\n\nWe will share the sample with Cardano related hubs or those who represent the Cardano Brand at Cardano related events,\n\nThe watch will be a mechanical one. No digital means. Something simple that can stand the test of time on its own means. No ZK proofs, digital tracking, Bluetooth or even a battery in this piece. Just the inputs and outputs of fine engineering in a mechanical watch.\n\nThe watch will count the days of the epoch and show or course the day of the epoch.\n\nThe contract for creating the bulk order must come with a guarantee either 1 year or 2+ years of quality assurance by the manufacturer.\n\nThe watch sample contract must include a discount for a potential bulk order. IE the money going into creating the samples will also be applied to the cost for a larger bulk order.,\n\nAlso, if a bulk order exceeds x number of items then a discount will be applied to the cost and the retail cost will be lowered accordingly. These teirs for order quantity discount will be transparent and benefit the retail user. We would not keep the same price if there is higher demand. If enough orders are met then the final cost to the consumer will be lowered.\n\nChronoracle will not be asking for additional funds or seek funding through a token sale due to various reasons both ethical and legally binding.\n\nIf enough demand for a bulk order comes from this sample set we will give a portion of the sales back to the Treasury.\n\nThe cost for the final product should remain affordable to keep demand and offer a competitive product to market Cardano and benefit the Treasury and end user.\n\n\n\nSEE the Sample Design [https://www\\.chronoracle\\.com/catalyst\\-fund\\-15](https://www.chronoracle.com/catalyst-fund-15)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"In the first couple of months we will secure the contract and share the details of the order.\n\nRelease The terms of using a portion of this money in the sample to be applied to the cost of a bulk order. IE typical sample contracts will take 50% of the money used to create the sample and apply it to the cost of a larger production order.\n\nEvidence from the manufacturers of creating the sample including the details of the watch.\n\nRegular updates via social media and website.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":19000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Bringing Inclusivity with a Globally Recognized Approach","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Bringing Inclusivity with a Globally Recognized Approach \n\n\n\nOur approach is to shine a light on creating this product with materials and tools that are globally recognized and readily available. Something that can be appreciated by our common ancestors but also offer timeless appeal.\n\nTo be able to share and celebrate these methods and create something lasting for the new technology that will take the world by storm. Though a blockchain that represents us all. We are sharing with the world how to turn a common everyday watch into a epoch related watch, of course with the use of some basic supplies.\n\nThe video series will cover the process from start to finish of making the 5 day epoch countdown. Throughout we will discuss the blockchain, its meaning and how Cardano can change the world of watches and the study of time itself, through a lasting decentralized consensus.\n\nAnd also focus on using a worldwide artform that dates back to centuries of beautiful artifacts and is still used today in some of the most expensive watches in the world\n\nWe will create Cardano enamel Dials, using a multi step process of forming custom dials in the shape of the Cardano logo and going through the enamel process with high grade material. Similar to the process that end up in world renowned watches.\n\nWe will film the process and share with others how to turn materials that can be found in most places around the world into something special for our common Brand\n\nCreate a Cardano Logo Dial at the Horological Society of New York, a 160 year old institution that upholds the study of Time and watchmaking. Located in the heart  of Midtown Manhattan, it is America's Oldest Watch Guild established 1866. Roots in USA, Switzerland and many other countries that have contributed to the industry.\n\nDiscuss Horology (the study of time) throughout the videos as it relates to Cardano tech, Ouroboros, consensus and universal epoch time on the blockchain.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The video series completed with the full process on how the watch can be created including the process of designing and prepping the Dial\n\nCreating the Cardano Logo inspired Enamel Dial with all of the steps and process\n\nCardano Logo inspired watch dial created at the Horological Society of New York, captured with photos and video.\n\nWe are willing to share and give away some of the Dials to community members around the world. Through a raffle, sale or simple give away.\n\nAny proceeds from a raffle or sale would flow to the Cardano Treasury in the form of ADA.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The film/ video series will be documented and released\n\nThe plans and process for creating the dial and enamel process will be released via social media. \n\n\n\nShared with the web3 communities in social media, discords\n\nShared with watch communities at watch related events.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":800,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Spreading the Samples to Hubs, Established Institutions. Measure demand Collect Presale Interest","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The aim here is to take the sample watches and disperse them strategically to showscase the concept, take feedback and measure demand for a potental bulk order.\n\nThe sample watches will be created and given out first to Cardano related Hubs. \n\n\n\nThis will be of no cost to the Hub. The watch is to be used for educational purposes. To show people the significance of input and output, engineering, art and most importantly the significance of the epoch cycle and what this all means.\n\nThe Hub can potentially raffle it off, keep it as a display, or even sell it to be able to help fund its own location.\n\nThis will also be a means to get a measure for demand for what could be a larger order for sale. If demand is high enough then orders can be filled. The Hubs will receive a considerable discount from Chronoracle if orders are filled and a portion of these proceeds will go to the Cardano Treasury, further sale by the Hubs can be used by the for their own means and interests.\n\n\n\nGift a watch sample to a Diamond District Influencer. This will provide an opportunity to put the spotlight on the community. To share the technology and pass on a gift that will likely be regifted to another passerby to spread the message about Cardano.\n\nChronoracle will also be promoting the watch sample to gain interest for meeting the requirements to fulfill a larger order size, via social media, the press, and Watch societies, clubs and conferences.\n\nIf enough demand is raised then Chronoracle will share with the Community figures as far as how many watches will be produced, what countries are of interest and provide a % of sales back to the Cardano Treasury. The aim is to have a sustainable business while giving as much as possible back to the Treasury. Either a flat rate or royalty. \n\nIf enough demand is created and orders fulfilled then Chronoracle will also return the 20k ADA back to the Cardano Treasury or Catalyst. This order fulfillment would likely need to be close to the 300 item range.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Deliver watches to either Cardano Related Hubs, event planners. entities, Daos within the community, Intersect etc. For education purposes.\n\nProvide basic materials educational material to complement the watch, the mission and how Cardano and the study of time, Ouroboros,  conciseness, including all the highlights for Cardano Eras.\n\nGift a watch to a Diamond District Influencer. To Showcase or even regift to someone.\n\nShowcase the watch at Cardano Related Events, on social media and discords.\n\nShare with the Horological Society of NY, a 160 year old institution focused Soley on Horology, the study of time and is the oldest watch guild in America. est 1866.\n\nDonate a sample to the Horological Society to keep, auction off, give away. Any proceeds here would end up split between the Horological Society (non profit) and the Cardano Treasury\n\nThere will also be a focus on teaming up with already created online stores for web3 and Cardano relate products to help measure demand and collect indications of interest.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence of delivery to the hubs or Cardano related events.\n\n1. A receipt of shipping with pictures and tracking.\n2. A reciept of any potential auction, raffle or give away. Done through non profit, or transparen and onchain.\n3. Share the watch with a Diamond District influencer. These handful of individudals really encompass a lot of the same characteristics to that our community in web3 . The  message is of universal truth, helping eachother to succeed with life long lessons, longevity in mind and appreciation for limited supply commodites. To be able to give and showcase the Cardano blockchain in physical form with an influencer with such reach with pictures and or video to promote and share.\n4. Similarly  we will capture the evidence of a donation with the Horological Society of NY, a non profit in Midtown Manhattan, America's oldest Watch Guild. \n5. Join recorded Cardano related spaces, IE discords, Intersect. Cardano marketing teams.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":200,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Chronoracle will work with the manufacturers to create the sample,\n\nThe manufacturing teams will be confirmed and order placed within the first 3 months\n\nChronoracle will also contact Cardano related Hubs and marketing teams to confirm where to send the samples.\n\nChronoracle has a binding agreement to uphold the integrity of the Cardano community, its Brand and Image\n\nChronoracle is also under additional oversight due to policy and regulation given the securities licensing of the Founder. IE there will not likely ever be a token launch.\n\nAny ICO type of investment, for example, is many times prohibited or regulated selling for a certain period of time...Sales and other outside business related ventures for Chronoracle are monitored.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The cost to start a manufacturing sample is close to if not more than what is being requested. Chronoracle will have to continue to fill in the difference when it comes to completing the sample if necessary but will be transparent throughout the process.\n\nThe on-the-ground work done for marketing the watch, sending samples out, sharing at conferences, with Hubs, influencers, and time on social media is not being compensated for with any sort of hourly rate or fee.\n\nIf demand for a bulk order is not met then Chronoracle will have paid for the samples using the funds and would likely have further debts to pay to cover the above. So in effort not to waste our working hours and efforts, we will be working to make this something to build off of to eventually receive compensation given a laser order.\n\nThe samples themselves do not take further funds from those who will receive them. Distributing these will be solely for the benefit of marketing and creating a presale environment by creating a first of it's kind watch specific to Cardano's epochs. Chronoracle is not taking from the sale of these samples, any proceeds from a potential raffle or auction.\n\nMilestone 1: 19000\n\nWill be the majority of Costs, creating watch sample.\n\nMilestone 2: 800 ADA, Cost for materials used\n\nCopper Dials, Enamel, Torches, Film and Editing, Dial Maker. Fiber Laser machine use. Potentially needing to rent kiln/oven.\n\nMilestone 3: 200 ADA for Shipping and distributing the sample across Cardano related hubs, Cardano events, Sharing with watch industry at conferences, showcases.\n\nRaising a demand and collecting indication of interest for presale.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"1. This will create a tangible product that can help to onboard people from all over the world.\n2. We are keeping and opensource and inclusive philosophy\n3. To be able to get people onboarded with a simple purchase of an item that applies to all people and is specific to Cardano\n4. It is an educational tool representing the blockchain in physical form\n5. Something that the founding entities already have established markets with. USA, Switzerland and Japan are all major hubs for watches. An opportunity to come together under our common Brand that is Cardano, or even compete with their own version to be able to raise money and self-fund without taking from the treasury.\n6. A potential positive income for the Cardano Treasury on a global scale and something Cardano developers can build off of and integrate with.\n7. Sales and onboarding is measurable.\n8. To also focus on onboarding a like-minded community of the watch and horological industry that is full of engineers, collectors, artists and enthusiasts, similar to the Cardano community.\n9. Keeps the value and ownership in the hand of the end user\n10. Puts Cardano in the spotlight in the field of Horology and Time itself. Market Cardano and its uptime in a real world, material way.  Use the universal nature of Epochs to change how people see time.\n11. Set Cardano up with this foundation to sponsor further events as an official time provider. IE 'the official time for the XYZ sporting event, conference or display these epoch related watches and clocks in a public square, airport or shopping center.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Marketing","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1746}