{"pr_id":"019a8b07-4174-7542-a668-1a40a1d3d6d8","title":"Tokyo Dome: Utility Tokens at the top stadium -powered by AI","event_id":15,"objective":37,"objective_title":"Cardano Partners: Tier-1 Enterprise Integrations","summary":"Tokyo Dome, chosen by Taylor Swift, Bruno Mars, and the Dodgers, is Japan’s top stadium. Tokyo Dome City has 40 million yearly visitors, but most do not return, leading to suboptimal LTV.","solution":"Tokyo Dome Coin can turn up to 40 million annual Tokyo Dome City visitors into repeat customers. Our AI personalizes pricing and perks for each user — including on-site visitors — to maximize LTV.","proposer_name":"Kabushiki Kaisha Anifie Japan","proposer_relevant_experience":"# Yohei Iwasaki — CEO, Anifie (Overall Project Lead)\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/yoheiiwasaki/](https://www.linkedin.com/in/yoheiiwasaki/)\n\n\n\nYohei started his career as a securitization attorney at one of Japan’s largest law firms before earning his MBA and MS at Stanford University.\n\nHe co-founded and exited mOasis; served as VP & Country Manager Japan for Kurion (acquired for $350M); and later became Vice President at Veolia (a Fortune 500 company with 20,000 employees).\n\n\n\nHe is also a frequent guest lecturer for Stanford GSB’s Path to Power course and a mentor for StartX and the Japanese government’s JETRO–StartX joint program.\n\n\n\nFor this project, Yohei oversees regulatory alignment, partner coordination with Tokyo Dome and banks, milestone execution, and overall delivery quality.\n\n\n\n# Masao Watanabe — Head of AI (Japan), Anifie\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/%E9%9B%85%E5%A4%AB\\-%E6%B8%A1%E9%83%A8\\-640a82302/](https://www.linkedin.com/in/%E9%9B%85%E5%A4%AB-%E6%B8%A1%E9%83%A8-640a82302/)\n\n\n\nFormer Head of AI at Fuji Xerox, Masao has led hundreds of enterprise AI implementations for Japan’s largest corporations.\n\nHe supervises AI deployment, personalization logic, and integration of user-engagement signals with the token-based perk system.\n\n\n\n# Tang Chaw Kwan — Blockchain Director, Anifie\n\n\nResume: [https://drive\\.google\\.com/file/d/1PTsijJmmg8y5\\_tNWN9Vm\\-dGX8O9lUARh/view](https://drive.google.com/file/d/1PTsijJmmg8y5_tNWN9Vm-dGX8O9lUARh/view)\n\n\n\nFormer Barclays Capital engineer and founder/CTO of an NFT marketplace, Tang brings deep experience in blockchain integration, wallet design, and high-reliability system architecture.\n\nHe leads all Cardano integration, wallet logic, PPI-compliant token purchase flow, and security review.\n\n\n\n# John Oetjen — Project Manager (Execution & Entertainment Partnerships)\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/johnoetjen/](https://www.linkedin.com/in/johnoetjen/)\n\n\n\nJohn is an award-winning producer whose work spans the Grammy Awards, Cannes, MTV Music Awards, Billboard, ABC, NBC, Disney, and Sony. He produced MC Hammer’s video with over 920 million views and served as Head of Entertainment for the U.S. presidential campaign of George W. Bush.\n\n\n\nJohn manages day-to-day execution and operations for this project and contributes to high-profile partnership development.\n\nHis participation is secured under a signed agreement already used in our Japanese government co-funding approval.\n\n# \n# Igor Khmel — Tokenomics & Product Consultant\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/ikhmel/](https://www.linkedin.com/in/ikhmel/)\n\n\n\nStanford GSB graduate and founder of BankEx (once valued above $1B), Igor specializes in token economics and incentive design.\n\nHe supports the multi-token architecture (accelerated-launch token + second-generation token), ensuring regulatory consistency and maximizing user LTV.\n\n\n\n# Engineering, QA, and Community Operations Teams (Japan, U.S., EU, Africa)\n# \nWe maintain a distributed engineering and QA team with experience delivering regulated payment flows, Web3 integrations, and production-grade consumer applications.\n\nWe also employ international community managers who support operational monitoring, user onboarding, and early-stage user interactions.\n\n\n\nRoles include:\n\n- Blockchain engineers\n- Full-stack engineers\n- QA engineers\n- Community managers (Japan, EU, Nigeria)\n\nThese roles ensure rapid iteration, multilingual support, and robust operational coverage.\n\n\n\n# Tokyo Dome — Enterprise Partner & Deployment Environment\n\n\nTokyo Dome is providing the real-world venue for deployment, making this one of the most significant enterprise integrations in Cardano’s history:\n\n\n\n- 40 million annual visitors to Tokyo Dome City\n- 55,000-seat stadium hosting top global talent\n- Multiple operational zones (retail, attractions, restaurants, live-event venues)\n- Enterprise-level coordination with internal facilities, systems, and compliance teams\n\n\n\nTokyo Dome has already spent over one year conducting regulatory analysis with attorney involvement and supports the deployment environment, operational readiness, and coordination across its facilities.\n\n\n\nAll Tokyo Dome participation is secured and active; no additional recruitment is required.\n\n\n\n# Why This Team Is Uniquely Qualified\n\n\n- Regulatory strength: Legal & banking alignment led by a former Japanese finance attorney + top-tier law firm involvement.\n- Technical strength: Proven production deployments across blockchain, payments, and AI.\n- Operational readiness: Experienced enterprise-grade PM and engineering teams.\n- Enterprise partner strength: Tokyo Dome brings one of Japan’s largest consumer ecosystems — already committed and fully engaged.\n- Execution certainty: All critical partners and team members are already secured.\n\n\n\nThis combined capacity ensures reliable delivery, low execution risk, and a project capable of setting a real-world precedent for Cardano adoption in Japan.","url":null,"funds":550000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Tokyo Dome: Utility Tokens at the top stadium -powered by AI","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Kabushiki Kaisha Anifie Japan","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an Incorporated entity or a Consortium?","description":"Are you submitting this proposal as an Incorporated entity or a Consortium?","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 250,000 and $ADA 750,000","format":null,"answer":550000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Tokyo Dome, chosen by Taylor Swift, Bruno Mars, and the Dodgers, is Japan’s top stadium. Tokyo Dome City has 40 million yearly visitors, but most do not return, leading to suboptimal LTV.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Tokyo Dome Coin can turn up to 40 million annual Tokyo Dome City visitors into repeat customers. Our AI personalizes pricing and perks for each user — including on-site visitors — to maximize LTV.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://fan.anifie.com/cardano-pay/","https://docs.google.com/document/d/1G9ZEiUP3HNXno5fGuGIdfPV3cKAwCM6cwLe1misGc0I/edit?tab=t.0#heading=h.yo9fgtqjpic1","https://cardanoscan.io/token/c9369abc4a759956f382d54185066b61aeee7c4764011d23d12a9a04416e69666965?tab=topholders","https://github.com/Anifie/Cardano_AuroraSynex","https://docs.google.com/document/d/1Jmxlry21nhxVLiui4_Buxsq4UTF4nRkD1adNyNCDR3k/edit?tab=t.0"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","description":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","format":null,"answer":"We intend to open-source a significant portion of our project, including the codebase used to create blockchain-based communities with deployment on the Cardano mainnet (as referenced above).\nHowever, certain components will remain proprietary to safeguard user privacy and maintain system security. Specifically, we plan not open-source:\nUsers’ sensitive conversational chat data\nBackend code that could expose potential attack vectors for malicious actors","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Entertainment","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your established collaborations.","description":"Please provide your rationale for your established collaborations.","format":null,"answer":"# Collaborator — Tokyo Dome (40M Annual Visitors)\nTokyo Dome City attracts an extraordinary **_40 million visitors per year_**, making it one of Japan’s largest and most influential entertainment districts.\n\nIt includes:\n\n• Tokyo Dome — a 55,000-seat stadium that has hosted world-class artists and teams such as **_Taylor Swift, Bruno Mars, LA Dodgers, Coldplay, Michael Jackson_**, and many others.\n\n• Korakuen Hall — Japan’s premier venue for boxing, wrestling, martial arts, and other live competitions.\n\n• A diverse entertainment ecosystem featuring multiple event halls, a full amusement park, several natural hot-spring facilities, a large restaurant and retail zone, and the Tokyo Dome Hotel.\n\nPlease see this link for the proof of the partnership (MOU): [https://bit\\.ly/49GTjO2](https://bit.ly/49GTjO2)\n\n# Role of Tokyo Dome in This Project\nTokyo Dome will provide one of Japan’s largest and most influential entertainment ecosystems as the environment where Cardano-based fungible utility tokens powered by AI will be introduced and expanded.\n\nTokyo Dome City draws **40 million visitors per year — roughly one out of every three people in Japan, equivalent to the combined populations of Tokyo, Osaka, and Nagoya**. This concentration of foot traffic across live events, retail, hospitality, and entertainment creates an unparalleled environment for real-world token deployment.\n\nTokyo Dome is regarded as Japan’s most prestigious music venue — chosen by global icons such as **Taylor Swift and Bruno Mars** and **considered the dream destination for virtually every major pop artist in the country**. Korakuen Hall holds an equally unrivaled position in combat sports — widely regarded as the iconic home of Japanese combat sports — and Tokyo Dome City includes several other dream venues across multiple entertainment genres.\n\nAnifie has spent the past three years building the relationship and business case with Tokyo Dome, meeting regularly with the Chairman and executives — a level of engagement that would take any external organization, including Cardano, years to reproduce.\n\nOn this foundation, **the integration plan has been refined through more than a year of joint planning** and formal presentations to Tokyo Dome’s senior leadership, including the Chairman, CEO, and the broader executive team.\n\nWe envision transforming the entire Tokyo Dome ecosystem into a token-based economy where individual enthusiasm influences pricing and perks. After a year of collaborative planning, this rollout plan has been formally presented to the Chairman, CEO, and executive team. Within this plan, Korakuen Hall — the iconic home of Japanese combat sports — is currently strongly expected to be included in the early implementation. This reflects the alignment and shared understanding that have emerged through the leadership-level planning process.\n\nIn parallel, we are preparing digital pathways. Tokyo Dome may support implementation through funding contributions, access to relevant IP, and coordinated participation in digital fan-engagement initiatives. The digital chat community will play a critical role in converting one-time visitors into repeat customers by delivering AI-tailored perks and benefits directly through our platform.\n\nThe early rollout at Tokyo Dome is expected to be followed by expansion into additional venues, services, and digital channels across its ecosystem, enabling Cardano to reach a broad, mainstream audience through both physical and digital touchpoints.\n\n# Nature of the Collaboration\n• Tokyo Dome, one of Japan’s most iconic and influential entertainment companies, provides high-impact, real-world utility for Cardano-based fungible tokens, enabling mainstream adoption through its large user base.\n\n• Anifie serves as the AI and software provider, delivering the token infrastructure, personalized engagement engine, and integration technology that power the system.\n\nTogether, this collaboration connects one of Japan’s largest entertainment platforms with an advanced AI-driven Cardano application — creating a major opportunity for large-scale, real-world blockchain adoption.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe funding commitments.","description":"Please provide your rationale for your funding commitments.","format":null,"answer":"# Enterprise-Scale Co-Investment &amp; Funding Commitment\nTokyo Dome has already provided extensive support for this collaboration and is preparing additional internal contributions that substantially exceed the size of the Catalyst request. These contributions reflect Tokyo Dome’s strong interest in exploring Cardano-based payments inside its ecosystem.\n\nTo date, Tokyo Dome and Anifie have jointly contributed or prepared the equivalent of well over **JPY 150,000,000** in development, operational resources, and infrastructure support, including:\n\nAnifie’s platform development — Over JPY 100,000,000 already invested into the AI, blockchain, and 3D infrastructure that this project uses.\n\nTokyo Dome operational and facility resources — Approx. JPY 15,000,000 for site access, testing, and on-site deployment.\n\nOperational integration support — Approx. JPY 20,000,000 for payment-system integration work.\n\nIP licensing and branding support — Approx. JPY 20,000,000, made available for use within the project.\n\nServer, AI compute, and 50% of project-management labor — covered by Anifie.\n\nExtensive prior analysis — **More than one year of regulatory and operational review, involving about three external consultants at any given time and a five\\-member internal Tokyo Dome team, focused on confirming the feasibility of introducing digital payments inside Tokyo Dome City**.\n\nTokyo Dome has also indicated that the value it intends to allocate toward utilizing the system is on the order of JPY 100,000,000, separate from the contributions listed above. Combined with Anifie’s prior development investments, this demonstrates the substantial scale of resources already deployed or prepared around this collaboration.\n\nCatalyst funds will focus on the adoption-side components that partners do not cover:\n\nlegal clarification, user onboarding, payment deployment, KPI-based validation, and on-site activation inside Tokyo Dome City.\n\nIn effect, Catalyst provides approximately JPY 35,000,000, while Tokyo Dome and Anifie together contribute or allocate more than JPY 150,000,000.\n\nThis dramatically reduces Catalyst’s risk and enables Cardano to be tested and validated inside one of Japan’s largest consumer ecosystems.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your key performance metrics.","description":"Please provide your rationale for your key performance metrics.","format":null,"answer":"# Goal\nThe goal is to transform the entire Tokyo Dome ecosystem into a token-based economy. With **40 million visitors per year—roughly one out of every three people in Japan—even a conservative 5% conversion would already create about 2 million token users on\\-site**. For context, Cardano has recently seen over 600,000 active wallets in a 30-day period, so a few million mainstream, non-Web3 consumers from a single venue would represent several times that scale (source: ChatGPT, citing Cardano wallet activity data referenced in ccn.com).\n\nThese 2 million users are only the starting layer.\n\nUtility tokens used for payments can spread **virally—much like PayPal or Venmo**—but only if retention is high. Retention increases when users receive AI-tailored perks and benefits based on their digital identity and enthusiasm signals. **Our chat platform has previously achieved ~40% Day\\-30 retention**, and the same mechanism will be applied here. If users return and transact repeatedly, viral expansion beyond Tokyo Dome into its partner network becomes realistic.\n\n# KPIs\nTo reach this outcome, we will measure the following KPIs:\n\n- User Access &amp; Active Usage – number of users accessing the payment app/site\n- Transaction Volume – total and average transactions per user\n- Retention &amp; Repeat Usage – percentage of users returning after first use\n- AI-Measured Enthusiasm Scores – engagement intensity indicators captured through our AI\n- AI-Based LTV Estimates – predicted lifetime value per user generated from AI analysis\n- Ecosystem Revenue Lift – revenue attributable to payment-app users inside Tokyo Dome City\n\n# Why These KPIs Matter\nThese metrics show whether we are building a sustainable token-based economy in which enthusiasm, personalization, and real utility convert one-time visitors into repeat customers. Retention drives virality, repeated usage drives economic value, and together they determine whether millions of mainstream consumers can realistically onboard into the Cardano ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"# Who will our project engage?\nTokyo Dome Coin can transform up to **40 million annual Tokyo Dome City visitors** into repeat customers. Our AI personalizes pricing and perks for each user—including on-site visitors—to maximize LTV.\n\n# Proven Track Record\nAnifie has collaborated with **Honda, Boehringer Ingelheim, TBS**, and others. Our product was recently used at the **World Championship Gymnastics event\\.**\n\nExamples of Past Projects (Fully Delivered)\n\n- **Honda Synergy Lab:** [https://opensea\\.io/collection/honda\\-synergy\\-lab](https://opensea.io/collection/honda-synergy-lab)\n- **World Championship of Gymnastics**: [https://prtimes\\.jp/main/html/rd/p/000000011\\.000069860\\.html](https://prtimes.jp/main/html/rd/p/000000011.000069860.html)\n- **TBS \\(one of Japan’s major broadcast stations\\)**: [https://prtimes\\.jp/main/html/rd/p/000000317\\.000005544\\.html](https://prtimes.jp/main/html/rd/p/000000317.000005544.html)\n- **Ripple’s $250M Creator Fund grant recipient** (1 of only 7 global projects at the time): [https://cointelegraph\\.com/news/ripple\\-s\\-250m\\-fund\\-backs\\-web3\\-projects\\-focused\\-on\\-entertainment\\-and\\-media](https://cointelegraph.com/news/ripple-s-250m-fund-backs-web3-projects-focused-on-entertainment-and-media)\n\nThese projects demonstrate our ability to deliver high-visibility, enterprise-grade deployments with strict timelines and compliance requirements.\n\nAcross our communities, we have achieved:\n\n- **100,000\\+ downloads of our blockchain\\-powered 3D app:** [https://play\\.google\\.com/store/apps/details?id=com\\.anifie\\.anifie&amp;hl=en\\_US\\)](https://play.google.com/store/apps/details?id=com.anifie.anifie&hl=en_US))\n- **500,000\\+ messages exchanged**\n- **~40% Day\\-30 retention**\n- **~$5,000 revenue in a single day**\n- **~20× enthusiasm increase compared to open platforms like X**\n\nWe have also partnered with Jane Lynch, Dick Van Dyke, and Shaun Martin (Snarky Puppy), leveraging their influence to drive engagement. Our team includes a Grammy Award winner, providing direct access to major influencers. Tony Hawk and David Foster have supported our PR efforts.\n\n# How we perceive the problem\nTokyo Dome—selected by Taylor Swift, Bruno Mars, and the Dodgers—is Japan’s top stadium. **The annual visitors of Tokyo Dome City equate to one out of every three people in Japan\\.** Yet only about 100,000 of these 40 million visitors return. This leads to low repeat engagement and suboptimal LTV. This project transforms Tokyo Dome City from a one-time destination into a personalized, AI-driven, repeat-engagement ecosystem.\n\n# Our Solution\nTokyo Dome Coin operates like “a stablecoin with dynamic pricing.” Visitors can purchase the token instantly inside the Tokyo Dome or Anifie app—without using an exchange. The token maintains a general 1:1 relationship with JPY, with a small allowable range, as strict pegging is not required under Japanese regulations.\n\n**A simple analogy explains the value model:**\n\nTokyo Dome Coin is like airline miles—but powered by engagement, not just spending.\n\nInstead of awarding static perks based solely on purchase history, users hold tokens, and their pricing and benefits adapt dynamically based on real engagement, including online behaviors such as chat activity inside our platform. All adjustments are driven by AI-personalized pricing using each user’s digital identity, which is stored securely on their own encrypted blockchain account.\n\n**AI\\-personalized pricing:**\n\nUsers receive better pricing than paying in cash. Discount levels vary per user and are dynamically determined by our multi-agent AI based on each fan’s enthusiasm score.\n\n**AI\\-measured enthusiasm:**\n\nGenerative-AI agents analyze chat activity and interactions to calculate each user’s “enthusiasm score,” which drives personalized perks, discounts, and benefits.\n\n**Broad utility across Tokyo Dome City:**\n\nThe token can be used for stadium goods, exclusive merchandise, tickets (including premium seats), tipping, NFTs/SBTs, membership passes, food, retail goods (such as cosmetics), restaurants, hotels, hot springs, gyms, and more.\n\n**Frictionless purchase flow:**\n\nUsers buy the token directly in-app using JPY, removing Web3 complexity and enabling mainstream adoption across 40 million annual visitors.\n\n**Built\\-in engagement engine:**\n\nBy combining AI enthusiasm scoring with token-based incentives, the system deepens fan engagement, increases repeat visits, and drives ecosystem-wide ROI for Tokyo Dome City.\n\nPlease note that the name of the utility token may be changed from “Tokyo Dome Coin.”\n\n# Why we approach the problem this way\nThree major shifts now make this solution viable at scale:\n\n- Generative AI — Recent breakthroughs allow large-scale, cost-efficient analysis of chat data, enabling real-time measurement of community enthusiasm.\n- Blockchain — MPC-based wallet authentication and secure data policies are now simple enough for mainstream users, even those unfamiliar with Cardano.\n- 3D Social Interaction — Younger generations connect inside 3D digital environments. Our platform combines an advanced AI/blockchain backend with a visually compelling 3D frontend (example:[https://www\\.youtube\\.com/watch?v=zCCUzk0bn\\_o\\)](https://www.youtube.com/watch?v=zCCUzk0bn_o)\n\n# What is unique about our solution\nHistorically, utility tokens have struggled outside of exchange ecosystems (e.g., Binance) because mainstream users face obstacles:\n\n- Purchasing tokens through exchanges is difficult.\n- Paying with tokens rarely provides benefits over credit cards.\n- Few environments offer compelling reasons to use utility tokens.\n\nOur approach overcomes these barriers:\n\n- Ease of Use: Users can purchase tokens directly on Anifie’s or Tokyo Dome’s websites/apps—no exchange onboarding required.\n- AI-Driven Value: Personalized perks and offerings reward meaningful engagement.\n- Compelling Venue: Tokyo Dome is one of Japan’s most iconic entertainment ecosystems, selected by artists like Taylor Swift, Bruno Mars, Lady Gaga, and the Dodgers. It offers a powerful mainstream use case.\n\nTo support mainstream adoption, the regulatory framework must prioritize ease of use. For the Catalyst-funded phase, the entire implementation can be delivered using only one token type: a Prepaid Payment Instrument (PPI). A PPI can be purchased directly inside the Tokyo Dome app or the Anifie app, does not require an exchange account, and is already widely used across Japan for frictionless consumer payments.\n\nIn Japanese consumer and industry contexts, tokens issued under PPI may be referred to as “stablecoins,” even though strict 1:1 pegging is not required. For example, JPYC previously issued a PPI-based stablecoin. (Regulations have since evolved so that secondary trading of PPIs now requires issuer approval.) Consumers, however, naturally perceive these tokens simply as practical payment tools, not speculative assets.\n\nBy grounding the initial launch in a simple, adoption-first PPI structure—we deliver a regulatory-compliant, AI-optimized payment system that can scale from Tokyo Dome City to nationwide use.\n\nOur long-term strategy is to begin with PPI for mainstream adoption, build user familiarity and comfort. This ensures regulatory clarity, smooth onboarding, and a sustainable expansion path for the entire ecosystem.\n\n# How we will demonstrate the impact of our solution\nWe will demonstrate clear project impact through:\n\n- Integration of our technology into Tokyo Dome’s ecosystem (40 million annual visitors).\n- At least 3,500 transactions during this project phase.\n- Deployment of fully compliant payment-focused utility tokens under Japanese regulatory standards.\n\nThese metrics validate early mainstream consumer adoption and provide measurable evidence that a Cardano-powered payment system can succeed inside one of Japan’s most visible entertainment ecosystems.\n\n# Why this is important to Cardano\nGlobally, stablecoins such as USDT, USDC, and USDA have long been discussed as tools for everyday payments or for preserving value in volatile markets, yet mainstream adoption has remained limited. Japan’s clear regulatory framework finally makes it possible to implement this vision in a safe, consumer-friendly way.\n\n**Introducing a payment\\-oriented digital token inside Tokyo Dome’s 40\\-million\\-visitor ecosystem represents one of the world’s first real, large\\-scale demonstrations of digital tokens being used naturally by ordinary, non\\-Web3 consumers\\. This is not a pilot, a sandbox, or a crypto\\-native use case—it is a production deployment in one of Japan’s most active cultural and entertainment environments, where everyday visitors can use a digital token as intuitively as Suica or PayPay\\.**\n\nThis deployment also begins laying the foundation for a more inclusive, behavior-driven economic model—one where personalized incentives and enthusiasm-based loyalty unlock repeat engagement at scale. The broader economic implications are discussed in the Impact section.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"# Short-Term Impact: What Tokyo Dome Deployment Achieves\nTokyo Dome City provides one of Japan’s largest and most influential entertainment ecosystems, with **40 million annual visitors, a 55,000\\-seat stadium**, Korakuen Hall’s year-round competitions, and retail, attractions, restaurants, and hospitality. Introducing Cardano-based utility tokens into this environment creates **one of the first large\\-scale, real\\-world use cases for blockchain payments** in Japan.\n\nIn practical terms, this means:\n\n- **Fans of Taylor Swift, Bruno Mars, Lady Gaga, and the Dodgers could use Cardano\\-based tokens for tickets, merch, food, and in\\-venue experiences\\.**\n- Visitors interact with blockchain without needing to understand blockchain, because token purchasing remains fully compliant and **consumer\\-friendly**.\n- Tokyo Dome gains a system for repeat engagement, loyalty, and personalized perks, powered by AI and settled on Cardano.\n\nThis demonstrates real utility in a live environment far beyond speculative crypto use cases.\n\n# Long-Term Vision: Establishing a New Behavior-Driven Economic Model\nGlobally, **stablecoins such as USDT, USDC, and USDA are often discussed as tools for everyday payments or as ways to preserve value\\. Yet mainstream consumer adoption — especially among non\\-Web3 users — has remained limited\\.**\n\nJapan’s** regulatory clarity **creates a unique opportunity:\n\n**the ability to deploy payment\\-oriented digital tokens safely, at scale, in an ecosystem visited by tens of millions\\.** Tokyo Dome becomes the first real environment where such usage can occur naturally.\n\nHowever, this project reaches beyond stablecoins themselves.\n\nIt begins introducing a more inclusive economic model that corrects structural imbalances in current markets.\n\n**_The Structural Problem_**\n\nTraditional economics maximizes consumer and producer surplus assuming a fixed demand curve. In practice, this leads to a system where outcomes are optimized for those with the highest purchasing power — effectively the top 1%, not the 99%.\n\n**_Our Contribution: Enthusiasm as an Economic Variable_**\n\nWe introduce a new measurable variable: enthusiasm.\n\nEnthusiasm — passion, loyalty, repeat behavior — is evenly distributed across society, unlike wealth.\n\nWith multi-agent AI and blockchain-based identity, pricing and services can adjust dynamically based on each person’s enthusiasm, maximizing that individual’s LTV. When this happens:\n\n- The demand curve itself rises.\n- Customers return more often and spend more per visit.\n- Tokyo Dome gains higher-value, longer-term relationships.\n\nThis is not theoretical:\n\nAI-driven personalization effectively increases each individual’s willingness to return, turning casual visitors into loyal fans.\n\n**_A More Inclusive Economic Structure_**\n\nUnder this model, people receive discounts, perks, and recognition not because they are wealthy but because they meaningfully contribute energy and engagement.\n\nThis creates a new kind of personal economic asset:\n\nhuman engagement, not financial holdings.\n\n# Privacy-Preserving Digital Identity as the Foundation\nA key requirement for this model is that users maintain complete control of their personal identity.\n\nConsumers should not hand their behavioral data, chat history, or identity to centralized institutions.\n\nOur architecture prevents that erosion of privacy.\n\nWe store identity-related data in sharded, encrypted fragments across multiple blockchains, ensuring:\n\n- No single party — not a bank, not a government, not a platform — can reconstruct the user’s identity.\n- Only the individual, through their private key, can unlock and authorize personalization.\n- AI can deliver value without compromising privacy.\n\nThis enables a mass-scale, personalized economic system without the surveillance issues that plague Web2 models.\n\n# How This Drives Cardano Ecosystem Growth\nThis project brings substantial value to Cardano by:\n\n- Introducing Cardano-based tokens to **40 million annual visitors, most of whom are non\\-Web3 users\\.**\n- Demonstrating a** fully regulated payment system deployed inside a Tier\\-1 enterprise partner\\.**\n- Showcasing **Cardano’s strengths in identity, settlement, compliance, and AI\\-assisted personalization**.\n- Establishing a blueprint that **other venues and global enterprises can replicate**.\n- This **elevates Cardano from a blockchain ecosystem to a real\\-world economic infrastructure provider\\.**\n\n# How Impact Will Be Measured\nOur measurement plan includes both early signals and long-term adoption metrics.\n\nInitial Phase:\n\nDeploy at a selected Tokyo Dome touchpoint (example: Korakuen Hall).\n\nMeasure:\n\n- Token purchases\n- Number of transactions\n- Repeat interactions\n- Retention\n- Per-user LTV uplift\n\nExpansion Phase:\n\nWith Tokyo Dome’s support, scale across more venues, services, and/or digital channels.\n\n**Quantitative Metrics**\n\n- Total Cardano-based transactions\n- Total unique users\n- Repeat transaction rate\n- Conversion rates from visitors → token holders → repeat users\n- LTV uplift compared to baseline\n\n**Qualitative Metrics**\n\n- User satisfaction\n- Perceived usefulness of tokens\n- Business partner feedback\n- Influence on Tokyo Dome’s strategic decisions\n\n# How Outputs Will Be Shared\nOur outputs—including case studies, technical resources, and key learnings—will be shared with the Cardano community through open-source channels and through a dedicated project chat community accessible to Cardano members. This approach ensures broad access, encourages replication, and supports scaling across fandom- and venue-based projects.\n\nTo balance transparency with partner confidentiality, we will report performance insights and outcomes at an aggregate level—including total transaction volumes, access rates, retention, engagement, and overall LTV uplift. We will not disclose sensitive information such as individual community revenues or popularity comparisons, as doing so could create competitive or reputational risks for Tokyo Dome or other partners. Instead, detailed or sensitive data will be shared confidentially with the Cardano team upon request, ensuring accountability without compromising trust.\n\nWe will also provide:\n\n- A public dashboard displaying verified KPI data (transaction volumes, engagement rates, aggregated revenues).\n- Case studies and impact summaries shared through appropriate open platforms.\n- Necessary on-chain information (such as policy IDs or transaction references) so that activity can be independently verified through CardanoScan, Koios API, Blockfrost API, or other blockchain explorers.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"# Proven and Commercialized Technology\nWe began developing our platform in 2019 and commercialized it in 2020. Since then, our technology has been deployed in real production environments with enterprise partners and has demonstrated strong performance.\n\n**Our traction includes:**\n\n- **Fortune 500 customers: Hitachi, Boehringer Ingelheim, Honda**\n- **100,000\\+** users who have downloaded and accessed our products\n- **~40% Day\\-30 retention**, far exceeding typical app or website benchmarks\n- ~**20×** higher engagement (messages and session duration) than open platforms like X\n- High-quality 3D environments developed with a Grammy Award–winning artist’s team\n\nThese outcomes confirm that the platform is technically mature and ready for production deployment with Tokyo Dome.\n\nExamples of Past Projects (Fully Delivered)\n\n- **Honda Synergy Lab**: [https://opensea\\.io/collection/honda\\-synergy\\-lab](https://opensea.io/collection/honda-synergy-lab)\n- **World Championship of Gymnastics**: [https://prtimes\\.jp/main/html/rd/p/000000011\\.000069860\\.html](https://prtimes.jp/main/html/rd/p/000000011.000069860.html)\n- **TBS \\(one of Japan’s major broadcast stations\\)**: [https://prtimes\\.jp/main/html/rd/p/000000317\\.000005544\\.html](https://prtimes.jp/main/html/rd/p/000000317.000005544.html)\n- **Ripple’s $250M Creator Fund grant recipient \\(1 of only 7 global projects at the time\\)**: [https://cointelegraph\\.com/news/ripple\\-s\\-250m\\-fund\\-backs\\-web3\\-projects\\-focused\\-on\\-entertainment\\-and\\-media](https://cointelegraph.com/news/ripple-s-250m-fund-backs-web3-projects-focused-on-entertainment-and-media)\n\nThese projects demonstrate our ability to deliver high-visibility, enterprise-grade deployments with strict timelines and compliance requirements.\n\n# Tokyo Dome’s Capabilities and Operational Strength\nTokyo Dome has conducted more than one year of internal and external review—working with a licensed attorney in Japan, multiple consultants, and a dedicated five-member internal team—to evaluate the operational feasibility of enabling digital payments inside Tokyo Dome City.\n\nTokyo Dome provides the scale and operational reliability required for mainstream blockchain adoption:\n\n- **40 million annual visitors** across Tokyo Dome City\n- **55,000\\-seat Tokyo Dome** (Japan’s premier large-venue stadium)\n- Korakuen Hall, hosting hundreds of live competitions annually\n- A full ecosystem of attractions, retail, restaurants, hotels, and event spaces\n\nTokyo Dome is consistently chosen by world-class performers and organizations, including:\n\n- **Taylor Swift**\n- **Bruno Mars**\n- **Lady Gaga**\n- **The Dodgers \\(MLB\\)**\n\nThis makes Tokyo Dome one of the most effective environments in Japan for onboarding millions of non-Web3 users and for validating Cardano-based consumer adoption in the real world.\n\n# Validated Engagement and Monetization Model\nOur AI-driven, closed-community engagement model has demonstrated:\n\n- **~20× **increase in enthusiasm versus open social media\n- Material uplift in monetizable behaviors (paid fan interactions, premium engagement)\n- Strong, repeat user activity across diverse fandoms and brands\n\nThis shows that our “enthusiasm → personalization → loyalty → spending” mechanism is repeatable and already validated in production environments.\n\n# Experienced Team and Execution Network\nWe bring the necessary experience and partnerships:\n\n- Long-term relationships with major Japanese entertainment organizations\n- Collaborations with **Grammy Award–winning** creators and high-profile IPs\n- **Backed by institutional venture capital**\n\nAlumni of top-tier accelerator programs:\n\n- **StartX \\(Stanford University\\)**\n- **Berkeley Blockchain Accelerator \\(UC Berkeley**)\n\nThis network ensures we can deliver reliably and at the level expected for high-visibility enterprise partners.\n\n# Operational and Financial Discipline\nWe have successfully delivered multiple enterprise contracts and government-funded projects that required:\n\n- Milestone-based delivery\n- Strict reporting and documentation\n- Compliance with technical, legal, and financial requirements\n- Careful budget control\n- Transparent accountability\n\nThis track record demonstrates that we can be trusted to manage Catalyst funds responsibly.\n\n# Feasibility and Validation Plan\nFeasibility is strongly supported because:\n\n- The platform is already developed and deployed\n- Engagement mechanics are proven\n- Tokyo Dome provides infrastructure and operational support\n- The rollout will follow a step-by-step, measurable deployment plan\n- KPIs such as retention, engagement, transactions, and LTV uplift provide clear validation signals\n\nBecause the technology is production-ready, the partnerships are secured, and the deployment plan is incremental, the feasibility risk of this project is extremely low.\n\n# Regulatory Feasibility (Japan’s Stablecoin-Equivalent Framework)\nTokyo Dome has also completed **_more than a year of regulatory due diligence, supported by a licensed Japanese attorney_,** several external specialists, and its internal task force, to confirm compliance pathways under Japan’s Payment Services Act.\n\nJapan’s Payment Services Act enables a stablecoin-like payment token category known as Prepaid Payment Instruments (PPI).\n\nFor the initial launch, this project will adopt the PPI model—the same regulatory classification used by JPYC, one of Japan’s most widely recognized “stablecoin-equivalent” tokens.\n\nReference: [https://jpyc\\.jp/](https://jpyc.jp/)\n\nThe PPI framework allows users to purchase tokens directly inside an app or website without a crypto exchange, making it significantly more accessible for mainstream, non-Web3 visitors at Tokyo Dome.\n\nHowever, PPIs also come with regulatory constraints; they are extremely easy for consumers to use but more limited than what the global Web3 ecosystem typically describes as a “stablecoin.”\n\nFor this proposal, we focus exclusively on the mainstream-oriented initial PPI token, which provides the optimal balance of regulatory speed, consumer accessibility, and real-world deployability within Tokyo Dome City. Tokyo Dome expects to take a multi-token approach in future phases to balance consumer usability, regulatory speed, and the ability to remove certain PPI constraints.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Product launch ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Output A — Product Launch**\n\nProduct with the following functionalities:\n\n- Token payment – Users can conduct payments using the utility token through a payment app, payment website, PWA, App Clip or Anifie's chat platform.\n- Token purchase – Users can purchase the utility token within the payment app, website, PWA, App Clip or Anifie's chat platform.\n- Perks and benefits application – The system can apply eligible perks and benefits to users, displayed within a chat community or another designated interface in the payment experience.\n- Chat platform integration – The product can connect with our AI-based chat platform so that engagement signals may be used to determine perk eligibility.\n- AI-based personalization – AI can provide personalized perks or benefits.\n\n**Output B — Regulatory Document**\n\nA regulatory clarification supporting the launch, consisting of one of the following:\n\n- A no-action letter in Japanese issued by the Financial Services Agency of Japan (JFSA); or\n- The result of a formal inquiry (shōkai kekka) to the JFSA, in Japanese (written or oral); or\n- A legal memorandum in Japanese prepared by licensed attorney(s) confirming the regulatory basis under the Payment Services Act; or\n- An equivalent document.\n\n**Clarification:**\n\n- Our approach uses multiple token types with different launch timing. The initial token prioritizes accelerated launch and user friendliness, while later tokens provide broader functionality. To expedite regulatory confirmation for the initial token, it may include one or more of the following characteristics: (i) validity limited to six months or less; (ii) usability restricted to designated online sites, off-site locations, or specified wallet address(es); (iii) non-transferability in secondary markets or transferability only with issuer permission or transferability with capped amount; and (iv) other restrictions required by the regulator.\n- Tokens will be issued by Tokyo Dome or Anifie.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Acceptance Criteria for Output A**\n\n- The product platform includes all features listed in Milestone Outputs.\n- All functionalities are tested by a quality assurance engineer and approved by Anifie’s project manager (or, alternatively, Anifie’s CEO or another officer), indicating that the product is ready for launch.\n- The smartcontract is audited.\n- The product is launched to the public.\n\n**Acceptance Criteria for Output B**\n\n- One of the documents described in Output B is obtained.\n- Anifie, in its sole discretion, decides to proceed with the launch.\n\n**Clarification:**\n\n- “The ‘What is unique about our solution’ section above explains why launching under the Prepaid Payment Instrument structure is legally permissible. Obtaining one of the documents listed above is a matter of good practice, not a project dependency. As discussed, Tokyo Dome and Anifie conducted one year of joint planning with a licensed attorney to confirm the legality of this approach.”\n- Japanese regulatory communications routinely use expressions such as “the risk is low” or “the risk is very low,” even when substantive legal risk is effectively zero. Therefore, Tokyo Dome or Anifie will make the final determination on whether to proceed after receiving the regulatory document.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Evidence for Output A**\n\n- Delivery of the product in the form of a public website URL, an Instant App / App Clip, or an app accessible to the public.\n- A QA checklist completed by a quality assurance engineer, with approval from a project manager (or, alternatively, Anifie’s CEO or another officer), demonstrating that the product meets all Milestone Outputs and Acceptance Criteria.\n\n**Evidence for Output B**\n\n- One of the documents described in Output B.\n\n**Clarification:**\n\n- If the Output B document cannot be released publicly, we will provide it privately. Alternatively, we will privately provide a summary of its contents.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":75000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Initial transactions ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Output A — Verified On\\-Chain Transactions**\n\n- At least 10 successful on-chain transactions are executed through the payment app, payment website, PWA, App Clip, or Anifie's chat platform.\n\n**Output B — Verified Token Purchase**\n\n- At least one token purchase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Acceptance Criteria for Output A**\n\n- Blockchain records confirm ≥10 distinct transactions.\n\n**Acceptance Criteria for Output B**\n\n- System log(s), system dashboard, **or** blockchain record(s) confirm ≥1 successful token purchase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Evidence for Output A**\n\n- A list of transaction showing ≥10 valid on-chain transactions.\n\n**Evidence for Output B**\n\n- Screenshot or log excerpt showing at least one successful token purchase; or\n- Corresponding transaction ID or explorer link confirming delivery of the token to the user’s wallet.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":100000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"At least 100 transactions ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Output A — Verified On\\-Chain Transactions**\n\n- At least 100 successful on-chain transactions are executed through the payment app, payment website, PWA, App Clip, or Anifie's chat platform.\n\n**Output B — Verified Token Purchase**\n\n- At least 10 token purchases.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Acceptance Criteria for Output A**\n\n- Blockchain records confirm ≥100 distinct transactions.\n\n**Acceptance Criteria for Output B**\n\n- System log(s), system dashboard, or blockchain record(s) confirm ≥10 successful token purchase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Evidence for Output A**\n\n- A list of transaction showing ≥100 valid on-chain transactions.\n\n**Evidence for Output B**\n\n- Screenshot or log excerpt showing at least ten successful token purchase; or\n- Corresponding transaction ID or explorer link confirming delivery of the token to the user’s wallet.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":100000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"At least 500 transactions","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Output A — Verified On\\-Chain Transactions**\n\n- At least 500 successful on-chain transactions are executed through the payment app, payment website, PWA, App Clip, or Anifie's chat platform.\n\n**Output B — Verified Token Purchase**\n\n- At least 20 token purchases.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Acceptance Criteria for Output A**\n\n- Blockchain records confirm ≥500 distinct transactions.\n\n**Acceptance Criteria for Output B**\n\n- System log(s), system dashboard, or blockchain record(s) confirm ≥20 successful token purchase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Evidence for Output A**\n\n- A list of transaction showing ≥500 valid on-chain transactions.\n\n**Evidence for Output B**\n\n- Screenshot or log excerpt showing at least 20 successful token purchase; or\n- Corresponding transaction ID or explorer link confirming delivery of the token to the user’s wallet.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":100000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"At least 1000 transactions","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Output A — Verified On\\-Chain Transactions**\n\n- At least 1000 successful on-chain transactions are executed through the payment app, payment website, PWA, App Clip, or Anifie's chat platform.\n\n**Output B — Verified Token Purchase**\n\n- At least 50 token purchases.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Acceptance Criteria for Output A**\n\n- Blockchain records confirm ≥1000 distinct transactions.\n\n**Acceptance Criteria for Output B**\n\n- System log(s), system dashboard, or blockchain record(s) confirm ≥50 successful token purchase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Evidence for Output A**\n\n- A list of transaction showing ≥1000 valid on-chain transactions.\n\n**Evidence for Output B**\n\n- Screenshot or log excerpt showing at least 50 successful token purchases; or\n- Corresponding transaction ID or explorer link confirming delivery of the token to the user’s wallet.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":11,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":100000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #6","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"At least 5,000 transaction volumes","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"**Output A — Verified On\\-Chain Transactions**\n\n- At least 5,000 successful on-chain transactions are executed through the payment app, payment website, PWA, App Clip, or Anifie's chat platform.\n\n**Output B — Verified Token Purchase**\n\n- At least 100 token purchases.\n\n**Output C — Close\\-Out Video and Close\\-Out Document**","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"**Acceptance Criteria for Output A**\n\n- Blockchain records confirm ≥5,000 distinct transactions.\n\n**Acceptance Criteria for Output B**\n\n- System log(s), system dashboard, or blockchain record(s) confirm ≥100 successful token purchase.\n\n**Acceptance Criteria for Output C — Close\\-out video and Close\\-out document**\n\n- Close-out video and Close-out document that meets the guideline below:\n\n[https://docs\\.projectcatalyst\\.io/current\\-fund/general\\-information/project\\-close\\-out\\-report\\-and\\-project\\-close\\-out\\-video\\-pcr\\-and\\-pcv](https://docs.projectcatalyst.io/current-fund/general-information/project-close-out-report-and-project-close-out-video-pcr-and-pcv)\n\n(clarification) The utility token can also purchase NFTs. We are including token purchase transactions, payment transactions, and NFT transfer/mint transactions as transactions. This clarification applies to all milestones.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Evidence for Output A**\n\n- A list of transaction showing ≥5000 valid on-chain transactions.\n\n**Evidence for Output B**\n\n- Screenshot or log excerpt showing at least 100 successful token purchase; or\n- Corresponding transaction ID or explorer link confirming delivery of the token to the user’s wallet.\n\n**Evidence for Output C — Close\\-out Video and Close\\-out Document**\n\n- Links to close-out video and close-out document","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":75000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"# Yohei Iwasaki — CEO, Anifie (Overall Project Lead)\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/yoheiiwasaki/](https://www.linkedin.com/in/yoheiiwasaki/)\n\n\n\nYohei started his career as a securitization attorney at one of Japan’s largest law firms before earning his MBA and MS at Stanford University.\n\nHe co-founded and exited mOasis; served as VP & Country Manager Japan for Kurion (acquired for $350M); and later became Vice President at Veolia (a Fortune 500 company with 20,000 employees).\n\n\n\nHe is also a frequent guest lecturer for Stanford GSB’s Path to Power course and a mentor for StartX and the Japanese government’s JETRO–StartX joint program.\n\n\n\nFor this project, Yohei oversees regulatory alignment, partner coordination with Tokyo Dome and banks, milestone execution, and overall delivery quality.\n\n\n\n# Masao Watanabe — Head of AI (Japan), Anifie\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/%E9%9B%85%E5%A4%AB\\-%E6%B8%A1%E9%83%A8\\-640a82302/](https://www.linkedin.com/in/%E9%9B%85%E5%A4%AB-%E6%B8%A1%E9%83%A8-640a82302/)\n\n\n\nFormer Head of AI at Fuji Xerox, Masao has led hundreds of enterprise AI implementations for Japan’s largest corporations.\n\nHe supervises AI deployment, personalization logic, and integration of user-engagement signals with the token-based perk system.\n\n\n\n# Tang Chaw Kwan — Blockchain Director, Anifie\n\n\nResume: [https://drive\\.google\\.com/file/d/1PTsijJmmg8y5\\_tNWN9Vm\\-dGX8O9lUARh/view](https://drive.google.com/file/d/1PTsijJmmg8y5_tNWN9Vm-dGX8O9lUARh/view)\n\n\n\nFormer Barclays Capital engineer and founder/CTO of an NFT marketplace, Tang brings deep experience in blockchain integration, wallet design, and high-reliability system architecture.\n\nHe leads all Cardano integration, wallet logic, PPI-compliant token purchase flow, and security review.\n\n\n\n# John Oetjen — Project Manager (Execution & Entertainment Partnerships)\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/johnoetjen/](https://www.linkedin.com/in/johnoetjen/)\n\n\n\nJohn is an award-winning producer whose work spans the Grammy Awards, Cannes, MTV Music Awards, Billboard, ABC, NBC, Disney, and Sony. He produced MC Hammer’s video with over 920 million views and served as Head of Entertainment for the U.S. presidential campaign of George W. Bush.\n\n\n\nJohn manages day-to-day execution and operations for this project and contributes to high-profile partnership development.\n\nHis participation is secured under a signed agreement already used in our Japanese government co-funding approval.\n\n# \n# Igor Khmel — Tokenomics & Product Consultant\n\n\nLinkedIn: [https://www\\.linkedin\\.com/in/ikhmel/](https://www.linkedin.com/in/ikhmel/)\n\n\n\nStanford GSB graduate and founder of BankEx (once valued above $1B), Igor specializes in token economics and incentive design.\n\nHe supports the multi-token architecture (accelerated-launch token + second-generation token), ensuring regulatory consistency and maximizing user LTV.\n\n\n\n# Engineering, QA, and Community Operations Teams (Japan, U.S., EU, Africa)\n# \nWe maintain a distributed engineering and QA team with experience delivering regulated payment flows, Web3 integrations, and production-grade consumer applications.\n\nWe also employ international community managers who support operational monitoring, user onboarding, and early-stage user interactions.\n\n\n\nRoles include:\n\n- Blockchain engineers\n- Full-stack engineers\n- QA engineers\n- Community managers (Japan, EU, Nigeria)\n\nThese roles ensure rapid iteration, multilingual support, and robust operational coverage.\n\n\n\n# Tokyo Dome — Enterprise Partner & Deployment Environment\n\n\nTokyo Dome is providing the real-world venue for deployment, making this one of the most significant enterprise integrations in Cardano’s history:\n\n\n\n- 40 million annual visitors to Tokyo Dome City\n- 55,000-seat stadium hosting top global talent\n- Multiple operational zones (retail, attractions, restaurants, live-event venues)\n- Enterprise-level coordination with internal facilities, systems, and compliance teams\n\n\n\nTokyo Dome has already spent over one year conducting regulatory analysis with attorney involvement and supports the deployment environment, operational readiness, and coordination across its facilities.\n\n\n\nAll Tokyo Dome participation is secured and active; no additional recruitment is required.\n\n\n\n# Why This Team Is Uniquely Qualified\n\n\n- Regulatory strength: Legal & banking alignment led by a former Japanese finance attorney + top-tier law firm involvement.\n- Technical strength: Proven production deployments across blockchain, payments, and AI.\n- Operational readiness: Experienced enterprise-grade PM and engineering teams.\n- Enterprise partner strength: Tokyo Dome brings one of Japan’s largest consumer ecosystems — already committed and fully engaged.\n- Execution certainty: All critical partners and team members are already secured.\n\n\n\nThis combined capacity ensures reliable delivery, low execution risk, and a project capable of setting a real-world precedent for Cardano adoption in Japan.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"# 1. Legal Cost — JPY 15,000,000\nThis is the most critical component of the budget.\n\nTokyo Dome has already spent over one year analyzing this regulatory pathway with attorney involvement, and based on that work, no material legal obstacles are expected. However, any stablecoin-like utility token issued for real-world consumer payments in similarly developed jurisdictions — such as Japan or the United States — requires legal costs of this magnitude, because compliance is the single most important requirement.\n\nIf compliance is imperfect, the token cannot launch and all Catalyst-funded work becomes unusable.\n\nThe legal work will be conducted by Masuda-sensei of Mori Hamada &amp; Matsumoto, one of Japan’s top financial-regulation attorneys and a former regulator.\n\nThis cost covers:\n\n- Understanding the technical and business model required for compliant issuance\n- Preparing and submitting a formal inquiry (shōkai kekka) to the JFSA\n- Obtaining a no-action-equivalent clarification\n- Confirming the regulatory position of the initial payment token\n- Drafting compliant Terms of Service and consumer disclosures\n- Reviewing operational controls at Tokyo Dome and/or Anifie\n- Advising on the second-generation token with expanded functionality\n\nThis legal work spans multiple milestones, because the project issues multiple token types (initial accelerated-launch token + second-generation token with expanded capabilities).\n\nNote: The team may or may not choose to submit a todokede to the Kanto Finance Bureau, but this is not a dependency of the Catalyst project.\n\n# 2. Project Management — JPY 7,500,000 (Catalyst Portion)\n(Full cost = JPY 15,000,000; the remaining half is funded by Anifie.)\n\nThis covers coordination across:\n\n- Tokyo Dome\n- Banks and financial institutions\n- Legal counsel\n- AI, blockchain, and product teams\n- On-site operational teams\n\nConducted by:\n\n- Yohei Iwasaki (0.3 FTE) — regulatory alignment, banking coordination, milestone execution\n- John Oetjen (0.2 FTE) — operational and partner integration\n\n(USD 100,000 ≈ JPY 15,000,000; Catalyst funds only JPY 7.5M.)\n\n# 3. Advertising &amp; User Acquisition — JPY 2,000,000\nSupports early KPIs:\n\n- Initial user onboarding\n- Targeted campaigns aligned with Tokyo Dome audiences\n- Conversions needed for Milestones 2–5 (payments + token purchases)\n\n# 4. Community Management — JPY 1,000,000\n20 community managers. This covers:\n\n- Token/payment support\n- User onboarding\n- Community monitoring for AI-driven personalization\n- Chat environment oversight during initial deployment\n\n# 5. Gas Fees (10,000 transactions)\nAllocated for Cardano network fees required for:\n\n- Token purchases\n- Payment transactions\n- Fees will match mainnet gas costs at the time of deployment.\n\n# 6. Tokenomics Design — JPY 3,000,000\nLed by Igor Khmel, covering:\n\n- Multi-token architecture (initial token + second-generation token)\n- Expiration mechanics\n- Compliance-aligned usability constraints\n- Incentive design for LTV maximization\n- Economic modeling aligned with Japan’s regulatory standards\n\n# 7. Financial Operations Setup — JPY 1,000,000\nIncludes:\n\n- Reconciliation workflows\n- Refund/expiration handling\n- Ensures operational readiness under Japanese financial regulatory norms.\n\n# 8. On-Going QA — JPY 1,000,000\nOn-going QA for:\n\n- Payment flow stability\n- Perk-eligibility logic\n- Ensures user safety and functional reliability.\n\n# Costs Not Requested From Catalyst (Covered by Tokyo Dome or Anifie)\n- These large, essential costs are fully funded outside Catalyst:\n- Facility Fee (Tokyo Dome): JPY 15,000,000\n- Operational Fee for Payment System (Tokyo Dome): JPY 20,000,000\n- IP Licensing Fee (Tokyo Dome): JPY 20,000,000\n- Development Cost (already completed): JPY 100,000,000\n- Server / AI Compute (Google Cloud): No cost to Catalyst\n- Smart Contract Audit (Anifie): JPY 3,000,000\n- Half of Project Management Cost: JPY 7,500,000 (Anifie)\n\nThis represents over JPY 150,000,000 in co-funding, demonstrating deep enterprise commitment and sharply reducing the burden on Catalyst.\n\n# Funding Context\nAt today’s exchange rate, 550,000 ADA ≈ JPY 35,000,000. The exchange rate may fluctuate.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"# Why This Budget Represents Strong Value for the Cardano Ecosystem\nThis project delivers one of the largest real-world adoption opportunities ever proposed in Catalyst — a Cardano-based payment system deployed inside Tokyo Dome City, an ecosystem with 40 million annual visitors. The requested 550,000 ADA (~JPY 35 million) unlocks a deployment that is co-funded by Tokyo Dome and Anifie at a level more than 4× larger than the Catalyst contribution.\n\n# 1. Catalyst pays only for the essential components that cannot be covered by enterprises\nThe items requested from Catalyst — legal compliance, project management, tokenomics, user acquisition, and minimal QA/ops — are the only components that must be funded publicly to ensure transparency, regulatory soundness, and accountability.\n\nEverything else is funded by Tokyo Dome and Anifie.\n\n# 2. Over JPY 150,000,000 in co-funding is already committed\nTokyo Dome and Anifie are funding major cost items that are necessary for real deployment but not appropriate for Catalyst funding:\n\n- Tokyo Dome Facility Fee: JPY 15M\n- Tokyo Dome Operational Fee for Payment System: JPY 20M\n- Tokyo Dome IP Licensing Fee: JPY 20M\n- Anifie/Tokyo Dome Development Cost: JPY 100M (already completed)\n- Google-funded AI/Server costs: 0 cost to Catalyst\n- Smart Contract Audit: JPY 3M\n- Half of Project Management Cost: JPY 7.5M\n\nTotal enterprise co-funding:\n\n≈ JPY 165,000,000, over 4× the amount requested from Catalyst.\n\nThis demonstrates exceptionally strong enterprise commitment and de-risks the project for Catalyst voters.\n\n# 3. Regulatory compliance alone justifies Catalyst’s investment\nThe largest cost item — legal compliance — is aligned with norms in other developed jurisdictions such as the United States.\n\nAny stablecoin-like payment token issued in a regulated jurisdiction requires this level of legal rigor. Without it, the token cannot launch, and the entire project fails.\n\nCatalyst funding therefore protects:\n\n- Cardano’s reputation\n- Regulatory safety\n- On-chain consumer protection\n- The viability of deployment inside a major enterprise ecosystem\n\nThis is value creation through risk elimination, which is essential for Cardano entering mainstream environments.\n\n# 4. Catalyst receives a highly leveraged outcome\nFor ~JPY 35M in Catalyst support, the community receives:\n\n- Deployment of a Cardano-based payment token in one of Japan’s largest entertainment ecosystems\n- Access to tens of millions of non-Web3 users\n- A regulatory blueprint that other Japanese enterprises can replicate\n- Validation of a multi-token structure operable under Japan’s strict payment laws\n- A real example of AI-driven personalization + blockchain utility at national scale\n- A high-visibility enterprise collaboration funded overwhelmingly by the private sector\n- In effect, Catalyst receives a JPY 200M-scale project while paying ~15% of its total cost\n\n# 5. Cardano benefits disproportionately relative to the funding amount\nThis project establishes Cardano as:\n\n- A compliant payment infrastructure used by millions\n- A trusted system for Japan’s largest entertainment venues\n- A platform for future stablecoin-like deployments\n- A real-world consumer technology, not just a blockchain\n- The potential visibility — through Tokyo Dome concerts, sporting events, retail locations, and digital channels — makes this one of the most mainstream consumer integrations ever proposed in Catalyst.\n\n# Final Summary\nCatalyst is not funding a speculative experiment. It is funding the portion of the project that unlocks:\n\n- A fully compliant, real-world payment token\n- Enterprise deployment at national scale\n- Japan’s most visible entertainment partner\n- A blueprint for future Cardano adoption across Japan\n\nWith Tokyo Dome and Anifie absorbing over 150 million yen of the cost, the requested 550,000 ADA offers extraordinary value and delivers one of the highest-leverage proposals ever presented in Catalyst.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead applicant is a verified legal business entity.","description":"Legal Entity:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead org has a ≥2-year track record, and the consortium collectively has ≥$5M in verifiable annual revenue.","description":"Track Record & Revenue:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of collaboration with a qualified Tier-1 enterprise is provided.","description":" Tier-1 Collaboration:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is for mature R&D or integration, not an early-stage concept or core infrastructure.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of a mature product is provided, with a clear integration plan if not already on Cardano.","description":"Mature Product & Path:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that all key partners, including the Tier-1 collaborator, are clearly identified.","description":"Partner Identification:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that a clear statement of the partner's in-kind or financial contributions is included.","description":"Partner Commitment:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable references (e.g., LinkedIn, portfolio) for key team members.","description":"Verifiable Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear KPIs for adoption (e.g., transaction volume, user growth). Forecast for projected on-chain transaction volume is provided with adequate justification.","description":"Measurable Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that delivery is ≤ 12 months with clear milestones.","description":"Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a co-marketing or community engagement plan to amplify Cardano's visibility.","description":"Visibility & Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal budget is for future work only, not for completed tasks. No incentives, giveaways, private treasuries and regranting are included in the budget.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400074","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Entertainment","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1747}