{"pr_id":"019abf96-b876-7808-a4c1-ff92e00c0047","title":"Minswap AI-Powered Grid Trading Bot by Spidex AI","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano DEX volume only $3.8M/day (up just 6.1% in Q3 2025 – Messari), because grid trading is complex, fees are high, and 99% of users give up, leaving $423M TVL severely underutilised.\n","solution":"An AI-driven grid trading engine integrated into Minswap (Cardano's largest DEX) that deploys optimised, low-fee automated grids from a single user instruction, boosting volume and liquidity 24/7.","proposer_name":"Alex","proposer_relevant_experience":"This proposal is part of a limited set of submissions by our team. For Fund 15, we are submitting a total of 02 proposals, ensuring each is unique, focused, and aligned with Cardano’s ecosystem growth.\n\n**1\\. Project Management Team \\(Executive team\\)**\n\n**Mr\\. Alex \\- Marketing Manager**\n\n- 5+ years driving growth for early-stage and scaling startups in tech and digital services.\n- Experienced in brand building, performance marketing, and growth hacking to rapidly acquire and retain users.\n- Skilled in digital channels (SEO, SEM, social media ads, content strategy) and community-led marketing to boost brand visibility.\n- Strong track record in product launch campaigns, turning MVPs into market-ready products with measurable traction.\n- Data-driven decision-maker, using analytics tools (Google Analytics, Meta Business Suite, HubSpot) to optimize CAC and LTV.\n- Comfortable working in lean teams, wearing multiple hats across brand, acquisition, and partnerships.\n- Passionate about creating brand narratives that resonate with tech-savvy, early-adopter audiences.\n- LinkedIn: [https://www\\.linkedin\\.com/in/phunguyen16072001/](https://www.linkedin.com/in/phunguyen16072001/)\n\n**Mr\\. Marcus\\- Operations Manager**\n\n- 3+ years managing operations in fast-paced, high-growth startup environments.\n- Skilled in process design, workflow optimization, and scaling operations from small teams to nationwide reach.\n- Hands-on experience with project management (Jira, Trello, Notion) and lean operations to maximize efficiency with limited resources.\n- Strong background in vendor management, resource allocation, and cross-functional coordination between tech, product, and marketing.\n- Comfortable managing remote and hybrid teams, ensuring alignment and timely delivery in agile sprints.\n- Adept at setting up SOPs, tracking KPIs, and using real-time dashboards to monitor performance.\n- Driven by a builder’s mindset, solving bottlenecks quickly and enabling teams to scale without sacrificing quality.\n- LinkedIn: [https://www\\.linkedin\\.com/in/nguyen\\-thi\\-quynh\\-anh\\-0743b42b9/](https://www.linkedin.com/in/nguyen-thi-quynh-anh-0743b42b9/)\n\n**Mr\\. Simon \\- Graphic Designer**\n\n- Experienced in creative design, with 3+ years in blockchain branding.\n- Designed visual assets for 30+ Web3 events, including pitch decks, social media campaigns, and other marketing materials.\n- Telegram: @simonle1707\n- Behance: [https://www\\.behance\\.net/simonle1707](https://www.behance.net/simonle1707)\n\n**2\\. Product Development Team \\(Programming team\\)**\n\n**Mr\\. David \\- Project Manager**\n\n- Develops scalable backend systems using Go, Node.js, and JavaScript.\n- Bridges development and operations through DevOps practices and CI/CD automation.\n- Contributed to 5+ blockchain integration projects, enhancing data integrity and transparency.\n- Serves as mentor and team lead, onboarding and coaching junior engineers with a focus on code review, clean architecture, and agile delivery.\n- Passionate about emerging technologies, actively explores Go performance tuning, Kubernetes orchestration, and blockchain tooling to support clients in finance, retail, and healthcare sectors.\n- LinkedIn: [https://www\\.linkedin\\.com/in/xuantrong\\-vu/](https://www.linkedin.com/in/xuantrong-vu/)\n\n**Mr\\. Bevis \\- Blockchain Engineer**\n\n- 6+ years of experience in blockchain technology and backend development.\n- Senior-level expertise in Solidity, EVM, and various blockchain platforms.\n- Skilled in backend frameworks ExpressJS and NestJS.\n- Proficient with AWS services, microservices architecture, and Kubernetes for building robust, scalable solutions.\n- Strong technical background with a proven track record of delivering high-quality, reliable solutions.\n- Based in Hanoi, Vietnam, passionate about connecting with professionals and exploring opportunities in blockchain and backend development.\n- LinkedIn: [https://www\\.linkedin\\.com/in/bevis\\-thai\\-bao\\-hoang\\-83bb231bb](https://www.linkedin.com/in/bevis-thai-bao-hoang-83bb231bb)\n\n**Mr\\. Daniel \\- Product Manager**\n\n- 6+ years of experience delivering high-quality, scalable, and maintainable solutions.\n- Fullstack expertise: Golang, Node.js, React.js, Vue.js – from complex backend services to modern, responsive web apps.\n- Extensive cloud experience with AWS (AWS Certified Solutions Architect – Associate) and Google Cloud Platform (GCP).\n- Skilled in microservices architecture, Docker containerization, and Kubernetes (K8s) orchestration.\n- Combines a passion for clean code with a DevOps mindset, bridging development and operations for efficient, reliable systems.\n- Committed to continuous learning and collaborating with forward-thinking teams to create impactful solutions.\n- LinkedIn: [https://www\\.linkedin\\.com/in/trung\\-duy/](https://www.linkedin.com/in/trung-duy/)\n\n**Mr\\. Subete \\- AI Engineer**\n\n- Experienced in AI-powered solutions within fintech and blockchain domains, delivering scalable and secure systems.\n- Strong backend expertise with NestJS, PostgreSQL, MongoDB, Apache Kafka, and Redis.\n- Proven track record in team leadership, mentoring developers, and driving high-performance engineering teams.\n- Skilled in designing and optimizing data pipelines, event-driven architectures, and real-time transaction systems.\n- Adept at integrating AI models into fintech and blockchain platforms to enhance fraud detection, risk assessment, and user experience.\n- Currently serving as Backend Engineer at SOTATEK., JSC, contributing to mission-critical projects for global clients.\n- Passionate about bridging AI innovation with financial technology to create reliable, future-ready solutions.\n- LinkedIn: [https://github\\.com/xuantoan02](https://github.com/xuantoan02)\n\n**2\\. Advisor Team**\n\n**Mr\\. Long Nguyen – Founder &amp; CEO of Minswap**\n\n- Ex-Amazon software engineer\n- Built Minswap, Cardano’s #1 DEX by TVL, with fair-launch tokenomics.\n- Contributor to Jenkins, Kubernetes, Prometheus.\n- Oversaw security audits, mainnet launch, partnerships (e.g., SingularityNET).\n- Advocate for decentralization &amp; SPO support\n- Twitter: [https://x\\.com/longminswap](https://x.com/longminswap)\n\n**Mr\\. James \\- Founder of Sky3 Team**\n\n- 5+ years of experience in the blockchain industry\n- Founder and advisor for 10+ Web3 projects across DeFi, NFTs, and infrastructure\n- Twitter (X): [https://x\\.com/James\\_Sky3team](https://x.com/James_Sky3team)\n\nTo ensure delivery capacity across multiple projects, additional external headcount will be recruited if this proposal is funded.","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Minswap AI-Powered Grid Trading Bot by Spidex AI","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Alex","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":10,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano DEX volume only $3.8M/day (up just 6.1% in Q3 2025 – Messari), because grid trading is complex, fees are high, and 99% of users give up, leaving $423M TVL severely underutilised.\n","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"An AI-driven grid trading engine integrated into Minswap (Cardano's largest DEX) that deploys optimised, low-fee automated grids from a single user instruction, boosting volume and liquidity 24/7.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://app.spidex.ag","https://spidex.ag/","https://spidex-ai.gitbook.io/spidex-ai-docs","https://x.com/Spidex_ag","https://t.co/GmKMAEQLql"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Our AI engine is fully built and maintained in-house by Spidex AI. All core components (AI logic, optimisation engine, automation stack, execution layer) are already operational and owned entirely by our team. While the model is trained using publicly available data and API endpoints from Minswap","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"The core AI trading engine, optimisation models, and execution infrastructure are proprietary intellectual property of Spidex Team.\nThese components include high-frequency execution logic and AI-based parameter models that cannot be open-sourced due to:\n• The need to protect commercially sensitive algorithms,\n• Security considerations around execution infrastructure,\n• Maintaining competitive integrity for the product.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"DeFi","group":"DeFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Our solution introduces the first fully AI-driven grid trading engine natively integrated into a Cardano DEX, enabling users to deploy automated liquidity strategies through a single natural-language instruction. Unlike traditional grid bots that require manual configuration, spreadsheets, or external bots running off-chain, our engine:\n\n\n\n- Translates plain-English user intents (“Grid ₳500 into ADA/USDM”) into optimised, fee-aware grid parameters in seconds.\n- Runs entirely on-chain through Minswap’s batching system, ensuring extremely low per-order fees — a capability unique to Cardano and not available on CEXs or other chain DEXs.\n- Continuously re-optimises grid parameters using real-time volatility modelling and execution feedback loops, something no existing Cardano tool provides.\n- Removes 99% of the complexity of algorithmic market-making, enabling both new and advanced traders to participate without specialised knowledge.Our MVP will demonstrate a fully functional end-to-end grid trading flow integrated with Minswap test pools, accessible as a public staging environment for community testers.\n\n\n\nThis combination of AI orchestration + UTXO-native execution + natural-language deployment has never been implemented on Cardano before, making the solution both technically novel and strategically valuable to the ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our MVP will demonstrate a fully functional end-to-end grid trading flow integrated with Minswap test pools, accessible as a public staging environment for community testers.\n\nSpecifically, the MVP will show:\n\n- A working natural-language instruction field that interprets user prompts.\n- AI-generated grid parameters including spreads, levels, batch timing, and risk bounds.\n- A functioning execution engine completing a full buy–sell–buy cycle on testnet with correct UTXO handling.\n- Real-time grid visualisation and fee estimation.\n- Wallet connectivity and one-click deployment.\n\nThe MVP will be accessible through:\n\n- A public Spidex-hosted staging URL with wallet connection.\n- GitHub documentation, including API specs and workflow diagrams. \n- Recorded testnet transaction hashes showing live grid activity.\n\nThis prototype provides tangible, verifiable proof that the system is ready for final integration and scaling.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"We define success using measurable, on-chain and user-activity metrics tied directly to increased ecosystem performance:\n\n**On\\-chain Metrics \\(Primary KPIs\\)**\n\n- Automated Grid Cycles Executed: 10,000+ cycles within the first 90 days post-launch.\n- DEX Trading Volume Generated: Increase daily Minswap volume through automated activity by 2–5% (measured via pool-level transactions).\n- Fee Efficiency: Maintain average per-order fee using batching.\n- Number of Supported Trading Pairs: Support at least 3 major pairs with stable performance.\n\n**User Adoption &amp; Activity Metrics**\n\n- Beta Tester Participation: At least 50 wallets completing validated test cycles (Milestone 3).\n- Mainnet User Adoption: 100–200 unique mainnet users deploying grids in the first 90 days.\n- Retention: 40% of users running more than one grid session.\n- Instruction Accuracy Rate: ≥94% success rate for valid AI-interpreted instructions.\n\n**Qualitative Success Indicators**\n\n- User feedback confirming reduced complexity in market-making.\n- Integration visibility through community channels and DEX dashboard engagement.\n- Increased liquidity depth, reduced slippage, and more efficient pool utilisation on Minswap.\n\nTogether, these metrics provide a clear, auditable demonstration of economic impact and real value delivered to the Cardano ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The integration of our bot to Mindwap introduces a full AI-powered grid trading engine that simplifies market-making on Cardano. Users can deploy automated grids using natural-language instructions, while the AI calculates spreads, grid levels, batching frequency, risk limits, and re-optimisation cycles. All executions route through Minswap pools, generating continuous, fee-efficient trading activity. Minswap is the only Cardano DEX (to our knowledge) with zero added “Batching fees” cost. As such, transaction batching keeps average per-order fees extremely low, enabling scalable high-frequency trading behaviour across pairs. This system provides both retail users and advanced traders a frictionless way to participate while strengthening Minswap liquidity. Real User Flow Example User types: “Grid ₳500 into ADA/USDM” → AI replies in &lt; 7s: “Deployed #1847","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project directly increases Cardano’s 24/7 trading volume by enabling thousands of automated grid cycles that continuously buy and sell within pools. Users gain easy access to algorithmic trading without needing technical knowledge, which significantly lowers barriers to active participation. Liquidity depth improves, slippage decreases, and pool utilisation becomes more efficient. The automation also attracts users accustomed to CEX grid bots, bringing new activity onto Cardano’s DeFi rails. Ultimately, this project strengthens Cardano, deepens markets, and accelerates ecosystem growth.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Spidex already operates a functioning AI-driven deployment engine and automated execution stack. This reduces development risk, as the proposal focuses on expanding the existing engine, integrating Minswap pools, and creating a robust in-DEX user experience. The team has the required AI engineering, UTXO-aware batching, and high-frequency trading automation expertise. Feasibility is validated through current live grid execution demos, confirming readiness for integration.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Core Grid Engine Integration with Minswap Pools","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone delivers the core system that connects the Spidex grid engine to Minswap pools, enabling basic grid execution, spread calculation, and fee-optimised batch ordering. It includes SDK development, API endpoints for creating and managing grids, and integration of Minswap price feeds. Testnets will show fully working buy-and-sell cycles with batched transactions and correct UTXO handling.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A functioning SDK and backend capable of creating, updating, and executing grid strategies on Minswap test pools must be deployed. At least one complete grid cycle (buy–sell–buy) must execute successfully with batched transactions. All activity must be verifiable through transaction hashes and logs proving correct spread behaviour and proper UTXO balancing in at least two supported pairs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"GitHub commits showing SDK and API implementations, documentation of the integration, and signed transaction hashes proving the execution of full grid cycles. A recorded demonstration must show the full workflow from grid creation to cycle completion, including batching behaviour and correct price-aligned execution across Minswap pools.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":80000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Minswap UI Integration and User Instruction Engine","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The Minswap interface receives a new Grid Trading section with a natural-language input field, full wallet connectivity, projected APR display, and fee estimates. The UI will communicate with Spidex’s backend to request optimal parameters, display them clearly, and allow single-click deployment. Users will see real-time grid visuals, validation checks, and configuration summaries.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Users on a Minswap staging environment must be able to log in with supported wallets, enter natural-language commands, receive valid AI-generated grid parameters, and deploy an operational grid. The UI must show all grid levels, parameters, and expected fees. Errors, rejected inputs, and invalid states must be handled clearly and consistently.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A publicly accessible staging link with wallet connectivity, screenshots of the functioning flow, and a complete screen recording showing instruction input, AI parameter generation, confirmation, and grid deployment. UI commit history must reflect implemented components, including parameter cards, charts, and deployment modals.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Closed Beta Testing & Performance Validation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone includes onboarding at least 50 beta testers from Cardano and Spidex communities, running structured testing scenarios across several pairs, and stress-testing optimisation cycles. Metrics such as grid success rate, average per-order fee, execution latency, and re-optimisation timing will be collected to ensure stability and economic viability.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"At least 50 wallets must complete multiple successful grid cycles using the integrated system. The overall success rate must reach at least 94%, and the average executed order fee must be reduced. Re-optimisation events must complete without grid interruption. No critical errors, fund losses, or incorrect accounting may remain unresolved.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A metrics dashboard must present aggregated results, including cycle counts, success rates, fees, and performance charts. Test transaction hashes, and logs must verify correct behaviour. A written summary of tester feedback and recorded walkthroughs of testing sessions will be provided to confirm system stability and user satisfaction.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Public Launch on Minswap & Multi-Pair Rollout","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone finalises the public launch of grid trading through an interface, with full production deployment, global Telegram alerting, and improvements derived from beta testing. It includes additional trading pairs, optimised batching logic, refined visualisations, and detailed tooltips for user education. Marketing materials and user guides will accompany the release.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Grid trading must be accessible on the mainnet for all supported wallets and selected pairs. Users must be able to deploy grids using natural-language commands, view real-time performance, and receive alerts. The platform should handle increasing load and support at least three major trading pairs with consistent execution quality across all configurations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Mainnet URL demonstrating operability, announcement posts on official channels, and public documentation. Screen recordings of real users deploying grids, along with transaction hashes confirming mainnet activity, will verify completion. Updated documentation must include onboarding guides and FAQs demonstrating readiness.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":" Final Close-Out Report & System Review","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A complete project report summarising architecture, execution performance, user adoption data, optimisation behaviour, metrics from launch, and recommendations for future expansion. It includes an audit-friendly technical overview, visual charts, and a summary of ecosystem impact, focusing on volume improvements and liquidity effects across pairs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A well-structured PDF must be publicly released detailing milestone achievements, measured performance, user activity data, and technical descriptions. The report must present evidence of economic impact and confirm stable production performance. It should be shared via official Minswap and Spidex social channels.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A publicly accessible PDF in a GitHub repository, complete with charts, final metrics, system architecture diagrams, and a written executive summary. Links to social posts confirming publication will also be provided, along with an archive entry suitable for Cardano Catalyst record-keeping.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"This proposal is part of a limited set of submissions by our team. For Fund 15, we are submitting a total of 02 proposals, ensuring each is unique, focused, and aligned with Cardano’s ecosystem growth.\n\n**1\\. Project Management Team \\(Executive team\\)**\n\n**Mr\\. Alex \\- Marketing Manager**\n\n- 5+ years driving growth for early-stage and scaling startups in tech and digital services.\n- Experienced in brand building, performance marketing, and growth hacking to rapidly acquire and retain users.\n- Skilled in digital channels (SEO, SEM, social media ads, content strategy) and community-led marketing to boost brand visibility.\n- Strong track record in product launch campaigns, turning MVPs into market-ready products with measurable traction.\n- Data-driven decision-maker, using analytics tools (Google Analytics, Meta Business Suite, HubSpot) to optimize CAC and LTV.\n- Comfortable working in lean teams, wearing multiple hats across brand, acquisition, and partnerships.\n- Passionate about creating brand narratives that resonate with tech-savvy, early-adopter audiences.\n- LinkedIn: [https://www\\.linkedin\\.com/in/phunguyen16072001/](https://www.linkedin.com/in/phunguyen16072001/)\n\n**Mr\\. Marcus\\- Operations Manager**\n\n- 3+ years managing operations in fast-paced, high-growth startup environments.\n- Skilled in process design, workflow optimization, and scaling operations from small teams to nationwide reach.\n- Hands-on experience with project management (Jira, Trello, Notion) and lean operations to maximize efficiency with limited resources.\n- Strong background in vendor management, resource allocation, and cross-functional coordination between tech, product, and marketing.\n- Comfortable managing remote and hybrid teams, ensuring alignment and timely delivery in agile sprints.\n- Adept at setting up SOPs, tracking KPIs, and using real-time dashboards to monitor performance.\n- Driven by a builder’s mindset, solving bottlenecks quickly and enabling teams to scale without sacrificing quality.\n- LinkedIn: [https://www\\.linkedin\\.com/in/nguyen\\-thi\\-quynh\\-anh\\-0743b42b9/](https://www.linkedin.com/in/nguyen-thi-quynh-anh-0743b42b9/)\n\n**Mr\\. Simon \\- Graphic Designer**\n\n- Experienced in creative design, with 3+ years in blockchain branding.\n- Designed visual assets for 30+ Web3 events, including pitch decks, social media campaigns, and other marketing materials.\n- Telegram: @simonle1707\n- Behance: [https://www\\.behance\\.net/simonle1707](https://www.behance.net/simonle1707)\n\n**2\\. Product Development Team \\(Programming team\\)**\n\n**Mr\\. David \\- Project Manager**\n\n- Develops scalable backend systems using Go, Node.js, and JavaScript.\n- Bridges development and operations through DevOps practices and CI/CD automation.\n- Contributed to 5+ blockchain integration projects, enhancing data integrity and transparency.\n- Serves as mentor and team lead, onboarding and coaching junior engineers with a focus on code review, clean architecture, and agile delivery.\n- Passionate about emerging technologies, actively explores Go performance tuning, Kubernetes orchestration, and blockchain tooling to support clients in finance, retail, and healthcare sectors.\n- LinkedIn: [https://www\\.linkedin\\.com/in/xuantrong\\-vu/](https://www.linkedin.com/in/xuantrong-vu/)\n\n**Mr\\. Bevis \\- Blockchain Engineer**\n\n- 6+ years of experience in blockchain technology and backend development.\n- Senior-level expertise in Solidity, EVM, and various blockchain platforms.\n- Skilled in backend frameworks ExpressJS and NestJS.\n- Proficient with AWS services, microservices architecture, and Kubernetes for building robust, scalable solutions.\n- Strong technical background with a proven track record of delivering high-quality, reliable solutions.\n- Based in Hanoi, Vietnam, passionate about connecting with professionals and exploring opportunities in blockchain and backend development.\n- LinkedIn: [https://www\\.linkedin\\.com/in/bevis\\-thai\\-bao\\-hoang\\-83bb231bb](https://www.linkedin.com/in/bevis-thai-bao-hoang-83bb231bb)\n\n**Mr\\. Daniel \\- Product Manager**\n\n- 6+ years of experience delivering high-quality, scalable, and maintainable solutions.\n- Fullstack expertise: Golang, Node.js, React.js, Vue.js – from complex backend services to modern, responsive web apps.\n- Extensive cloud experience with AWS (AWS Certified Solutions Architect – Associate) and Google Cloud Platform (GCP).\n- Skilled in microservices architecture, Docker containerization, and Kubernetes (K8s) orchestration.\n- Combines a passion for clean code with a DevOps mindset, bridging development and operations for efficient, reliable systems.\n- Committed to continuous learning and collaborating with forward-thinking teams to create impactful solutions.\n- LinkedIn: [https://www\\.linkedin\\.com/in/trung\\-duy/](https://www.linkedin.com/in/trung-duy/)\n\n**Mr\\. Subete \\- AI Engineer**\n\n- Experienced in AI-powered solutions within fintech and blockchain domains, delivering scalable and secure systems.\n- Strong backend expertise with NestJS, PostgreSQL, MongoDB, Apache Kafka, and Redis.\n- Proven track record in team leadership, mentoring developers, and driving high-performance engineering teams.\n- Skilled in designing and optimizing data pipelines, event-driven architectures, and real-time transaction systems.\n- Adept at integrating AI models into fintech and blockchain platforms to enhance fraud detection, risk assessment, and user experience.\n- Currently serving as Backend Engineer at SOTATEK., JSC, contributing to mission-critical projects for global clients.\n- Passionate about bridging AI innovation with financial technology to create reliable, future-ready solutions.\n- LinkedIn: [https://github\\.com/xuantoan02](https://github.com/xuantoan02)\n\n**2\\. Advisor Team**\n\n**Mr\\. Long Nguyen – Founder &amp; CEO of Minswap**\n\n- Ex-Amazon software engineer\n- Built Minswap, Cardano’s #1 DEX by TVL, with fair-launch tokenomics.\n- Contributor to Jenkins, Kubernetes, Prometheus.\n- Oversaw security audits, mainnet launch, partnerships (e.g., SingularityNET).\n- Advocate for decentralization &amp; SPO support\n- Twitter: [https://x\\.com/longminswap](https://x.com/longminswap)\n\n**Mr\\. James \\- Founder of Sky3 Team**\n\n- 5+ years of experience in the blockchain industry\n- Founder and advisor for 10+ Web3 projects across DeFi, NFTs, and infrastructure\n- Twitter (X): [https://x\\.com/James\\_Sky3team](https://x.com/James_Sky3team)\n\nTo ensure delivery capacity across multiple projects, additional external headcount will be recruited if this proposal is funded.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The total requested budget is 200,000 ADA (1 ADA = $0.42) ≈ 84,000 USD, allocated across five milestones that directly correspond to development, integration, testing, and public launch. Each milestone represents a discrete deliverable with clear acceptance criteria and evidence requirements.\n\n**Milestone 1 — 80,000 ADA**\n\nCore integration of the Spidex AI grid engine with Minswap pools, including SDK, API, batching logic, and testnet execution.\n\nPersonnel Costs:\n\n- Senior AI & FE Engineers: 2 × 300h × $25.2/h (60 ADA/h) = $15,120 ≈ 36,000 ADA\n- Backend Engineer: 250h × $18.9/h (45 ADA/h) = $4,725 ≈ 11,250 ADA\n- QA &amp; Internal Testing: 200h × $12.6/h (30 ADA/h) = $2,520 ≈ 6,000 ADA\n- Documentation &amp; Integration Review: 250h × $12.6–$15/h = $2,835 ≈ 6,750 ADA\n\nTotal: 80,000 ADA\n\n**Milestone 2 — 40,000 ADA**\n\nMinswap UI integration, natural-language instruction module, deployment flow, APR/fee display, and user-facing visual components.\n\nPersonnel Costs:\n\n- Frontend Engineer: 200h × $18.9/h = $3,780 ≈ 9,000 ADA\n- Instruction Engine Engineer: 150h × $18.9/h = $2,835 ≈ 6,750 ADA\n- UX &amp; QA: 150h × $12.6/h = $1,890 ≈ 4,500 ADA\n- Documentation &amp; Staging Support: 120h × $12.6–$15/h = $1,575 ≈ 3,750 ADA\n\nTotal: 40,000 ADA\n\n**Milestone 3 — 30,000 ADA**\n\nClosed beta with 50 testers, performance analytics, stress testing, and optimisation cycle validation.\n\nPersonnel Costs:\n\n- QA/Test Lead: 150h × $12.6/h = $1,890 ≈ 4,500 ADA\n- Analytics Engineer: 150h × $18.9/h = $2,835 ≈ 6,750 ADA\n- Test Support &amp; Bug Fixing: 200h × $12.6/h = $2,520 ≈ 6,000 ADA\n- Reporting &amp; Validation Docs: 100h × $12.6/h = $1,260 ≈ 3,000 ADA\n\nTotal: 30,000 ADA\n\n**Milestone 4 — 20,000 ADA**\n\nMainnet launch, multi-pair rollout, refined visualisation, user education materials, and global notification system.\n\nPersonnel Costs:\n\n- Backend Engineer: 120h × $18.9/h = $2,268 ≈ 5,400 ADA\n- Integration Engineer: 120h × $18.9/h = $2,268 ≈ 5,400 ADA\n- Documentation &amp; User Guide: 120h × $12.6/h = $1,512 ≈ 3,600 ADA\n- Launch Support: 60h × $12.6/h = $756 ≈ 1,800 ADA\n\nTotal: 20,000 ADA\n\n**Final Milestone — 30,000 ADA**\n\nComprehensive final report, public documentation, system review, and ecosystem impact analysis.\n\nPersonnel Costs:\n\n- Analyst: 150h × $12.6/h = $1,890 ≈ 4,500 ADA\n- Engineer: 150h × $18.9/h = $2,835 ≈ 6,750 ADA\n- Technical Writer: 200h × $12.6/h = $2,520 ≈ 6,000 ADA\n- Data Compilation &amp; Charts: 100h × $12.6/h = $1,260 ≈ 3,000 ADA\n\nTotal: 30,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This proposal delivers strong value for money because it turns a one-time development cost into a permanent, self-sustaining benefit for the Cardano DeFi ecosystem. With 200,000 ADA, the project unlocks: \n\n- Continuous on-chain trading volume on Minswap without future funding.\n- Deeper liquidity and lower slippage, improving market efficiency for all users.\n- CEX-style automated trading tools that Cardano currently lacks, attracting new traders and capital.\n- High leverage: we build on an already functional AI engine, so Catalyst funding goes directly to integration and public deployment - not foundational R&amp;D.\n\nIn short, a relatively small grant produces lasting economic impact for the ecosystem, making this proposal a high-value investment for Catalyst.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"DeFi","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1750}