{"pr_id":"019abbd4-21d2-7643-ab76-d77e464b23bf","title":"AI Agents for Cardano dApps to scale User & Org Adoption!","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano’s potential growth is limited by lacking custom automated guidance for users and established organizations to onboard and adopt operations, governance and finances using Cardano dApps.","solution":"A Cardano Lifecycle Toolkit of 4 customizable AI Agents helping dApps to scale by seamlessly guiding users and providing established Orgs with native wallets, Clarity DAOs and Reeve Accountability!","proposer_name":"Local DAO Agents","proposer_relevant_experience":"This project is executed by a joint task force: Local DAO Agents (Implementation and Adoption) and A0x AI (Technology and AI Infrastructure).\n\n\n\n**1\\. Implementation and Adoption Lead \\(Local DAO Agents\\)**\n\n\n\n- **Gonzalo Camps – Project Manager and Methodology Architect**\n\nExpert in DAO implementation and community orchestration in LATAM.\n\nDirector, DAO Incubation Program 2024 (Fund 11): Successfully incubated 8 organizations, achieving a 97% satisfaction score.\n\nDirector, IME Link DAO Festival 2025: Orchestrated the first decentralized festival in LATAM, generating 1,000+ on-chain actions.\n\nCo-Founder, ChileDAO: Regional leader in Web3 governance. Speaker in Cardano Summit 2025 (Buenos Aires)\n\n\n\n**Gonzalo's Role in Project:**\n\n- Methodology: Designs the 6-Module Operational Framework; (Assessment, Execution) that the AI will be trained to teach.\n- Pilot Management: Leads the migration of the pilot cohort to the new product.\n- Partnerships: Manages the technical liaison with Clarity and Reeve teams to ensure API compliance.\n\n[https://www\\.linkedin\\.com/in/gonzalocamps/](https://www.linkedin.com/in/gonzalocamps/)\n\n\n\n\n\n**2\\. Technology and AI Infrastructure \\(The A0x Team\\)**\n\n\n\n- **Daniel Beltrán – A0x CEO, Founder \\(Business and Strategic Architect\\)**\n\nFounder of A0x, the AI Agent framework backed by Coinbase Ventures’ Base Ecosystem Fund.\n\n\n\n**Daniel's Role in Project:**\n\n- Growth Officer and DeFi Business Model Strategist\n- Architecture: Oversees the porting of the A0x engine to Cardano ecosystem.\n- Quality Control: Ensures theBuilder Clones (Model A) meet the high fidelity standards verified on Base.\n\n[https://www\\.linkedin\\.com/in/danielbeltranv/](https://www.linkedin.com/in/danielbeltranv/)\n\n[https://x\\.com/bvdani\\_el](https://x.com/bvdani_el)\n\n\n\n\n\n- **Claudio Condor – AI Engineer \\(Backend and RAG\\)**\n\nExpert in scalable backend architectures and AI pipelines. Lead engineer for integrations.\n\n\n\n**Claudio's Role in Project:**\n\n- RAG Pipeline: Builds the ingestion engine for Cardano documentation to prevent hallucinations.\n- Data Atomization: Manages the system that keeps agents synced with real-time ecosystem updates.\n- Security: Implements the secure backend logic for the wallet connection requests.\n\n[https://www\\.linkedin\\.com/in/oydual3/](https://www.linkedin.com/in/oydual3/)\n\n[https://github\\.com/claucondor](https://github.com/claucondor)\n\n\n\n\n\n- **Matías Palomo – Software Engineer \\(Frontend and Interfaces\\)**\n\nSpecialist in modern web technologies and blockchain-integrated interfaces.\n\n\n\n**Matías' Role in Project:**\n\n- Collaborator Dashboard: Leads the React development of the Model B interface for workers.\n- SDK: Builds the embeddable JavaScript chatbox for Model C (Widget). Manages the Open Action SDK; roadmap for long-term developer adoption.\n- UX/UI: Designs the seamless flow between the Chat Interface and the Wallet Connection.\n\n[https://www\\.linkedin\\.com/in/matias\\-palomo/](https://www.linkedin.com/in/matias-palomo/)\n\n[https://github\\.com/Matiaspp96](https://github.com/Matiaspp96)\n\n\n\n\n\n- **Position: Cardano Full Stack Developer \\(To Be Hired / Budget Allocated\\)**\n\n\n\n**Rationale:** Our 2 trusted Cardano developers from previous successful funds are currently committed to the maximum of 2 projects allowed under the new Fund 15 Eligibility Rules. To ensure full compliance and dedicated bandwidth, we are hiring a new specialist dedicated 100% to this project.\n\n\n\n**Profile Required:** 3+ years in Plutus/MeshJS, experience with eUTxO transaction building, and React proficiency. We have a deep network to fill this role immediately upon funding.\n\n\n\n**Role in Project:**\n\n- Wallet Connect: Implementing the Wallet transaction signatures from the Agent.\n- API Connectors: Writing the middleware that fetches state from the Clarity API and Reeve API to populate the dashboard.\n- Transaction Building: Constructing the CBOR payloads for Bounties and Payments.","url":null,"funds":192800,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"AI Agents for Cardano dApps to scale User & Org Adoption!","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Local DAO Agents","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":192800,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":10,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano’s potential growth is limited by lacking custom automated guidance for users and established organizations to onboard and adopt operations, governance and finances using Cardano dApps.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"A Cardano Lifecycle Toolkit of 4 customizable AI Agents helping dApps to scale by seamlessly guiding users and providing established Orgs with native wallets, Clarity DAOs and Reeve Accountability!","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://linktr.ee/Local.DAO.Agents","https://a0x.co/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"We lead strategic collaborations with the Clarity and Reeve teams, turning dependencies into core strengths.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"We will Open Source (MIT License) all Cardano-specific integrations developed with these funds, ensuring developers can build their own agents using our rails. The core A0x AI engine remains proprietary.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Business Services","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"**1\\. Innovation: Moving from \"Chatbots\" to an \"Agentic Operating System\"**\n\n\n\n- The Status Quo: Most AI solutions currently in the blockchain market fall into two categories: \"Generic GPT Wrappers\" (which hallucinate technical details) or \"Siloed Support Bots\" (which can read docs but cannot act).\n\n\n\n- Our proposal is innovative because it introduces the concept of an Active Agentic Network that does not just read the blockchain, but operates it. We are not building a chatbot; we are building a Co-Pilot for On-Chain Operations.\n\n\n\n- This innovation is defined by four distinct pillars that separate us from anything previously launched in the Cardano ecosystem:\n\n\n\n\n\n**2\\. Structural Innovation: Validated Infrastructure vs\\. R&D Risk**\n\n\n\n- The Status Quo: Most Catalyst AI proposals attempt to build custom Large Language Model (LLM) architectures from scratch. This is high-risk, capital-intensive, and often results in \"vaporware.\"\n\n\n\n- Our Innovation (The A0x Partnership): We are optimizing the R&D phase by partnering with A0x, a framework already backed by Coinbase Ventures’ Base Ecosystem Fund.\n\n\n\n- We leverage A0x’s existing \"Clone\" technology (proven with the Jesse Pollak clone on Base, where he’s the CEO) and adapt it for Cardano’s Ecosystem.  While others are figuring out how to make an LLM remember a conversation, we are deploying a system that already serves thousands of users, focusing 100% of our resources on Cardano dApp integrations, rather than basic AI research.\n\n\n\n\n\n**3\\. Methodological Innovation: Digitizing \"Human Middleware\"**\n\n\n\n- The Status Quo: Tools like Cardano Wallets, Clarity DAO Protocol and CF’s Reeve Accountability on-chain are excellent but complex for massive adoption. The market solution has been “UI”, \"Education\" and \"Consulting\". Neither scales massively.\n\n\n\n- We are not just training an AI on documentation; we are training it on a validated methodology. We are digitizing the \"Local dao Agents\" proven incubation curriculum developed by Cooperativa Local (Fund 11) with 8 stress-tested established organizations. The Agent doesn't just answer questions; it actively guides the user through a proven 6-Module Operational Framework (Assessment -> Onboarding -> Execution).\n\n\n\n- A generic AI might tell you how to create a transaction. Our Agent tells you why you should create it, helps you draft the budget based on your organization’s state, and then prepares the payload for you. \n\n\n\n\n\n**4\\. Interface Innovation: The Dual\\-View Architecture**\n\n\n\n- The Status Quo: AI Agents typically live in an external chat window. This fails for complex work. A user cannot manage a 500-person DAO or track 50 active bounties through a text stream.\n\n\n\n- Our Innovation (The Collaborator Dashboard): We recognize that \"Chat\" is for Strategy, but \"UI\" is for Execution.\n\n\n\n- In our Admin View: The Leader uses natural language in Telegram to give orders (\"Draft a bounty\").\n\n\n\n- In our Collaborator View: The Worker receives a link to a React-based Web Dashboard. This interface visualizes the tasks fetched from a Cardano dApp API, allows file uploads for \"Proof of Work,\" and manages claim transactions.\n\n\n\n\n\n**5\\. Technical Innovation: Active \"Write\" Capabilities**\n\n\n\n- The Status Quo: Most crypto AI bots are \"Read-Only.\" They can explain a transaction hash, but they cannot help you create one. We are implementing Wallet Connect directly into the Agent's interface. This transforms the Agent from a \"Passive Advisor\" into an \"Active Participant.\" \n\n\n\n- This closes the loop between \"Intent\" and \"Action,\" effectively creating a Natural Language Interface for the Blockchain.\n\n\n\n\n\n**6\\. Ecosystem Innovation: The \"Open Action\" Standard**\n\n\n\n- The Status Quo: Agents are usually siloed. We are building an Open Action SDK.\n\n\n\n- We allow third-party developers (e.g., the Clarity or Reeve teams) to register their own API endpoints as \"Actions\" in our network. This creates a Network Effect: As more dApps integrate, every Agent in the network becomes smarter and more capable.\n\n\n\n- We are not building a closed product; we are building the Interoperability Layer for AI on Cardano, solving the fragmentation problem that currently plagues the ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our MVP is not a single static page; it is a live Agentic Network deployed in phases. The prototype will demonstrate the successful porting of the A0x Infrastructure to Cardano, validated through the functional orchestration of the Clarity and Reeve APIs.\n\n\n\nWe will demonstrate four specific \"Models\" of functionality, accessible via web and Telegram:\n\n\n\n\n\n**1\\. Demonstration of \"Model A\": The A0x Ecosystem Knowledge Layer**\n\n\n\n- What it Demonstrates: The capability of our RAG (Retrieval-Augmented Generation) engine to ingest, synthesize, and accurately cite complex Cardano documentation (CIPs, Governance Rules, Technical Docs) without hallucinating. It demonstrates the \"Builder Clone\" persona technology.\n\n\n\n- Key Deliverables: 2 Builder Clones: \"Digital Twins\" of high-profile Cardano key opinion leaders.\n\n\n\n- 3 Protocol Agents: Specialized agents for GovTools, Intersect, and Project Catalyst.\n\n\n\n- Where it can be accessed: Web: Publicly available on the A0x Cardano Portal.\n\n\n\n- Telegram: Direct links to the Telegram Bots for each agent.\n\n\n\n\n\n**2\\. Demonstration of \"Model B\": The Operational A0x Co\\-Pilot**\n\n\n\n- What it Demonstrates: The core innovation—Automated Organizational Management. This demonstrates the Agent's ability to translate natural language intent into specific API calls for Cardano dApps, such as Clarity Protocol (Governance, Management, DAO) and Reeve (Accountability, Reporting).\n\n\n\n- Key Deliverables: The Admin Interface: We will demonstrate an Admin Interface commanding the Agent to \"Create a Bounty\" or \"Check Treasury Health,\" with the Agent successfully guiding the step by step for the admin to follow.\n\n\n\n- The Collaborator Dashboard: We will demonstrate a live React-based Web Dashboard where users can view tasks fetched from APIs and submit proofs of work.\n\n\n\n- The 6 Modules: Validation of the \"Local DAO Agents\" proven workflow (Assessment, Onboarding, and Execution) functioning without human intervention.\n\n\n\n- Where it can be accessed: Live Pilot: Deployed live use-cases with our partners from established organization, such as IME (200 associates), TRAMUS (400 members), and METRO21 (100 collaborators) who were incubated in our DAO Incubation Program 2024.\n\n\n\n\n\n**3\\. Demonstration of \"Model C\": The A0x dApp Support Widget**\n\n\n\n- What it Demonstrates: The portability of the agent. We will show that the \"Support Clone\" can be decoupled from the main platform and embedded directly into a third-party frontend.\n\n\n\n- Key Deliverables: A functional JavaScript Widget (Chatbox) that provides context-aware support based on error codes and documentation.\n\n\n\n- Where it can be accessed: Embedded on a Live Demo Site where users can interact with the widget to troubleshoot common transaction errors.\n\n\n\n\n\n**4\\. Demonstration of \"Model D\": A0x Infrastructure & Active Signing**\n\n\n\n- What it Demonstrates: The transition from \"Chatbot\" to \"Active Participant.\"\n\n\n\n- Key Deliverables: Wallet Connect: We will demonstrate a user asking the Agent to perform an on-chain action, and the Agent triggering the user's wallet extension to request a signature.\n\n\n\n- Open Action SDK: We will demonstrate the developer tooling that allows third parties to register new capabilities.\n\n\n\n- Where it can be accessed: GitHub: The SDK documentation and code examples will be open-sourced.\n\n\n\n- Live Interface: The transaction signing feature will be active within the Model B Collaborator Dashboard.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Our success is defined by the successful transition of our Pilot Cohort from manual consulting to automated Agentic orchestration. We focus on Operational Volume high-value, recurring governance and financial actions, rather than speculative trading volume. We categorize our success metrics into three tiers:\n\n\n\n\n\n**1\\. On\\-Chain Metrics \\(The \"North Star\"\\)**\n\n\n\n- These metrics verify that the Agents are successfully triggering the Clarity and Reeve APIs to generate actual blockchain state changes.\n\n\n\n- Operational Transactions (300+ Actions):Total number of Bounties/Tasks Created on Clarity with the Agent help.\n\n\n\n- Total number of Tokens/Reward Claims executed by Collaborators facilitated through the Dashboard (Model B).\n\n\n\n- Total number of Treasury Transfers assisted by the Agent and signed by Admins.\n\n\n\n- Governance Actions (100+ Actions):Number of On-Chain Votes cast by members of the Pilot Cohort (with former partners such as IME, TRAMUS, METRO21) facilitated by the Agent’s prompts.\n\n\n\n- Number of Proposals drafted by the Agent and successfully submitted on-chain by users.\n\n\n\n- Verified Reporting (6+ Reports):Number of Financial Statements successfully published to the Reeve protocol with our Pilot Agents support (proving the \"Accountability-as-a-Service\" module).\n\n\n\n\n\n**2\\. Platform & User Metrics \\(Engagement\\)**\n\n\n\n- These metrics validate the utility of the A0x infrastructure and the interfaces we are building.\n\n\n\n- Agent Deployment (5 Live Agents): Successful deployment of the 2 \"Builder Clones\" and 3 \"Protocol Agents\" (GovTool, Intersect, Catalyst) by Month 3.\n\n\n\n- User Activation (100+ Unique Users): Number of unique wallet addresses or Telegram IDs interacting with the \"Builder Clones\" (Model A) to validate the RAG system's knowledge base.\n\n\n\n- Knowledge Queries (300+ Conversations): Total number of conversations held where the Agent successfully retrieves and cites Cardano documentation (CIPs, Governance rules) to answer user questions.\n\n\n\n- Collaborator Activation (50+ Active Workers): Number of unique users who log in to the Model B Collaborator Dashboard, connect their wallet, and submit at least one interaction in the dApps connected.\n\n\n\n\n\n**3\\. Infrastructure Deliverables \\(Feasibility\\)**\n\n\n\n- These binary metrics confirm we have built the promised technology.\n\n\n\n- Wallet Connect Integration: Successful demonstration of a signature request triggered by an Agent and signed by a user.\n\n\n\n- Widget SDK: Publication of the embeddable JavaScript code for Model C.\n\n\n\n- Open Action SDK: Publication of the documentation allowing third-party developers (e.g., Clarity team) to register new API endpoints.\n\n\n\n- Validation Strategy: We will achieve these numbers not by hoping for random adoption, but by migrating our existing \"Local DAO Agents\" network to the new system. The success target represents converting approximately 10% of this existing captive audience into active on-chain users during the project timeline.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**The Evolution: From Manual Consulting to AI Orchestration**\n\n\n\nIn our Fund-11 backed 2024 DAO Incubation Program, we successfully onboarded 8 organizations to Cardano by acting as \"human middleware\" -manually reading documentation, explaining concepts, and guiding the configuration of smart contracts for them. But human consulting does not scale. To bring millions of users on-chain, we must automate this guidance for established organizations capable of driving massive, coordinated adoption.\n\n\n\nAfterwards, our ongoing validation with Local DAO Agents (via the 2024 Fund11-backed DAO Incubator) revealed a critical bottleneck: Bandwidth. While we successfully supported the IME Link DAO Festival -bootstrapping an acceleration process that generated over 1,000 on-chain governance actions- we proved that this required intense human intervention. Protocols like Clarity (Governance, Management) and Reeve (On-chain Accountability & Reporting) are powerful, but they remain complex for established companies, institutions, and NGOs transitioning from traditional Web2 structures.\n\n\n\nIn Fund 14, we proposed a \"AI-assisted DAO Operating System\" to help established companies and organizations navigate Cardano. That proposal received a high evaluation score (4.41/5), ranking 7th overall score out of 460 proposals -and 38th in the popular vote- validating the community's deep appreciation for our focus on facilitating mass adoption on established environments, based on our proven prior frameworks.\n\n\n\nThis new Fund15 proposal keeps the highlighted features of our Fund 14 submission but provides multiples of that value by expanding our offer through a strategic partnership with A0x, the experts validated in the broader Web3-AI ecosystem. We are not just building a tool; we are bringing the A0x Infrastructure to Cardano to deploy a specialized AI Agentic Network.\n\n\n\nWe will build the Ecosystem Agents (A) for general knowledge, the Operational Agent (B) for established organizations, the Agent-Widget (C) for dApp onboarding, and the Signature-Capability (D) infrastructure that allows builders to integrate A0x power into their own products.\n\n\n\nOur solution is structured into four distinct Models, delivered sequentially over a 10-month timeline:\n\n\n\n\n\n**MODEL A: The Ecosystem Knowledge Layer \\(Month 3\\)**\n\n\n\nObjective: Immediate engagement and validation of the RAG (Retrieval-Augmented Generation) system on Cardano data.\n\n\n\nBefore agents can execute transactions, they must demonstrate deep understanding. We will launch 5 High-Profile Agents to solve information fragmentation.\n\n\n\n- **The \"Builder Clones\" \\(2 Agents\\)**\n\n\n\nWe will clone the minds of two high-profile Cardano builders/educators. This replicates the massive success of the Jesse Pollak (Base Founder and CEO) official on-chain clone, which has become a primary channel for developer mentorship.\n\n\n\nCapabilities: These agents do not just \"read docs.\" They ingest every blog post, real-time X posts, GitHub commit, whitepaper, and anything else the builder has ever written, submitted by an admin, role that can be claimed by the “original”, for free.\n\n\n\nMentorship at Scale: A developer can ask: \"How would you structure the eUTxO logic for this DEX?\" The clone reasons using the builder's specific mental models and past architectural decisions. It allows the community to \"mentor\" with top leaders 24/7, scaling their presence infinitely.\n\n\n\nReal-Time Sync: Just like the A0x Base clones, these Cardano agents stay synchronized with the builder’s latest announcements, ensuring the advice is never outdated.\n\n\n\n- **The \"Protocol Agents\" \\(3 Agents\\)**\n\n\n\nWe will deploy specialized agents for GovTool, Intersect, and Project Catalyst.\n\n\n\nThe Problem: Users are overwhelmed by the density of CIP-1694, Intersect committees, and Catalyst changing guidelines.\n\n\n\nThe Solution: The Agent goes beyond simple FAQs. It supports simple, and analytic decision making.Simple actions: \"How do I register as a DRep?\" (Procedural).\n\n\n\nAnalytic actions: \"I prioritize decentralization and small pool operators. Based on the current Catalyst Fund 15 parameters, which voting strategy aligns best with my values?\" The Agent analyzes the rules to provide reasoned strategic advice, citation-backed.\n\n\n\nMilestone: By Month 3, these 5 agents will be live, driving traffic and training our underlying model on Cardano-specific terminology.\n\n\n\n\n\n**MODEL B: The Operational \"Local\" Co\\-Pilot \\(Month 6\\)**\n\n\n\nObjective: The core innovation, automating the \"Local Agents\" manual methodology for organizations.\n\n\n\nOnce the AI understands Cardano (Model A), we deploy Model B. This acts as the \"Local\" Co-Pilot for established organizations (Companies, NGOs, DAOs). It replaces the \"Human Middleware.\"\n\n\n\nDeep Training on Key Infrastructure: This Agent is rigorously trained on the documentation of Cardano Wallets, Clarity Protocol (Governance/Treasury), and Reeve (Reporting).\n\n\n\n- **The 6 Operational Modules \\(Guided Experience\\):** Unlike a simple automation script, this Agent focuses on Guidance and Education to solve the friction of human adoption.\n\n\n\nModule 1 (Deep Assessment): This is fundamental. The Agent conducts a structured interview with the Admin to map the organization's DNA. \"Are you a Cooperative requiring 1-member-1-vote? Or a Startup requiring token-weighted voting?\" It analyzes this data to prescribe the perfect adoption path—whether it is following the standard piloting of Modules 2-6, jumping directly to a specific tool, or identifying a grant opportunity in the ecosystem (linking back to Model A).\n\n\n\nModule 2 (Onboarding Guidance): Friction occurs here. The Agent does not simply call an API to configure contracts in a black box. Instead, it acts as an interactive Tutor. It guides the Admin and the Collaborators step-by-step: \"To access the platform, please download a compatible wallet. Here is how you securely back up your seed phrase. Now, navigate to the Clarity dashboard...\" It tailors this tutorial to the specific context of the organization, ensuring non-crypto natives (e.g., NGO workers) feel supported, not overwhelmed.\n\n\n\nModules 3-6 (Execution Guidance): The Agent guides 3. Treasury Management (Clarity), 4. Operations (Clarity), 5. Reporting (Reeve), and 6. Strategy. It actively monitors the organization's needs. If it detects a need for transparency, it prompts: \"It is time to generate your monthly financial report for Reeve. Here is the guide to export your treasury data and publish the proof.\" It ensures the tools are actually used by efficiently communicating workflows to the massive number of new users.\n\n\n\n- **The User Experience: A Dual\\-Interface System**\n\n\n\nThe Admin Interface (Strategy): The Manager interacts via our Web interface that includes a Structured Dashboard (fetching Clarity and Reeve instances), or Telegram. They receive high-level strategic advice and prompts.\n\n\n\nThe Collaborator Interface (Execution): Workers interact via chat, through a task-based Structured Dashboard where the Agent displays active tasks. Collaborators use this interface to submit proofs of work and track their contributions.\n\n\n\nReal-World Validation: We will test this feature with 3 Real Organizations from our existing massive network that participated in the 2024 DAO Incubation Program (8), including:\n\n\n\n1. IME: A trade association of 200+ members.\n2. TRAMUS: A union of 400+ workers.\n3. METRO21: An agency of 100+ collaborators.\n4. RONDA: A distribution company with 30+ members.\n\n\n\n\n\n**MODEL C: The dApp Onboarding Agent \\+ Widget \\(Month 9\\)**\n\n\n\nObjective: Reducing user churn for the wider ecosystem.\n\n\n\nOnce we have a functioning \"Co-Pilot\" (Model B), we package a lightweight version for the broader ecosystem.\n\n\n\nThe Problem (example): Users leave DEXs and Lending Protocols because they don't understand the UI or encounter errors.\n\n\n\nThe Solution: We deploy a JavaScript Widget (Chatbox) that any Cardano dApp can embed in their frontend.\n\n\n\nCapability: A user on a DEX encounters a failed transaction. They open the widget. The Agent analyzes the error context and explains: \"Your collateral was too low for this UTxO size. Please add 2 ADA.\" This provides context-aware support without the user leaving the dApp.\n\n\n\n\n\n**MODEL D: The \"Connect & Build\" Infrastructure \\(Month 9\\)**\n\n\n\nObjective: Opening the platform for developers and enabling true \"Agentic Action.\"\n\n\n\nIn the final phase, we transform from a \"Tool\" into a \"Platform\" by releasing two critical infrastructure features that enable builders.\n\n\n\n**1\\. Agent Wallet Connect**\n\n\n\nFeature: We enable a secure bridge between the AI Agent and Cardano Wallets.\n\n\n\nUtility: This allows users to \"Sign\" transactions directly through the Agent's interface. This moves the AI from \"Passive Advisor\" to \"Active Participant\" (always with user confirmation).\n\n\n\n**2\\. Open Action Creation Tool \\(SDK\\)**\n\n\n\nFeature: We open the \"Action\" layer to external developers.\n\n\n\nUtility: Our role is to publish the infrastructure. The Clarity Team, Reeve Team, etc, can register their own API endpoints as \"Actions\" for the Agent.\n\n\n\nScenario: The dApp team writes a JSON definition for \"Create Bounty.\" Now, any A0x Agent on Cardano can guide a user to create a bounty. This crowdsources the capabilities of the agents, allowing the community to build plugins for DEXs, NFT marketplaces, and Oracles.\n\n\n\n**This proposal delivers a scalable \"Operating System\" that solves the bandwidth bottleneck\\. By combining the A0x Infrastructure with our validated Local Agents Methodology, we provide the missing link that allows millions of users and organizations to onboard, adopt, and build on Cardano with an intelligent guide by their side\\.**","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The most significant threat to the Cardano ecosystem is not a lack of technological capability, our infrastructure is world-class. The threat is the \"Adoption Chasm.\" We have built a robust superhighway, but we lack the drivers.\n\n\n\nCurrently, the friction to onboard a real-world organization (Company, NGO, Cooperative) or a non-technical user is dangerously high. A user must navigate complex wallet UIs, understand governance parameters, and decipher error codes.\n\n\n\nAs validated by our work with Local DAO Agents, this friction requires intense human consulting to overcome. Because human consulting is expensive and unscalable, adoption remains stagnant.\n\n\n\n**Our Project's Core Impact: Infinite Scalability of Onboarding**\n\n\n\nThis proposal delivers a \"0-to-1\" shift in how the ecosystem scales. By replacing the \"Human Consultant\" with an A0x Agentic Network, we remove the bottleneck on adoption. We are moving from a model where we can onboard 10 organizations per year (manually) to a model where we can onboard 10,000 organizations per year (automatically).\n\n\n\nThis impact ripples across four distinct dimensions of the ecosystem, directly aligned with the \"Use Cases: Prototype & Launch\" category goals:\n\n\n\n\n\n**1\\. Impact on On\\-Chain Volume & Utility \\(The Economic Engine\\)**\n\n\n\nThe primary KPI for this fund is \"On-Chain Transaction Volume.\" Model B (The Operational Co-Pilot) is explicitly designed to drive high-value, recurring transactions rather than sporadic, low-value transfers.\n\n\n\nFrom Speculation to Operation: Most current transactions are speculative (buying/selling tokens). Our \"Local Agents\" methodology focuses on Operational Transactions: publishing quests, rewarding bounties, and managing treasuries. These are \"sticky\" transactions that occur monthly, regardless of market conditions.\n\n\n\nImmediate Activation of Dormant Networks: We are not waiting for hypothetical users. We are launching with a captive audience from our previous incubations:\n\n\n\n- IME (200+ Members): A trade association for electronic music.\n- TRAMUS (400+ Members): A union of women workers in music.\n- METRO21 (100+ Collaborators): A creative agency.\n- RONDA (30+ Members): A distribution cooperative.\n\n\n\nThe \"Agentic\" Shift: Without the Agent, these 730+ of users remain off-chain because the learning curve of Cardano is still too steep. With the Agent guiding them via the Collaborator Dashboard, they begin submitting proofs of work on Clarity and claiming payments on-chain.\n\n\n\nQuantifiable Impact: If just 20% of these users claim one bounty per month, that is 1,750+ complex smart contract interactions per year just from our pilot cohort. This creates a baseline of verifiable economic activity that grows exponentially as we open the platform to other DAOs.\n\n\n\n\n\n**2\\. Impact on User Retention & Churn Reduction \\(The \"Leaky Bucket\"\\)**\n\n\n\nCardano dApps spend millions on marketing to attract users, only to lose them when they encounter their first error message. Model C (The dApp Widget) directly plugs this leak.\n\n\n\nStopping the \"Rage Quit\": When a user's transaction fails on a DEX due to slippage or collateral issues, they often leave the ecosystem, assuming \"Cardano is broken.\"The Agentic Solution: By embedding the Model C Widget directly into the dApp frontend, we provide instant, context-aware troubleshooting (\"Your collateral is low, add 2 ADA\").\n\n\n\nThe Value: Retaining a user is 5x cheaper than acquiring a new one. By reducing churn by even 10% for our partner dApps, we significantly increase the Total Value Locked (TVL) and daily active users (DAU) of the wider ecosystem.\n\n\n\nDemocratizing Support: Small dApp teams (1-2 devs) cannot afford 24/7 support staff. This Agent gives every Cardano builder a \"Support Team in a Box,\" allowing them to focus on shipping code rather than answering the same Discord questions 500 times.\n\n\n\n\n\n**3\\. Impact on Governance & Knowledge Distribution \\(The \"Informed Voter\"\\)**\n\n\n\nThe transition to the Voltaire Era (CIP-1694) requires an educated populace. Currently, knowledge is fragmented across PDF whitepapers, 1-hour Town Halls, and buried Discord threads. Model A (The Ecosystem Knowledge Layer) solves this.\n\n\n\nScaling the \"Super-Builders\": Leaders like the heads of Intersect or high-profile builders are bottlenecks. Everyone wants their advice, but they have limited time.The \"Builder Clone\" Impact: By cloning their minds (replicating the Jesse Pollak on-chain clone success), we democratize access to high-level mentorship. A junior dev or a student can have a 2-hour \"mentorship session\" with a top Cardano architect’s AI clone at 3 AM. This accelerates the up-skilling of our global developer base.\n\n\n\nAnalytic Governance: The Catalyst and GovTool Agents do not just regurgitate rules; they help users think. By enabling users to ask, \"Which DReps align with my values on sustainability?\", we transform passive token holders into active, informed participants. This directly increases the Voting Participation Rate and the quality of on-chain governance and budget decisions.\n\n\n\n\n\n**4\\. Impact on Developer Ecosystem \\(The \"Multiplier Effect\"\\)**\n\n\n\nModel D (Infrastructure) transforms this project from a closed tool into an open platform. We are solving the \"Agent Problem\" so other devs don't have to.\n\n\n\n- Standardization of \"Agentic Actions\": By releasing the Open Action SDK, we provide a standard way for any Cardano protocol to become \"Agent-Ready.\"\n\n\n\n- Dev Efficiency: Builders of NFT marketplaces, Oracles, or Identity solutions do not need to build their own LLM infrastructure. They simply plug into A0x. This dramatically lowers the barrier to entry for building complex, AI-integrated dApps on Cardano.\n\n\n\n- Showcasing eUTxO Props: The broader crypto industry is obsessed with \"AI Agents.\" Cardano’s eUTxO model (deterministic transactions) is actually better for Agents than EVM (where gas fees are unpredictable). By launching a high-profile, Agent network on Cardano, we create a powerful marketing narrative: \"Cardano is the best chain for AI Agents.\" This attracts liquidity and talent from other ecosystems.\n\n\n\n**Solving the \"Trust\" Problem for Real\\-World Adoption**\n\n\n\nOne of the biggest barriers for NGOs and Companies (like our 400-member partner TRAMUS) is financial compliance. They cannot use crypto if they cannot account for it in their local jurisdiction.\n\n\n\n- Automated Accountability: By automating the Reeve reporting workflow (Module 5 of Model B), we turn \"On-Chain Data\" into \"Financial Statements.\"\n\n\n\n- The Impact: This unlocks a new demographic: Compliant Organizations. It allows entities that must pass audits (governments, registered charities, unions) to safely use Cardano, knowing the Agent will handle the reporting compliance automatically.\n\n\n\n**Strategic Value: Bringing \"Big Tech\" Validation to Cardano**\n\n\n\nWhile this is a community proposal, the strategic partnership with A0x brings significant institutional validation. A0x is backed by Coinbase Ventures’ Base Ecosystem Fund.\n\n\n\n- Cross-Pollination: By porting this tech to Cardano, we signal to the wider Web3 industry that Cardano is open for business and compatible with top-tier VC-backed infrastructure.\n\n\n\n- Quality Assurance: We are not building an LLM from scratch (high risk). We are deploying a framework that is already serving thousands of users on Base (low risk). This maximizes \"Value for Money\" for the Catalyst Treasury—funding is used for integration and growth, not unsure R&D.\n\n\n\n\n\n**Quantifiable Success Metrics \\(KPIs\\)**\n\n\n\nTo ensure we are delivering tangible impact, we commit to the following metrics:\n\n\n\n**1\\. Deployment & Activation:**\n\n\n\n- 5 Agents Live by Month 3 (Knowledge Layer).\n- 1 Operational Co-Pilot Live by Month 6, deployed to 3 Pilot Networks.\n- 1 Widget SDK released by Month 9.\n\n\n\n**2\\. User Engagement:**\n\n\n\n- 100+ Unique Users interacting with the \"Builder Clones\" (Model A).\n- 500+ Conversations held regarding Governance/Catalyst (Model A).\n- 50+ Active Collaborators submitting proofs of work via the Dashboard (Model B).\n\n\n\n**3\\. On\\-Chain Volume \\(The \"North Star\"\\):**\n\n\n\n- 300+ Transactions Facilitated: (Bounties, Salary Claims, Treasury Swaps) generated by the Pilot Cohort.\n- 10+ Verified Financial Reports published to Reeve.\n\n\n\n**4\\. Developer Adoption:**\n\n\n\n- 2 External Protocols integrated via the Open Action SDK.\n\n\n\n**Conclusion: Leading the Agentic Future of Cardano**\n\n\n\nThe impact of this proposal extends far beyond the 10-month timeline. We are laying the rails for the Agentic Era of Cardano.\n\n\n\nToday, users struggle to use dApps. Tomorrow, with this infrastructure, users will simply state their intent—\"Hire a designer,\" \"Swap for ADA,\" \"Vote for privacy\"—and the A0x Agentic Network will orchestrate the complex Cardano infrastructure to make it happen.\n\n\n\n**This is how we bridge the chasm\\. This is how we onboard the next million users\\. This is how we turn a powerful blockchain into a bustling, automated economy on Cardano\\.**","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**A Strategic Alliance: World\\-Class Tech Meets Battle\\-Tested Operations\\. **This project is not a speculative venture by a new team. It is the operational convergence of two powerhouse entities in the Web3 ecosystem: A0x (The Tech Partner) and Cooperativa Local (The Implementation Partner).\n\n\n\nOur capability to deliver is guaranteed by a simple fact: We have already built the pieces separately. A0x has already deployed this agent infrastructure on Base (Coinbase, EVM, L2). Cooperativa Local has already executed the manual pilot on Cardano via Project Catalyst Fund 11. This proposal is simply the integration of two proven realities to solve the \"Adoption Chasm.\"\n\n\n\n**1\\. The Team: A \"Dream Team\" for Agentic Adoption on Cardano**\n\n\n\nWe have assembled a multidisciplinary team that covers every layer of the stack: from the LLM architecture to the end-user adoption in the streets of Latin America.\n\n\n\n**A\\. The Implementation Lead: Cooperativa Local**\n\n\n\nGonzalo Camps (Project Lead): An expert in established organizations blockchain implementation and innovation orchestration.Director of 2024 DAO Incubation Program (Fund 11): Gonzalo led the successful onboarding of 8 diverse organizations to the Cardano ecosystem. He designed the curriculum that guided them from \"Zero to DAO\" using Clarity and Reeve, achieving a 97% satisfaction score.\n\n\n\n- Director of 2025 IME Link DAO Festival: He orchestrated the first decentralized electronic music festival in LATAM. This massive pilot involved 60+ artists and producers, generating over 1,000 on-chain actions (voting, payments, treasury management) on the Clarity Protocol.\n\n\n\n- Co-Founder of ChileDAO: A recognized leader in the LATAM community, ensuring we have deep roots and accountability within the ecosystem.\n\n\n\n**B\\. The Tech Partner: A0x \\(Coinbase\\-Backed\\)**\n\n\n\nWe are not building AI from scratch. We are partnering with A0x, a team whose \"Clone\" technology has already secured investment from Coinbase Ventures’ Base Ecosystem Fund.\n\n\n\n- Daniel Beltrán (Founder): The strategic architect behind the A0x framework. He leads the vision of democratizing access to \"On-Chain Minds\" and has successfully navigated the project to VC backing.\n\n\n\n- Matías Palomo (Software Engineer): Specialist in modern web technologies and User Experience (UX). He is responsible for the \"Collaborator Dashboard\" and the \"dApp Widget\" that allow users to interact with the agents.\n\n\n\n- Claudio Condor (AI Engineer): Expert in scalable backend architectures. He leads the XMTP/Farcaster integrations and ensures the secure \"Atomization\" of data within the RAG pipeline.\n\n\n\n**2\\. Technical Feasibility: Why We Will Not Fail**\n\n\n\nSoftware projects often fail due to \"R&D Risk\" (trying to invent something new). We have eliminated this risk by adopting a \"Port & Integrate\" Strategy. We are not inventing the engine; we are putting it into a new car (Cardano).\n\n\n\n**A\\. The Engine Exists \\(The A0x Architecture\\)**\n\n\n\nThe A0x framework is live today. It is serving thousands of users on the Base ecosystem with clones like \"Jesse Pollak\" (Base Founder). We rely on a proven technical stack:\n\n\n\nIngestion & Atomization: We utilize A0x's existing pipeline to ingest unstructured data (Tweets, Docs, PDFs). Uniquely, the system \"atomizes\" this data into Core Identity (Tone), Dynamic Context (News), and Static Knowledge (Docs). This ensures the Agent sounds like a human but cites facts like a database.\n\n\n\nRAG System (Retrieval-Augmented Generation): We use Pinecone vector databases to fetch real-time Cardano documentation. This prevents \"Hallucinations.\" If the Agent doesn't find a citation in the vector DB (e.g., a specific Governance parameter), it is programmed to say \"I don't know\" rather than inventing a fact.\n\n\n\n**B\\. The Integration is Low\\-Risk \\(Read\\-First Approach\\)**\n\n\n\nWe are not building \"Black Box\" smart contracts. We are orchestrating existing, audited protocols via their APIs.\n\n\n\nClarity & Reeve API Integration: We use these APIs primarily to Fetch Information.Scenario: The Agent queries the Clarity API to get the list of \"Open Bounties.\" It then displays this list in the Collaborator Dashboard.\n\n\n\nBenefit: This creates a seamless user experience where the Agent \"knows\" the state of the DAO without needing to index the blockchain directly.\n\n\n\nWallet Connect Standards: For \"Write\" actions (submitting transactions), we use industry-standard libraries (MeshJS). The Agent prepares the CBOR (transaction data), but the user always signs it in their own wallet (Lace/Eternl) via the Dashboard.\n\n\n\nOpen Action SDK (Infrastructure Release): In Month 9, we release the SDK that allows third parties to register their own API endpoints.Expectation Management: We do not expect external dApps (like Minswap/JPEG Store) to fully integrate this SDK within the 10-month timeline.\n\n\n\nValidation: We will use Clarity and Reeve internal integrations as the \"Alpha\" test cases to prove the SDK works, paving the way for future external adoption.\n\n\n\n**3\\. Operational Feasibility: Validating with \"Captive\" Audiences**\n\n\n\nThe second most common failure point is \"Adoption Risk\" (building a tool nobody uses). We have mitigated this by securing our users before we write a line of code.\n\n\n\n**A\\. The Pilot Cohort \\(Ready on Day 1\\)**\n\n\n\nWe are engaging with the active networks of Cooperativa Local (incubated in Fund 11) to migrate to this new system. These organizations are the most feasible candidates to participate in the pilot, representing a deep pool of real treasuries waiting for this automation.\n\n\n\n- IME (200+ Members): A trade association.\n- TRAMUS (400+ Members): A union of workers.\n- METRO21 (100+ Collaborators): An agency.\n- RONDA (30+ Members): A distribution cooperative.\n\n\n\nCommitment to Volume: While the specific mix of participating organizations may adjust based on their internal timelines, our Milestone Outputs (regarding transaction volume, active users, and verified reports) remain our fixed commitment. We have a sufficient surplus of incubated partners to ensure these targets are met regardless of individual organizational churn.\n\n\n\n**B\\. The \"Traffic\\-Light\" Validation Framework**\n\n\n\nWe employ a strict Agile methodology to ensure quality control throughout the 10 months:\n\n\n\nGreen Light (Proceed): If the Agent answers >90% of \"Model A\" queries accurately (verified by human review in the A0x dashboard).\n\n\n\nYellow Light (Refine): If the Agent hallucinates governance rules, we pause deployment and reinforce the RAG citations before releasing \"Model B.\"\n\n\n\nRed Light (Stop): If users cannot connect their wallets via the \"Collaborator Dashboard,\" we halt Model C development to fix the UI. We prioritize Stability over Speed.\n\n\n\n\n\n**4\\. Financial Accountability & Transparency**\n\n\n\nWe apply the same standards to ourselves that we preach to our users. We believe that a Catalyst proposal should be a model of the technology it promotes.\n\n\n\nMilestone-Based Funding: We adhere strictly to the Catalyst milestone system. We will not request the next tranche of funding until the previous deliverable (e.g., \"5 Agents Live\") is verifiable on-chain.\n\n\n\n\"Be what you preach\": In a meta-demonstration of our product, we will use our own Model B Agent to report our project expenses. We will publish our own financial statements on-chain via Reeve, allowing the community to audit exactly how the Catalyst funds are being spent.\n\n\n\nOpen Source Commitment: While the A0x core engine is proprietary, all Cardano-Specific Integrations (The Open Action SDK, The dApp Widget, The Wallet Connect Module) will be published on GitHub under an MIT License. This ensures the ecosystem retains the infrastructure value even if our team disappears.\n\n\n\n\n\n**5\\. Trust: Why the Community Should Bet on Us**\n\n\n\nTrust is built on consistency. We are the team that stayed.\n\n\n\nResilience: When the bear market hit, Cooperativa Local continued educating organizations. When our Fund 13 proposal was unfunded, we bootstrapped the IME Festival anyway, proving we care about the mission, not just the grant.\n\n\n\nSkin in the Game: Gonzalo has spent years building the Web3 and DAO ecosystem. Daniel and the A0x team have VC backing and a reputation to protect in the broader crypto ecosystem. We cannot afford to deliver a substandard product.\n\n\n\nExecution Focus: We are not asking for funds to \"explore\" or \"research\" an idea. We are asking for funds to execute a validated plan with a world-class team. We have the code, we have the users, and we have the will to turn Cardano into the Agentic Blockchain.\n\n\n\n\n\n**6\\. Risk Management Strategy**\n\n\n\nWe have identified the core risks and prepared mitigation strategies:\n\n\n\nRisk: API Changes. If Clarity or Reeve update their APIs, the Agents could break.Mitigation: We have direct communication channels with the Clarity and Reeve dev teams (due to our extensive prior work with them). We will implement \"Versioned Actions\" in the SDK to ensure backward compatibility.\n\n\n\nRisk: LLM Hallucinations. The Agent might give wrong financial advice.Mitigation: The \"Human-in-the-Loop\" dashboard allows Admins to review Agent outputs. Furthermore, for critical actions (Transactions), the Agent never signs; it only proposes. The human Admin is the ultimate failsafe signature.\n\n\n\nThis operational excellence, combined with A0x's technical prowess, creates the highest possible probability of success for Fund 15.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Model A Launch: Ecosystem Knowledge Layer","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. The A0x RAG (Retrieval-Augmented Generation) engine is successfully connected to Cardano documentation, CIPs, and partner APIs.\n2. Model A is Live: The 2 Builder Clones (High-Profile Educators) and 3 Protocol Agents (GovTools, Intersect, Catalyst) are deployed and publicly accessible via Web and Telegram.\n3. Initial data ingestion from Clarity and Reeve documentation is complete to train the underlying Operational model.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. The 5 Agents can successfully process natural language queries regarding Cardano governance and technical stacks, providing accurate, cited answers without hallucinations.\n2. Public users can interact with the Agents via the provided Telegram links or Web Portal.\n3. The system architecture is documented, showing the connection between the A0x engine and the Cardano knowledge base.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Video Demonstration: A short video showing real-time interaction with the Builder Clones and Protocol Agents answering complex questions.\n2. Public Links: Direct links to the 5 live Agents for community testing.\n3. Technical Report: A PDF summarizing the RAG architecture and data sources ingested.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":38560,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Model B Launch: Operational Co-Pilot & Interfaces","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Model B is Live: The Operational Agent is functional, capable of guiding users through the 6-Module Framework (Assessment to Execution).\n2. The Collaborator Dashboard (React) is deployed, allowing workers to view tasks fetched from the Clarity API and connect their Cardano wallets.\n3. The Admin Interface (Telegram/Web) is fully functional for strategic commands.\n4. Pilot Migration: 3 partner networks are onboarded to the new Agentic system.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. An Admin can start a conversation, and the Agent successfully guides them through the \"Module 1 Assessment\" and \"Module 2 Onboarding\" scripts.\n2. A Collaborator can log in to the Dashboard, view active Bounties fetched from the API, and connect a wallet.\n3. The Admin Interface successfully sends commands to the backend that trigger the creation of tasks/proposals.\n4. Database logs confirm that the 3 specific pilot organizations have been created and populated with initial members.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Video Walkthrough (Agent): Video showing the Agent guiding a user through the 6-Module Framework.\n2. Video Walkthrough (Dashboard): Video showing a user connecting a wallet and viewing tasks on the React Dashboard.\n3. GitHub Repository: Link to the frontend code for the Collaborator Dashboard.\n4. Pilot Onboarding Report: Anonymized logs showing the successful registration of the pilot cohort members.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":57840,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Launch Models C & D: Infrastructure Expansion & Full Validation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Model C (Widget) Released: The JavaScript SDK for the dApp Support Chatbox is packaged and deployed to a demo site.\n2. Model D (Wallet Connect) Live: The \"Active Signing\" feature is enabled, allowing the Agent to trigger a signature request to the user's wallet.\n3. Open Action SDK Released: Documentation for third-party developers to register their own Agent Actions.\n4. Validation Report: Publication of the \"Traffic Light\" validation results and on-chain metrics from the Pilot Cohort.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. The dApp Widget is functional on an external web page, answering context-aware support questions.\n2. A user can trigger a transaction via the dashboard, and the Agent successfully prompts the Cardano wallet extension to sign.\n3. The Open Action SDK documentation is accessible and contains clear JSON examples for registering new actions.\n4. The Validation Report includes the \"Traffic Light\" status and specific on-chain volume data (transactions/votes) generated by the pilot.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Live Demo Link: URL to the site hosting the Model C Widget.\n2. Transaction Video: A video proving the Agent-to-Wallet signature flow (Model D).\n3. SDK Documentation: Public link to the Open Action SDK for developers.\n4. Impact Report: A detailed PDF report analyzing the on-chain volume and user engagement metrics from the Pilot Cohort.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":57840,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Close-Out","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A comprehensive Project Close-Out Report is written and published, following the Fund guidelines.\n2. A professional Project Close-Out Video is produced and published, following the Fund guidelines.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. The Close-Out Report is comprehensive, publicly accessible, and transparently details the project's outcomes against its original goals.\n2. The Close-Out Video effectively communicates the project's value and success stories to the Cardano community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. A public link to the published Project Close-Out Report.\n2. A public link to the published Project Close-Out Video.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":38560,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"This project is executed by a joint task force: Local DAO Agents (Implementation and Adoption) and A0x AI (Technology and AI Infrastructure).\n\n\n\n**1\\. Implementation and Adoption Lead \\(Local DAO Agents\\)**\n\n\n\n- **Gonzalo Camps – Project Manager and Methodology Architect**\n\nExpert in DAO implementation and community orchestration in LATAM.\n\nDirector, DAO Incubation Program 2024 (Fund 11): Successfully incubated 8 organizations, achieving a 97% satisfaction score.\n\nDirector, IME Link DAO Festival 2025: Orchestrated the first decentralized festival in LATAM, generating 1,000+ on-chain actions.\n\nCo-Founder, ChileDAO: Regional leader in Web3 governance. Speaker in Cardano Summit 2025 (Buenos Aires)\n\n\n\n**Gonzalo's Role in Project:**\n\n- Methodology: Designs the 6-Module Operational Framework; (Assessment, Execution) that the AI will be trained to teach.\n- Pilot Management: Leads the migration of the pilot cohort to the new product.\n- Partnerships: Manages the technical liaison with Clarity and Reeve teams to ensure API compliance.\n\n[https://www\\.linkedin\\.com/in/gonzalocamps/](https://www.linkedin.com/in/gonzalocamps/)\n\n\n\n\n\n**2\\. Technology and AI Infrastructure \\(The A0x Team\\)**\n\n\n\n- **Daniel Beltrán – A0x CEO, Founder \\(Business and Strategic Architect\\)**\n\nFounder of A0x, the AI Agent framework backed by Coinbase Ventures’ Base Ecosystem Fund.\n\n\n\n**Daniel's Role in Project:**\n\n- Growth Officer and DeFi Business Model Strategist\n- Architecture: Oversees the porting of the A0x engine to Cardano ecosystem.\n- Quality Control: Ensures theBuilder Clones (Model A) meet the high fidelity standards verified on Base.\n\n[https://www\\.linkedin\\.com/in/danielbeltranv/](https://www.linkedin.com/in/danielbeltranv/)\n\n[https://x\\.com/bvdani\\_el](https://x.com/bvdani_el)\n\n\n\n\n\n- **Claudio Condor – AI Engineer \\(Backend and RAG\\)**\n\nExpert in scalable backend architectures and AI pipelines. Lead engineer for integrations.\n\n\n\n**Claudio's Role in Project:**\n\n- RAG Pipeline: Builds the ingestion engine for Cardano documentation to prevent hallucinations.\n- Data Atomization: Manages the system that keeps agents synced with real-time ecosystem updates.\n- Security: Implements the secure backend logic for the wallet connection requests.\n\n[https://www\\.linkedin\\.com/in/oydual3/](https://www.linkedin.com/in/oydual3/)\n\n[https://github\\.com/claucondor](https://github.com/claucondor)\n\n\n\n\n\n- **Matías Palomo – Software Engineer \\(Frontend and Interfaces\\)**\n\nSpecialist in modern web technologies and blockchain-integrated interfaces.\n\n\n\n**Matías' Role in Project:**\n\n- Collaborator Dashboard: Leads the React development of the Model B interface for workers.\n- SDK: Builds the embeddable JavaScript chatbox for Model C (Widget). Manages the Open Action SDK; roadmap for long-term developer adoption.\n- UX/UI: Designs the seamless flow between the Chat Interface and the Wallet Connection.\n\n[https://www\\.linkedin\\.com/in/matias\\-palomo/](https://www.linkedin.com/in/matias-palomo/)\n\n[https://github\\.com/Matiaspp96](https://github.com/Matiaspp96)\n\n\n\n\n\n- **Position: Cardano Full Stack Developer \\(To Be Hired / Budget Allocated\\)**\n\n\n\n**Rationale:** Our 2 trusted Cardano developers from previous successful funds are currently committed to the maximum of 2 projects allowed under the new Fund 15 Eligibility Rules. To ensure full compliance and dedicated bandwidth, we are hiring a new specialist dedicated 100% to this project.\n\n\n\n**Profile Required:** 3+ years in Plutus/MeshJS, experience with eUTxO transaction building, and React proficiency. We have a deep network to fill this role immediately upon funding.\n\n\n\n**Role in Project:**\n\n- Wallet Connect: Implementing the Wallet transaction signatures from the Agent.\n- API Connectors: Writing the middleware that fetches state from the Clarity API and Reeve API to populate the dashboard.\n- Transaction Building: Constructing the CBOR payloads for Bounties and Payments.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**The total budget requested for this 10\\-month project is 192,800 ADA \\($64,067 USD\\)\\.**\n\n\n\n\n\nThis budget is allocated across three core areas: Personnel (Hybrid Team), Strategic Partners (Pilot Cohort), and Operational Costs.\n\n\n\n\n\n**1\\. Personnel Costs \\(Total: $55,760 / 167,800 ADA\\)**\n\n\n\nThis covers the compensation for the core team. To ensure fairness and resource optimization, all core team members operate on the same monthly rate ($1,360/mo). Total compensation is defined by the duration of their active phase in the project.\n\n\n\n\n\n- **Project Lead & Methodology Architect: Gonzalo Camps**\n\n\n\n$13,600 (10 months).\n\n\n\n**Responsibilities**: Overall project management, Pilot Cohort migration, and \"6-Module Framework\" design, long term ecosystem roadmap.\n\n\n\n\n\n- **A0x Founder & Strategic Architect: Daniel Beltrán**\n\n\n\n$13,600 (10 months).\n\n\n\n**Responsibilities: **A0x Engine porting strategy, Quality Control of \"Builder Clones,\" and long-term DeFi roadmap.\n\n\n\n\n\n- **AI Engineer \\(Backend & RAG\\): Claudio Condor**\n\n\n\n$9,520 (7 months).\n\n\n\nResponsibilities: RAG pipeline ingestion, Data Atomization, and secure backend architecture. Focused on Phase 2 & 3.\n\n\n\n\n\n- **Cardano Full Stack Developer: To Be Hired**\n\n\n\n$9,520 (7 months).\n\n\n\n**Responsibilities:** Wallet Connect implementation, Transaction Building (MeshJS), and API middleware. Hiring starts in Month 3.\n\n\n\n\n\n- **Software Engineer \\(Frontend & Interfaces\\): Matías Palomo**\n\n\n\n$9,520 (7 months).\n\n\n\n**Responsibilities: **React development of the Collaborator Dashboard and the dApp Widget SDK. Focused on Phase 2 & 3.\n\n\n\n\n\n\n\n**2\\. External Services and Partner Engagement \\(Total: $3,000 / 9,028 ADA\\)**\n\n\n\nThis category is dedicated to funding the direct collaborations essential for MVP validation.\n\n\n\n**Partner Operational Stipends: $3,000**\n\n\n\nA stipend of $1,000 USD for each of the 3 pilot networks. This serves as strategic activation capital to guarantee deep engagement, data entry, and feedback required to refine the Agentic Models and Modules.\n\n\n\n\n\n\n\n**3\\. Operational and Tooling Costs \\(Total: $5,307 / 15,972 ADA\\)**\n\n\n\nThis covers essential software, infrastructure, and buffers.\n\n\n\n**Software Subscriptions & APIs: $1,500**\n\n\n\nCovers API access for Large Language Models (LLM inference), project management tools, and design software.\n\n\n\n**Infrastructure & Hosting \\(Reeve/A0x\\): $1,814**\n\n\n\nCovers server costs, vector database hosting (Pinecone), and the direct costs for running our managed Reeve reporting instances.\n\n\n\n**Contingency: $1,993**\n\n\n\nA responsible buffer of ~3% of the total budget to hedge against unforeseen costs or extreme ADA volatility beyond our conservative estimate.\n\n\n\n\n\n\n\n**Total Budget Request**\n\n\n\n**Total in USD: $64,067 = Total in ADA: 192,800 ADA**\n\n\n\n**Exchange Rate Strategy:** We utilize a conversion rate of $0.3323 USD/ADA. This figure reflects the 1-year minimum price observed during the Fund 15 launch week (November 6, 2024). We selected this conservative rate due to the clear 200-day downtrend trendline estimation, ensuring the project remains fully funded and operational even if market conditions remain bearish throughout the delivery phase.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"**This proposal represents an exceptional value proposition for the Cardano Treasury because it leverages a strategy of \"Integration over Invention\\.\"**\n\n\n\nMost AI proposals in Project Catalyst ask for funds to build new Large Language Model (LLM) architectures or training engines from scratch—a high-risk, capital-intensive endeavor that often costs millions and results in undelivered products due to the sheer difficulty of competing with Web2 giants.\n\n\n\nIn contrast, we are asking for 192,800 ADA ($64,067 USD) to port an existing, battle-tested infrastructure.\n\n\n\nA0x has already secured significant support from Coinbase Ventures’ Base Ecosystem Fund to build the core \"AI Clone\" engine, the RAG pipelines, and the vector database architecture. By funding this proposal, the Cardano ecosystem effectively \"inherits\" the value of that massive R&D spend. You are paying only for the \"Last Mile\" integration, acquiring millions of dollars worth of backend technology for the price of a standard integration grant.\n\n\n\n\n\n**1\\. The Scalability Multiplier: Exponential ROI**\n\n\n\nThe primary value driver of this project is the shift from Linear to Exponential scaling for ecosystem onboarding.\n\n\n\n**The Status Quo \\(Linear Cost\\)**: In our Fund 11 \"Local Agents\" pilot, it cost us approximately $2,000 USD in human hours to manually onboard, educate, and mentor three organizations through the full governance and treasury setup process over 3 months.\n\n\n\n**Cost to onboard 1,000 Organizations**: $666,000 USD. (Financially Unfeasible).\n\n\n\n**The Solution \\(Exponential Value\\): **Once the Model B (Operational Co-Pilot) is built, the marginal cost to onboard the next organization drops to the cost of API tokens (pennies).\n\n\n\n**Cost to onboard 1,000 Organizations**: ~$64,000 USD (This Grant).\n\n\n\n**ROI**: This represents a 10,4x efficiency increase in the first year alone. As the network grows to 10,000 or 100,000 users, the cost-per-user approaches zero, providing major scalability for the Cardano ecosystem.\n\n\n\n\n\n**2\\. The \"Support Offset\" Dividend**\n\n\n\nEvery active Cardano dApp currently faces a hidden cost: Human Support. Founders and developers spend countless hours in Discord and Telegram answering repetitive questions (\"How do I vote?\", \"Why did my transaction fail?\").\n\n\n\n**The Calculation**: If our Model C (Widget) and Model A (Protocol Agents) save just 10 hours of support time per week across the ecosystem, valued at a conservative $50/hour, that creates $26,000 USD/year in saved productivity.\n\n\n\n**The Impact**: This frees up our best builders to write code instead of answering support tickets, accelerating the overall development velocity of the ecosystem.\n\n\n\n\n\n\n\n**3\\. 4,6% CAC User Acquisition \\(Captive Audience\\)**\n\n\n\nMost dApp projects spend 30-50% of their budget on Marketing (Customer Acquisition Cost or CAC) to find their first users.\n\n\n\n**Our Advantage**: We have 4,6% CAC. We are bringing a captive audience of hundreds verified users from our existing 2024 Incubator Partners (IME, TRAMUS, METRO21, RONDA).\n\n\n\n**The Value**: The Treasury is not paying us to \"find\" users; the users are already waiting. Every dollar goes directly into Product Development, not Google Ads or Influencer Marketing. This guarantees immediate on-chain activity upon launch.\n\n\n\n\n\n**4\\. Generating \"Economic Velocity\" for SPOs**\n\n\n\nUnlike projects that focus on \"holding\" tokens, our project is designed to increase Transaction Velocity.\n\n\n\n**Operational Volume**: Our \"Local DAO Agents\" methodology focuses on salaries, bounties, and supply chain payments. These are transactions that must happen every month.\n\n\n\n**The Value**: Every transaction generates fees for Stake Pool Operators (SPOs) and load for the network. By converting dormant organizations into active on-chain operations (through Clarity DAO features) that process monthly payroll on-chain, we create a sustainable stream of network fees that supports the long-term security of Cardano.\n\n\n\n\n\n\n\n**5\\. Protecting the Treasury: Conservative Financial Engineering**\n\n\n\nWe have structured the budget to eliminate the most common cause of Catalyst project failure: Volatility Insolvency.\n\n\n\n**The Strategy**: We calculated our budget using the rate of $0.3323 USD/ADA.\n\n\n\n**The Rationale**: This specific figure represents the 1-year minimum price observed during the Fund 15 launch week (November 6, 2024). We selected this conservative floor due to the clear 200-day downtrend trendline estimation observed in the market.\n\n\n\n**Why this is Value for Money**: Many projects budget at the \"market top,\" run out of funds when the price corrects, and abandon the project, wasting 100% of the Treasury's investment. Our conservative peg ensures that we will deliver regardless of market conditions. If the price rises, the surplus extends our runway; if it falls to the yearly low, we remain fully operational.\n\n\n\n\n\n\n\n**6\\. Open Source Assets: Permanent Ecosystem Value**\n\n\n\nWhile the core A0x engine remains proprietary (protecting the IP), the Cardano-Specific Infrastructure we build will be released as Open Source (MIT License). The ecosystem acquires permanent assets:\n\n\n\n**The Wallet Connect Module:** A reusable library for connecting AI Agents to Cardano wallets.\n\n\n\n**The dApp Widget SDK**: A JavaScript chatbox that any DEX or Lending Protocol can plug into their site.\n\n\n\n**The Open Action SDK**: Documentation allowing any developer to make their dApp \"Agent-Ready.\"\n\n\n\nThese assets allow future builders to create their own agents without asking Catalyst for funding to rebuild the wheel.\n\n\n\n\n\n\n\n**7\\. \"Dog Fooding\" Accountability**\n\n\n\nWe are the only project that proves its value using its own tool to manage the grant itself.\n\n\n\nWe will use our Model B (The Organizational Agent Co-Pilot) to report our own project expenses on-chain via Reeve.\n\n\n\n**The Value**: This provides the community with a transparent, immutable record of how every ADA is managed. It sets a new standard for accountability in the Catalyst program, proving that if the tool is good enough for the developers, it is good enough for the community.\n\n\n\n\n\n**Summary:**\n\n\n\n**For 192,800 ADA, the ecosystem receives a fully operational AI Agentic Network, a validated Onboarding Pipeline for real\\-world organizations, and a suite of Open Source Tools for developers\\. This is high\\-impact infrastructure at a low\\-risk price point, executed by a team that has already proven it can deliver\\.**","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Business Services","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1752}