{"pr_id":"019aba1b-be0c-7601-a1f8-ba4f87766298","title":"CAOV: Hydra DeFi Cardano Automated Options Vaults ","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Much ADA is underutilized with low staking returns, limiting capital efficiency. Layer-1 remains slow, so DeFi projects on it struggle so Cardano needs a structured product layer to boost yields.","solution":"Build Cardano’s first Automated Options Vaults use a covered-call strategy. Users deposit ADA, bot sells weekly options, generating profits. Hydra integration solves Layer-1 slowness for fast.","proposer_name":"Tuan Ngo","proposer_relevant_experience":"**Tuan Ngo**\n\nExperience:\n\n- Deputy Head of Engineering at Blockchain Pioneer Student Club\n- Experienced in leading and managing projects, organizations and clubs.\n- 2 years developing dApps on Cardano, specializing in writing smart contracts using Aiken.\n- More than 2 years of experience in fullstack programming and directly building and operating solutions on the Cardano blockchain.\n- Second prize at the CARDANO HACKATHON BLOCKCHAIN ​​2025 competitions\n- Third prize at the CARDANO HACKATHON BLOCKCHAIN ​​2024 competitions\n- Over 1 year of market research for DeFi projects on Cardano, solid understanding of non-tech concepts like AMM, LP, LPs, Staking, Yield Farming, etc.\n- Contributed to the ecosystem as a Level 0 _Community Reviewer_ (Funds 14)\n\nContact:\n\n- Email: vantuan132005@gmail.com\n- LinkedIn: [https://www\\.linkedin\\.com/in/tuanngo205\\-dev/](https://www.linkedin.com/in/tuanngo205-dev/)\n- Github: [https://github\\.com/vantuann205](https://github.com/vantuann205)\n\n**Dong Duc Manh**\n\nExperience:\n\n- More than a year of building and operating on the Cardano Blockchain platform.\n- Over a year of experience as a back-end developer, proficient in back-end (Python/Java, C#), handling everything from design to deployment.\n- Experience building Python SDKs with a focus on clean architecture, optimal performance, and extensive documentation.\n\nContact:\n\n- Email: manhducdongyb@gmail.com\n- LinkedIn: [https://www\\.linkedin\\.com/in/manhducdong\\-b2366b330/](https://www.linkedin.com/in/manhducdong-b2366b330/)\n- Github: [https://github\\.com/Manhddm](https://github.com/Manhddm)\n\n**Hong Nhung Tran**\n\nExperience:\n\n- Vice President of Logistics Club - University of Transport\n- Head of Logistics at Blockchain Pioneer Student Club\n- Top 5 Best Student Teams of Viet Nam Aptos Hackathon 2025\n- First Prize of Scientific Research Competition – Faculty of Transport Economics, University of Transport (2024–2025)\n- Main Pitching for National Innovative Startup Projects\n- MC for academic events, seminars and competitions\n- Communications Manager for YLI forum: Youth led Innovation, competition: Youth debate Logistics 2024\n- Team leader in academic projects, event planning and communications strategy\n- Fresher Data Analyst – YRC FTU\n- Research direction: Finance, economics and communication in blockchain technology\n\nContact:\n\n- Email: tranhnhung2912@gmail.com\n- LinkedIn: [https://www\\.linkedin\\.com/in/hong\\-nhung\\-tran\\-084504304/](https://www.linkedin.com/in/hong-nhung-tran-084504304/)","url":null,"funds":120000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"CAOV: Hydra DeFi Cardano Automated Options Vaults ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Tuan Ngo","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":120000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Much ADA is underutilized with low staking returns, limiting capital efficiency. Layer-1 remains slow, so DeFi projects on it struggle so Cardano needs a structured product layer to boost yields.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Build Cardano’s first Automated Options Vaults use a covered-call strategy. Users deposit ADA, bot sells weekly options, generating profits. Hydra integration solves Layer-1 slowness for fast.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://docs.google.com/document/d/1htXOqIcvnuPC3nQWUCY-5aWUFYfqHQzJHgML0puzq-4/edit?tab=t.0","https://caov-v1.vercel.app/explore","https://www.figma.com/design/6PN152UZtdPi313PN5jbZi/UI-UX-CAOV?node-id=0-1&p=f&t=FqaYW3HhVnS7fRTn-0","https://drive.google.com/drive/folders/1lGdzFYxeStKSzukIhPzyl-iozC4bgvBQ?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"As mentioned, our solution requires an automated vault layer, which needs an underlying options market that Cardano currently lacks. Instead of relying on third parties, we build the core financial layers ourselves: First, the Option Engine: a system to create option tokens (CIP-68 standard). Second, the Auction Module: a system to verify conditions for on-chain execution after the Hydra Head closes. Finally, the Vault contract: the main contract holding users’ ADA and managing minting or redeeming rvADA. Premium profits are sent here. Thus, the project operates independently from the start. The only dependencies are the Pyth Oracle for real-time ADA/USD pricing and the Hydra infrastructure to speed up deposits and auctions this is the project’s core.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"To build absolute trust in the DeFi space and enable other developers to build on our platform, all project smart contracts, including the Option Engine and Vault Contract, will be fully open-source under the MIT license after testing is complete. The user interface and Execution Bots will also be open-source.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"DeFi","group":"DeFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Currently, Cardano lacks advanced structured investment products for ADA holders. Users mainly have two options: low-yield, stable staking or higher-yield liquidity provision, which often carries high risk and temporary losses. CAOV (Cardano Automated Options Vaults) introduces fully automated Covered Call Vaults on Cardano, combining on-chain smart contracts with off-chain automated services. Unlike previous projects, CAOV enables a repeatable, low-risk yield strategy directly from holding ADA, with rvADA tokens representing vault shares. The key is integrating Hydra Head for deposits and auction settlements, allowing CAOV to execute transactions quickly, transparently, and at scale something previous projects never offered.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our MVP (expected by Milestone 4) will be a fully functional web dApp on the Cardano testnet. Users will be able to:\n\n- Deposit ADA into Vault T-ADA-C via Hydra and receive rvADA representing their vault shares.\n- Monitor weekly covered call minting and automatically collect premium fees.\n- Track ADA call option auctions through Hydra, executed quickly and transparently.\n- View a dashboard showing vault performance, including TVL, APR, and premium fee profits.\n\n\n\nAccess the dApp publicly via a testnet url to interact directly with the vault and simulate real trading cycles","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Project success metrics are defined by the following specific goals:\n\n- Complete and publish the open-source Option Engine (smart contract + backend + frontend) on Github\n- Attract at least 200 real user wallets via integration with popular wallets like Eternl, Yoroi, Lace, etc after mainnet launch 6 months.\n- Ensure product quality through comprehensive testing, minimizing errors that affect user experience and operations\n- Achieve ≥ 250 deposit transactions per month \n- Achieve ≥ 150 withdrawal transactions per month\n- Ensure off-chain performance, with Hydra transaction processing times between 1 - 2 seconds per transaction","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**Problem:**\n\nCurrently, Cardano’s DeFi infrastructure is fairly mature, with notable DEXs (Minswap, Muesliswap, WingRiders, SundaeSwap, Spectrum Network, etc.) along with some lending/borrowing protocols and basic products. However, the ecosystem still severely lacks more complex structured financial products a key pillar in well-developed DeFi chains like Ethereum, Solana, or Arbitrum.\n\nCurrently, ADA holders have only two main options to generate returns:\n\n- Staking: safe and stable, but actual yields are around 2–4% APR (further reduced when inflation rises in many countries).\n- Liquidity Provider (LP): may achieve higher yields, but comes with high risk, especially impermanent loss and other complex risks.\n\nThe lack of safe, passive yield optimization tools means billions of ADA are idle in staking wallets. This reduces overall capital efficiency in the Cardano ecosystem and forces users to seek yields on other chains.\n\n**Solution:**\n\nOur solution is to build CAOV – Cardano Automated Options Vaults, a decentralized and open-source protocol providing structured investment products that help users generate passive, sustainable yields from their ADA assets.\n\nOur goal is to propose a testnet prototype for the first core strategy: T-ADA-C (Thetys ADA Covered Call)\n\n- Covered call strategy: a neutral, low-risk strategy where the vault holds ADA and sells weekly out-of-the-money (OTM) call options.\n- Generates yield: premiums earned from selling these options are the yield. The yield accumulates in the vault, increasing the value of users’ ADA holdings.\n- Users simply deposit ADA into the Vault Contract. They receive rvADA (Receipt Vault Token), a token (CIP-68 standard) representing their share in the vault, rvADA value increases as more premiums are earned.\n\n**Protocol Architecture:**\n\nLayer 1: Core Contracts (On-chain L1 Validators – Aiken/Plutus)\n\nThis is the immutable financial primitives layer we build. It executes logic and holds assets.\n\n1.1 Option Engine (Option Minting System):\n\n- A validator script allowing minting of option tokens.\n- To comply with Cardano standards, these are structured as tokens (CIP-68), containing on-chain data (datum or metadata) about: strike price, expiry date, and asset type (e.g., ADA Call).\n\n1.2 Vault Contract (T-ADA-C):\n\n- The main smart contract holding users’ ADA.\n- It manages minting or redeeming rvADA (representative tokens). Profits (premium fees) are sent directly to this contract, increasing vault asset value.\n\n1.3 Auction Validator:\n\n- A dedicated on-chain validator script, receiving proof from Hydra Head closure.\n- Verifies the integrity of the highest bid finalized on Layer 2 and executes asset swaps (transfer option tokens to winner and ADA premium to Vault Contract) transparently on-chain.\n\nLayer 2: Operational Services (Off-chain)\n\nThis layer automates all processes to run the protocol 24/7.\n\n2.1 Execution Bot (Automated Execution Bot):\n\n- A high-reliability off-chain service running 24/7, tracking weekly cycles (e.g., Friday 9 AM)\n\nThe bot performs the following steps:\n\n- Read ADA price from Pyth Oracle\n- Decide strike price (e.g., 10% OTM)\n- Trigger Option Engine (Layer 1) to mint options\n- Open Hydra Head for Market Makers, commit L1 option tokens into the Head. When finished, close Head and send L1 transaction to Auction Validator for settlement\n- Trigger settlement at expiry\n- Manage deposit aggregation: temporarily open Hydra Head with user wallets to batch L2 deposits, then commit to Vault Contract on L1\n\n2.2 Hydra Head Manager\n\nResponsibilities:\n\n- Manage opening/closing commit of UTxOs (option tokens, ADA bidders) into Head\n- Manage auction Head, process off-chain highest-bid logic, store state updates, and compile final snapshot when session ends\n- Manage deposit Head and a dedicated Hydra Head for deposit aggregation\n\nLayer 3: Application (Frontend dApp)\n\nUser interface (React/NextJS) enabling community interaction with Layer 1 contracts.\n\n3.1 User Interface (UI):\n\n- Allow users to deposit ADA into Vault Contract and redeem rvADA or  market maker to buy the option\n- Display dashboard showing TVL, historical APR, and vault activities\n\nDetails of system architecture are as follows:\n\n![](https://images.pexels.com/photos/34928422/pexels-photo-34928422.png)\n\n**Core Technical Flows:**\n\nTo understand how the prototype works, we separate 3 main technical flows (focused on T-ADA-C):\n\n**Flow 1: Cycle Start &amp; Option Minting**\n\n(Goal: Friday arrives, Execution Bot starts a new weekly cycle)\n\nDetection (Layer 2): Execution Bot detects the start of a new cycle (e.g., Friday 9 AM).\n\nOracle Read &amp; calculation (Layer 2): Bot queries:\n\nVault Contract (Layer 1) for total locked ADA (e.g., 5,000 ADA)\n\nPyth Oracle API for current ADA price (e.g., 0.40)\n\nDetermine (Layer 2): Bot calculates strike price for Covered Call (e.g., 10% OTM → 0.44) and expiry date (e.g., 7 days later).\n\nMint Options (Layer 1+2): Bot builds and sends an L1 transaction to Option Engine, minting 5,000 ADA Call option tokens (CIP-68) with parameters (0.44, 7-day expiry, …) in metadata.\n\nTokens are sent to a UTxO controlled by Execution Bot, ready for auction in Head.\n\n**Flow 2: Option Auction \\(Premium Flow\\)**\n\n(Goal: Bot sells 5,000 newly minted option tokens to Market Makers)\n\nOpen Head &amp; Commit (L2): Execution Bot opens Hydra Head for Market Makers and announces it. Bot commits UTxO containing 5,000 option tokens. Market Makers commit UTxOs with ADA bids.\n\nHigh-speed Auction (In Hydra Head – L2):\n\nMarket Makers send off-chain bid messages (e.g., MM C bids 2,500 ADA).\n\nHydra Head Manager handles off-chain logic, registering MM C as highest-bid.\n\nFinalize state (L2): At auction end, Hydra Head Manager creates and commits final snapshot containing proof of highest bid (2,500 ADA from MM C).\n\nOn-chain settlement (L2 → L1):\n\nExecution Bot triggers Hydra Head close.\n\nClose transaction sent to Auction Validator (L1).\n\nAuction Validator verifies inputs/outputs and executes on-chain settlement:\n\nTransfer 5,000 option tokens to MM C (winner)\n\nReturn ADA bonds to losing MMs\n\nTransfer 2,500 ADA premium to Vault Contract (L1)\n\nResult: 2,500 ADA of new yield is generated and added to total vault assets.\n\n**Flow 3: Deposit or Redeem &amp; Settlement**\n\n(Goal: Users interact and Vault settles at expiry)\n\nDeposit via Hydra Head (Layer 2)\n\nStart Hydra deposit Head: Execution Bot opens temporary Hydra Head and announces Head ID to dApp.\n\nL2 Deposit: User A connects to dApp and deposits 10,000 ADA.\n\ndApp guides User A to commit ADA into Hydra Deposit Head. Bot monitors committed ADA.\n\nAggregate &amp; close Head (Layer 2 → Layer 1): When threshold/time is met (e.g., 1 hour), Execution Bot closes Head. Bot builds a single L1 transaction from final Head state (e.g., total 100,000 ADA from 10 users) and submits to Vault Contract (Layer 1).\n\nMint rvADA (Layer 1): Vault Contract calculates current rvADA value (e.g., 1 rvADA = 1.01 ADA) and mints corresponding rvADA (~99,010 rvADA).\n\nDistribute rvADA (Layer 1): rvADA sent back to Execution Bot, which allocates precise shares to users (e.g., ~9,901 rvADA to User A) via L1/L2 transactions.\n\nSettlement (Layer 1+2): (at 7-day expiry)\n\nScenario A (OTM – profit): ADA price = 0.42 (below strike 0.44). Options expire worthless, all 2,500 ADA premium retained in vault. Most common scenario.\n\nScenario B (ITM – exercise): ADA price = 0.45 (above strike 0.44). Option exercised, Vault Contract pays difference to MM B. Vault keeps premium but loses some upside profit.\n\nRedeem (Layer 1+3): User A redeems 9,901 rvADA. Vault Contract burns rvADA and calculates corresponding ADA (original 10,000 ADA + share of 2,500 ADA premium, e.g., 10,020 ADA) and returns to user A wallet.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Our project aims to build a new core financial layer for the Cardano ecosystem: the first on-chain options market, designed to be independent and scalable. This will serve as a foundation for developing more advanced derivatives in the future, while providing an additional stable revenue channel for ADA holders.\n\nThe positive impacts we target are as follows:\n\n- A standardized options market will create a new yield-generating layer, giving the ecosystem more risk management and profit tools beyond staking.\n- If the Vault operates efficiently, it will attract capital from users seeking automated yield strategies, especially ADA holders wanting to optimize assets without frequent trading.\n- The product targets new users in Vietnam and internationally, while also providing opportunities for developers to contribute, audit, or build tools around the Option Engine.\n- Integrating Hydra for high-speed auctions and offloading L1 demonstrates Cardano’s scalability, offering a solution currently unmatched by projects like Ribbon Finance on Ethereum or other options markets.\n\nTo quantify these impacts clearly and transparently, we set the following metrics:\n\nOn-chain KPI (6 months post-mainnet launch):\n\n- User count: ≥ 200 unique wallets interacting.\n- Weekly options minted: ≥ 10,000 option tokens.\n- Off-chain transactions via Hydra: ≥ 150.\n- Deposit transactions per month: ≥ 250.\n- Withdraw transactions per month: ≥ 150.\n- Off-chain transaction processing: 1 – 2s per transaction.\n\nUser &amp; UX KPI:\n\n- User satisfaction (survey): ≥ 80%.\n- Dashboard visits: ≥ 500 per month within 6 months post-launch.\n\nSharing outputs:\n\n- Analytics dashboard: Public dashboard showing TVL, APR, number of interacting wallets, options minted, participating market makers, and vault activities in real-time.\n- Detailed technical documentation of the Option Engine will be published for other developers to build on our platform.\n- All source code (Layer 1 contracts, Layer 2 bots, Layer 3 dApp) will be fully open-source.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Feasibility**\n\n- Technical: The biggest challenge is that Cardano currently lacks an options market. We address this by building all core components, namely the Option Engine. This fully self-contained design is controlled, ensuring feasibility without relying on any third party.\n- Market: There is strong demand for sustainable yield products. The success of similar protocols on Ethereum (e.g., Ribbon Finance) demonstrates that the market is ready for such products, validating demand and growth potential on Cardano.\n\n**Capability &amp; Accountability**\n\nTeam capability: We are an experienced Cardano development team, skilled in Aiken, Hydra, and DeFi. We have deployed a CIP-68 NFT minting prototype, built custom validators, and developed dApps with complex off-chain backends for financial transactions. Team members have managed testnet funds, tested smart contracts, and operated automated bots.\n\nManagement &amp; transparency:\n\n- All ADA deposited in the Vault is managed by immutable smart contracts, with all deposits/withdrawals fully transparent on-chain.\n- We use multi-signature and off-chain control processes to prevent fund manipulation.\n- Bid logic in Hydra Head runs off-chain but only uses committed ADA, eliminating manipulation risk.\n- Final outcomes are settled atomically on-chain, ensuring funds are distributed solely based on actual auction results.\n\n**Additionally, we have some past achievements, including:**\n\n_Participated in the CARDANO BLOCKCHAIN HACKATHON 2025 and won second place\\._\n\n![](https://images.pexels.com/photos/34906267/pexels-photo-34906267.jpeg)\n\n**Along with that we also had some activities:**\n\n- Organize technical workshops on smart contract development and dApp building: [https://x\\.com/bps\\_club/status/1987537831779287085?s=20](https://x.com/bps_club/status/1987537831779287085?s=20)\n- Organize and teach blockchain courses to students and the community: [https://x\\.com/bps\\_club/status/1978880718853017995?s=20](https://x.com/bps_club/status/1978880718853017995?s=20)\n\nThese steps demonstrate that our team creates a transparent, well-controlled environment, managing ADA assets with high reliability and accountability.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Deploy two Core Contracts – Vault (Basic rvADA mint => ADA redeem) & Option Engine","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Vault Contract (T-ADA-C) – On-chain Logic(Basic mint rvADA =&gt;redeem ADA)\n\nThe contract allows:\n\n- User sends ADA =&gt;mint token rvADA.\n- User burns rvADA =&gt; withdraws corresponding ADA.\n\nLogic guarantees:\n\n- Calculate the exact rvADA conversion rate based on current NAV.\n- Prevent double-spend and value distortion.\n\nOption Engine Contract\n\n- Mint option contract in CIP-68 format. Record metadata including:strike, expiry, option_type.\n- Successfully mint or burn option tokens on testnet.\n\nUnit tests &amp; Integration scripts\n\n- Write unit tests.\n\nGenerate a test report summarizing testnet results:\n\n- Tx hash proof.\n- Logical output result.\n- The CLI script simulates two main flows\n\nVideo demo: CLI demo video illustrating the flow of 2 contracts.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Have tx hash proof of sending ADA =&gt; mint rvADA =&gt; redeem ADA successfully\n- Have tx hash proving mint or burn of valid CIP-68 option (correct metadata).\n- 100% of main logic test cases pass.\n- Have file test_report.md public on GitHub\n- There is a CLI video illustrating 2 test flows on testnet","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Github repository: Source code two contract(Vault Contract V0, Option Engine Contract), scripts, test reports.\n- Testnet tx hash: Mint or redeem rvADA transaction and options.\n- Video demo (CLI): Run real tests on testnet.\n- Test report PDF: Record test results and output.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":28750,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Auction Validator & Advance Vaults contract","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Auction Validator Contract\n\n- On-chain contract manages Settlement Auction.\n- Main function: Receive proof from Hydra Head closing transaction and Validate the integrity of highest-bid (ADA premium transferred) and Option Token validity transparently on-chain.\n- Perform asset swap (Option Token for winner, ADA premium into Vault Contract).\n\nEpoch, settlement logic (Vault Contract update):\n\n- Epoch logic: Manages operating cycles.\n- Settlement logic: Process OTM or ITM based on Oracle price, calculate and update new NAV after each settlement.\n\nIntegration test: Full cycle simulation (EpochStart =&gt;Mint Option =&gt;Auction =&gt;Premium =&gt;EpochEnd =&gt;Settle =&gt;NAV update)\n\nVideo demo: CLI script simulating the process.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Having a tx hash on testnet proves the settlement transaction was successful when the Auction Validator authenticates the Hydra Head closure proof, ensuring the premium is transferred to the Vault and the option token is transferred to the winner.\n- Vault records the correct epoch_id, start_time, expiry_time.\n- When ITM/OTM, Vault updates NAV and net assets correctly according to the result.\n- Unit test and integration test (CLI) for both contracts passed completely.\n- There is a CLI script video illustrating the whole process","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- GitHub repo (Source code Auction Validator), tx hash settlement successful on testnet\n- GitHub repo (Source code Vault v2 Epoch + Settlement), tx hash update epoch + settle NAV\n- The CLI demo video illustrates the full flow.\n- Test report PDF","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":27250,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Execution Bot, Hydra Head Manager and Automation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Off-chain Execution Bot (v1)\n\n- A service that runs continuously (or on a cron schedule) that monitors and controls the Vault.\n- Core function: Detect EpochStart =&gt; trigger Mint =&gt; open Hydra Head for market maker =&gt; close Head when timer expires =&gt; send L1 transaction to Auction Validator =&gt; check Oracle =&gt; trigger Settlement.\n- Auxiliary functions: Manage deposit aggregation Head and commit UTxO to Vault.\n\nHydra Head Manager (v1)\n\n- Main functions: Manage UTxO commits to Head. Handle highest-bid L2 logic (for Auction) and create final snapshot (final state) as evidence. Manage deposit aggregation Head.\n\nOracle Integration\n\n- Oracle integration Pyth to read real ADA/USD price.\n- Update price when settle (determine OTM/ITM).\n- There is mock fallback for offline testing.\n\nAutomation log &amp; monitoring\n\n- Bot logs the entire cycle in detail: EpochStart =&gt;Mint =&gt;Auction =&gt;Settle =&gt;NAV update.\n- Save the log to file or console, to demonstrate actual operation.\n- There is an error reporting mechanism when the transaction fails.\n\nCLI end-to-end test (Semi-automated)\n\n- CLI script simulates the Bot and Hydra process in action.\n- There is a CLI demo video and test report.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Execution Bot and Hydra Head Manager run stable and automatically ontestnet\n- Oracle price is read correctly and used in settlement logic.\n- NAV changes exactly when premium or payout is processed.\n- Log CLI output clearly records the entire epoch lifecycle.\n- End-to-end CLI test completed without errors.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Github repo: Source code Bot, Hydra Head Manager, integration scripts, Oracle adapter.\n- Testnet tx hashes: Transactions generated by the Bot (EpochStart, Auction Settlement, Deposit Aggregation).\n- CLI demo video: Demonstrating Bot and Hydra Head in action.\n- Test report PDF: Log summary and updated NAV.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":21800,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"dApp Frontend MVP & Public Testnet ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- dApp frontend MVP: Web application (React/NextJS) that connects to wallets (Nami, Eternl, Lace). Interacts with Vault, Option, Auction and allows deposit/withdrawal of ADA testnet.\n- Backend API Gateway (v1): The middleware service provides endpoints (/vault/status, /auction/active, /bot/logs).\n- Testnet infrastructure (Nodes, Relay, Domain, Server, Monitoring)\n- Public preprod testnet deployment: Deploy the entire system to the public preprod testnet (UI + backend + contracts) real user interaction. Minimum 30 test users.\n- User feedback collection: Feedback forms and summary reports.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Users can connect wallets, deposit testnet ADA, and view NAV.\n- Transactions from dApps can interact with Vault, Option, Auction preprod testnet.\n- There is a public preprod testnet link, at least 30 users can try it.\n- There is a feedback form and a report summarizing user opinions.\n- API returns TVL, NAV, logs data from bot.\n- There is a video demonstrating the dApp interface working with the preprod testnet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public preprod testnet dApp link.\n- Github repo (frontend + backend, smartcontract).\n- Tx hashes demonstrate preprod testnet transactions from UI (deposit/redeem).\n- Video demo illustrating the dApp interface working with testnet (user flow).\n- Community feedback report (feedback summary).\n- Link to API docs.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":21390,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"System QA, Mainnet Deployment,Bug Fix and Final Release","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"System QA &amp; optimization:\n\n- Test coverage report: System-wide regression and edge-case testing report.\n- Bug fix &amp; performance optimization: Fix all bugs discovered in milestone 4 and optimize gas usage/script size.\n\nMainnet deployment v1:\n\n- Core contract (L1): Deploy Vault, Option Engine, Auction Validator to Cardano mainnet.\n- L2/Off-chain infrastructure: Deploy Execution Bot, Hydra Node mainnet, and API Gateway to production cloud infrastructure.\n- Final test: Perform a full Epoch =&gt; Mint =&gt; Auction =&gt; Settle cycle on mainnet with small amount of assets.\n\nDocumentation: Complete user documentation and technical documentation.\n\nFinal demo video &amp; public report: Mainnet working demo video. Closeout report summarizing 5 milestones.\n\nMainnet infrastructure costs: Budget and spend on mainnet Cloud/Node deployment and operations costs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- There is comprehensive test reporting for major flows and confirmed bug fixes.\n- Have tx hash to prove deployment contracts to mainnet and complete smoke test on mainnet.\n- Execution Bot and Hydra Node mainnet running continuously.\n- User guide, API docs, Technical docs are complete.\n- There is a video demonstrating the entire system in action on mainet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- GitHub repo: Updated code fixes, internal system wide testing reports.\n- Files QA_report.pdf and Bugfix_changelog.md.\n- Link dApp mainnet works stably with platform features\n- Link =&gt;documentation (User guide, API docs, Technical docs).\n- End-to-end demo video (on mainnet).\n- Closeout report and summary video.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20810,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Tuan Ngo**\n\nExperience:\n\n- Deputy Head of Engineering at Blockchain Pioneer Student Club\n- Experienced in leading and managing projects, organizations and clubs.\n- 2 years developing dApps on Cardano, specializing in writing smart contracts using Aiken.\n- More than 2 years of experience in fullstack programming and directly building and operating solutions on the Cardano blockchain.\n- Second prize at the CARDANO HACKATHON BLOCKCHAIN ​​2025 competitions\n- Third prize at the CARDANO HACKATHON BLOCKCHAIN ​​2024 competitions\n- Over 1 year of market research for DeFi projects on Cardano, solid understanding of non-tech concepts like AMM, LP, LPs, Staking, Yield Farming, etc.\n- Contributed to the ecosystem as a Level 0 _Community Reviewer_ (Funds 14)\n\nContact:\n\n- Email: vantuan132005@gmail.com\n- LinkedIn: [https://www\\.linkedin\\.com/in/tuanngo205\\-dev/](https://www.linkedin.com/in/tuanngo205-dev/)\n- Github: [https://github\\.com/vantuann205](https://github.com/vantuann205)\n\n**Dong Duc Manh**\n\nExperience:\n\n- More than a year of building and operating on the Cardano Blockchain platform.\n- Over a year of experience as a back-end developer, proficient in back-end (Python/Java, C#), handling everything from design to deployment.\n- Experience building Python SDKs with a focus on clean architecture, optimal performance, and extensive documentation.\n\nContact:\n\n- Email: manhducdongyb@gmail.com\n- LinkedIn: [https://www\\.linkedin\\.com/in/manhducdong\\-b2366b330/](https://www.linkedin.com/in/manhducdong-b2366b330/)\n- Github: [https://github\\.com/Manhddm](https://github.com/Manhddm)\n\n**Hong Nhung Tran**\n\nExperience:\n\n- Vice President of Logistics Club - University of Transport\n- Head of Logistics at Blockchain Pioneer Student Club\n- Top 5 Best Student Teams of Viet Nam Aptos Hackathon 2025\n- First Prize of Scientific Research Competition – Faculty of Transport Economics, University of Transport (2024–2025)\n- Main Pitching for National Innovative Startup Projects\n- MC for academic events, seminars and competitions\n- Communications Manager for YLI forum: Youth led Innovation, competition: Youth debate Logistics 2024\n- Team leader in academic projects, event planning and communications strategy\n- Fresher Data Analyst – YRC FTU\n- Research direction: Finance, economics and communication in blockchain technology\n\nContact:\n\n- Email: tranhnhung2912@gmail.com\n- LinkedIn: [https://www\\.linkedin\\.com/in/hong\\-nhung\\-tran\\-084504304/](https://www.linkedin.com/in/hong-nhung-tran-084504304/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Total budget required: ₳120,000 (~$0.40/ADA) for a 12 month project.\n\nThe budget is allocated in detail across each milestone as follows:\n\nMilestone 1: Deploy two Core Contracts – Vault (Basic rvADA mint =&gt; ADA redeem) &amp; Option Engine\n\nTotal for milestone 1: ₳28,750 (~23.96%)\n\nCategories:\n\n- Vault contract version 0 development: ₳13,000\n- Option engine contract development (CIP-68 mint or burn, metadata standards): ₳10,250\n- Unit tests, integration scripts, and detailed test report: ₳3,500\n- Command-line interface demonstration video, preliminary technical documentation, and backup: ₳2,000\n\nMilestone 2: Auction Validator &amp; Advance Vaults contract\n\nTotal for milestone 2: ₳27,250 (~22.71%)\n\nCategories:\n\n- Auction validator development (Layer 1/Layer 2 trust boundary, Hydra proof verification, settlement): ₳13,000\n- Vault contract version 2 upgrade (epoch logic, out-of-the-money or in-the-money settlement, net asset value update): ₳9,900\n- Full-cycle integration testing and automated command-line simulation: ₳3,150\n- Full-cycle demonstration video, test report, and contingency: ₳1,200\n\nMilestone 3: Execution Bot, Hydra Head Manager and Automation\n\nTotal for milestone 3: ₳21,800 (~18.17%)\n\nCategories:\n\n- Execution bot version 1 (automatic epoch start, minting, opening head, and settlement): ₳9,000\n- Hydra head manager version 1 (auction head, deposit head, snapshot management): ₳7,500\n- Oracle Pyth integration, monitoring, logging, and auto-retry functionality: ₳4,800\n- End-to-end command-line testing and automated demonstration video: ₳500\n\nMilestone 4: dApp Frontend MVP &amp; Public Testnet\n\nTotal for milestone 4: ₳21,390 (~17.82%)\n\nCategories:\n\n- Frontend dApp minimum viable product development (React/Next.js, wallet connection, user interface/user experience): ₳6,540\n- Testnet infrastructure (nodes, relay, domain, server, monitoring): ₳7,000\n- Backend API gateway, indexer, and monitoring dashboard: ₳3,000\n- Public deployment, community testing, and feedback collection: ₳3,350\n- dApp demonstration video and user guide: ₳1,500\n\nMilestone 5: System QA, Mainnet Deployment,Bug Fix and Final Release\n\nTotal for milestone 5: ₳20,810 (~17.34%)\n\nCategories:\n\n- Comprehensive independent security testing (Layer 1 and Hydra flow): ₳5,000\n- Mainnet infrastructure (nodes, relay, domain, server, monitoring): ₳7,000\n- Post-test bug fixes: ₳4,500\n- Mainnet deployment and complete documentation: ₳3,350\n- Final closeout report and final demonstration video: ₳960\n\nDetailed link: [https://docs\\.google\\.com/spreadsheets/d/1mEFNbp2q9veCH\\_oznYSWvDqfQ4y27PHSvV4OpN2pJdk/edit?hl=vi&amp;gid=0\\#gid=0](https://docs.google.com/spreadsheets/d/1mEFNbp2q9veCH_oznYSWvDqfQ4y27PHSvV4OpN2pJdk/edit?hl=vi&gid=0#gid=0)\n\nWe would like to confirm that the entire requested budget of 120,000 ADA will only be used for future development activities as specified in the 5 milestones of the T-ADA-C (Cardano Automated Options Vault) project.\n\nSpecifically:\n\nThere will be no retroactive funding for work done prior to the funding being received.\n\nNone of these funds will be used to purchase digital assets, provide liquidity, invest, speculate, build project treasuries, purchase branded merchandise, re-grant, or implement incentive programs, token rewards, airdrops, or giveaways of any kind.\n\n100% of the budget is allocated directly to:\n\n- Development staff costs (smart contract, off-chain bot, Hydra, frontend/backend)\n- Project management and reporting\n- Independent security testing\n- Testnet/mainnet infrastructure costs (Hydra nodes, servers, monitoring)\n- Technical documentation and user manuals required for complete product delivery.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"With an investment of 120,000 ADA, we believe this project brings exceptional value as it is not just developing a regular dApp, but building a prototype for a completely new base financial layer that has never existed before for the Cardano ecosystem.\n\n- At the current exchange rate (~$0.40/ADA), the total project budget corresponds to approximately $48,000\n- Cost breakdown: Distributed evenly over the 12 month period, the average operational expenditure is about $4,000 per month. This represents a lean bootstrap-level budget capable of sustaining a full-stack blockchain engineering team (experienced in Aiken and Hydra node operations) while maintaining essential production-grade infrastructure. It demonstrates the team’s long-term dedication to the Cardano ecosystem, accepting below-market compensation to deliver a practical and impactful real-world solution.\n- This budget is used to develop a prototype for a programmable options marketplace through Option Engine, and the first layer of Automated Vaults applications running on the platform.\n- The total budget of 120,000 ADA is focused on delivering a tested prototype, including mandatory testing costs. This is an essential expense for any serious DeFi project, ensuring the safety of user assets and the reputation of the entire ecosystem.\n- By creating an automated yield product, our prototype will lay the foundation for mainnet launch to be able to attract live TVL and maintain a steady on-chain trading volume through weekly bot activities that bring real value to the entire Cardano ecosystem.\n- We have good compliance status and verified technical expertise in the required technology (CIP-68) to significantly reduce failure risk and ensure capital is used efficiently.\n- The 120,000 ADA budget reflects a serious investment not only in L1 Core Engineering, but also in pioneering Hydra integration for a complex DeFi project that significantly reduces transaction speeds.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"DeFi","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1753}