{"pr_id":"019ac366-bc8b-7e0f-866f-a402da215e40","title":"From Labs to BIOHUB – Building Science on Cardano","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Latin America lacks a dedicated entry point for scientists to explore Cardano. There’s no regional hub bridging biotech, research, and Web3 — and that’s holding back adoption and innovation.","solution":"We’ll launch Latin America’s first BioHub on Cardano — a regional entry point for scientists, with workshops, expert interviews, community building, and co-created biotech use cases.","proposer_name":"Dandeu Leonardo, PhD","proposer_relevant_experience":"We’re a small team — but mighty where it counts. What brings us together is a shared purpose: to bridge the world of science with the possibilities of Cardano. Between us, we’ve got the science, the experience, the creative firepower — and the track record to back it up.\n\n**1\\. Leonardo Dandeu – Project Lead &amp; Educational Lead**\n\nLinkedIn [https://www\\.linkedin\\.com/in/leonardo\\-dandeu\\-15ab33aa/](https://www.linkedin.com/in/leonardo-dandeu-15ab33aa/) | Research Profile [https://bicyt\\.conicet\\.gov\\.ar/fichas/p/leonardo\\-nestor\\-ruben\\-dandeu](https://bicyt.conicet.gov.ar/fichas/p/leonardo-nestor-ruben-dandeu)\n\nLeonardo is a licensed hematologist and breast cancer researcher with hands-on clinical and academic experience across Latin America. He’s currently a PhD fellow at CONICET — Argentina’s national science council — and lead author of a published study on breast cancer (PubMed [https://pubmed\\.ncbi\\.nlm\\.nih\\.gov/39927763/](https://pubmed.ncbi.nlm.nih.gov/39927763/)).\n\nBut he’s not just about lab coats and research papers. Leo has also been exploring the frontier between science and blockchain. He’s part of the DeSci Quark alumni network, has helped test their early educational programs, and won a Cardano Ideathon in 2024 with a proposal on blockchain for healthcare.\n\nFor this BioHub, he’s leading the vision — designing learning experiences, guiding scientific outreach, and keeping our work grounded in the realities of research across the region.\n\n\n\n**2\\. Nerina Ermacora – Project Coordinator &amp; Media/Design Lead**\n\nLinkedIn [https://www\\.linkedin\\.com/in/nerina\\-ermacora/](https://www.linkedin.com/in/nerina-ermacora/)\n\nNerina brings a rare mix of precision, creativity, and people skills. She’s a specialist in client management and institutional relations — and also a talented visual designer. She was co‑proposer of the successfully completed DeSci Quark project ([https://desciquark\\.com/en/](https://desciquark.com/en/) )(Catalyst F13, ID 1300094), where she managed overall coordination, produced multimedia content (interviews, editing, visual design), and built strong bridges with researchers and students.\n\nIn this BioHub, she’s steering day-to-day operations, producing all visual and video content, and leading communications with participants and the broader scientific community.\n\nTogether, we bring:\n\n✔ Real-world scientific knowledge (cancer, hematology, Latin American healthcare)\n\n✔ Hands-on experience with blockchain, Web3, and the Cardano ecosystem\n\n✔ Proven project delivery — education, design, and community building\n\n\n\n_And above all — we care about doing it with respect, clarity, and openness\\. That’s what makes this team ready to build the first BioHub on Cardano\\._","url":null,"funds":50000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"From Labs to BIOHUB – Building Science on Cardano","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Dandeu Leonardo, PhD","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":50000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Latin America lacks a dedicated entry point for scientists to explore Cardano. There’s no regional hub bridging biotech, research, and Web3 — and that’s holding back adoption and innovation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We’ll launch Latin America’s first BioHub on Cardano — a regional entry point for scientists, with workshops, expert interviews, community building, and co-created biotech use cases.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":{"links":[]},"sub_fields":null},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Yes — 100% open source.\n\nAlthough this project doesn't involve software or code, all outputs will be publicly available, free to use, adapt, and share.\n\nWe believe in open science, open knowledge, and open collaboration. This project is built to spread.\n","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Community Outreach","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We’re focusing on a very specific — and very overlooked — group: early-career scientists, students, and educators across Latin America. These are folks deep in biotech, biomedicine, and health research... full of ideas, full of drive — but mostly unaware that blockchain could be part of their toolkit.\n\nThe truth? There's a big disconnect right now.\n\nWhile DeSci (Decentralized Science) is gaining traction globally, most researchers in our region haven’t been invited into the conversation. Some don’t know where to start. Others don’t even know this space exists. Language barriers, tech barriers, access issues... you name it.\n\nThat’s where we come in.\n\nOur **BioHub** isn’t just a project — it’s a space. A welcoming, collaborative space where researchers and students can discover what Cardano is, what it can do, and how it might actually solve problems they’re wrestling with every day.\n\nWe’ll reach them through the channels that already work: partner universities, local science clubs, DeSci Quark alumni, Telegram groups, LinkedIn, YouTube, and the occasional friendly DM. We’re not guessing here — we’ve already built these bridges. Now we’re walking across them.\n\nBut here’s the most important part: we’re not showing up with answers. We’re showing up with curiosity.\n\nWorkshops, interviews, co-creation sessions… all designed to learn with (and from) these scientists. We’re not just “educating” — we’re building alongside them. We’re turning the abstract into the practical. Blockchain into something they can see, touch, maybe even trust.\n\nWhy should this matter to Cardano?\n\nBecause growth doesn’t come from buzzwords. It comes from people. Real people, in real communities, doing real work.\n\nBy connecting Cardano to the scientific world in Latin America — not through tech demos, but through trust, collaboration, and shared purpose — we’re planting seeds. For impact. For adoption. For something bigger than the chain itself.\n\nThis is how Cardano becomes more than infrastructure.\n\nIt becomes part of the future of science.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"What We'll Be Doing (And Why It Matters)\n\n\n\n**1\\.Kickstarting the BioHub — the home base**\n\n  First things first: we’ll set up a simple, friendly space on LinkedIn and X (Twitter) to introduce the BioHub and keep everything public, visible, and easy to follow. Think of it as our digital home — where anyone can find our interviews, sessions, co-created use cases, and all the open-access content we’ll be putting out (all in Spanish, made for the Latin American science community).\n\n\n\n**2\\.Real Talk with Real Scientists**\n\n   We’ll sit down with 10 early-career scientists, students, and educators  from fields like biotech, biomedicine, and health sciences. Not just to chat — but to really understand what’s working, what’s not, and where something like Cardano might actually help in the real world. These interviews won’t be hidden away; we’ll edit and share them openly as a learning resource. And their insights? They'll help shape what the BioHub focuses on next, so it truly speaks to their needs.\n\n\n\n**3\\. Co\\-Creation Sessions — live and collaborative**\n\n   Starting in month 3, we’ll host two live co-creation sessions per month (in Spanish) — for a total of six sessions over three months. These aren’t lectures. They’re open, participatory spaces where people can bring their research problems, their questions, their ideas — and together, we’ll explore how Cardano might fit in. Every session will be recorded, documented, and shared through the BioHub so others can learn too.\n\n\n\n**4\\. Mapping Use Cases, Together**\n\n   Finally, we’ll gather all the ideas and feedback from the interviews and live sessions to co-create a **practical document of use cases**. We’re talking real stuff here — like tracking data, improving research transparency, or boosting academic recognition. This won’t be theoretical fluff. It’ll be rooted in the lived experiences of researchers who’ve helped shape it every step of the way.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"How we’ll know it’s working\n\n\n\nFor us, success doesn’t mean going viral or racking up huge numbers. It means *real people showing up, connecting, and building something together*. That’s the heartbeat of this project.\n\n\n\nSo — what are we watching for?\n\n\n\n We’re aiming to publish 10 interviews with scientists, educators, and students. Not just raw footage — we’ll edit them, add highlights, and share them in open, easy-to-access formats. Stories that speak.\n\n\n\nOver the course of 3 months, we’ll host 6 live co-creation sessions  (two per month). We’d love to see at least 15–20 unique participants  joining in — asking questions, sharing ideas, getting curious.\n\n\n\nFrom all of this, we’ll pull together 1 co-created document — a growing library of 5 to 8 real use cases showing how Cardano could make a difference in the scientific world. Written clearly, no fluff.\n\n\n\n We’ll keep 1 active BioHub page (on LinkedIn/X) where everything lives: videos, documents, updates — all in Spanish, for our region. The goal? Visibility, connection, and trust.\n\n\n\n And finally, we’ll pay close attention to the qualitative feedback — the little signs that tell us we’re on the right track. “This made me think...” or “Can I share this with my lab?” — those comments mean the world.\n\n\n\nBecause in the end, success is simple: people feeling inspired, informed, and ready to take the next step.\n\n\n\nAnd hopefully... this is just the beginning.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**What We're Building \\(and Why It Matters\\)**\n\n\n\nWe’re launching the very first **BioHub for Latin America on Cardano** — an open, collaborative space where science and blockchain meet in ways that actually make sense for people on the ground.\n\n\n\nNot buzzwords. Not theory. Real conversations. Real exploration. Real use.\n\n\n\nOur focus? Early-career researchers, students, educators — and yes, even startups — working in biotech, health sciences, and related fields across Latin America. Folks who are brilliant and motivated, but usually have zero exposure to what Cardano (or any blockchain, really) could do for their work.\n\n\n\nSo here’s our approach:\n\n\n\n**Step one — listen\\.**\n\nBefore anything else, we ask. We’ll connect with real people in labs, classrooms, and research programs. What challenges are you facing? Where do things get stuck? What tools do you wish you had?\n\n\n\n**Step two — co\\-create\\.**\n\nWe won’t just present Cardano as a finished thing. We’ll invite people in to explore it together. Through live co-creation sessions (in Spanish), we’ll ask:\n\n\"Could this tech help solve *your* problem?\"\n\n\"What would it take to make it useful, usable, and relevant to you?\"\n\n\n\nThese sessions will be recorded, shared, and documented so others can join in, even if they can’t be there live.\n\n\n\n**Step three — build a use case library\\.**\n\nFrom all these voices, insights, and experiments, we’ll co-create a small but meaningful collection of real-world use cases. Not theoretical papers — practical, human-centered examples of how Cardano could support scientific work. Everything will be free, open, and published in Spanish.\n\n\n\nBut here’s the heart of it:\n\n\n\n_From day one, everyone involved will know — this isn’t a one\\-way project\\. It’s not us giving answers\\. It’s a shared space to imagine, prototype, and maybe even build Cardano\\-powered tools together, based on their needs, not ours\\._\n\n\n\nThat’s how you build trust. That’s how you plant the seeds of real adoption. And that’s why this BioHub exists.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The Impact We’re Hoping to Spark\n\n\n\nAt its heart, this project isn’t about checkboxes or deliverables. It’s about creating an open door — one that welcomes the scientific community into Cardano, especially voices that have been left out for far too long.\n\n\n\nSo... what could this mean for the ecosystem?\n\n\n\n**Fresh eyes, fresh energy\\.**\n\nWe’re reaching out to early-career scientists, students, educators — folks in Latin America working on real, everyday challenges in biotech, healthcare, and research. Most of them have never touched blockchain. Some haven’t even heard of Cardano. But they’re curious, creative, and problem-solvers by nature. And once they see the potential? That changes everything.\n\n\n\n**Use cases that actually make sense**\n\nNo theoretical fluff. We’ll be co-creating examples that come directly from real frustrations — things like data traceability, collaboration hurdles, or lack of transparency in research funding. These aren’t just “what ifs” — they’re “what now?” moments that can show builders what’s possible, and what’s needed.\n\n\n\n**A real link between Cardano and DeSci**\n\nLet’s face it — DeSci is gaining ground fast, but most of it is happening outside Cardano. We think it’s time that changed. This BioHub is our way of saying: “Hey, Cardano belongs in this conversation too.” And more importantly, here’s how.\n\n\n\n**Trust first, tech second**\n\nBecause adoption isn’t about code. It’s about connection. We’re showing up with open ears, not just open wallets — and that’s how you build something that lasts.\n\n\n\nIf this works (and we really believe it will), this isn’t a one-time initiative. It’s the spark. The beginning of something much bigger: scientists building on Cardano, new ideas emerging from Latin America, and a BioHub model that others can run with in their own communities.\n\n\n\nAnd that, right there, is the kind of impact we’re here for.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"We’re building on real things that already work. This project grows from a solid base: a network that’s alive and kicking, lived experience in the field, and one goal that drives us — bringing Cardano closer to the world of science. Not in theory. In practice.\n\nLet’s start with the people behind it.\n\nFirst up, **Leonardo Dandeu** — a licensed hematologist, breast cancer researcher, and someone who knows the realities of healthcare in Latin America first-hand. He’s not just reading papers — he’s living it. And he’s been exploring how Cardano blockchain can actually help. He even won a Cardano Ideathon for his ideas on blockchain in health. So yeah, this isn’t just a curiosity for him — it’s a mission.\n\nAnd right there with him is **Nerina Ermacora** — creative lead, general coordinator, and co-proposer of the DeSci Quark project (funded and completed in Catalyst Fund 13). She was behind the scenes making it all happen: planning, recording, editing, and building real relationships with scientists and students. Her track record speaks for itself. She’s not “interested in science” — she’s part of the network that makes these bridges possible.\n\nTogether, they’re supported by the DeSci Quark community — a collective that’s been connecting the dots between researchers and Web3 builders for the last couple of years. We’re talking live workshops, open interviews, collaborations across 5+ countries — and dozens of hours of real content with scientists, educators, and innovators.\n\nConnection. Education. Co-creation.\n\nWe’ve done this before. We’ve hosted blockchain sessions for beginners. We’ve talked to scientists. We’ve helped “non-Web3” folks take their first step and feel comfortable doing it. That’s why we’re confident we can deliver: 3 educational sessions, 10 expert interviews, and an actionable open report. This isn’t guesswork — we’ve got the systems, the formats, and most of all, the trust.\n\nEverything will be open.\n\nWe’ll share feedback, insights, mistakes, learnings — all of it. We’ll track registrations and use pre/post-session surveys so we’re not just talking — we’re learning what works.\n\nSo yes — this is not just possible. It’s grounded. It’s tested. It’s human.\n\nThis isn’t a big wild shot in the dark. It’s the natural next step for a team that’s already building this bridge — between two worlds that have so much to gain from each other.\n\nOne connection at a time. One conversation at a time. One step closer.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Listening First – Interviews, Mapping & BioHub Launch","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- 10 interviews with early-career scientists, students, and educators in biotech and health sciences across Latin America.\n- Insights gathered and synthesized into a summary of recurring research challenges and potential Web3/Cardano opportunities.\n- Initial mapping of relevant research communities, labs, clubs, and university networks open to collaboration.\n- BioHub presence launched on LinkedIn and X (formerly Twitter) — posting project updates and resources in Spanish.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 10 interviews recorded.\n- Insight report identifying at least 5–8 shared pain points or opportunities for Cardano-based solutions.\n- Contact list or spreadsheet mapping key individuals, labs, and networks.\n- Active LinkedIn and X profiles for the BioHub, each with at least 3 posts published.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Google Drive folder containing:**\n\n- Interview recordings + transcripts/summaries\n- Insights document (PDF)\n- Mapping sheet with outreach notes\n- Public links of social accounts and posts","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Co-Creation in Action – Live Sessions & Use Case Building","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- 6 live co-creation sessions (2 per month during Months 3, 4, and 5) — interactive, open, and designed for hands-on exploration of Cardano’s potential in science.All sessions recorded and shared, with attendance tracking.\n- Co-creation of at least 3 practical Cardano use cases — real scenarios where blockchain could help solve scientific pain points.\n- Community contributions integrated via session input and feedback.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 6 recorded live sessions, with summaries and attendance logs.\n- Clear documentation (PDF) of at least 3 use cases created through the process.\n- Engagement from at least 15 unique participants across sessions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Google Drive folder with:**\n\n- Session videos and summaries\n- Participant data/logs\n- Link to use case documentation with visuals and context","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Report + Summary Video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- A final, open-access report  that brings everything together: who we spoke to, what we learned, what we co-created — and what’s next.\n- A short, public summary video (YouTube-ready) highlighting the journey, impact, and key takeaways — in accessible, visual format.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Final report in downloadable PDF format, summarizing all insights, interviews, sessions, and use cases.\n- Video (2–4 min) publicly available.\n\n\n\n_All content published openly and indexed via the BioHub’s social platforms\\._","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Public links to:\n\n\n\n- Final report PDF\n- Summary video on YouTube\n\n\n\n_All content published openly and indexed via the BioHub’s social platforms\\._","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":5000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"We’re a small team — but mighty where it counts. What brings us together is a shared purpose: to bridge the world of science with the possibilities of Cardano. Between us, we’ve got the science, the experience, the creative firepower — and the track record to back it up.\n\n**1\\. Leonardo Dandeu – Project Lead &amp; Educational Lead**\n\nLinkedIn [https://www\\.linkedin\\.com/in/leonardo\\-dandeu\\-15ab33aa/](https://www.linkedin.com/in/leonardo-dandeu-15ab33aa/) | Research Profile [https://bicyt\\.conicet\\.gov\\.ar/fichas/p/leonardo\\-nestor\\-ruben\\-dandeu](https://bicyt.conicet.gov.ar/fichas/p/leonardo-nestor-ruben-dandeu)\n\nLeonardo is a licensed hematologist and breast cancer researcher with hands-on clinical and academic experience across Latin America. He’s currently a PhD fellow at CONICET — Argentina’s national science council — and lead author of a published study on breast cancer (PubMed [https://pubmed\\.ncbi\\.nlm\\.nih\\.gov/39927763/](https://pubmed.ncbi.nlm.nih.gov/39927763/)).\n\nBut he’s not just about lab coats and research papers. Leo has also been exploring the frontier between science and blockchain. He’s part of the DeSci Quark alumni network, has helped test their early educational programs, and won a Cardano Ideathon in 2024 with a proposal on blockchain for healthcare.\n\nFor this BioHub, he’s leading the vision — designing learning experiences, guiding scientific outreach, and keeping our work grounded in the realities of research across the region.\n\n\n\n**2\\. Nerina Ermacora – Project Coordinator &amp; Media/Design Lead**\n\nLinkedIn [https://www\\.linkedin\\.com/in/nerina\\-ermacora/](https://www.linkedin.com/in/nerina-ermacora/)\n\nNerina brings a rare mix of precision, creativity, and people skills. She’s a specialist in client management and institutional relations — and also a talented visual designer. She was co‑proposer of the successfully completed DeSci Quark project ([https://desciquark\\.com/en/](https://desciquark.com/en/) )(Catalyst F13, ID 1300094), where she managed overall coordination, produced multimedia content (interviews, editing, visual design), and built strong bridges with researchers and students.\n\nIn this BioHub, she’s steering day-to-day operations, producing all visual and video content, and leading communications with participants and the broader scientific community.\n\nTogether, we bring:\n\n✔ Real-world scientific knowledge (cancer, hematology, Latin American healthcare)\n\n✔ Hands-on experience with blockchain, Web3, and the Cardano ecosystem\n\n✔ Proven project delivery — education, design, and community building\n\n\n\n_And above all — we care about doing it with respect, clarity, and openness\\. That’s what makes this team ready to build the first BioHub on Cardano\\._","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Breakdown by Milestone & Role**\n\n\n\nThis isn’t a massive dev build with layers of complexity. It’s a community-centered project — built on conversation, co-creation, and connection. We’re here to open doors for scientists in Latin America, and that means investing time, care, and thoughtful execution.\n\n\n\nWe’re working with a fair, freelance-style hourly rate of  $30/hour, which reflects the kind of skilled, professional effort that goes into meaningful educational and community work. At the time of writing (Nov 2025), that puts us at 1 ADA ≈ $0.40 USD.\n\n\n\nMilestone 1: Months 1–2\n\n\n\nThis is where it all begins. We’ll set up the BioHub presence, kick off outreach through our existing networks, prepare materials for interviews, and start mapping out how our live sessions will flow.\n\n\n\nLeo will take the lead on identifying key challenges from the science side, co-developing the interview guide, and sketching out the educational roadmap (~100 hours).\n\nNerina will handle launching the BioHub's online presence, design initial visuals, and coordinate with our first round of interviewees (~90 hours).\n\nTogether, they’ll set the tone — crafting outreach materials, planning the rhythm of content, and building the foundation for the rest of the project (~80 hours combined).\n\n\n\nEstimated Cost: ₳20,000 (~$8,000 USD)\n\n\n\nMilestone 2: Months 3–5\n\n\n\nWe’ll host six live co-creation sessions, and start shaping a set of real, grounded Cardano use cases — built from the voices of the people who live these challenges every day.\n\n\n\nLeo will host all the live sessions, lead the interviews, extract insights, and start putting together the use case library (~200 hours).\n\nNerina will run the behind-the-scenes engine — scheduling, recording, editing, and keeping the content flowing to our audience (~100 hours).\n\nAnd of course, we’ll need time to follow up with participants, capture feedback, and document the moments that matter (~35 hours).\n\n\n\nEstimated Cost: ₳25,000 (~$10,000 USD)\n\n\n\nMilestone 3: Month 6\n\n\n\nOnce the work is done, we’ll bring it all together — not just as data or notes, but as a story worth telling. A final report, beautifully designed and accessible. A short video that captures the spirit of the project and invites others in.\n\n\n\nNerina will lead the charge here — designing the final report, building out the visuals, and producing a shareable summary video (with subtitles, editing, distribution, the whole thing) (~45 hours).\n\nLeo will help shape the written content, turning raw insights into a compelling narrative that makes sense to both scientists and the Cardano community (~15 hours).\n\n\n\nEstimated Cost: ₳5,000 (~$2,000 USD)\n\n\n\n**Total Budget: ₳50,000 \\(≈ $20,000 USD\\)**\n\n\n\n_That’s it\\. A fair, clear budget — focused on people, participation, and building something that lasts\\._","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"We’re asking for ₳50,000 — around $20,000 USD — to run a 6-month project that brings Cardano into a space it’s barely touched: the world of science, biotech, and education in Latin America.\n\n\n\n**And honestly? That’s a pretty fair ask for what we’re setting out to do\\.**\n\n\n\nWe’re not throwing buzzwords into the wind or hoping for “maybe someday” impact. We’re building something very real:\n\n→ Six co-creation sessions.\n\n→ Ten interviews with real scientists and educators.\n\n→ A use-case library — grounded in the day-to-day challenges of people actually working in research.\n\n\n\nEvery ADA in this budget is tied to real, thoughtful work. It goes into listening, designing, facilitating, creating — not fluff. This is a lean, focused team that knows the space and knows how to deliver.\n\n\n\n**So, what does Cardano actually get from this?**\n\n\n\nNew voices, new minds\\.  Researchers, educators, students — people who’ve never seen blockchain as “for them” — now discovering Cardano in a space they understand.\n\n\n\n**Real\\-world stories\\.** Use cases that aren’t theoretical or generic. They’re co-created, concrete, and actually make sense to people in the scientific world.\n\n\n\nStronger bridges\\.  Between Cardano and the DeSci movement — which right now, let’s be honest, is mostly happening elsewhere. We want to change that.\n\n\n\n**And… new connections with Latin American science startups**. This is an entry point, not the finish line. We’re planting seeds that could grow into collaborations, pilots, and longer-term opportunities.\n\n\n\nWe’re not promising moonshots. We’re just doing the real work — human, honest, and practical — to make Cardano visible where it’s needed, and to invite people in on their own terms.\n\n\n\nAnd the best part? The **BioHub model** is lightweight, replicable, and ready to be reused — in other countries, other fields, other languages. We’re building something that can grow.\n\n\n\nBecause this region? It’s full of talent, ideas, and energy — but often left out of the Web3 conversation.\n\n\n\nLet’s change that.\n\n\n\nLet’s open the door.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Community Outreach","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1754}