{"pr_id":"019abff7-f378-7409-961f-84a1272e598b","title":"MangroveLens: AI Monitoring & On-Chain Proof of Restoration","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Coastal mangrove restoration lacks reliable, scalable monitoring. Field surveys are slow, costly and hard to verify, and there is no automated, blockchain-secured proof of restoration.","solution":"MangroveLens combines AI, drone and satellite imagery with Cardano smart contracts to assess mangrove health and carbon, then publish tamper-proof on-chain “Proof of Restoration” records.","proposer_name":"Nelson Maillard","proposer_relevant_experience":"Nelson Maillard – Bôndy – Project Lead\n\n[https://www\\.linkedin\\.com/in/nelson\\-maillard\\-a7723b150](https://www.linkedin.com/in/nelson-maillard-a7723b150%EF%BF%BC)\n\nSkills: Strategic leadership, environmental project management, stakeholder engagement, partnership building, blockchain integration strategy.\n\nRole: Leads the overall project, ensuring alignment with objectives, budget, and timelines. Coordinates technical, scientific, and blockchain teams, and drives engagement with NGOs, researchers, and Cardano ecosystem partners.\n\n⸻\n\nZoninra Ramahaimandimby – Bôndy – Chief Information Officer\n\n[https://www\\.linkedin\\.com/in/zoninra\\-ramahaimandimby\\-bb462b129/](https://www.linkedin.com/in/zoninra-ramahaimandimby-bb462b129/%EF%BF%BC)\n\nSkills: Hydrology, environmental monitoring, data systems architecture, geomatics, integration of earth observation technologies.\n\nRole: Designs the project’s data architecture and oversees integration between the registry, blockchain infrastructure, and open-data interfaces. Ensures interoperability, data security, and compliance with environmental monitoring standards.\n\n⸻\n\nAndrianina Razafimbelo – Bôndy – GIS &amp; Remote Sensing Specialist\n\n[https://www\\.linkedin\\.com/in/andrianina\\-razafimbelo\\-0aa704169](https://www.linkedin.com/in/andrianina-razafimbelo-0aa704169%EF%BF%BC)\n\nSkills: Geospatial data analysis, remote sensing, ecological mapping, forestry, environmental monitoring.\n\nRole: Leads the acquisition, processing, and classification of high-resolution satellite and drone imagery. Delivers ecological categorisation of plots and prepares structured geospatial datasets to support analysis and digital asset creation.\n\n⸻\n\nManda Rafalimanana – Bôndy – GIS &amp; Cartography Officer\n\n[https://www\\.linkedin\\.com/in/manda\\-rafalimanana\\-866715259](https://www.linkedin.com/in/manda-rafalimanana-866715259%EF%BF%BC)\n\nSkills: Database management, cartography, land-use planning, geospatial data accessibility.\n\nRole: Manages the project’s geospatial database, ensuring accurate geolocation, mapping consistency, and reliable data access. Oversees map production for both the public interface and scientific stakeholders.\n\n⸻\n\nAlban Bonnet-Casson – Bôndy – Supply Chain &amp; Sustainability Expert\n\n[https://www\\.linkedin\\.com/in/alban\\-bonnet\\-casson\\-113466102/?originalSubdomain=mg](https://www.linkedin.com/in/alban-bonnet-casson-113466102/?originalSubdomain=mg%EF%BF%BC)\n\nSkills: Sustainable sourcing, certification standards (UEBT, Rainforest Alliance, organic, Fairtrade), traceability systems, program design.\n\nRole: Provides expertise on tracability pathways and monitoring design. Ensures alignment with international standards for restoration projects and supports partners in meeting compliance requirements.\n\n⸻\n\nLalao Aigrette – Bôndy – Blue Carbon &amp; Social-Ecological Research Lead\n\n[https://www\\.linkedin\\.com/in/lalao\\-aigrette\\-40868052](https://www.linkedin.com/in/lalao-aigrette-40868052)\n\nSkills: Mangrove ecology, blue carbon and blue economy, social-ecological systems, gender and natural resource governance, impact evaluation, scientific publishing.\n\nRole: Leads research at the interface of mangrove restoration, blue-carbon accounting and community livelihoods. Integrates ecological data into project design and MRV, advises on how restoration generates resilient blue-economy opportunities, and co-authors peer-reviewed studies that validate the project’s carbon and biodiversity outcomes.\n\n⸻\n\nZenGate Global – Technology Partner (Palmyra Ecosystem)\n\n[https://palmyraecosystem\\.io](https://palmyraecosystem.io)\n\n\n\nSkills: Cardano-based blockchain architecture, smart contract and token/NFT standards, backend & API development, data integration with Palmyra, DevOps and platform security, production-grade infrastructure.\n\n\n\nRole: Co-designs and builds the blockchain and integration layer for MangroveLens, defining data and asset models, anchoring monitoring outputs on-chain, connecting to wallets and dashboards, and ensuring the tool is secure, scalable, and ready for real-world deployment.","url":null,"funds":190000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"MangroveLens: AI Monitoring & On-Chain Proof of Restoration","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Nelson Maillard","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":190000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Coastal mangrove restoration lacks reliable, scalable monitoring. Field surveys are slow, costly and hard to verify, and there is no automated, blockchain-secured proof of restoration.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"MangroveLens combines AI, drone and satellite imagery with Cardano smart contracts to assess mangrove health and carbon, then publish tamper-proof on-chain “Proof of Restoration” records.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.bondy.earth/en","https://dagshub.com/nelson.maillard/Bondy-Omdena","https://www.omdena.com/blog/monitoring-reforestation-using-machine-learning","https://ia.bondy.earth/Model_Prediction","https://sites.google.com/bondy.earth/information-system/syst%C3%A8mes-dinformation?authuser=0"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"MangroveLens will use a mixed IP model. The production platform will be mostly proprietary, because it hosts sensitive ecological and finance data. Selected analysis libraries, anonymised sample datasets and Cardano smart-contract interfaces will be published openly so other builders can reuse the Proof of Restoration pattern.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Environment","group":"Sustainability"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"MangroveLens is one of the first Cardano projects to link automated ecological monitoring directly with on-chain proofs of restoration.\n\n\n\nIt is innovative because it:\n\n• Uses computer-vision models trained on a unique drone dataset of 15,000 ha of real mangrove sites, detecting seedlings, canopy recovery and biomass trends rather than only coarse land-use classes.\n\n\n\n• Turns these indicators into structured digital attestations and hashes each validated report to Cardano, creating a verifiable “Proof of Restoration” trail that can underpin carbon sequestration, NFTs or impact-linked finance.\n\n\n\n• Builds on a prior Machine Learning prototype developed with Omdena and hosted on DagsHub, so we extend proven data pipelines instead of starting from a pure idea.\n\nFor Cardano this provides a specialised blue-carbon MRV rail, complementary to general tree-tracking or NDVI-oracle projects already funded by Catalyst.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The MVP demonstrates the full workflow from imagery to on-chain proof. Users will:\n\n1. **Upload** or link drone and satellite scenes for selected mangrove plots;\n2. **Run AI models** that segment mangroves, detect survival and estimate canopy and carbon proxies;\n3. **Explore indicators** on a web map and generate monitoring reports;\n4. **Send a signed “Proof of Restoration\"** record to a Cardano testnet smart contract for each validated report.\n\nThe public will access a testnet dApp to inspect sample plots and their on-chain proofs.\n\nPartner NGOs and researchers will use a secure workspace to upload real data and test the workflow during the pilot.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"We define success using technical, adoption and on-chain metrics:\n\n• **AI performance:** at least 85% precision and recall on validation data for mangrove detection and classification.\n\n• **Coverage**: 15,000 ha of mangroves processed, with indicators generated for at least three restoration projects.\n\n• **User adoption:** 5 active pilot users (NGO staff, scientists and project managers) using the dashboard during the pilot.\n\n• **On\\-chain usage:** a minimum of 500 Proof of Restoration transactions on Cardano testnet across multiple monitoring cycles and plots.\n\n•**Mainnet readiness:** a documented, smart-contract interface and at least one Letter of Intent from a finance or carbon partner to use the system after the fund.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"MangroveLens is an AI-powered monitoring and verification platform dedicated to mangrove and blue-carbon projects and built on Cardano.\n\n\n\nIt ingests drone and satellite imagery, aligns it with plot boundaries and field observations, and runs computer-vision models to detect mangrove cover, seedling survival, canopy change and carbon proxies. \n\n\n\nResults are stored in a geospatial database and presented through a web dashboard and APIs so project teams can track performance, compare sites and export reports.\n\n\n\nWhen a monitoring report is validated, key metrics and metadata are hashed and recorded in a Cardano smart contract, creating a tamper-proof Proof of Restoration event linked to the project, plot and date.\n\n\n\nThis replaces spreadsheet-based monitoring with automated analytics, reduces verification costs and provides funders, registries and the Cardano community with independently verifiable evidence of ecological impact.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"MangroveLens positions Cardano as a backbone for real-world climate and biodiversity action. \n\nIt gives the community a live example where network transactions represent verified restoration events, not just financial trades.\n\n\n\nThe project delivers a reusable Proof of Restoration contract pattern, open ecological analysis components and anonymised datasets that other builders can fork or extend for forests, wetlands or regenerative agriculture.\n\n\n\nWe will engage Cardano Impact, Cardano Africa and other community groups with testnet demos, feedback sessions and transparent reporting. This will seed collaborations with impact funds, NGOs and DeFi builders, leading to new nature-based applications and sustained on-chain activity.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Bôndy has run large-scale restoration and agroforestry programmes since 2019, managing millions of trees and long-term partnerships with NGOs, scientists and communities.\n\nIn 2022 we co-developed with Omdena a Machine Learning dashboard for reforestation monitoring, including vegetation indices, segmentation models and a dockerised web app; the code and data pipelines are stored in a public DagsHub repository.\n\nThis provides a strong technical foundation for MangroveLens.\n\nOur team now includes a dedicated CIO for data architecture, two GIS and remote-sensing specialists, a sustainability and certification expert, and ZenGate Global as our blockchain and infrastructure engineering partner.\n\nWe will validate feasibility through three phases:\n\n\n\n1.\tarchitecture and data pipeline set-up;\n\n\n\n2.\tAI models and dashboard integrated with plot-level data;\n\n\n\n3.\twith ZenGate, deployment of the solution on Cardano testnet, anchoring key monitoring indicators on-chain, and running a field pilot on a selected mangrove area.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project setup and technical & data architecture defined","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Core team contracted; governance, risk and reporting processes defined. System architecture and data-flow diagrams produced, covering AI pipeline, geospatial database, backend, frontend and Cardano contracts. First test dataset (one mangrove site) ingested into a development database.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Architecture document reviewed and approved by the project lead and core technical team, including data flows, component responsibilities, and Cardano integration points. A tagged version of this document is stored in the shared.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Link to PDF.\n\n\n\nNotes: Documents and links will be hosted on a public Notion page. We may additionally consider providing the evidence in other mediums to facilitate milestone reviewer access, but this shall not be the basis of a milestone rejection unless the reviewer is unable to access the page.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":23000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Data pipeline and baseline AI models for mangrove monitoring","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Operational ETL pipeline for drone and satellite imagery and field data. Baseline computer-vision models trained for mangrove segmentation, seedling detection and canopy/NDVI analysis, integrated into the pipeline. Evaluation report with metrics and recommended improvements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Pipeline can process all datasets from at least two mangrove sites end-to-end. Models reach minimum agreed performance (around 85% precision/recall) on validation data and indicators are stored in the database.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Link to PDF.\n\nNotes: Documents and links will be hosted on a public Notion page. We may additionally consider providing the evidence in other mediums to facilitate milestone reviewer access, but this shall not be the basis of a milestone rejection unless the reviewer is unable to access the page.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Web dashboard beta for restoration teams","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Functional web dashboard with login, plot selection on a map, time-series charts of key indicators and basic report export. \n2. Role-based access implemented for at least two partner organisations. User testing sessions run and priority UX issues fixed.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. At least two pilot users from partner organisations can use the dashboard to review their plots with assistance. \n2. Bug list and UX issues tracked and resolved for the initial beta.\n\nThe version will be entirely in French or in English.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Public or password-protected URL of the beta dashboard.\n2. Link to a PDF\n\nPlease note that the dashboard will not be responsive at this stage and must be opened from a recent desktop or laptop computer.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":60000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cardano testnet integration and field pilot","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Smart contracts deployed on Cardano testnet implementing the Proof of Restoration record. \n2. Backend integrated so that validated monitoring reports are hashed and submitted on-chain. \n3. Pilot with at least two mangrove projects generating on-chain proofs through the dashboard.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Minimum of 200 Proof of Restoration transactions created on Cardano testnet across multiple plots and monitoring cycles. \n2. Contracts and APIs documented and reviewed, with no critical security issues outstanding.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Testnet contract addresses and example transaction IDs\n2. Link to a PDF.\n\nNotes: Documents and links will be hosted on a public Notion page. We may additionally consider providing the evidence in other mediums to facilitate milestone reviewer access, but this shall not be the basis of a milestone rejection unless the reviewer is unable to access the page.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":11,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":45000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":" Project Close-out","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Hardened, production-ready codebase with resolved issues from the pilot and a clear mainnet deployment plan\n\n\n\n2. Promotional content produced for the tool\n\n\n\n3. Project Close-out Report and Project Close-out Video submitted created","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. The tool is fully deployed on the Cardano mainnet with no know bugs.\n\n\n\n2. Communication materials, including case studies, social media content \n\n\n\n3. Final closeout report is publicly available and final closeout video is publicly available","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Link to the prototype tools \n\n\n\n2. Link to social media contents & case studies\n\n\n\n3. Link to final closeout report & link to final closeout video","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":22000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Nelson Maillard – Bôndy – Project Lead\n\n[https://www\\.linkedin\\.com/in/nelson\\-maillard\\-a7723b150](https://www.linkedin.com/in/nelson-maillard-a7723b150%EF%BF%BC)\n\nSkills: Strategic leadership, environmental project management, stakeholder engagement, partnership building, blockchain integration strategy.\n\nRole: Leads the overall project, ensuring alignment with objectives, budget, and timelines. Coordinates technical, scientific, and blockchain teams, and drives engagement with NGOs, researchers, and Cardano ecosystem partners.\n\n⸻\n\nZoninra Ramahaimandimby – Bôndy – Chief Information Officer\n\n[https://www\\.linkedin\\.com/in/zoninra\\-ramahaimandimby\\-bb462b129/](https://www.linkedin.com/in/zoninra-ramahaimandimby-bb462b129/%EF%BF%BC)\n\nSkills: Hydrology, environmental monitoring, data systems architecture, geomatics, integration of earth observation technologies.\n\nRole: Designs the project’s data architecture and oversees integration between the registry, blockchain infrastructure, and open-data interfaces. Ensures interoperability, data security, and compliance with environmental monitoring standards.\n\n⸻\n\nAndrianina Razafimbelo – Bôndy – GIS &amp; Remote Sensing Specialist\n\n[https://www\\.linkedin\\.com/in/andrianina\\-razafimbelo\\-0aa704169](https://www.linkedin.com/in/andrianina-razafimbelo-0aa704169%EF%BF%BC)\n\nSkills: Geospatial data analysis, remote sensing, ecological mapping, forestry, environmental monitoring.\n\nRole: Leads the acquisition, processing, and classification of high-resolution satellite and drone imagery. Delivers ecological categorisation of plots and prepares structured geospatial datasets to support analysis and digital asset creation.\n\n⸻\n\nManda Rafalimanana – Bôndy – GIS &amp; Cartography Officer\n\n[https://www\\.linkedin\\.com/in/manda\\-rafalimanana\\-866715259](https://www.linkedin.com/in/manda-rafalimanana-866715259%EF%BF%BC)\n\nSkills: Database management, cartography, land-use planning, geospatial data accessibility.\n\nRole: Manages the project’s geospatial database, ensuring accurate geolocation, mapping consistency, and reliable data access. Oversees map production for both the public interface and scientific stakeholders.\n\n⸻\n\nAlban Bonnet-Casson – Bôndy – Supply Chain &amp; Sustainability Expert\n\n[https://www\\.linkedin\\.com/in/alban\\-bonnet\\-casson\\-113466102/?originalSubdomain=mg](https://www.linkedin.com/in/alban-bonnet-casson-113466102/?originalSubdomain=mg%EF%BF%BC)\n\nSkills: Sustainable sourcing, certification standards (UEBT, Rainforest Alliance, organic, Fairtrade), traceability systems, program design.\n\nRole: Provides expertise on tracability pathways and monitoring design. Ensures alignment with international standards for restoration projects and supports partners in meeting compliance requirements.\n\n⸻\n\nLalao Aigrette – Bôndy – Blue Carbon &amp; Social-Ecological Research Lead\n\n[https://www\\.linkedin\\.com/in/lalao\\-aigrette\\-40868052](https://www.linkedin.com/in/lalao-aigrette-40868052)\n\nSkills: Mangrove ecology, blue carbon and blue economy, social-ecological systems, gender and natural resource governance, impact evaluation, scientific publishing.\n\nRole: Leads research at the interface of mangrove restoration, blue-carbon accounting and community livelihoods. Integrates ecological data into project design and MRV, advises on how restoration generates resilient blue-economy opportunities, and co-authors peer-reviewed studies that validate the project’s carbon and biodiversity outcomes.\n\n⸻\n\nZenGate Global – Technology Partner (Palmyra Ecosystem)\n\n[https://palmyraecosystem\\.io](https://palmyraecosystem.io)\n\n\n\nSkills: Cardano-based blockchain architecture, smart contract and token/NFT standards, backend & API development, data integration with Palmyra, DevOps and platform security, production-grade infrastructure.\n\n\n\nRole: Co-designs and builds the blockchain and integration layer for MangroveLens, defining data and asset models, anchoring monitoring outputs on-chain, connecting to wallets and dashboards, and ensuring the tool is secure, scalable, and ready for real-world deployment.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"• 51,000 ADA – AI and data engineering: model refinement, training, evaluation, and maintenance of the ETL/geodatabase pipeline.\n\n\n\n• 43,000 ADA – Blockchain and backend: Plutus contracts, APIs, security reviews, testnet deployment and performance tuning.\n\n\n\n• 33,000 ADA – Frontend and UX: web dashboard, maps, wallet integration, field-app components, accessibility and user testing.\n\n\n\n• 38,000 ADA – Field pilot and scientific support: partner coordination, data acquisition, validation campaigns, travel and workshops.\n\n\n\n• 25,000 ADA – Project management, accounting, legal and community engagement: coordination, reporting to Catalyst, legal review and ecosystem outreach.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project turns 190,000 ADA into a reusable MRV infrastructure for many future nature-based solutions on Cardano. Since we are building on an existing prototype developed with Omdena and on a codebase already available on DagsHub, Catalyst funds are mainly devoted to engineering a robust, Cardano-native implementation and data processing rather than preliminary research.\n\nThe resulting AI pipelines, geospatial database design and “Proof of Restoration” smart contract pattern can be reused by other teams, reducing duplication and accelerating the launch of new climate projects. By enabling verifiable restoration records that can back carbon credits, impact tokens or green lending, MangroveLens can unlock much larger volumes of capital and long-term on-chain activity far beyond the cost of the prototype itself.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Environment","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1755}