{"pr_id":"019aac11-ec28-7744-b34a-c03e1c2c7b0d","title":"UrbanLink: Cardano-Powered EV Carpool for Urban Mobility","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Accra’s daily commuters face severe traffic congestion, long travel times, and rising transport costs, worsened by unreliable and poorly coordinated transport systems","solution":"Build a reliable EV carpool system with scheduled routes, coordinated pickups, and transparent operations powered by Cardano blockchain to cut commute time, cost, and congestion in Accra.","proposer_name":"Ekow Harding","proposer_relevant_experience":"1. Ekow Harding - Project Lead\n\nI am a UI/UX Designer. Find some projects [here](https://docs.google.com/document/d/1tBmdWSa67FWhVmU7ETF4MNa8NJIR_LhX_gzwYkg-8M4/edit?tab=t.0).\n\nA year’s direct experience in the transport sector as a driver with Bolt Ghana. Find [here](https://docs.google.com/document/d/1tBmdWSa67FWhVmU7ETF4MNa8NJIR_LhX_gzwYkg-8M4/edit?tab=t.0)\n\nLead Proposer and Project Manager. Funded Proposer in [Fund13](https://projectcatalyst.io/funds/13/cardano-open-ecosystem/empowering-ghanaian-youths-through-cardano-blockchain-aiesec-collaboration-for-awareness-and-adoption).\n\nFunded Co - Proposer in Fund10. We have successfully completed project and closed out both projects.\n\nAlternate for Accra, Ghana during Cardano Constitutional Convention. Community\n\nReviewer for Fund 8 to Fund14.\n\nContact: [Telegram](https://t.me/mrharding), [instagram](https://www.instagram.com/_mr.harding/?igsh=MWozZHh3cnBmNmZwYQ%3D%3D&utm_source=qr#), [LinkedIn](https://www.linkedin.com/in/ekowharding/), [Twitter/X](https://x.com/mrharding3?s=21&t=66NR-0KRGwC5HmE9Go5g8g)\n\n\n\n2. Essiel Justice – Blockchain Developer\n\nBrings 5+ years of hands-on experience in smart contracts development and zero knowledge, decentralized applications, and grassroots blockchain advocacy in Africa throught the Graph\n\nProtocol and Graph Africa.\n\nHe is also ZK certified by Encode Club:\n\n[https://opensea\\.io/item/matic/0xdBf2138593aeC61d55d86E80b8ed86D7b9ba51F5/11509](https://opensea.io/item/matic/0xdBf2138593aeC61d55d86E80b8ed86D7b9ba51F5/11509)\n\nSome Zk Projects done By Justice include Tornado Cash Clone:[https://youtu\\.be/gpb7lnYP9X8](https://youtu.be/gpb7lnYP9X8)\n\ngihub of clone of Tornado :[https://github\\.com/JUSTICEESSIELP/zkMixerWithSubgraph](https://github.com/JUSTICEESSIELP/zkMixerWithSubgraph)\n\n[https://github\\.com/JUSTICEESSIELP/zkSnarkProject](https://github.com/JUSTICEESSIELP/zkSnarkProject)\n\n[https://www\\.linkedin\\.com/in/essiel\\-justice/](https://www.linkedin.com/in/essiel-justice/)\n\n\n\n3. Brahim Malek – Software Engineer\n\nExpertise in TypeScript, Next.js, Golang, and serverless cloud computing. Passionate about\n\nmerging cutting-edge technology with clean, maintainable code, I thrive in collaborative teams to\n\ndeliver innovative solutions that solve complex problems. He lead the implementation of the api\n\nfor the zk validity rollup we built\n\n[https://github\\.com/MegaBytee](https://github.com/MegaBytee)\n\n\n\n4. Richmond Sabah - Operations and Community Manager\n\nAccountant. Active member of Cardano Ecosystem; CA for Fund 7, 8; PA for Fund 9.\n\nReviewer for Fund 10,11,12 and challenge team member. Hence, has knowledge in catalyst proposal planning and executions. Presenter and media platform cordination role.\n\nContact: richmondsabah09@gmail.com , telegram [https://t\\.me/Kofi0\\_0;](https://t.me/Kofi0_0;) twitter/x @sabah_kofi\n\n\n\n5. Mago Motors Ghana\n\nMago Motors Ghana is a strategic partner in UrbanLink, bringing operational expertise, innovative EV technology, and local transportation experience to the project. At Mago, the team is redefining transportation in Ghana with a vision to make urban and intercity travel smarter, cleaner, and more accessible. Their state-of-the-art electric smart buses are central to the pilot, providing reliable, eco-friendly 10-seater vehicles for all scheduled trips.\n\n[https://magomotorsghana\\.com/Ev\\.html](https://magomotorsghana.com/Ev.html)","url":null,"funds":165600,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"UrbanLink: Cardano-Powered EV Carpool for Urban Mobility","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Ekow Harding","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":165600,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Accra’s daily commuters face severe traffic congestion, long travel times, and rising transport costs, worsened by unreliable and poorly coordinated transport systems","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Build a reliable EV carpool system with scheduled routes, coordinated pickups, and transparent operations powered by Cardano blockchain to cut commute time, cost, and congestion in Accra.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://github.com/JUSTICEESSIELP/","https://github.com/MegaBytee","https://www.figma.com/proto/7yMjQMgLS192OTu2L3Leez/UrbanLink?node-id=0-1&p=f&t=i5y8swnA1YqkqDR6-0&scaling=scale-down&content-scaling=fixed&starting-point-node-id=14%3A849","https://magomotorsghana.com/Ev.html","https://drive.google.com/drive/folders/156dgh_fr691srl88BDjogdMF6I-1ZXvL?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Mago Motors Ghana. They will provide the EV buses required for the operational pilot. They supply a 10-seater EV bus for scheduled rides, ensuring reliable transport capacity. Additionally, Mago Motors Ghana supports logistics coordination for the pilot, including driver availability, bus maintenance, and operational safety throughout the pilot phase.  The company is affiliated with Mago Motors Japan, strengthening the credibility and technical backing behind the buses and services provided. Their partnership in this project is formalized through a signed Memorandum of Understanding (MoU), which secures commitment and clearly outlines responsibilities.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"UrbanLink will provide open-source API documentation and smart contract templates for the Cardano community. \nThe mobile application itself will remain proprietary during the pilot phase but may be partially opened later to allow developers to build on backend integrations and core features.\nLicense: MIT License\nScope: API documentation and smart contracts available for replication and improvement by the community.\n","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Marketplace","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"UrbanLink is innovative because it combines scheduled EV carpooling, fiat payments, and blockchain-backed trip and reputation logging — a combination not previously offered in Accra. Traditional buses are cheap but overcrowded, slow, and unreliable, while ride-hailing apps often lack transparency, predictability, and trust mechanisms. UrbanLink addresses these gaps by:\n\n- Scheduled Rides: Unlike on-demand apps, commuters can rely on predictable pick-up and drop-off times, reducing uncertainty and wait times.\n- EV Integration: Environmentally friendly vehicles reduce emissions and offer a more comfortable ride than conventional minibuses.\n- Blockchain Transparency: Using Cardano, all trips and reputations are recorded immutably, fostering trust between riders and drivers.\n- Local Adaptation: Payments start in fiat to accommodate users unfamiliar with crypto, but are logged in ADA equivalents on the backend, bridging traditional finance and blockchain.\n- Validated Demand: We conducted a market research survey with over 1,000 respondents, all employees from more than 20 different companies across Accra, and the results show a strong demand, confirming both usability and scalability potential. Find survey results [here](https://drive.google.com/drive/folders/156dgh_fr691srl88BDjogdMF6I-1ZXvL?usp=sharing).\n\nThis approach uniquely merges tech, sustainability, trust, and local usability, creating a solution tailored for Accra’s commuting challenges rather than replicating existing models.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The UrbanLink MVP will demonstrate a fully functional scheduled EV carpool platform for Accra, showcasing:\n\n- Trip Requests &amp; Scheduling: Riders create and schedule trips, specifying pick-up and drop-off locations and preferred times.\n- Payments: Passengers pay in fiat, with backend logging of ADA-equivalent values on the Cardano blockchain.\n- Decentralized Identity (DID): Drivers, riders, and EV buses are all registered with DIDs, ensuring trust, accountability, and verifiable participation.\n- Reputation System: Blockchain-backed ratings record and display reliability and feedback for drivers, riders, and buses.\n- Operational Pilot: Real-world deployment with 100 active users completing 200 rides, using EV 10-seater buses provided by Mago Motors, all registered with DIDs for transparency.\n\nThe MVP will be accessible via mobile dApp during the pilot phase and deployed on the Cardano testnet for smart contract testing, backend logging, and reputation tracking. Screenshots, demo videos, and analytics reports will be shared with assessors and the Cardano community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"1. User Engagement:\n\n- Target: 100 active riders participating in the operational pilot.\n- On-chain metric: Number of unique rider DIDs interacting with the platform.\n\n\n\n2. Trip Volume:\n\n- Target: 200 completed rides during the pilot.\n- On-chain metric: Smart contract logs of trip creation, bookings, and completions recorded on Cardano.\n\n\n\n3. Payment Transparency:\n\n- Target: All ride payments logged accurately in ADA-equivalent values on the backend.\n- On-chain metric: Number of transactions recorded, showing correct fiat-to-ADA mapping.\n\n\n\n4. Reputation System:\n\n- Target: At least 80% of users submit ratings after rides.\n- On-chain metric: Blockchain records of user feedback and ratings, associated with rider, driver, and bus DIDs.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"UrbanLink is a scheduled EV carpool platform designed to address the inefficiencies, unreliability, and stress of daily commuting in Accra.\n\nTraditional transport is often overcrowded, slow, and unpredictable, forcing commuters to spend excessive time and money while enduring uncomfortable rides. UrbanLink’s solution integrates technology, sustainability, and trust mechanisms to solve these challenges:\n\n- Scheduled Rides:\n\nUnlike traditional buses that stop at every bus stop, UrbanLink allows riders to create and schedule trips in advance via a mobile dApp. This ensures that trips run on predictable timelines, reducing uncertainty, waiting times, and travel-related stress. Drivers do not create trips; instead, they provide the vehicles and act as verified operators, which simplifies operations and ensures safety.\n\n- Electric Vehicle Integration:\n\nUrbanLink exclusively uses EV 10-seater buses provided by Mago Motors for the pilot program. EVs provide a comfortable, eco-friendly alternative to traditional minibuses while maintaining operational reliability. Each bus is registered with a Decentralized Identity (DID), allowing riders and the community to verify the vehicle and driver, enhancing trust.\n\n- Payment System:\n\nTo accommodate users unfamiliar with crypto, UrbanLink accepts fiat payments during the pilot. These payments are logged in ADA-equivalent values on the Cardano backend, creating immutable, blockchain-based transaction records without requiring riders to directly hold or use ADA. This approach bridges traditional finance with blockchain transparency, building confidence in Cardano-enabled applications.\n\n- Decentralized Identity (DID):\n\nDrivers, riders, and buses are all registered with DIDs, which provides a trustable, verifiable digital identity. This prevents misuse, ensures accountability, and allows for secure, verifiable interactions between participants, addressing trust issues common in traditional transport.\n\n- Reputation System:\n\nUrbanLink integrates a blockchain-backed reputation system that records ratings and feedback for drivers, riders, and buses. This creates accountability, encourages responsible behavior, and allows participants to make informed decisions when booking rides. Unlike informal systems, the on-chain nature ensures that reputations are tamper-proof and transparent.\n\n- Operational Pilot:\n\nThe pilot program is designed for 100 active users completing 200 rides. The MVP will demonstrate real-world usability, operational reliability, and the effectiveness of the reputation system and backend logging. By validating the platform in a controlled environment, UrbanLink can gather user feedback, refine processes, and prepare for scalable deployment.\n\n- Blockchain Integration &amp; Transparency:\n\nAll relevant data — trip requests, bookings, payments (ADA equivalents), and reputations — are recorded on the Cardano blockchain via smart contracts. This ensures transparency, traceability, and auditability, directly addressing the problem of opaque or unreliable transport systems.\n\n- Evidence-Based Design:\n\nUrbanLink’s development is informed by 1,000+ survey responses, showing that more than 95% of respondents are open to a structured carpooling alternative. \n\nThis data validates both demand and usability, ensuring that the solution is grounded in real commuter needs. These respondents are employees from more than 20 different companies across Accra. Find market research survey results [here](https://drive.google.com/drive/folders/156dgh_fr691srl88BDjogdMF6I-1ZXvL?usp=sharing).","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"UrbanLink is designed not only to solve commuting challenges in Accra but also to showcase the practical utility, scalability, and social relevance of Cardano in real-world applications. The positive impact on the wider Cardano community can be seen across several dimensions:\n\n- Demonstrating Real-World Utility:\n\nUrbanLink bridges traditional finance and blockchain by allowing riders to pay in fiat while logging ADA-equivalent values on Cardano. This provides a practical example of Cardano’s use in everyday transactions, showing how blockchain can support large-scale, real-world operations even in regions where crypto adoption is still emerging.\n\n- On-Chain Data for Ecosystem Insights:\n\nAll interactions — trip requests, bookings, payments, and reputations — are recorded immutably on Cardano. This generates valuable on-chain data that developers, researchers, and other projects can use to understand usage patterns, smart contract performance, and user behavior. These insights can inform future dApp development, system optimizations, and ecosystem scaling strategies.\n\n- Enhanced Trust and Transparency:\n\nBy integrating DID-based identities for drivers, riders, and buses and recording reputations on-chain, UrbanLink strengthens trust in blockchain systems. This demonstrates the potential of decentralized identity and blockchain verification in public-facing applications, inspiring confidence in other Cardano-based projects.\n\n- Showcasing Scalable Smart Contract Applications:\n\nUrbanLink will deploy smart contracts to handle trip booking, payments, and reputation tracking. The operational pilot will demonstrate how smart contracts can manage real-world, high-frequency transactions reliably, serving as a template for other use cases and encouraging developers to explore Cardano’s technical capabilities.\n\n- Driving Community Engagement and Adoption:\n\nThrough the pilot, UrbanLink will engage 100 active users and collect extensive feedback, creating an early community of participants who interact with Cardano-enabled systems without prior crypto experience. This represents organic onboarding of new users, increasing familiarity and trust with Cardano technologies.\n\n- Providing a Blueprint for Social Impact dApps:\n\nUrbanLink demonstrates how Cardano can be leveraged for socially impactful applications—in this case, improving transportation efficiency, reducing commuting stress, and offering environmentally friendly EV rides. This positions Cardano as a blockchain capable of solving real societal problems, attracting both developers and impact-oriented investors to the ecosystem.\n\n- Catalyzing Future Projects:\n\nThe insights, data, and operational knowledge gained from UrbanLink will inform future Funding rounds and other Cardano initiatives, offering a tested model for combining blockchain transparency, decentralized identity, and real-world logistics. This creates a ripple effect, strengthening the Cardano ecosystem’s maturity and credibility.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"1. Capability to Deliver with Trust and Accountability:\n\nUrbanLink is led by a team with a proven track record in business development, project management, and blockchain integration. The team has successfully:\n\n- Conducted market research survey with 1,000+ respondents, who are employees from over 20 companies across Accra, to validate commuter demand, demonstrating strong research and community engagement skills. Over 95% are open to a structured carpooling alternative as that proposed by UrbanLink. Find survey details [here](https://drive.google.com/drive/folders/156dgh_fr691srl88BDjogdMF6I-1ZXvL?usp=sharing).\n- Established a formal partnership with Mago Motors, backed by a signed [MoU](https://drive.google.com/drive/folders/156dgh_fr691srl88BDjogdMF6I-1ZXvL?usp=sharing), ensuring operational reliability and accountability for vehicle supply and driver coordination.\n- Managed prior projects integrating technology solutions for real-world applications, demonstrating competence in coordinating complex processes and ensuring timely delivery.\n- Built trust through transparent communication and rigorous documentation at every stage, ensuring stakeholders,including users, drivers, and the Cardano community, are consistently informed and engaged.\n1. Approach to Validate Feasibility:\n\nUrbanLink’s feasibility will be validated through multiple mechanisms:\n\n- Operational Pilot: Deploying the MVP with 100 active users completing 200 rides provides real-world validation of system reliability, usability, and rider adoption.\n- Blockchain Logging: All trip interactions, payments, and reputations will be logged on Cardano, allowing the team to monitor and validate transaction integrity, smart contract performance, and data accuracy.\n- User Feedback: Structured surveys and feedback collection during the pilot will provide actionable insights on platform usability, trust, and satisfaction.\n- Technical Testing: Comprehensive internal testing of smart contracts, backend integration, and DID functionality will ensure operational readiness and scalability.\n- Data-Driven Decision Making: On-chain metrics, transaction logs, and pilot analytics will provide empirical evidence of the platform’s effectiveness and the feasibility of scaling UrbanLink beyond the pilot.\n\nTogether, these measures ensure high levels of trust, accountability, and verifiable feasibility, demonstrating to both the Cardano community and potential investors that UrbanLink can deliver a reliable, impactful, and blockchain-enabled urban mobility solution.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Platform Architecture, API Documentation, and UI Wireframes","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Design a scalable backend architecture using FastAPI/Django to manage seamless communication between user-facing applications, smart contracts, and Cardano blockchain, ensuring high performance and future scalability.\n- Produce complete API documentation detailing endpoints, authentication, data structures, and blockchain integration for smooth developer implementation and long-term maintainability.\n- Create detailed UI wireframes in Figma illustrating rider-driven trip creation, booking flows, payment interfaces, and DID verification, optimized for web and mobile user experience.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Backend architecture is fully defined, optimized, and reviewed for scalability, maintainability, and performance.\n- API documentation covers all integration points, validated by technical reviewers.\n- UI wireframes demonstrate all key workflows including trip creation, booking, payments, and DID authentication, approved for development","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- GitHub or shared links for backend architecture and API documentation.\n- Figma wireframes or shareable links showing workflow designs for web and mobile platforms.\n- Completed developer requirement sheets detailing all features and interactions","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":31000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Smart Contract Development and Testing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Develop smart contracts to manage trip bookings, payment escrows, and trip completion verification, ensuring transparency and trust between riders and drivers.\n- Conduct thorough unit testing and security audits on smart contracts to confirm correctness, reliability, and secure blockchain operations.\n- Peer reviews and internal audits to ensure smart contracts meet technical and security standards, and implement feedback for optimization.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Smart contracts deployed on Cardano testnet using tADA and function correctly for bookings, payments, and completion verification.\n- Unit tests validate functional correctness, security, and error handling.\n- Peer review reports confirm compliance with technical specifications and project requirements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Testnet transaction logs demonstrating successful execution of trips, payments, and completion agreements.\n- Unit testing documentation with methodology, scenarios, results, and resolution logs.\n- Peer review feedback and enhancement documentation for smart contracts.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":31000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"MVP Development (Mobile dApp)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Integrate smart contracts, DID authentication, and blockchain reputation system into an MVP, allowing riders to create trips, book rides, and interact with a transparent feedback system.\n- Build responsive web and mobile applications that enable users to book rides, make payments, and view reputation scores efficiently.\n- Conduct internal testing of the MVP for functionality, usability, integration, and cross-platform performance.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- MVP deployed on Cardano testnet supporting full workflows for riders: trip creation, booking, payment, and reputation interactions.\n- Internal testing confirms usability, reliability, and performance across platforms, with issues documented and resolved.\n- Smart contract execution and DID authentication operate without errors and meet performance benchmarks.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Demo videos or screenshots of MVP workflows.\n- Internal testing reports including scenarios, results, issues resolved, and user feedback.\n- Demonstration of blockchain interactions and DID verification in the MVP","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":31000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Operational Pilot & User Feedback","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Launch pilot program with 100 active users completing 200 rides using EV 10-seater buses from Mago Motors, each bus registered with a DID for trust and verification.\n- Collect structured user feedback on usability, payment reliability, and reputation system functionality.\n- Track real-world system performance, including booking efficiency, transaction success, and platform uptime.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 100 active participants complete 200 rides successfully.\n- ≥75% of participants provide structured feedback covering usability, payment experience, and reputation system.\n- System meets benchmarks: ≥95% transaction success, ≤5 min booking time","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- User feedback surveys and interview summaries.\n- Analytics reports showing trip completions, payments, and performance metrics.\n- Media (photos/videos) documenting pilot usage and platform interactions.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Closeout, Launch, and Expansion","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Expand platform adoption post-pilot, increasing user base and completed rides.\n- Implement ADA loyalty/reward system to incentivize repeat usage and active participation.\n- Integrate pilot feedback to optimize platform usability, performance, and stability.\n- Execute marketing campaigns to increase awareness and accelerate adoption.\n- Produce final closeout report and video documenting outcomes, lessons, and impact.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- All prior milestones approved by milestone reviewers.\n- Closeout report and video approved and published to the Cardano community.\n- Increased adoption, usage metrics, and functioning loyalty/rewards system","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Analytics reports showing active user growth and ride completions.\n- Transaction logs demonstrating ADA rewards usage.\n- Marketing campaign metrics and assets showing outreach and engagement.\n- Final closeout report and video shared publicly.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15600,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"1. Ekow Harding - Project Lead\n\nI am a UI/UX Designer. Find some projects [here](https://docs.google.com/document/d/1tBmdWSa67FWhVmU7ETF4MNa8NJIR_LhX_gzwYkg-8M4/edit?tab=t.0).\n\nA year’s direct experience in the transport sector as a driver with Bolt Ghana. Find [here](https://docs.google.com/document/d/1tBmdWSa67FWhVmU7ETF4MNa8NJIR_LhX_gzwYkg-8M4/edit?tab=t.0)\n\nLead Proposer and Project Manager. Funded Proposer in [Fund13](https://projectcatalyst.io/funds/13/cardano-open-ecosystem/empowering-ghanaian-youths-through-cardano-blockchain-aiesec-collaboration-for-awareness-and-adoption).\n\nFunded Co - Proposer in Fund10. We have successfully completed project and closed out both projects.\n\nAlternate for Accra, Ghana during Cardano Constitutional Convention. Community\n\nReviewer for Fund 8 to Fund14.\n\nContact: [Telegram](https://t.me/mrharding), [instagram](https://www.instagram.com/_mr.harding/?igsh=MWozZHh3cnBmNmZwYQ%3D%3D&utm_source=qr#), [LinkedIn](https://www.linkedin.com/in/ekowharding/), [Twitter/X](https://x.com/mrharding3?s=21&t=66NR-0KRGwC5HmE9Go5g8g)\n\n\n\n2. Essiel Justice – Blockchain Developer\n\nBrings 5+ years of hands-on experience in smart contracts development and zero knowledge, decentralized applications, and grassroots blockchain advocacy in Africa throught the Graph\n\nProtocol and Graph Africa.\n\nHe is also ZK certified by Encode Club:\n\n[https://opensea\\.io/item/matic/0xdBf2138593aeC61d55d86E80b8ed86D7b9ba51F5/11509](https://opensea.io/item/matic/0xdBf2138593aeC61d55d86E80b8ed86D7b9ba51F5/11509)\n\nSome Zk Projects done By Justice include Tornado Cash Clone:[https://youtu\\.be/gpb7lnYP9X8](https://youtu.be/gpb7lnYP9X8)\n\ngihub of clone of Tornado :[https://github\\.com/JUSTICEESSIELP/zkMixerWithSubgraph](https://github.com/JUSTICEESSIELP/zkMixerWithSubgraph)\n\n[https://github\\.com/JUSTICEESSIELP/zkSnarkProject](https://github.com/JUSTICEESSIELP/zkSnarkProject)\n\n[https://www\\.linkedin\\.com/in/essiel\\-justice/](https://www.linkedin.com/in/essiel-justice/)\n\n\n\n3. Brahim Malek – Software Engineer\n\nExpertise in TypeScript, Next.js, Golang, and serverless cloud computing. Passionate about\n\nmerging cutting-edge technology with clean, maintainable code, I thrive in collaborative teams to\n\ndeliver innovative solutions that solve complex problems. He lead the implementation of the api\n\nfor the zk validity rollup we built\n\n[https://github\\.com/MegaBytee](https://github.com/MegaBytee)\n\n\n\n4. Richmond Sabah - Operations and Community Manager\n\nAccountant. Active member of Cardano Ecosystem; CA for Fund 7, 8; PA for Fund 9.\n\nReviewer for Fund 10,11,12 and challenge team member. Hence, has knowledge in catalyst proposal planning and executions. Presenter and media platform cordination role.\n\nContact: richmondsabah09@gmail.com , telegram [https://t\\.me/Kofi0\\_0;](https://t.me/Kofi0_0;) twitter/x @sabah_kofi\n\n\n\n5. Mago Motors Ghana\n\nMago Motors Ghana is a strategic partner in UrbanLink, bringing operational expertise, innovative EV technology, and local transportation experience to the project. At Mago, the team is redefining transportation in Ghana with a vision to make urban and intercity travel smarter, cleaner, and more accessible. Their state-of-the-art electric smart buses are central to the pilot, providing reliable, eco-friendly 10-seater vehicles for all scheduled trips.\n\n[https://magomotorsghana\\.com/Ev\\.html](https://magomotorsghana.com/Ev.html)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"1. Platform Architecture, API Documentation, and UI Wireframes – 17,000 ADA\n\n- Backend Architecture &amp; Database Design: 7,000 ADA\n- API Design &amp; Documentation: 5,000 ADA\n- UI/UX Wireframes (Figma): 3,500 ADA\n- Project Management &amp; Coordination: 1,500 ADA\n\n\n\n\n\n2. Smart Contract Development and Testing – 28,000 ADA\n\n- Smart Contract Coding (Booking, Payments, Reputation): 15,000 ADA\n- Unit Testing &amp; QA: 6,000 ADA\n- Peer Reviews &amp; Security Audits: 5,000 ADA\n- Documentation &amp; Technical Review: 2,000 ADA\n\n\n\n\n\n3. Minimum Viable Product (MVP) Development – 30,000 ADA\n\n- Frontend Development (Mobile dApp): 12,000 ADA\n- Backend Integration &amp; API Implementation: 10,000 ADA\n- Blockchain Integration (Wallets, ADA Logging, Reputation System): 5,000 ADA\n- DevOps &amp; Cloud Setup / Project Coordination: 3,000 ADA\n\n\n\n\n\n4. Operational Pilot &amp; User Feedback – 50,500 ADA\n\n- Vehicle Operations (4 EV 10-seater buses, Drivers, Logistics)\n- User Onboarding &amp; Support\n- Monitoring &amp; Data Collection Tools\n- Feedback Gathering &amp; Analysis\n\n\n\n\n\n5. Closeout, Launch, and Expansion – 35,100 ADA\n\n- Loyalty &amp; Rewards System Development: 10,000 ADA\n- Marketing &amp; Promotional Campaign: 12,000 ADA\n- Platform Optimizations &amp; Bug Fixes: 8,000 ADA\n- Final Reporting &amp; Closeout Video Production: 5,100 ADA\n\n\n\n\n\n6. Contingency – 10,000 ADA\n\n- Reserved for unexpected operational costs, inflation, or other unforeseen expenses.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The total budget of 155,600 ADA represents exceptional value for the Cardano ecosystem because every expense is directly tied to creating tangible on-chain utility, real-world impact, and ecosystem adoption.\n\n\n\n- Practical On-Chain Use Cases\n\nEvery trip, booking, payment, and reputation record is logged on the Cardano blockchain, demonstrating smart contract functionality and DID integration in a real-world scenario.\n\nThis provides measurable, verifiable blockchain activity that can serve as reference data for other projects, developers, and researchers in the ecosystem.\n\n\n\n- Pilot-Driven Validation:\n\nThe operational pilot engages 100 active users completing 200 rides with EV buses.\n\nThis validates system reliability, smart contract performance, and user experience in a controlled but real-world environment, reducing risks for future deployments.\n\n\n\n- Scalable, Reusable Components:\n\nThe platform architecture, smart contracts, APIs, and UI wireframes will be documented and potentially open-sourced, providing reusable building blocks for other dApps, reducing future development costs for the Cardano community.\n\n\n\n- Bridging Traditional Finance and Blockchain:\n\nBy starting with fiat payments logged as ADA equivalents, UrbanLink encourages adoption by users unfamiliar with crypto while still building on-chain activity.\n\nThis lowers barriers for Cardano adoption, broadening the ecosystem’s user base without compromising blockchain benefits.\n\n\n\n- Sustainable Mobility Integration:\n\nUsing EV buses with DIDs combines environmental sustainability with blockchain transparency.\n\nThis showcases Cardano’s capability to support socially impactful, real-world initiatives, attracting attention from developers, investors, and communities worldwide.\n\n\n\n- Risk Mitigation and Contingency Planning:\n\nThe inclusion of a 10,000 ADA contingency ensures that unforeseen costs or inflation do not disrupt milestone delivery, demonstrating prudent financial management and accountability.\n\n\n\nThe allocation ensures that every ADA contributes to technical innovation, operational validation, ecosystem engagement, and measurable impact, maximizing value for the Cardano community while providing a scalable model for future blockchain-enabled urban mobility solutions.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Marketplace","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1756}