{"pr_id":"019ac2d7-64a3-758d-9bf1-4eefb2774d4d","title":"6,000+ New Users via CIP13 ADA Cashback at SovaBar Vietnam","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Cashback incentives boost conversions by up to 30%, yet Cardano still lacks retail programs that drive wallet creation. Without partnerships with retail F&B chains, Cardano adoption remains stalled.","solution":"Sova will offer ADA cashback on every purchase, guiding customers to create wallets on the spot. Staff assist setup, rewards auto-drop in ADA, forming a repeatable system that grows Cardano users.","proposer_name":"SOVA Lounge - Phani Deepak","proposer_relevant_experience":"Phani Deepak [https://in\\.linkedin\\.com/in/phani\\-deepak\\-chodisetti\\-a53034277](https://in.linkedin.com/in/phani-deepak-chodisetti-a53034277)\n\n\n\nWith over 13 years of experience, Phani Deepak has honed his expertise as a skilled brand development strategist, building and scaling successful SMEs across India, the USA, Hong Kong, Vietnam, and beyond. As the Head of Brand Development at Creme Foods, he oversees 27 stores across Andhra Pradesh, Orissa, and Telangana, playing a key role in expanding the brand's presence. He is also part of Chai Mandi, a supermarket and restaurant in San Francisco, and Baamaata, an exporter of retail food products to the USA.\n\n\n\nHis ventures extend to Sova, a restaurant in Da Nang, Vietnam, and Palate Pals Pvt Limited, an F&B consulting firm based in Hyderabad. Known for creating scalable, successful brands, Phani has a proven track record of turning innovative ideas into international businesses.","url":null,"funds":50000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"6,000+ New Users via CIP13 ADA Cashback at SovaBar Vietnam","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"SOVA Lounge - Phani Deepak","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":50000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":3,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cashback incentives boost conversions by up to 30%, yet Cardano still lacks retail programs that drive wallet creation. Without partnerships with retail F&B chains, Cardano adoption remains stalled.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Sova will offer ADA cashback on every purchase, guiding customers to create wallets on the spot. Staff assist setup, rewards auto-drop in ADA, forming a repeatable system that grows Cardano users.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://sova.social/","https://share.google/tPzFtTbmDRe02NrDC","https://x.com/sova_social/status/1982063138880057397?s=46"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All Outputs will be Fully opensource","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Community","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"**Target Audience**\n\n\n\n• Local residents of Da Nang who regularly visit nightlife and social venues\n\n • Young professionals, tourists and students who are open to digital rewards\n\n • First time crypto users who have never created a Cardano wallet\n\n • SovaBar customers who can be onboarded during their normal social activities\n\n\n\n**How We Will Reach Them**\n\nAs the owners of SovaBar, we have direct access to a high volume of customers every week. This allows us to create a controlled and consistent onboarding funnel.\n\n\n\n**We will reach them through:**\n\n • On-site ADA cashback interactions integrated into real purchases\n\n • Staff-guided wallet setup using CPS-0016 compatible URI flows\n\n • Weekend onboarding sessions hosted inside our own venue\n\n • Collaboration with nearby universities, coworking spaces and local groups\n\n • Printed bilingual instructions placed at tables, menus and bar counters\n\n\n\n**Why This Matters for Cardano**\n\n• The project converts a physical business with steady foot traffic into a reliable onboarding machine for Cardano\n\n • Every customer goes through a complete lifecycle from scanning to wallet creation to receiving ADA\n\n • Our position as bar owners allows stable operations and repeated engagement instead of one-off events\n\n • The initiative demonstrates a real business using CIP-13, CIP-99 and CPS-0016 in day-to-day customer interactions\n\n • The model is easy to replicate and scale to other hospitality venues in Vietnam and across Southeast Asia","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"**Education and Awareness**\n\n• Host onboarding sessions weekly at SovaBar with live demonstrations of wallet setup and ADA transfers\n\n • Train the entire SovaBar staff team so they can confidently guide customers\n\n • Hold monthly Cardano community nights inside the venue\n\n • Collect pre and post session surveys to measure understanding and improvement\n\n • Provide short educational materials in English and Vietnamese for new users\n\n\n\n**Operational Activities**\n\n• Deploy ADA cashback QR codes that follow CPS-0016 and CIP-99 standards\n\n • Build and maintain the vendor server that processes claim sessions\n\n • Prepare multilingual printed guides on how to use the wallet\n\n • Form partnerships with at least three local groups or student communities\n\n • Track wallet creation numbers, onsite onboarding counts and ADA transactions","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"**Grassroots Growth and Onboarding**\n\n\n\n• Number of new wallets created directly inside SovaBar\n\n • Number of ADA transactions initiated through the cashback system\n\n • Growth in participation in monthly sessions and community meetups\n\n • Number of collaborations formed with local organizations\n\n\n\n**Community Engagement**\n\n\n\n• Total onboarding events and educational sessions held at the venue\n\n • Attendance and retention rates for both new and returning participants\n\n • Participant feedback scores and testimonials\n\n • Growth of the local Cardano community communication channels\n\n • Formation and sustained operation of at least one recurring meetup group\n\n\n\n**Education Impact**\n\n\n\n• Total number of customers trained or onboarded\n\n • Improvement in Cardano knowledge measured through survey results\n\n • Percentage of first time users who return for a second Cardano activity or event","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**Cashback programs are among the most effective tools for increasing customer acquisition and repeat visits\\.**\n\nIndustry research shows the following:\n\n• Cashback incentives increase conversions by 20 to 30 percent according to Forrester 2023\n\n• More than 70 percent of consumers prefer businesses that provide instant rewards according to Deloitte Loyalty Research 2022\n\n• Digital payment systems that include cashback features onboard new users at roughly twice the rate of systems without incentives according to McKinsey Digital Payments 2023\n\n**Retail context in blockchain**\n\nSeveral blockchain ecosystems such as Ethereum, Solana and Polygon already experimented with real world onboarding through QR based payments, tokenized loyalty programs and simple wallet creation steps at merchant locations. These attempts demonstrate that physical venues can serve as strong entry points for new blockchain users.\n\nCardano has the necessary standards to support similar experiences.\n\nCIP-13 defines the Cardano URI scheme.\n\nCIP-99 introduces the claim authority and the wallet-to-server interaction protocol.\n\nCPS-0016 organizes these efforts and creates a registry for future authorities so the ecosystem can coordinate integrations.\n\nDespite having these standards in place, Cardano does not yet have a recognizable retail program that directly converts walk-in customers into new wallet users. Current onboarding still relies on manual wallet searches, separate installation flows and address entry by hand. Cardano has not yet demonstrated a simple retail friendly experience where a customer scans a QR code, installs a wallet and receives a meaningful ADA reward at the point of purchase.\n\n# **Solution**\nSovaBar in Da Nang will implement a Cardano based ADA cashback program that rewards customers during their purchase experience. This program is designed to onboard more than 6000 new users through a simple and guided process.\n\n\n\n![](https://ik.imagekit.io/nrygeh273/WhatsApp%20Image%202025-11-27%20at%207.22.48%20AM.jpeg)\n\n**How it works**\n\n1. A customer makes a purchase at SovaBar.\n2. Staff present a QR code that encodes a Cardano URI based on CPS-0016 and CIP-99.\n3. The user scans the code and is guided to install a Cardano wallet if they do not already have one.\n4. The wallet automatically receives a claim request for the ADA cashback amount.\n5. The customer receives ADA instantly after authorizing the claim request.\n\nThis produces a complete onboarding cycle that begins with the physical purchase and ends with a funded Cardano wallet. Customers are likely to return since they now hold ADA and understand the reward process.\n\n# Technical Flow Using CPS-0016\nCPS-0016 standardizes how Cardano URI authorities are registered and used across different applications. The SovaBar cashback program relies on the claim authority from CIP-99 and follows the recommended structure.\n\n**1\\. Cashback QR Code**\n\nThe QR code uses the following format:\n\nweb+cardano://claim?v=1&amp;vendor=sovabar&amp;session=abc123&amp;amount=500000\n\nThis contains the version, vendor identification, session token and the ADA cashback amount in Lovelace. The URI launches the wallet and begins the claim protocol.\n\n**2\\. Wallet Detection and Installation**\n\nIf the user has no wallet installed, the URI redirects to a selection page. The user chooses among supported wallets such as Lace, Vespr, Eternl, Typhon, Nami or Yoroi.\n\nAfter installation, the URI automatically resumes the claim process. This creates a simple and unified installation and onboarding journey.\n\n**3\\. Wallet to Server Claim Protocol \\(CIP\\-99\\)**\n\n1. The user scans the QR code.\n2. The wallet interprets the claim authority and fetches a challenge from the vendor server:\n3. GET [https://api\\.sovabar\\.vn/cashback/challenge?session=abc123](https://api.sovabar.vn/cashback/challenge?session=abc123) The wallet signs the challenge with the customer’s payment key. The wallet sends the signed solution back to the vendor server:  POST /cashback/claim\n4. { &quot;address&quot;: user_address, &quot;signature&quot;: sig, &quot;session&quot;: &quot;abc123&quot; }\n5. The vendor server verifies the signature and checks the session details.\n6. The server sends an ADA transaction to the user’s wallet address.\n7. The wallet confirms the deposit to the user.\n\nThis flow follows the standard defined in CIP-99 and is fully compatible with CPS-0016.\n\n# Expected Impact\n• More than 6000 new wallet users in 2025 through guided onboarding\n\n• Increased foot traffic and customer retention at SovaBar\n\n• First high volume real world example of Cardano URI standard usage\n\n• Playbook for future F&amp;B venues and retail chains in Vietnam and Southeast Asia\n\n• Demonstrates Cardano as a practical technology for mainstream users\n\n# Conclusion\nThe SovaBar ADA Cashback program creates a clear and repeatable method for onboarding new Cardano users directly through physical venues. By leveraging CIP-13, CIP-99 and CPS-0016, the project delivers a smooth interaction that turns everyday purchases into blockchain participation.\n\nThis proposal serves as the first tangible example of how Cardano URI standards can power real world consumer adoption.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The project creates a real world onboarding funnel that brings new users into the Cardano ecosystem through a simple experience inside SovaBar, which we own and operate. This is an environment with consistent foot traffic that allows us to introduce Cardano to people during their everyday social activities. By combining ADA cashback with CPS-0016 QR onboarding, we demonstrate a complete use of Cardano technology for a mainstream audience.\n\n\n\n**How the project brings value to the Cardano community**\n\n\n\nThe project delivers value in several ways:\n\n • It generates a large number of new wallets created through real purchases by people who would not otherwise engage with blockchain\n\n • It produces measurable increases in ADA transactions made by first time users\n\n • It establishes a working example of CIP-13, CIP-99 and CPS-0016 used in a real business, which can be replicated by other venues\n\n • It strengthens local community participation in Da Nang through workshops, events and recurring meetups\n\n • It expands Cardano’s presence in Vietnam, a rapidly growing region for crypto adoption\n\n • It creates onboarding materials and a protocol workflow that the wider ecosystem can reuse\n\n\n\n**How we will measure this impact**\n\n\n\nImpact will be tracked with quantitative and qualitative methods:\n\n • Number of new wallets created inside SovaBar\n\n • Number of ADA cashback claims completed\n\n • Total number of new users who complete their first transaction\n\n • Attendance numbers at onboarding sessions and community nights\n\n • Retention rates of participants who return for a second activity\n\n • Growth of the local community group or mailing list\n\n • Pre and post session survey data showing improvements in Cardano knowledge\n\n • Testimonials collected from new users about their experience\n\nAll wallet creation and transaction data will come from the CPS-0016 and CIP-99 claim flows, which allow transparent and verifiable tracking.\n\n\n\n**How we will share outputs and opportunities**\n\n\n\nOutputs will be shared in several accessible formats:\n\n • Monthly public reports summarizing wallet creation numbers, event attendance and educational outcomes\n\n • Open source publication of the CPS-0016 onboarding flow, QR templates and server logic so other venues can reuse the system\n\n • Community presentations at local meetups and online calls that explain lessons learned and best practices\n\n • Social media posts that highlight milestones, onboarding events and partnership results\n\n • A final project summary delivered to the Cardano community with data visualizations, survey results and recommendations for scaling the model\n\nThese outputs will help other businesses, ambassadors and community groups adopt the same approach to grow Cardano in their local regions.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"We are the owners and operators of SovaBar in Da Nang, which gives us full control over the venue, the staff training program and the day to day operations needed to deliver this project. Our team has direct experience running hospitality businesses, managing customer flow and implementing technology driven initiatives inside a live environment. This allows us to execute the onboarding process consistently and ensure that customer interactions with Cardano are smooth and safe.\n\n\n\n# Existing Capabilities\n\n\n• Ownership of SovaBar ensures full continuity, access to the venue and long term stability for ongoing onboarding sessions\n\n • Experience managing staff, inventory and customer operations gives us the structure to run repeated events without interruption\n\n • Technical capability to implement CPS-0016 and CIP-99 flows, including QR onboarding, session handling and ADA claim logic\n\n • Proven ability to organize and host community events, workshops and educational activities\n\n • Experience handling budgets, supplier payments and reporting for a functioning business\n\n • Ability to develop bilingual educational materials and instructions for a diverse customer base\n\nThese capabilities position us to deliver the project reliably, manage funds responsibly and maintain consistent progress throughout the entire period.\n\n\n\n**Steps Demonstrating Trust and Accountability**\n\n\n\n• All spending will be tracked through transparent budget reporting and monthly public updates\n\n • Onboarding counts, wallet creation numbers and event attendance will be documented and shared regularly\n\n • QR codes, backend logic and onboarding materials will be open sourced so the community can verify the methods\n\n • All ADA cashback distributions will be logged and published as part of our monthly summaries\n\n • Clear operational schedules will be provided for workshops and meetups, ensuring a predictable and accountable workflow\n\n\n\n**How We Will Validate Feasibility**\n\n\n\nThe approach will be validated through measurable outputs and observable progress:\n\n• Successful creation of new wallets inside SovaBar through CPS-0016 onboarding\n\n • Successful execution of CIP-99 claim flows that deliver ADA cashback with minimal friction\n\n • Repeat participation from customers who return for workshops or additional Cardano activities\n\n • Consistent event attendance and engagement metrics that show the model is working in practice\n\n • Feedback collected from users and staff to improve the process and confirm ease of use\n\n • The ability to run the onboarding system at high volume during peak hours without operational issues\n\n\n\nIf early validation shows strong results, the model can scale to other venues in Da Nang and eventually to other regions. The combination of business ownership, operational control and technical implementation ensures that the project is both feasible and accountable.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Technical Deployment and Venue Readiness","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Complete installation of the ADA cashback onboarding system inside SovaBar. This includes the CPS-0016 QR onboarding setup, CIP-99 claim server, multilingual instructions placed throughout the venue, and full staff training to guide customers through scanning, wallet creation, and cashback claiming. Internal testing ensures the entire flow works before launch.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"This milestone is complete when the system is fully functional, QR codes are deployed at all customer touchpoints, staff can execute the onboarding flow reliably, and at least five internal test claims succeed from scan to ADA receipt.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Screenshots of successful test claims, photos of deployed QR signage and instructions inside the venue, and documentation confirming that staff onboarding procedures are finalized.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Onboarding Launch and High-Volume Customer Activation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Begin daily onboarding inside SovaBar with ADA cashback offered to all qualifying customers. Track all new wallet creations, claim attempts, ADA rewards delivered, and user flow performance. Optimize signage, QR placement, and staff scripts to increase throughput and reduce onboarding friction. Publish mid-project progress showing wallet creation numbers and early adoption data.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"This milestone is complete when onboarding has been active for several weeks and measurable traction is achieved. A minimum of 2,000 new wallets or successful claim attempts must be recorded. Mid-project data must be publicly shared.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Wallet creation counts, claim logs, ADA distribution data, customer flow measurements, and a published mid-project status update.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Closure, Final Reporting and Public Release","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Produce a final project closure package that includes a comprehensive written closure report, a project closure video, and complete onboarding statistics. This includes total new wallets, total ADA rewards delivered, cost per onboarded user, operational insights, and recommendations for scaling to additional venues. Final results must confirm progress toward the project goal of 6,000 new wallets onboarded at SovaBar.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"This milestone is complete when the final closure report is published, the closure video is publicly available, and clear documentation verifies onboarding results. The report must include a roadmap showing how the model can be expanded to reach the full 6,000 wallet target.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Published closure report, public closure video, final onboarding statistics, and supporting documentation from the claim server.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Phani Deepak [https://in\\.linkedin\\.com/in/phani\\-deepak\\-chodisetti\\-a53034277](https://in.linkedin.com/in/phani-deepak-chodisetti-a53034277)\n\n\n\nWith over 13 years of experience, Phani Deepak has honed his expertise as a skilled brand development strategist, building and scaling successful SMEs across India, the USA, Hong Kong, Vietnam, and beyond. As the Head of Brand Development at Creme Foods, he oversees 27 stores across Andhra Pradesh, Orissa, and Telangana, playing a key role in expanding the brand's presence. He is also part of Chai Mandi, a supermarket and restaurant in San Francisco, and Baamaata, an exporter of retail food products to the USA.\n\n\n\nHis ventures extend to Sova, a restaurant in Da Nang, Vietnam, and Palate Pals Pvt Limited, an F&B consulting firm based in Hyderabad. Known for creating scalable, successful brands, Phani has a proven track record of turning innovative ideas into international businesses.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Milestone 1 Budget Breakdown\n\nTechnical Deployment and Venue Readiness\n\n• CPS-0016 QR generation, signage, and printing - 3,000 ADA\n\n• CIP-99 claim server setup, hosting, backend development - 4,500 ADA\n\n• Multilingual instructions, user guides, and in-venue materials - 2,500 ADA\n\n• Staff training, process creation, and internal testing - 3,000 ADA\n\n• Initial ADA reserves for internal test transactions - 2,000 ADA\n\nTotal: 15,000 ADA\n\nMilestone 2 Budget Breakdown\n\nOnboarding Launch and High-Volume Customer Activation\n\n• ADA cashback subsidies for customers - 8,000 ADA\n\n• Staff support hours for daily onboarding assistance - 1,000 ADA\n\n• Operational costs, QR placement optimization, maintenance - 2,500 ADA\n\n• Marketing to drive foot traffic and increase onboarding volume - 3,500 ADA\n\nTotal: 15,000 ADA\n\nMilestone 3 Budget Breakdown\n\nProject Closure, Final Reporting, and Public Release\n\n• Final data extraction, analytics, and performance measurement - 5,000 ADA\n\n• Written final closure report and documentation package - 4,000 ADA\n\n• Production of final closure video and recap content - 5,000 ADA\n\n• Roadmap and scaling plan for reaching 6,000 total wallets - 6,000 ADA\n\nTotal: 20,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project delivers strong value because funding directly converts into real users onboarding onto Cardano inside a live business we already operate. The budget focuses on essential costs only: technical setup, ADA cashback incentives, and staff operations. These items directly support measurable outputs such as wallet creation, claim activity, and verified usage of Cardano tools like CPS-0016 and CIP-99.\n\n\n\nOperating in Vietnam keeps expenses low, allowing high-volume onboarding at a lower cost per user compared to similar projects in other regions. Every milestone produces clear evidence of impact, and the final cost per onboarded user remains highly competitive.\n\n\n\nOverall, the project turns ecosystem funding into practical adoption, real transactions, and a repeatable model for bringing thousands of new users into the Cardano ecosystem efficiently.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Community","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1760}