{"pr_id":"019ac352-1ec6-7598-9e76-b980d99e1e21","title":"Paraná Industrial Tokenization Lab - ADA3","event_id":15,"objective":37,"objective_title":"Cardano Partners: Tier-1 Enterprise Integrations","summary":"Cardano lacks adoption by large industrial corporations worldwide, blocking real transaction growth and enterprise traction essential for long-term success.","solution":"6-month Paraná Industrial Tokenization Lab, led by Token Economy with FIEP, engages Tier-1 industries to co-create problem statements and deliver a real Cardano PoC that drives enterprise adoption.  ","proposer_name":"Token Economy","proposer_relevant_experience":"PROJECT TEAM AND PARTICIPANT ROLES\n\n\n\nThis project is delivered through a strategic partnership between Token Economy Curitiba and FIEP (Federation of Industries of the State of Paraná), with active participation from selected Cardano developers and industrial partners.\n\n\n\nCORE TEAM - TOKEN ECONOMY CURITIBA\n\n\n\nLizzy Zanlutti - Program Coordinator and Lead\n\nLinkedIn: [https://www\\.linkedin\\.com/in/lizzyzanlutti/](https://www.linkedin.com/in/lizzyzanlutti/)\n\nOrganization: Token Economy Curitiba\n\nRole: Leads overall program execution, coordinates partnership with FIEP, oversees industrial partner engagement, manages workshop facilitation, ensures milestone delivery, handles Catalyst reporting, and serves as primary point of contact for all stakeholders. Responsible for strategic direction, budget management, and program quality.\n\n\n\nPROGRAM TEAM STRUCTURE\n\n\n\nProgram Manager (Full-time, 6 months)\n\nRole: Manages day-to-day operations including scheduling, logistics, industrial partner coordination, meeting facilitation, progress tracking, and stakeholder communication. Supports the Program Coordinator in execution and ensures operational continuity. Reports directly to Lizzy Zanlutti.\n\n\n\nProgram Analyst (Full-time, 6 months)\n\nRole: Conducts industrial research, documents use cases, facilitates workshops, coordinates meetings, tracks progress, and maintains technical documentation. Assists with Catalyst reporting, community communication, and administrative tasks. Acts as liaison between technical and business stakeholders.\n\n\n\nSenior Blockchain Consultant (Part-time, 6 months)\n\nRole: Provides strategic technical guidance, validates solution architectures, reviews smart contract implementations, mentors development teams, and ensures enterprise-grade quality standards. Advises on blockchain best practices and Cardano-specific technical decisions.\n\n\n\nSTRATEGIC PARTNER - FIEP\n\n\n\nFIEP Team Structure\n\n\n\nCorporate Relationship Manager\n\nOrganization: FIEP - Federação das Indústrias do Estado do Paraná\n\nRole: Facilitates access to Paraná's 70,000+ industrial companies, coordinates industrial partner engagement, arranges executive meetings, provides sectoral expertise, validates use cases from industrial perspective, and ensures alignment with FIEP's strategic priorities.\n\n\n\nInnovation and Technology Coordinator\n\nOrganization: FIEP\n\nRole: Coordinates, facilitates workshop venues and logistics, supports communication to industrial members, and provides institutional credibility to program activities.","url":null,"funds":700000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Paraná Industrial Tokenization Lab - ADA3","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Token Economy","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an Incorporated entity or a Consortium?","description":"Are you submitting this proposal as an Incorporated entity or a Consortium?","format":null,"answer":"Consortium","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 250,000 and $ADA 750,000","format":null,"answer":700000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano lacks adoption by large industrial corporations worldwide, blocking real transaction growth and enterprise traction essential for long-term success.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"6-month Paraná Industrial Tokenization Lab, led by Token Economy with FIEP, engages Tier-1 industries to co-create problem statements and deliver a real Cardano PoC that drives enterprise adoption.  ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":{"links":[]},"sub_fields":null},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","description":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence. ","format":null,"answer":"Not open source","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Tokenization","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your established collaborations.","description":"Please provide your rationale for your established collaborations.","format":null,"answer":"**Token Economy**\n\n\n\nToken Economy is a Brazilian organization dedicated to blockchain innovation and the development of tokenization models for both the public and private sectors. It has collaborated with GovChainLab, the Cardano Hub Brazil, and the Cardano Foundation, reinforcing its credibility within the Cardano ecosystem.\n\n\n\nToken Economy is also the creator and organizer of the 1st Brazilian Vehicle Tokenization Forum, a national landmark event bringing together regulators, industry leaders, technology institutions, and government agencies to explore real-world tokenization applications in mobility, traceability, and digital asset infrastructure.\n\n\n\nThe organization acts as a catalyst for knowledge and technological development, offering executive education programs, immersive workshops, and applied research initiatives. With an active presence in Curitiba and partnerships with universities and innovation labs, Token Economy has become a national reference in tokenization, digital economy, and strategic education for leaders and institutions.\n\n\n\n**FIEP — Federation of Industries of the State of Paraná**\n\n\n\nFIEP is the largest industrial business entity in the state of Paraná, representing more than 70,000 companies across multiple productive sectors. It oversees Senai, Sesi, and IEL, providing services in professional training, technological innovation, and institutional support. FIEP represents approximately 977,000 workers in the region.\n\n\n\nIn 2025, Paraná’s industrial sector recorded significant growth, with a 15% increase in industrial production compared to the previous year, according to FIEP. In the food and beverage sector alone, FIEP reports 5,931 industries, employing more than 250,000 workers, with strong participation in export markets.\n\n\n\nFIEP also plays a strategic leadership role in innovation. Through the Industry Technology Park and partnerships with institutions such as Tecpar and sectoral agencies, it drives digital transformation, industrial modernization, traceability initiatives, and the advancement of emerging technologies — including potential applications of blockchain and tokenization within productive chains.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe funding commitments.","description":"Please provide your rationale for your funding commitments.","format":null,"answer":"This project is delivered through a strategic partnership between Token Economy Curitiba and FIEP (Federation of Industries of the State of Paraná), combining blockchain technical expertise with unparalleled access to Brazil's industrial sector.\n\n\n\nTOKEN ECONOMY CURITIBA - Technical Leadership and Blockchain Expertise\n\n\n\nToken Economy is a Brazilian organization dedicated to blockchain innovation and tokenization model development for public and private sectors. With proven experience in the Cardano ecosystem through collaborations with GovChainLab, Cardano Hub Brazil, and the Cardano Foundation, Token Economy brings credibility and technical capability essential for enterprise blockchain adoption.\n\n\n\nToken Economy created the 1st Brazilian Vehicle Tokenization Forum, a landmark event bringing together regulators, industry leaders, technology institutions, and government agencies to explore real-world tokenization applications. This demonstrates our ability to convene high-level stakeholders and translate blockchain concepts into practical industrial solutions.\n\n\n\nFor this program, Token Economy commits:\n\n\n\n• Dedicated Program Manager (full-time, 6 months) - Day-to-day execution, corporate scouting, workshop coordination, and PoC delivery oversight ensuring accountability, timeline management, and quality control.\n\n\n\n• Program Analyst (full-time, 6 months) - Research, industrial scouting, workshop facilitation, documentation, and technical coordination with Cardano developers.\n\n\n\n• Senior Blockchain Consultant (part-time, 6 months) - Strategic technical guidance, architecture validation, smart contract review, and developer mentorship ensuring enterprise-grade quality.\n\n\n\n• Access to Cardano Developer Network - Connections to identify and engage qualified developers, builders, and projects capable of delivering enterprise-grade PoCs.\n\n\n\n• Technical Infrastructure - Development environments, testing infrastructure, project management tools, and documentation systems for professional delivery.\n\n\n\n• Program Management Framework - Structured methodology for milestone tracking, risk management, stakeholder communication, and Catalyst reporting compliance.\n\n\n\nFIEP - Industrial Access and Corporate Facilitation\n\n\n\nFIEP is the largest industrial business entity in Paraná state, representing 70,000+ companies across manufacturing, agribusiness, construction, energy, and technology sectors. FIEP oversees SENAI (industrial training), SESI (worker welfare), and IEL (innovation development), providing comprehensive support to Paraná's industrial ecosystem representing 977,000 workers.\n\n\n\nIn 2025, Paraná's industrial sector recorded 15% production growth. The food and beverage sector alone includes 5,931 industries employing 250,000+ workers with significant export participation. FIEP drives digital transformation and emerging technology adoption through the Industry Technology Park and strategic partnerships.\n\n\n\nFor this program, FIEP commits:\n\n\n\n• Strategic Access to Industrial Decision-Makers - 80 years of institutional credibility enabling direct C-level access in major Paraná industries, critical for corporate participation and executive buy-in.\n\n\n\n• Corporate Scouting and Facilitation - Active identification of industrial partners, introduction facilitation, and relationship management throughout the program.\n\n\n\n• Physical Infrastructure - Access to facilities for workshops, ideation sessions, and demonstration events including modern meeting spaces and professional environments.\n\n\n\n• Institutional Communication Channels - Platforms reaching 70,000+ industries through newsletters, events, sectoral meetings, and digital channels ensuring program visibility.\n\n\n\n• Industry Credibility and Validation - FIEP endorsement signals legitimacy and strategic importance to participating industries, reducing hesitation and accelerating decisions.\n\n\n\n• Sectoral Expertise - Deep understanding of industrial challenges, regulatory requirements, and operational realities ensuring problem statements are grounded in real business needs.\n\n\n\nPARTICIPATING INDUSTRIES - Co-Investment and Collaboration\n\n\n\nSelected industrial partners will contribute:\n\n\n\n• Dedicated Team Members - Personnel for workshops, domain expertise, and PoC development collaboration ensuring solutions address actual business problems.\n\n\n\n• Technical System Access - Where appropriate, access to existing systems, data structures (anonymized), and integration points for realistic PoC development.\n\n\n\n• Testing Environments - Real or simulated operational environments for PoC validation ensuring solutions work under actual business conditions.\n\n\n\n• Business Knowledge and Validation - Continuous feedback, requirements clarification, and solution effectiveness validation from users understanding operational realities.\n\n\n\nCATALYST FUNDING - Core Program Delivery\n\n\n\nTotal Catalyst funding requested: ₳700,000 ADA\n\n\n\nThis covers the complete 6-month program:\n\n- Core team salaries (Program Manager, Analyst, Consultant)\n\n- PoC development by Cardano developers/builders\n\n- Workshop facilitation and materials\n\n- Technical infrastructure and security audits\n\n- Marketing, communication, and community engagement\n\n- Administrative and legal compliance\n\n- Travel and operational expenses\n\n\n\nThe ₳700,000 ADA budget delivers 1 high-quality, enterprise-grade PoC with 1 major Paraná industrial partner, following proven methodology used by similar programs globally.\n\n\n\nSPONSORSHIP MODEL - Amplifying Impact Beyond Core Milestones\n\n\n\nTo maximize program impact on Cardano adoption and industrial blockchain innovation, we will open sponsorship quotas for additional funding from:\n\n\n\n• Technology Companies - Organizations with complementary technologies (cloud, IoT, AI, cybersecurity) interested in blockchain integration and industrial use cases.\n\n\n\n• Financial Institutions - Banks, payment processors, and fintech companies exploring tokenization, DeFi applications, or blockchain-based financial services.\n\n\n\n• Blockchain Projects - Other protocols interested in supporting industrial adoption and gaining enterprise market visibility.\n\n\n\n• Innovation-Focused Corporations - Large enterprises seeking early insight into industrial blockchain applications and strategic positioning.\n\n\n\n• Industry Associations - Sectoral organizations supporting digital transformation for member companies.\n\n\n\nSponsorship funds (if secured) will amplify impact through:\n\n\n\n1. Additional PoCs - Enable 2nd or 3rd PoC with different industries or use cases, multiplying Cardano adoption pathways.\n\n\n\n2. Extended Industry Engagement - Increase industries participating in ideation workshops, broadening future blockchain adoption pipeline.\n\n\n\n3. Enhanced Technical Development - Add advanced features, integrations, or comprehensive testing making PoCs more production-ready.\n\n\n\n4. Expanded Documentation - Create detailed technical documentation, video tutorials, and educational materials for the Cardano community.\n\n\n\n5. Post-Program Support - Provide additional technical support helping industries move from PoC to production deployment.\n\n\n\nAll sponsorship agreements will be transparent with fund usage reported to the Catalyst community. Sponsors receive recognition (brand visibility, report mentions, early access to findings) but do not influence technical decisions or program independence.\n\n\n\nRISK MITIGATION\n\n\n\nThe program is fully executable with Catalyst funding alone. Sponsorship is an enhancement opportunity, not a dependency, ensuring:\n\n- No delivery risk due to external funding shortfalls\n\n- Clear accountability for Catalyst-funded outcomes\n\n- Transparent reporting on all fund sources and usage\n\n- Ability to scale impact if market interest materializes\n\n\n\nThis demonstrates fiscal responsibility while maximizing potential impact for Cardano ecosystem and industrial blockchain adoption in Brazil and Latin America.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe your key performance metrics.","description":"Please provide your rationale for your key performance metrics.","format":null,"answer":"Success will be measured by:\n\n\n\n(1) 3+ Brazilian industrial companies engaged (e.g., agribusiness, manufacturing, construction, or energy sectors from Paraná state),\n\n\n\n(2) 3+ prioritized problem statements defined through collaborative workshops,\n\n\n\n(3) 1 Cardano-based PoC scoped and developed until business case with selected industrial partner, working with Cardano projects, builders and developers, and\n\n\n\n(4) Measurable growth in Cardano adoption through enterprise pilot, on-chain transactions, and ecosystem visibility in Brazil and Latin America.\n\n\n\nWHY THESE KPIs MATTER:\n\n\n\nCorporate Engagement (3+ companies) - This creates a qualified pipeline for future Cardano adoption beyond this program. Engaging multiple companies de-risks the program by ensuring alternatives if one partner drops out, while also broadening the range of use cases explored.\n\n\n\nProblem Statements (3+) - Ensures we're addressing genuine industrial pain points, not theoretical use cases. Multiple statements provide optionality and increase the likelihood of finding the optimal PoC fit that delivers maximum business value. These documented problems become valuable resources for the broader Cardano community, inspiring future projects and demonstrating enterprise demand for blockchain solutions.\n\n\n\nWorking PoC with Business Case - Proves Cardano's technical capability for real-world enterprise applications and provides a replicable model for other industries. The business case is critical for industrial decision-makers to justify scaling from pilot to production deployment, directly impacting long-term adoption. This deliverable transforms interest into concrete evidence that blockchain works for traditional industries, reducing adoption barriers for future corporate partners.\n\n\n\nMeasurable Adoption Growth - Validates real-world utility through actual on-chain activity, not just conceptual promises. Enterprise transactions demonstrate that the solution works under real business conditions. Ecosystem visibility in Brazil's industrial sector strengthens Cardano's credibility in Latin America's emerging markets, positioning Cardano as the blockchain of choice for enterprise applications in the region and opening doors for expanded adoption across other Brazilian states and neighboring countries.\n\n\n\nTogether, these KPIs create a complete adoption funnel: from corporate engagement to problem definition, technical execution, and measurable on-chain impact. This transforms corporate interest into tangible Cardano adoption, creating a proven, documented pathway for enterprise blockchain implementation that can be replicated across Brazil's industrial federations (FIESP, FIEMG, FIERGS) and throughout Latin America, ultimately contributing to Cardano's long-term sustainability through real transaction growth and enterprise validation.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"THE PROBLEM WE ARE SOLVING\n\n\n\nBrazilian industries, particularly in Paraná state, face critical challenges that blockchain could address: lack of supply chain transparency leading to fraud and inefficiency, limited access to fair credit for SMEs (95.6% of Paraná's industries), difficulty proving sustainability credentials for export markets, and high intermediation costs in B2B transactions. Despite growing corporate interest in blockchain, industries lack practical adoption pathways, technical expertise, and proven use cases to justify investment.\n\n\n\nCardano, while technically robust, lacks enterprise traction in Latin America's industrial sector. This creates a chicken-and-egg problem: industries won't adopt blockchain without proven use cases, and blockchain ecosystems can't demonstrate enterprise utility without industrial adoption. The result is missed opportunities—industries operate inefficiently while Cardano's transaction volume and real-world validation remain limited in one of the world's largest emerging markets.\n\n\n\nOUR SOLUTION: THE PARANÁ INDUSTRIAL TOKENIZATION LAB\n\n\n\nThe Paraná Industrial Tokenization Lab is a structured 6-month program bridging this gap by creating a direct adoption pathway between Paraná's industrial sector and the Cardano ecosystem. Rather than building solutions in search of problems, we flip the approach: engage real industries with real pain points, co-create blockchain solutions addressing actual business needs, and deliver working proof-of-concepts demonstrating measurable value.\n\n\n\nThe program operates as a three-way collaboration connecting industries (via FIEP's 70,000+ company network), blockchain capability (via Cardano's technical ecosystem), and execution expertise (via Token Economy's facilitation and program management).\n\n\n\nPROGRAM STRUCTURE\n\n\n\nPhase 1: Corporate Scouting (4-6 weeks) - We leverage FIEP's institutional relationships to identify and engage 3+ major Paraná industries interested in blockchain solutions. Target sectors include agribusiness (export focus, traceability needs), manufacturing (supply chain complexity), construction (material certification), and renewable energy (carbon credits). FIEP's 80-year credibility enables conversations at C-suite level. This phase includes presenting blockchain fundamentals, assessing digital maturity, identifying internal champions, and securing formal workshop participation commitment.\n\n\n\nGo/No-Go: Minimum 3 industries formally committed. If not achieved, we reassess engagement strategy before proceeding.\n\n\n\nPhase 2: Ideation Workshops (4-6 weeks) - We facilitate structured workshops with participating industries to define specific blockchain use cases. Using design thinking methodology, we map current pain points, identify where blockchain creates unique value versus traditional databases, and prioritize opportunities by business impact and technical feasibility. Industries bring operational expertise; Token Economy brings blockchain knowledge; together we co-create problem statements that are both valuable and realistic to implement. Output: 3+ documented problem statements with business context, success criteria, and solution concepts. We collaboratively select 1 use case and 1 industrial partner for PoC development.\n\n\n\nGo/No-Go: At least 1 industry committed to PoC with clearly defined problem statement.\n\n\n\nPhase 3: PoC Scoping (4-6 weeks) - We transform the selected problem statement into an executable technical project. Token Economy identifies relevant Cardano developers, builders, and projects with enterprise-grade capability. Working with both industrial partner and Cardano technical teams, we define detailed requirements, system architecture, integration points with existing systems, KPIs, development timeline, and testing approach. Both parties formally approve scope before development begins.\n\n\n\nGo/No-Go: Signed agreement from industrial partner and Cardano team confirming scope, timeline, and deliverables.\n\n\n\nPhase 4: PoC Development (10-12 weeks) - Selected Cardano developers build the proof-of-concept in close collaboration with the industrial partner. We use agile methodology with two-week sprints, weekly status meetings, and continuous feedback loops. The industrial partner provides real-world context and validates features meet business needs. Token Economy provides program management and facilitates communication between technical and business stakeholders. Development progresses from MVP through iterative refinement, culminating in a working solution tested on Cardano testnet or mainnet with real or realistic data.\n\n\n\nPhase 5: Validation and Business Case (2-4 weeks) - The completed PoC undergoes final validation by the industrial partner against predefined success criteria. We measure results versus KPIs: Does it solve the problem? What efficiency gains or cost reductions does it deliver? What's required to scale from pilot to production? We document findings in a comprehensive business case enabling the industrial partner to make informed decisions about expanding the solution. We also prepare recommendations for how the solution could be adapted for other industries, contributing reusable patterns to the Cardano community.\n\n\n\nWHY THIS APPROACH WORKS\n\n\n\nDemand-Driven, Not Technology-Driven - We start with real industrial problems, not predetermined blockchain solutions, ensuring relevance and increasing likelihood of post-PoC adoption.\n\n\n\nExecutive-Level Engagement - FIEP's institutional credibility enables conversations with C-suite decision-makers who control budgets and strategic direction, not just innovation managers lacking implementation authority.\n\n\n\nCo-Creation Ensures Fit - Industries actively shape what gets built, ensuring it addresses their actual needs and fits their operational reality.\n\n\n\nProven Methodology - This structure mirrors successful enterprise blockchain adoption programs globally (including the Antler Ibex model in Japan), adapted for Brazil's industrial context.\n\n\n\nProfessional Delivery - Token Economy's dedicated program management ensures accountability, quality control, timeline discipline, and proper documentation—critical for maintaining corporate confidence.\n\n\n\nReal Cardano Usage - The PoC generates actual on-chain activity on Cardano, contributing to transaction volume and demonstrating enterprise capability.\n\n\n\nWHO BENEFITS\n\n\n\nParticipating Industries - Gain blockchain expertise access, a working solution to a real business problem, and a validated business case for broader implementation—at significantly lower cost than hiring consultants or building in-house teams.\n\n\n\nCardano Ecosystem - Gains enterprise validation in Latin America's industrial sector, real transaction activity, documented use cases inspiring future projects, and a replicable corporate adoption model that can scale to other regions.\n\n\n\nCardano Developers/Builders - Access real enterprise clients, gain experience building for industrial use cases, create portfolio projects demonstrating enterprise capability, and potentially secure ongoing contracts if PoCs move to production.\n\n\n\nBrazilian Industrial Sector - Gains practical blockchain knowledge, reducing hesitation and accelerating digital transformation as success stories spread.\n\n\n\nWHAT MAKES THIS UNIQUE\n\n\n\nFirst Structured Industrial-Blockchain Program in Brazil - No similar initiative exists connecting Brazil's established industrial sector with Cardano's ecosystem at this scale and structure.\n\n\n\nFIEP's Unmatched Industrial Access - 70,000+ companies, 977,000 workers, and 80 years of institutional credibility provide access no other organization can offer.\n\n\n\nFocus on Real Business Value - Not research or experimentation—we're building solutions industries would actually pay for and deploy at scale.\n\n\n\nCardano-Native Approach - Unlike blockchain-agnostic programs, this specifically validates Cardano's enterprise capabilities, contributing directly to ecosystem growth.\n\n\n\nReplicable Model - Success in Paraná creates a proven playbook for other Brazilian states (São Paulo's FIESP, Minas Gerais' FIEMG, Rio Grande do Sul's FIERGS) and Latin American industrial federations, multiplying Cardano's regional impact.\n\n\n\nWHY THIS MATTERS TO CARDANO\n\n\n\nEnterprise adoption is critical for Cardano's long-term sustainability. This program delivers:\n\n\n\nTransaction Volume - Real enterprise operations generate sustained, meaningful on-chain activity, not speculative trading.\n\n\n\nValidation - Documented success with established industries proves Cardano works for serious business applications, attracting additional enterprise interest.\n\n\n\nGeographic Expansion - Latin America is an underserved but strategically important market; success here positions Cardano as the enterprise blockchain for emerging economies.\n\n\n\nReplicable Patterns - The use cases, architectures, and business cases we develop become resources for the global Cardano community, accelerating adoption elsewhere.\n\n\n\nNetwork Effects - One successful industrial PoC leads to conversations with that industry's suppliers, customers, and competitors, creating organic adoption expansion.\n\n\n\nThis program doesn't just talk about enterprise adoption—it delivers concrete evidence that Cardano solves real business problems for real companies in real markets, transforming corporate interest into measurable ecosystem growth.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"POSITIVE IMPACT ON THE WIDER CARDANO COMMUNITY\n\n\n\nThis project delivers direct, measurable value to the Cardano ecosystem by bridging the critical gap between technical capability and enterprise adoption in Latin America's industrial sector.\n\n\n\nENTERPRISE ADOPTION AND VALIDATION\n\n\n\nCardano will secure a real proof-of-concept with a major Brazilian industrial company in Paraná, one of Brazil's most industrialized states representing 6% of national GDP. This isn't a sandbox experiment—it's a working solution addressing genuine business problems with measurable results. Success here provides concrete evidence that Cardano works for traditional industries, not just crypto-native applications. This validation is critical for attracting additional enterprise interest globally, as corporations look to peers for proof before committing to new technologies.\n\n\n\nThe business case documentation produced will detail technical performance, cost-benefit analysis, integration challenges overcome, and recommendations for scaling—providing a replicable blueprint that other enterprises and Cardano projects can follow.\n\n\n\nTRANSACTION GROWTH AND NETWORK ACTIVITY\n\n\n\nThe PoC will generate real on-chain activity through enterprise deployment, whether on testnet during development or mainnet for production pilots. Unlike speculative trading volume, enterprise transactions represent sustained, predictable activity driven by operational needs. A supply chain traceability solution might generate thousands of transactions monthly as products move through distribution networks. A tokenized receivables platform could process dozens of financial transactions weekly. This organic usage strengthens network effects and demonstrates Cardano's ability to handle real-world business workloads.\n\n\n\nECOSYSTEM DEVELOPMENT AND KNOWLEDGE SHARING\n\n\n\nThe 3+ problem statements defined during ideation workshops become valuable public resources for the Cardano community. These documented industrial use cases—complete with business context, technical requirements, and success criteria—inspire developers and projects to build solutions addressing similar enterprise needs. Even use cases not selected for this program's PoC create a pipeline of opportunities for future Cardano projects.\n\n\n\nAll technical documentation, architecture decisions, integration patterns, and lessons learned will be openly shared with the Cardano community (respecting any necessary confidentiality around proprietary business data). This includes smart contract implementations, integration approaches with traditional enterprise systems, best practices for engaging corporate stakeholders, and common pitfalls to avoid. Future projects can build on this knowledge rather than starting from scratch.\n\n\n\nDEVELOPER CAPABILITY AND PORTFOLIO BUILDING\n\n\n\nCardano developers and projects participating in this program gain invaluable enterprise experience. Building for corporations requires different skills than building for crypto users—understanding regulatory requirements, integrating with legacy systems, meeting enterprise security standards, and working within corporate decision-making processes. Developers emerging from this program can credibly claim enterprise-grade capability, opening doors to additional corporate clients globally.\n\n\n\nThe completed PoC becomes a portfolio piece demonstrating real-world application of Cardano technology. \"We built a working supply chain solution for a 500-person manufacturing company\" is significantly more compelling than \"We built a demo\" when competing for future enterprise contracts.\n\n\n\nINVESTOR AND INSTITUTIONAL CONFIDENCE\n\n\n\nDocumented success with established Brazilian industries attracts venture capital and corporate investors to the Cardano ecosystem. Institutional investors conducting due diligence on blockchain platforms look for evidence of real-world adoption, not just technical whitepapers. A validated industrial use case with measurable business results provides that evidence, making Cardano-based startups more fundable and the ecosystem more attractive for institutional capital.\n\n\n\nThis is particularly important for Latin American investors and institutions exploring blockchain. Success in Paraná signals that Cardano is serious about the region, potentially catalyzing additional investments and partnerships throughout Brazil and neighboring countries.\n\n\n\nCOMMUNITY ALIGNMENT AND INCLUSIVITY\n\n\n\nThe program is explicitly designed to engage Cardano ecosystem developers, ensuring opportunities for community participation. We're not bringing in outside blockchain developers—we're creating paying work for Cardano builders. The RFP process for selecting developers will be transparent and open to any qualified Cardano project or developer team, prioritizing those with demonstrated commitment to the ecosystem.\n\n\n\nCommunity members following the program will gain insights into enterprise blockchain adoption challenges and solutions, raising the overall sophistication of ecosystem discussions beyond purely technical or speculative topics.\n\n\n\nGEOGRAPHIC EXPANSION AND MARKET POSITIONING\n\n\n\nLatin America represents 650+ million people and $5+ trillion in GDP, yet remains underserved by blockchain enterprise solutions. Success in Brazil's industrial sector positions Cardano as the enterprise blockchain of choice for the region, ahead of competing platforms. This first-mover advantage in industrial applications could lead to widespread adoption as digital transformation accelerates across Latin American industries.\n\n\n\nThe program establishes Cardano's presence in Brazil's blockchain conversation at institutional levels. FIEP's participation and endorsement lends legitimacy that reaches far beyond the crypto community into boardrooms of traditional industries. This institutional credibility is essential for mainstream adoption.\n\n\n\nREPLICABILITY AND SCALABILITY\n\n\n\nPerhaps most importantly, this program creates a proven model for enterprise blockchain adoption that can be replicated globally. The methodology, documentation, engagement strategies, and lessons learned become a playbook for other Cardano community members to run similar programs with industrial federations in their regions.\n\n\n\nBrazil alone has 26 state-level industrial federations beyond FIEP. If this model succeeds in Paraná, it can scale to São Paulo (FIESP - representing far larger industrial base), Minas Gerais (FIEMG), Rio Grande do Sul (FIERGS), and others. Each replication multiplies Cardano's enterprise footprint, transaction volume, and real-world validation.\n\n\n\nBeyond Brazil, this model applies to industrial federations throughout Latin America, Africa, Southeast Asia, and other emerging markets where traditional industries are exploring digital transformation but lack blockchain expertise.\n\n\n\nMEASURING IMPACT\n\n\n\nWe will measure and report impact through multiple quantitative and qualitative metrics:\n\n\n\nQuantitative Metrics:\n\n- Number of Brazilian industries formally engaged (target: 3+)\n\n- Problem statements documented (target: 3+)\n\n- Working PoCs delivered (target: 1)\n\n- On-chain transactions generated during PoC testing and deployment\n\n- Number of Cardano developers/projects participating in PoC development\n\n- Github repositories created and documentation pages published\n\n- Media mentions and industry press coverage\n\n- Social media reach and community engagement metrics\n\n- Workshop attendees and participants in ideation sessions\n\n\n\nQualitative Metrics:\n\n- Industrial partner satisfaction and willingness to scale PoC\n\n- Quality and depth of technical documentation produced\n\n- Reusability of solutions for other industries\n\n- Ecosystem feedback on knowledge sharing and documentation\n\n- Level of interest from other Brazilian states or industrial federations\n\n- Cardano community sentiment and engagement with project updates\n\n- Expert assessment of technical quality and enterprise readiness\n\n\n\nSHARING OUTPUTS AND OPPORTUNITIES\n\n\n\nAll outputs will be shared transparently with the Cardano community through multiple channels:\n\n\n\nProject Website and Documentation Hub - Dedicated site hosting all technical documentation, use case descriptions, architecture diagrams, business case templates, and lessons learned. This becomes a permanent resource for the community.\n\n\n\nCatalyst Reporting - Regular milestone reports submitted through Catalyst channels, ensuring transparency and accountability to ADA holders who funded the project.\n\n\n\nCommunity Presentations - Live presentations at Cardano community events, AMAs on social media, and participation in Cardano Foundation activities to share progress and insights.\n\n\n\nDeveloper Resources - Open-source code repositories (where appropriate and not containing proprietary business logic), smart contract templates, and integration patterns available for community reuse.\n\n\n\nCase Studies and White Papers - Professionally written case studies detailing the industrial partner's challenge, solution approach, implementation process, and results. These become marketing assets for both the industrial partner and the Cardano ecosystem.\n\n\n\nAcademic and Industry Publications - Where appropriate, findings will be submitted to academic conferences and industry publications, raising Cardano's profile in traditional business and technology circles beyond the crypto community.\n\n\n\nMedia Engagement - Proactive outreach to Brazilian technology media, business press, and international blockchain publications to ensure broad visibility for Cardano's enterprise success.\n\n\n\nReplication Toolkit - Creation of a \"how to run this program in your region\" toolkit enabling other Cardano community members to replicate the model with their local industrial federations or corporate networks.\n\n\n\nThis comprehensive sharing approach ensures that the program's value extends far beyond the single PoC delivered, amplifying impact across the entire Cardano ecosystem and establishing a foundation for sustained enterprise adoption growth in Latin America and beyond.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"POSITIVE IMPACT ON THE WIDER CARDANO COMMUNITY\n\n\n\nThis project delivers direct, measurable value to the Cardano ecosystem by bridging the critical gap between technical capability and enterprise adoption in Latin America's industrial sector.\n\n\n\nENTERPRISE ADOPTION AND VALIDATION\n\n\n\nCardano will secure a real proof-of-concept with a major Brazilian industrial company in Paraná, one of Brazil's most industrialized states representing 6% of national GDP. This isn't a sandbox experiment—it's a working solution addressing genuine business problems with measurable results. Success here provides concrete evidence that Cardano works for traditional industries, not just crypto-native applications. This validation is critical for attracting additional enterprise interest globally, as corporations look to peers for proof before committing to new technologies.\n\n\n\nThe business case documentation produced will detail technical performance, cost-benefit analysis, integration challenges overcome, and recommendations for scaling—providing a replicable blueprint that other enterprises and Cardano projects can follow.\n\n\n\nTRANSACTION GROWTH AND NETWORK ACTIVITY\n\n\n\nThe PoC will generate real on-chain activity through enterprise deployment, whether on testnet during development or mainnet for production pilots. Unlike speculative trading volume, enterprise transactions represent sustained, predictable activity driven by operational needs. A supply chain traceability solution might generate thousands of transactions monthly as products move through distribution networks. A tokenized receivables platform could process dozens of financial transactions weekly. This organic usage strengthens network effects and demonstrates Cardano's ability to handle real-world business workloads.\n\n\n\nECOSYSTEM DEVELOPMENT AND KNOWLEDGE SHARING\n\n\n\nThe 3+ problem statements defined during ideation workshops become valuable public resources for the Cardano community. These documented industrial use cases—complete with business context, technical requirements, and success criteria—inspire developers and projects to build solutions addressing similar enterprise needs. Even use cases not selected for this program's PoC create a pipeline of opportunities for future Cardano projects.\n\n\n\nAll technical documentation, architecture decisions, integration patterns, and lessons learned will be openly shared with the Cardano community (respecting any necessary confidentiality around proprietary business data). This includes smart contract implementations, integration approaches with traditional enterprise systems, best practices for engaging corporate stakeholders, and common pitfalls to avoid. Future projects can build on this knowledge rather than starting from scratch.\n\n\n\nDEVELOPER CAPABILITY AND PORTFOLIO BUILDING\n\n\n\nCardano developers and projects participating in this program gain invaluable enterprise experience. Building for corporations requires different skills than building for crypto users—understanding regulatory requirements, integrating with legacy systems, meeting enterprise security standards, and working within corporate decision-making processes. Developers emerging from this program can credibly claim enterprise-grade capability, opening doors to additional corporate clients globally.\n\n\n\nThe completed PoC becomes a portfolio piece demonstrating real-world application of Cardano technology. \"We built a working supply chain solution for a 500-person manufacturing company\" is significantly more compelling than \"We built a demo\" when competing for future enterprise contracts.\n\n\n\nINVESTOR AND INSTITUTIONAL CONFIDENCE\n\n\n\nDocumented success with established Brazilian industries attracts venture capital and corporate investors to the Cardano ecosystem. Institutional investors conducting due diligence on blockchain platforms look for evidence of real-world adoption, not just technical whitepapers. A validated industrial use case with measurable business results provides that evidence, making Cardano-based startups more fundable and the ecosystem more attractive for institutional capital.\n\n\n\nThis is particularly important for Latin American investors and institutions exploring blockchain. Success in Paraná signals that Cardano is serious about the region, potentially catalyzing additional investments and partnerships throughout Brazil and neighboring countries.\n\n\n\nCOMMUNITY ALIGNMENT AND INCLUSIVITY\n\n\n\nThe program is explicitly designed to engage Cardano ecosystem developers, ensuring opportunities for community participation. We're not bringing in outside blockchain developers—we're creating paying work for Cardano builders. The RFP process for selecting developers will be transparent and open to any qualified Cardano project or developer team, prioritizing those with demonstrated commitment to the ecosystem.\n\n\n\nCommunity members following the program will gain insights into enterprise blockchain adoption challenges and solutions, raising the overall sophistication of ecosystem discussion","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Industrial Partner Engagement Secured","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Successfully identify and secure commitment from a minimum of 3 Brazilian industrial enterprises from Paraná state. Each company will provide written confirmation to participate in collaborative workshop sessions, dedicating internal resources to explore blockchain applications and define use cases.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Documented commitments via official correspondence (letters, emails, or partnership agreements) from 3 industrial enterprises confirming their engagement in the program. Documentation must clearly specify workshop participation terms and expectations for the ideation phase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Upload to Catalyst platform of all formal commitment documents, partnership agreements, or signed letters from participating enterprises. Include company profiles, designated contact persons, and outlined areas of interest for blockchain exploration.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":210000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Use Case Identification and Prioritization","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Completion of collaborative workshop series resulting in three comprehensively documented use cases. Each use case will detail current business challenges, proposed blockchain applications, expected benefits, and preliminary technical approach.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Minimum of 3 fully documented use cases with enterprise validation and written commitment from at least 1 industrial partner to advance into technical planning phase. Documentation must demonstrate genuine business value and technical feasibility.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Comprehensive Catalyst report containing:\n\n\n\nThree prioritized use case documents with business requirements\n\nWorkshop session summaries with attendance records and photographs\n\nEnterprise stakeholder feedback and validation\n\nAdditional opportunities identified during sessions\n\nFormal agreement from selected enterprise to proceed with technical planning","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":98000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Technical Blueprint and Development Agreement","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Complete technical specification for the selected use case, including system architecture, functional requirements, success metrics, implementation timeline, and confirmed Cardano development team assignment.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Signed technical specification document approved by both the industrial enterprise and assigned Cardano development team. Document must include clear deliverables, performance indicators, technical approach, and resource allocation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Upload of complete technical specification package to Catalyst including:\n\n\n\nDetailed system architecture diagrams\n\nFunctional and non-functional requirements\n\nSuccess metrics and validation criteria\n\nDevelopment timeline with key checkpoints\n\nSigned approval from industrial partner and technical team\n\nResource allocation and responsibility matrix","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":98000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Initial Development Phase Completed","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Active development environment established with initial solution components operational. Demonstrated collaboration between industrial stakeholders and Cardano developers through working code, testing infrastructure, and documented sprint outcomes.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Functional code repository showing substantive development progress, operational test environment, and documented collaboration between enterprise and technical teams. Evidence must show regular development activity and stakeholder engagement.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Catalyst submission package including:\n\n\n\nAccess to code repositories demonstrating development progress\n\nSprint retrospectives and planning documents\n\nTest environment access credentials or demonstrations\n\nCollaboration logs showing industrial partner involvement\n\nScreenshots or recordings of functional components\n\nTechnical progress report from development team","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":98000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Advanced Development and Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Near-complete solution with core features implemented and undergoing validation with industrial partner. Integration with enterprise systems (where applicable), comprehensive testing, and iterative refinement based on stakeholder feedback.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Substantially complete solution demonstrating primary use case functionality in test environment. Active validation process with industrial partner showing solution effectiveness and identifying final refinements needed.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Comprehensive Catalyst submission containing:\n\n\n\nSignificantly advanced code repository\n\nTesting results and quality assurance documentation\n\nVideo demonstrations of operational features\n\nIndustrial partner testing feedback and validation\n\nIntegration documentation (if applicable)\n\nUpdated technical documentation\n\nIssue tracking and resolution logs","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":98000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"PROJECT TEAM AND PARTICIPANT ROLES\n\n\n\nThis project is delivered through a strategic partnership between Token Economy Curitiba and FIEP (Federation of Industries of the State of Paraná), with active participation from selected Cardano developers and industrial partners.\n\n\n\nCORE TEAM - TOKEN ECONOMY CURITIBA\n\n\n\nLizzy Zanlutti - Program Coordinator and Lead\n\nLinkedIn: [https://www\\.linkedin\\.com/in/lizzyzanlutti/](https://www.linkedin.com/in/lizzyzanlutti/)\n\nOrganization: Token Economy Curitiba\n\nRole: Leads overall program execution, coordinates partnership with FIEP, oversees industrial partner engagement, manages workshop facilitation, ensures milestone delivery, handles Catalyst reporting, and serves as primary point of contact for all stakeholders. Responsible for strategic direction, budget management, and program quality.\n\n\n\nPROGRAM TEAM STRUCTURE\n\n\n\nProgram Manager (Full-time, 6 months)\n\nRole: Manages day-to-day operations including scheduling, logistics, industrial partner coordination, meeting facilitation, progress tracking, and stakeholder communication. Supports the Program Coordinator in execution and ensures operational continuity. Reports directly to Lizzy Zanlutti.\n\n\n\nProgram Analyst (Full-time, 6 months)\n\nRole: Conducts industrial research, documents use cases, facilitates workshops, coordinates meetings, tracks progress, and maintains technical documentation. Assists with Catalyst reporting, community communication, and administrative tasks. Acts as liaison between technical and business stakeholders.\n\n\n\nSenior Blockchain Consultant (Part-time, 6 months)\n\nRole: Provides strategic technical guidance, validates solution architectures, reviews smart contract implementations, mentors development teams, and ensures enterprise-grade quality standards. Advises on blockchain best practices and Cardano-specific technical decisions.\n\n\n\nSTRATEGIC PARTNER - FIEP\n\n\n\nFIEP Team Structure\n\n\n\nCorporate Relationship Manager\n\nOrganization: FIEP - Federação das Indústrias do Estado do Paraná\n\nRole: Facilitates access to Paraná's 70,000+ industrial companies, coordinates industrial partner engagement, arranges executive meetings, provides sectoral expertise, validates use cases from industrial perspective, and ensures alignment with FIEP's strategic priorities.\n\n\n\nInnovation and Technology Coordinator\n\nOrganization: FIEP\n\nRole: Coordinates, facilitates workshop venues and logistics, supports communication to industrial members, and provides institutional credibility to program activities.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Total Requested: ₳750,000 ADA\n\nProject Duration: 6 months\n\n\n\nThis allocation prioritizes team expertise, technical implementation, and essential operations. The distribution emphasizes human capital and development execution, maximizing enterprise adoption impact for Cardano within Brazil's industrial landscape.\n\n\n\nPEOPLE COSTS (47% | ₳352,500)\n\n\n\nProgram Coordinator (Lizzy Zanlutti) - 6 months full-time\n\n- Program leadership and strategic direction\n\n- FIEP partnership coordination\n\n- Industrial partner relationship management\n\n- Milestone delivery accountability\n\n- Catalyst reporting\n\n\n\nProgram Manager - 6 months full-time\n\n- Day-to-day operational management\n\n- Workshop coordination and logistics\n\n- Timeline and budget tracking\n\n- Stakeholder communication\n\n\n\nProgram Analyst - 6 months full-time\n\n- Industrial research and use case documentation\n\n- Workshop facilitation support\n\n- Meeting coordination\n\n- Progress tracking and reporting\n\n\n\nSenior Blockchain Consultant - 6 months part-time\n\n- Technical strategy and architecture guidance\n\n- Solution validation\n\n- Developer mentorship\n\n- Quality assurance oversight\n\n\n\nWorkshop Facilitation and Industrial Engagement\n\n- Professional facilitators for ideation sessions\n\n- Design thinking methodology expertise\n\n- Session design and materials preparation\n\n- Industrial partner coordination support\n\n\n\nRationale: Core team ensures delivery of all industrial engagement, workshops, milestone reporting, and program accountability. This investment in experienced professionals is critical for bridging traditional industries with blockchain technology.\n\n\n\n---\n\n\n\nSOLUTION TECHNICAL DEVELOPMENT (40% | ₳300,000)\n\n\n\nCardano Ecosystem Developers\n\n- Solution design and architecture\n\n- Integration with industrial systems\n\n- Testing and quality assurance\n\n- Technical documentation\n\n\n\nRationale: Direct technical execution to ensure the solution is delivered to enterprise standards. Budget reflects market rates for experienced Cardano developers capable of building production-grade enterprise applications.\n\n\n\n---\n\n\n\nMARKETING AND COMMUNICATIONS (5% | ₳37,500)\n\n\n\nEcosystem Visibility\n\n- Catalyst community updates and reporting\n\n- Cardano forum engagement\n\n- Brazilian market communications\n\n- Social media and digital content\n\n\n\nDocumentation and Knowledge Sharing\n\n- Technical documentation for community\n\n- Case study development\n\n- Video demonstrations\n\n- Progress reports and updates\n\n\n\nTranslation and Localization\n\n- English/Portuguese translation services\n\n- Localized communications for industrial partners\n\n- International visibility materials\n\n\n\nRationale: Build awareness among Cardano community and strengthen adoption visibility in Brazil. Transparent communication ensures ecosystem benefits from learnings and creates reusable resources.\n\n\n\n---\n\n\n\nTRAVEL AND EXPENSES (5% | ₳37,500)\n\n\n\nIndustrial Engagement\n\n- Travel to industrial facilities in Paraná\n\n- Workshop logistics\n\n- Meeting expenses with corporate partners\n\n- Site visits for solution validation\n\n\n\nWorkshop Logistics\n\n- Audiovisual equipment\n\n- Catering and materials\n\n- Transportation\n\n\n\nRationale: In-person workshops and corporate access are critical for trust-building in Brazilian business culture. Face-to-face engagement significantly increases success rates with traditional industries.\n\n\n\n---\n\n\n\nADMINISTRATION AND OPERATIONS (3% | ₳22,500)\n\n\n\nLegal and Compliance\n\n- Partnership agreement reviews\n\n- Developer contracts\n\n- Regulatory compliance (Brazilian law)\n\n- Intellectual property considerations\n\n\n\nProgram Administration\n\n- Accounting and financial management\n\n- Insurance and operational costs\n\n- Project management tools and software\n\n- Administrative support\n\n\n\nContingency and Risk Management\n\n- Exchange rate fluctuations\n\n- Unexpected expenses\n\n- Buffer for unforeseen challenges\n\n\n\nRationale: Ensure governance, reporting, and accountability across all milestones. Professional administration reduces risk and maintains stakeholder confidence.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"VALUE FOR MONEY\n\n\n\nThis project represents strong value for the Cardano ecosystem:\n\n\n\nEnterprise Adoption Impact: With ₳750,000, the program delivers 1 real-world solution with 1 major Brazilian industrial partner, with expansion potential across Paraná's 70,000+ industries.\n\n\n\nTransaction Growth: The solution is expected to generate activity on Cardano testnet/mainnet, directly adding measurable on-chain usage.\n\n\n\nLeverage of Partner Contributions: FIEP contributes institutional resources, facilities, and corporate access. Industrial partner co-invests internal resources. Token Economy provides organizational infrastructure. These contributions multiply the Catalyst funding impact.\n\n\n\nReusable Model: The 6-month program creates a repeatable blueprint for enterprise adoption that can be replicated across Brazilian states and Latin America, amplifying ROI for Cardano.\n\n\n\nStrategic Positioning: Brazil is Latin America's largest economy. Winning industrial adoption here strengthens Cardano's credibility in emerging markets globally.\n\n\n\nGeographic First-Mover Advantage: First structured industrial blockchain program in Brazil positions Cardano ahead of competing platforms in a strategically important market.\n\n\n\nIn summary: For ₳750,000, the Cardano ecosystem gains 1 enterprise-grade solution, measurable adoption metrics, validated use cases, replicable methodology, and strategic positioning in Latin America—high-value, high-leverage use of Catalyst funds.\n\n\n\n---\n\n\n\nFUNDING NOTES\n\n\n\nThe ₳750,000 Catalyst funding covers complete program delivery. Additional in-kind contributions enhance total program value.\n\n\n\nOptional sponsorship revenue, would amplify impact by enabling additional solutions, extended engagement, or enhanced documentation—but is not required for core deliverables.\n\n\n\nThe program is fully executable with Catalyst funding alone, with sponsorship positioned as enhancement opportunity rather than dependency.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead applicant is a verified legal business entity.","description":"Legal Entity:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the lead org has a ≥2-year track record, and the consortium collectively has ≥$5M in verifiable annual revenue.","description":"Track Record & Revenue:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of collaboration with a qualified Tier-1 enterprise is provided.","description":" Tier-1 Collaboration:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is for mature R&D or integration, not an early-stage concept or core infrastructure.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of a mature product is provided, with a clear integration plan if not already on Cardano.","description":"Mature Product & Path:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that all key partners, including the Tier-1 collaborator, are clearly identified.","description":"Partner Identification:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that a clear statement of the partner's in-kind or financial contributions is included.","description":"Partner Commitment:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable references (e.g., LinkedIn, portfolio) for key team members.","description":"Verifiable Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear KPIs for adoption (e.g., transaction volume, user growth). Forecast for projected on-chain transaction volume is provided with adequate justification.","description":"Measurable Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that delivery is ≤ 12 months with clear milestones.","description":"Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a co-marketing or community engagement plan to amplify Cardano's visibility.","description":"Visibility & Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal budget is for future work only, not for completed tasks. No incentives, giveaways, private treasuries and regranting are included in the budget.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Tokenization","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1762}