{"pr_id":"019abf96-4380-73c4-abd3-d3913de4b38a","title":"HashiFlo - Intelligent AI Liquidity for Japanese Agri-RWAs ","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Japan’s agricultural producers lack AI-driven tokenization and liquidity tools, leaving real assets disconnected from Cardano and limiting adoption.","solution":"HashiFlo provides an AI liquidity layer that converts Japanese agricultural data into token-ready assets with valuation, onboarding, and automated flows linking producers to Cardano’s RWA ecosystem.","proposer_name":"Sapient Predictive Analytics Pte Ltd","proposer_relevant_experience":"**Thomas Wedler**: project management and trading-related content\n\nExperienced financial trader and entrepreneur. Ex Shell, Vattenfall, Masefield senior futures and options trader. Individual floor trader at Singapore Exchange. Tom has been building and deploying programs for automated market making and energy derivatives since 2014. 15 years Derivatives experience at multi-national organizations working closely with industry bodies and speaker at market conferences and workshops. Involved in crypto trading since 2014 and DeFi/oracles since 2018. Plutus Pioneer, Marlowe Pioneer and Atala Prism Pioneer.\n\nThomas is a certified Superforecaster with the Good Judgment Project and winner of the inaugural Hybrid Forecasting Challenge at SAGE / University of Southern California.\n\n[https://www\\.linkedin\\.com/in/thomas\\-wedler\\-18960/](https://www.linkedin.com/in/thomas-wedler-18960/)\n\nRole in Catalyst: Challenge Team (Fund 8–10), Sub-circle3, Catalyst Coordinators (funded proposers), Veteran Proposal Assessor, Reviewer in funded project milestone reporting Fund 10–14.\n\n**June Akra**: project management and risk-management related content, community\n\n**Sapient developer team**: to provide UI front-end and API for the portal.\n\nFounding member of BlockCarbon, financial market expert and academic with vast experience in risk management, derivatives and commodities. Experience for various risk functions in 2 billion-dollar AUM fund. Holder of Master degree in Investment with distinction and awarded Draper Prize. Certified Quantitative Finance (CQF) alumni London. Experienced video editor, content creator with combined 50,000 followers on social media, NFT collector and creator. Certified python AI practitioner, Plutus Pioneer &amp; Atala Prism Pioneer.\n\n[https://www\\.linkedin\\.com/in/june\\-a\\-a3a0b4174](https://www.linkedin.com/in/june-a-a3a0b4174)\n\nRole in Catalyst: Challenge Team (Fund 7–10), Sub-circle3, Catalyst Coordinators (funded proposers), Veteran Proposal Assessor, Reviewer in funded project milestone reporting (PoA pilot) Fund 9–14.\n\n**Sapient team members upon demand:**\n\nData scientist, Senior fullstack developer / head architect, LLM engineer, data engineer\n\n[https://www\\.18hall\\.com/sapient\\-predictive\\-analytics/](https://www.18hall.com/sapient-predictive-analytics/)","url":null,"funds":149500,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"HashiFlo - Intelligent AI Liquidity for Japanese Agri-RWAs ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Sapient Predictive Analytics Pte Ltd","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":149500,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":8,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Japan’s agricultural producers lack AI-driven tokenization and liquidity tools, leaving real assets disconnected from Cardano and limiting adoption.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"HashiFlo provides an AI liquidity layer that converts Japanese agricultural data into token-ready assets with valuation, onboarding, and automated flows linking producers to Cardano’s RWA ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.sapientswarm.com","https://github.com/Sapient-Predictive-Analytics/hashirwa","https://github.com/Sapient-Predictive-Analytics/hashirwa/blob/main/docs/HashiFlo_OnePager_F15.pdf"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All HashiFlo deliverables will be published as open source under the MIT License. Third-party components such as Chainlink SDKs, Cardano libraries (Lucid and Mesh), and AI frameworks including PyTorch and scikit-learn will retain their original licenses, with full attribution documented in the repository.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"RWA","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"HashiFlo is the first AI-driven agricultural RWA tokenization pipeline focused on Japan, bringing technical capabilities not available in today’s Cardano RWA tools. While existing projects stop at metadata templates or basic listings, HashiFlo delivers a full valuation-to-liquidity workflow that mirrors real-world asset onboarding.\n\n.\n\nIts innovations span a complete tokenization and liquidity stack:\n\n- AI valuation engine that analyzes lot size, region, crop grade, JAS/JGAP certification, and historical patterns to produce fair-value estimates before tokenization.\n- Tokenization preview simulator that models supply, pricing, seasonal risk, and liquidity outcomes - allowing producers to understand economic implications before minting.\n- On-chain transaction layer linking valuation → metadata → oracle-aligned pricing → minting → AI-guided liquidity actions, enabling transparent and automatable RWA flows.\n- Japan-first bilingual design adapted to real agricultural stakeholders, with guided onboarding and documentation optimized for producers unfamiliar with blockchain tools.\n\n.\n\nBy shifting the Cardano RWA model from static metadata to automated valuation, predictive token economics, and live testnet execution, HashiFlo sets a new benchmark for practical RWA utility and AI-driven liquidity intelligence on Cardano.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The HashiFlo MVP will demonstrate a complete AI-powered tokenization and liquidity pipeline tailored for Japanese agricultural RWAs. It includes producer onboarding, AI valuation models, tokenization previews, and a fully functional testnet integration that shows how real assets move from data → valuation → metadata → mint/burn actions → liquidity routing.\n\n.\n\nUsers will be able to:\n\n• Create asset listings through a guided onboarding flow designed for real agricultural producers.\n\n• View AI-generated fair-value ranges based on lot size, region, grade, certification, and historical trends.\n\n• Simulate token supply, pricing, and risk signals, allowing producers and reviewers to preview token economics before issuing any asset.\n\n• Execute on-chain testnet actions, including valuation calls, metadata registration, mint/burn flows, and AI-driven liquidity routing tests.\n\n• Track all status changes through an investor dashboard that updates dynamically as AI and on-chain events occur.\n\n.\n\nThe MVP will be accessible through a public testnet web demo, supported by full documentation and open-source code published on GitHub. This ensures full transparency, reproducibility, and independent verification by the Cardano community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"HashiFlo will measure success through transparent, verifiable on-chain activity that demonstrates real usage rather than theoretical output. By close-out, the MVP aims to generate **_500–1,000 testnet transactions_** across the full lifecycle: asset registration, AI valuation calls, metadata submission, mint/burn flows, and liquidity-routing tests.\n\n.\n\nWe also target **_150\\+ unique wallet interactions_** during open beta, representing both producer-side and investor-side usage. This includes wallet-based listing creation, valuation previews, dashboard interactions, and testnet confirmations.\n\n.\n\nThe MVP aims to process **_20–30 agricultural assets_** end-to-end through the AI valuation → listing → metadata → testnet transaction pipeline, demonstrating that the system can handle real-world variation in asset type, grade, and certification.\n\n.\n\nThese measurable indicators-high-volume on-chain activity, diverse asset processing, and multi-wallet participation-show genuine traction and highlight how agricultural RWAs can generate meaningful, verifiable utility for the Cardano ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"# 01. Problem &amp; Opportunity\n.\n\nJapan’s Real-World Asset (RWA) market is accelerating due to regulatory reform and new digital-asset guidelines. Yet agriculture—one of Japan’s highest-trust export sectors—remains digitally fragmented and lacks an RWA-ready pipeline.\n\n**Key structural problems:**\n\n• Agricultural pricing varies widely across prefectures with no transparent benchmarks.\n\n• Foreign investors face language barriers and non-standardized documentation formats.\n\n• Producers and cooperatives lack simple, bilingual workflows for presenting asset data in a consistent way.\n\n• Cardano currently has no Japan-focused agricultural RWA gateway to attract real producers.\n\n**Japan’s RWA momentum is well\\-documented:**\n\n• Digital-asset investment products in Japan grew 84% YoY in 2024 _\\(CoinShares 2025\\)\\._\n\n• Tokenized real-asset AUM in Asia surpassed USD 3.5B, with Japan at ~18% _\\(BCG × 21Shares 2024\\)\\._\n\n• Agricultural exports hit ¥1.4 trillion in 2024 (+14.3% YoY), the fastest growth in 10 years._\\(MAFF 2025\\)_\n\n• JFSA updated STO guidelines in 2024 to support broader tokenization adoption.\n\n_\\(JFSA 2024\\)_\n\n.\n\n**Opportunity:**\n\nJapan’s agriculture sector is entering a rare window of transformation. Producers face strong overseas demand, yet the path from a real farm asset to a digital and tradable financial instrument is still fragmented. Export-oriented producers lack standardised data formats, consistent valuation methods, and transparent digital workflows that can prove authenticity, quality, and origin. Japan’s push for digital transformation in food production is accelerating, but the available tools remain scattered across private platforms, local cooperatives, and long-standing certification bodies.\n\nFor global investors, agricultural real-world assets from Japan are highly attractive because the products are trusted, stable in quality, and supported by rising export growth. However, there is still no blockchain that provides compliant onboarding, verifiable provenance, and a predictable listing pipeline. Much of the opportunity remains locked behind manual steps, limited supply chain visibility, and the absence of a structured marketplace layer that lets producers list, validate, and transact with confidence.\n\nThis opens a clear opportunity for Cardano. No chain currently provides a complete pathway for Japanese agricultural assets. If Cardano enables a lean AI-assisted workflow that includes issuer onboarding, metadata validation, valuation intelligence, and secure tokenization, it becomes the first blockchain with an institutional-grade pipeline for one of Japan’s most trusted real-asset categories. This helps Cardano establish a leadership foothold in a trusted and rapidly expanding segment of Japan’s real-asset economy.\n\n.\n\n# 02. Our Approach\n.\n\nHashiFlo evolves the Fund 14 prototype into a bilingual, AI-driven agricultural RWA pipeline designed specifically for Japan.\n\n**Standardized workflow:**\n\nProducer → Data Entry → AI Valuation → Tokenization Preview → Investor Dashboard → On-Chain Testnet Transactions\n\n**This approach:**\n\n• Removes pricing ambiguity using AI-predicted fair-value ranges.\n\n• Standardizes issuer metadata (prefecture, certification, grade, lot size, export channel).\n\n• Provides clean, bilingual dashboards suited for global investors.\n\n• Connects outputs to Cardano-native tokenization logic.\n\n• Remains lean and implementable-no custodianship, lending modules, or complex market-maker design.\n\n.\n\n**\\(Graphic 1: Producer Onboarding \\+ AI Fair\\-Value Estimation\\)**\n\n![](https://raw.githubusercontent.com/Sapient-Predictive-Analytics/hashirwa/main/proof/hashiflo_onboarding.jpg)\n\n.\n\n**\\(Graphic 2: Internal Review Console \\-  Asset Profiles and AI Price Ranges\\)**![](https://raw.githubusercontent.com/Sapient-Predictive-Analytics/hashirwa/main/proof/hashiflo_investordashboard.jpg)\n\n**\\(Graphic 3: Simulated Marketplace View for RWA Listings\\) \\- Prototype Preview**\n\n![](https://raw.githubusercontent.com/Sapient-Predictive-Analytics/hashirwa/main/proof/hashiflo_marketplace.jpg)\n\n.\n\n# **03\\. Key Features**\n**\\.**\n\n**AI\\-Based Valuation Engine**\n\nPredicts fair-value ranges, confidence scores, and trend indicators using historical data, quality grades, certifications, and regional patterns.\n\n**Tokenization Preview**\n\nAllows producers to simulate token supply, implied price, and risk signals before minting, reducing complexity and increasing trust.\n\n**Standardized Metadata \\(Japan\\-first\\)**\n\nUnified listing cards including JAS/JGAP certification, prefecture origin, product grades, yields, and export details.\n\n**Investor Dashboard v2**\n\nLive listings, bilingual filters, valuation charts, risk indicators, and upcoming on-chain status logic.\n\n**Proof\\-of\\-Listing \\(Testnet\\)**\n\nVerifiable registry entries on Cardano testnet as the first step toward regulated token issuance processes.\n\n# **04\\. Implementation Plan**\n**\\.**\n\n**Months 1–2** : Data Calibration &amp; Producer UI Polish (Milestone 1)\n\n• Refine agricultural datasets (rice, tea, fruits, dairy) to ensure consistent inputs for AI valuation.\n\n• Improve bilingual onboarding forms for Japanese producers, including clearer data definitions and export-related fields.\n\n• Update tokenization preview logic to align with Japan-specific grade and certification requirements.\n\n**Months 3–4** : Marketplace Listing System &amp; Metadata Engine (Milestone 2)\n\n• Expand listing cards with structured metadata such as prefecture, certification (JAS/JGAP), and product grade.\n\n• Implement standardized proof-of-listing logic and deterministic metadata generation.\n\n• Conduct initial round of producer-side usability testing for listing submission and approval flow.\n\n**Months 5–6** : Dashboard, AI Liquidity Engine v1 &amp; Simulation Layer (Milestone 3)\n\n• Release the investor dashboard v2 with bilingual interface, filters, valuation charts, and live state indicators.\n\n• Implement AI Liquidity Engine v1 to generate valuation predictions, fair-value ranges, and simulated liquidity signals.\n\n• Build the simulation engine for mint/burn previews and integrate state changes with the dashboard.\n\n**Months 7–8** : Cardano Testnet Integration, AI Liquidity Execution v2 &amp; Public Demo (Milestones 4 &amp; 5)\n\n• Integrate full listing → valuation → metadata → mint/burn → proof-of-listing transactions into the Cardano testnet.\n\n• Upgrade AI Liquidity Engine to v2 so liquidity recommendations drive real testnet actions.\n\n• Launch a stable public demo, publish documentation, and deliver Catalyst-required close-out report and video.\n\n.\n\n# **05\\. Long\\-Term Vision**\n**\\.**\n\nHashiFlo aims to become the agricultural RWA entry point for Japan, connecting premium producers to global investors through verified data, transparent pricing, and simple onboarding.\n\nFuture directions include:\n\n• Chainlink price feeds and proof-of-reserve workflows.\n\n• Expansion to SMEs and renewable-energy RWAs.\n\n• Yield-optimized bundles curated from multiple prefectures.\n\n• API access for exchanges, funds, and platforms wanting Japan-origin RWAs.\n\nHashiFlo is a deliberate step toward national-level adoption and positions Cardano as a credible technological base for Japan-focused RWAs.\n\n.\n\n# **06\\. Why This Fits the Category: Prototype &amp; Launch**\n**\\.**\n\nThis proposal fits the Prototype &amp; Launch category because:\n\n• Fund 14 HashiRWA established the foundation, including datasets, UX patterns, metadata schema, and early interface prototypes.\n\n• HashiFlo extends this work into a functional, testnet-ready MVP with a focused agricultural RWA pipeline for Japan.\n\n• Producers will be able to trial the onboarding flow through a guided prototype environment.\n\n• The full lifecycle - metadata intake, AI price estimation, tokenization preview, and testnet execution - will be demonstrated end to end.\n\n• The deliverable is a publicly accessible prototype aligned with Cardano’s utility and decentralization goals.\n\nHashiFlo strengthens Cardano’s RWA presence in one of Japan’s highest-trust real-asset categories and directly supports ecosystem growth.\n\n.\n\n# **Appendix – References**\n**\\.**\n\n• CoinShares. Digital Asset Fund Flows Report, 2025.\n\n[https://www\\.coinshares\\.com/research/digital\\-asset\\-fund\\-flows](https://www.coinshares.com/research/digital-asset-fund-flows)\n\n• BCG × 21Shares. The State of Tokenization Report, 2024.\n\n[https://www\\.21shares\\.com/research](https://www.21shares.com/research)\n\n• MAFF (Japan Ministry of Agriculture). Annual Export Statistics, 2025.\n\n[https://www\\.maff\\.go\\.jp](https://www.maff.go.jp)\n\n• JFSA (Japan Financial Services Agency). Revised Security Token Offering Guidelines, 2024.\n\n[https://www\\.fsa\\.go\\.jp](https://www.fsa.go.jp)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Japan is rapidly emerging as a promising market for real-world digital assets. Government-backed digital transformation programs and rising global demand for high-quality agricultural exports are creating strong momentum for data-rich, traceable, and verifiable asset pipelines. Agriculture is among the earliest sectors where structured metadata, digital provenance, and price intelligence can be applied without entering regulated securities territory.\n\nHashiFlo is designed to produce measurable and verifiable outcomes within Fund 15. It advances beyond static prototypes by generating real user behaviour, structured data flows, and testnet activity that strengthens Cardano’s position in Japan’s digital asset landscape.\n\n**\\* Direct Ecosystem Impact**\n\n- AI-guided price estimation for agricultural products creates a practical and clearly scoped entry point for Japan-origin RWAs on Cardano.\n- The complete workflow of producer onboarding, metadata intake, valuation preview, and tokenization simulation generates a range of on-chain testnet events.\n- Japan is accelerating digital asset experimentation, making agricultural metadata one of the most suitable early categories for tokenization pilots.\n- HashiFlo builds a standardized data layer for Japanese agricultural assets including prefecture, certification, grade, lot size, and provenance information.\n- The project establishes a reusable RWA pipeline that future Cardano teams, auditors, or oracle providers can adopt and extend.\n\n_We have already secured certified agricultural producer contacts who are supplying our team with detailed issuer datasets\\. This provides HashiFlo with real, verifiable agricultural inputs that strengthen valuation previews, metadata structures, and early tokenization simulations\\. Progress is ongoing and publicly traceable through our open\\-source GitHub repository and regular updates on X \\(@sapientswarm\\), enabling the community to monitor data expansion, prototype validation, and milestone delivery in real time\\._\n\n**\\* Expected Measurable Outputs**\n\n**Testnet Activity**\n\n- 500 to 1,000 on-chain testnet transactions, including valuation calls, metadata publishing, tokenization previews, and simulated mint/burn flows.\n\nThis produces one of the largest open RWA testnet datasets available on Cardano.\n\n**Agricultural Assets Onboarded**\n\n- 20 to 30 agricultural products processed through the onboarding prototype.\n\nFund 14 already structured data for more than ten real Japanese products including rice, tea, apples, dairy, buckwheat, and matcha.\n\nFund 15 expands this dataset with complete metadata, fair-value estimates, and tokenization previews that form a consistent pipeline for future integrations.\n\n**Prototype Users and Testers**\n\n- At least 100 active beta participants, including producers, domain testers, and technical users interacting with listing previews and marketplace simulations.\n\nThis ensures early validation, broad data diversity, and a ready user base for post-Fund 15 development.\n\n**\\* Key Performance Indicators \\(KPIs\\)**\n\n**Data &amp; Issuer Onboarding**\n\n- 20–30 certified agricultural products supplied with complete metadata sets.\n- ≥10 verified producer entities providing structured issuer datasets.\n\n**Testnet &amp; Technical Activity**\n\n- 500–1,000 Cardano testnet transactions across core RWA workflows.\n- ≥3 open-source components released (metadata schema, valuation logic, tokenization simulator).\n\n**User &amp; Community Engagement**\n\n- 100+ prototype testers across agricultural and technical roles.\n- Monthly progress updates via GitHub and X (@sapientswarm).\n- ≥4 community demo sessions for feedback and iteration.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"HashiFlo is highly feasible because it builds directly on the groundwork already completed in Fund 14. The team has delivered structured agricultural datasets, metadata standards, bilingual producer workflows, early valuation logic, and a functional marketplace interface. These components form a mature foundation, allowing this proposal to focus on extending proven modules rather than creating new systems from scratch.\n\n**Technical Capability**\n\n**• AI and Data Expertise**\n\nThe team has hands-on experience preparing Japanese agricultural datasets and developing valuation logic that can be adapted for fair value estimation, quality scoring, and liquidity signalling. The data structures required for Fund 15 already exist in validated formats.\n\nSapient has successfully completed multiple Catalyst-funded AI projects, delivering Cardano-native machine learning systems, inference models, and data-driven tooling. These projects have already passed milestone review, proving our ability to design, implement, and ship highly specialized AI solutions within the Cardano ecosystem.\n\nWe successfully completed projects ([https://milestones\\.projectcatalyst\\.io/projects/1100277](https://milestones.projectcatalyst.io/projects/1100277) and [https://milestones\\.projectcatalyst\\.io/projects/1100299\\)](https://milestones.projectcatalyst.io/projects/1100299) which proves our capability to deliver specialized AI solutions for the Cardano ecosystem. We developed Catalyst-specific language models and comprehensive data analysis platforms, demonstrating exactly the kind of machine learning expertise required for cybersecurity threat detection and behavioral analytics.\n\n**• Cardano Development Experience**\n\nFamiliarity with Lucid, Mesh, CIP 68 and CIP 721 metadata, and workflow scripting enables seamless expansion of Fund 14 components into a valuation and token-ready pipeline. The team has previously demonstrated the ability to connect UI, Cardano logic, and metadata systems into a functioning prototype.\n\n**• Proven Catalyst Delivery**\n\nThe team has completed Catalyst projects with on-time documentation, clear milestone evidence, transparent reporting, and consistent GitHub activity. This establishes a strong record of disciplined execution within the Catalyst framework.\n\n**• Japan\\-Aligned UX and Producer Insights**\n\nPrior producer outreach and bilingual interface work provide clear knowledge of the cultural and operational needs of Japanese agricultural stakeholders. This ensures an onboarding flow that remains simple, intuitive, and export-friendly.\n\n**Team Background**\n\nThe team brings a balanced mix of skills across critical domains:\n\n• A data and valuation lead with experience in predictive modelling, agricultural dataset calibration, and fair value modelling.\n\n• A Cardano developer skilled in metadata standards, workflow integration, dashboard logic, and testnet operations.\n\n• A product and operations lead with expertise in Japanese UX, documentation, process design, and milestone reporting.\n\nThis combination covers data science, blockchain engineering, agricultural domain knowledge, and international stakeholder coordination.\n\n**Validation of Feasibility**\n\nFeasibility is validated through multiple channels:\n\n• Milestone-based outputs with clear and auditable proofs including valuation engine v1, metadata structures, prototype listings, and lifecycle demonstrations.\n\n• Lifecycle testing that verifies valuation, metadata generation, and token-ready asset creation within a controlled environment.\n\n• Producer usability feedback informed by prior Fund 14 interactions, which already demonstrated the viability of the onboarding flow.\n\n• Transparent documentation maintained through GitHub, ensuring reviewers have direct visibility into code, workflows, datasets, and UI snapshots.\n\n**Risk and Mitigation**\n\n- Dataset Variation\n\nAgricultural data may differ by region or product type.\n\nMitigation: Normalize formats and apply confidence scoring to support consistency.\n\n- Producer Adoption\n\nSome producers may be unfamiliar with digital onboarding.\n\nMitigation: Keep the workflow simple, bilingual, and guided with visual cues.\n\n- Integration Complexity\n\nConnecting valuation, metadata, and listing previews may require iteration.\n\nMitigation: Use a modular design that allows each component to be tested independently.\n\n- Regulatory Sensitivity\n\nJapan’s digital asset guidelines are evolving.\n\nMitigation: HashiFlo remains strictly a token-ready prototype and does not perform regulated issuance.\n\n**Why This Is Feasible in Eight Months**\n\nFund 14 has already established the core direction, validated datasets, early UX patterns, and metadata standards. Fund 15 builds on these components to deliver the valuation engine, structured listing pipeline, and token-ready asset flows.\n\nFund 15 development focuses on extending existing modules into a unified valuation and token-ready pipeline, not recreating the system.\n\nThe eight-month schedule allows sufficient time for development, integration, refinement, testnet activity, producer testing, and clear milestone reporting. The team’s prior Catalyst performance further supports the reliability of this timeline.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Data Onboarding System & Issuer Schema","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A complete agricultural issuer onboarding workflow capturing identity, farm details, product information, and supporting documents in a structured way.\n2. A finalized CSV schema with validation rules ensuring consistency across issuers, including format checks and field enforcement.\n3. A standardized GitHub proof-of-issuer folder structure with sample issuers, metadata, and documentation explaining how onboarding data is verified and stored.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Onboarding form successfully records all required issuer fields and rejects incomplete or inconsistent entries during testing.\n2. CSV validator detects incorrect formats, missing fields, and invalid metadata, producing logs that show the validation process clearly.\n3. Proof folders pass a repository audit confirming correct naming, presence of issuer evidence, and reproducible validation outputs.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Screenshots or recordings of the live onboarding form capturing multiple sample issuer submissions.\n2. A validated issuers.csv file with multiple entries and logs demonstrating error detection.\n3. GitHub proof-of-issuer folders containing 8-12 sample issuer packages, each including metadata, form outputs, validation logs, and timestamped supporting documents to demonstrate diversity across different agricultural producer types.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":27500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Marketplace Listing Workflow & Metadata Engine","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A functional listing system enabling issuer submission, admin review, approval/rejection actions, and recorded state transitions.\n2. A metadata generator that produces deterministic JSON artifacts for agricultural tokens, passing schema validation reliably.\n3. Automated proof-of-listing files, including timestamps, hashes, and consistent folder organization for auditability.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Listing module fully supports transitions (Pending, Approved, Rejected) and preserves a traceable activity history.\n2. Metadata generator outputs valid JSON following schema rules and maintains deterministic hashing across repeated runs.\n3. Proof-of-listing artifacts are automatically generated during listing approval and stored in the correct GitHub structure.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. GitHub samples of 12–18 listing metadata files with fully matched proof-of-listing records, deterministic hashes, timestamps, and state-history logs to demonstrate the completeness of the workflow across diverse agricultural products.\n2. Admin dashboard screen recording demonstrating submission, review, and approval flows.\n3. Logs or screenshots showing successful JSON schema validation and deterministic hash production.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":31000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Investor Dashboard, Simulation Layer & AI Liquidity Engine","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A dual-theme investor dashboard (dark/light) with wallet login, watchlist, issuer cards, and real-time visual status indicators that reflect backend logic.\n2. A simulation engine that generates deterministic mint/burn proof hashes, maintains event history, and updates listing states consistently as simulated transactions occur.\n3. AI Liquidity Engine (v1) that analyzes issuer metadata, category patterns, product characteristics, and historical signals to produce automated liquidity recommendations. These signals influence simulated mint/burn actions and drive system behavior during pre-testnet operations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Dashboard supports wallet login, accurate issuer card rendering, and watchlist functions while updating UI states instantly in response to simulation or AI-driven events.\n2. Simulation engine produces reproducible proof hashes and updates listing states without manual triggers, demonstrating correct handling of all event sequences.\n3. AI Liquidity Engine (v1) outputs deterministic recommendations based on metadata inputs, triggering simulated liquidity responses such as mint/burn signals and enabling reviewers to observe how liquidity intelligence influences asset readiness.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. GitHub frontend branch containing dashboard components, UI logic, configuration files, and documentation showing how the dashboard interprets both simulation and AI signals.\n2. Screen-recorded demo showing login, watchlist use, issuer interactions, simulated events, and AI-driven liquidity state changes visible through dashboard indicators.\n3. Logs of simulated mint/burn events, AI-generated liquidity recommendations, and proof hashes stored in GitHub, illustrating full integration between the simulation engine and AI module.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cardano Testnet Integration, On-Chain Proofs & AI Liquidity Execution","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A complete end-to-end Cardano testnet workflow linking listing, metadata generation, minting, burning, and proof-of-listing transactions, integrated into the dashboard via real-time testnet queries.\n2. Documented smart contract logic or fallback mechanisms enabling testnet operations with clear explanation of how decisions, validation boundaries, and transaction sequences are structured.\n3. AI Liquidity Engine (v2) connected to testnet operations, converting AI-driven liquidity recommendations from Milestone 3 into actual testnet actions. The system executes on-chain actions such as mint/burn operations based on AI outputs, demonstrating how automated liquidity logic performs in real blockchain conditions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. At least 500 structured testnet transactions must be executed, covering full listing, minting, burning, and proof-of-listing flows, including cases where AI-generated liquidity instructions influence transaction order or frequency.\n2. Dashboard must visibly reflect testnet activity, updating indicators in real time based on confirmed transactions, allowing users to verify how both system logic and AI-driven liquidity decisions manifest on-chain.\n3. Smart contract scripts or fallback logic must be fully documented, with explanation of how AI-generated instructions are validated, queued, and executed on testnet safely and reproducibly.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. GitHub folder containing 500–1,000 representative transaction hashes, execution logs, and metadata outputs documenting how testnet transactions were triggered, including those initiated by AI-driven liquidity logic.\n2. A complete testnet walkthrough video demonstrating the sequence from listing → metadata → AI decision → on-chain mint/burn → dashboard confirmation, showing the interplay between AI logic and blockchain operations.\n3. Contract or fallback scripts with comments, architecture notes, and documentation explaining how AI liquidity signals are translated into safe, structured blockchain actions.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":31000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Public Demo, Documentation, Close-Out Report & Final Video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. A stable public demo environment combining the investor dashboard, metadata engine, issuer onboarding, and full Cardano testnet flow.\n2. Complete project documentation explaining onboarding rules, metadata standards, workflow diagrams, technical limitations, and integration steps.\n3. All final Catalyst close-out materials including the written close-out report and a comprehensive close-out demo video summarizing milestone achievements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Public demo URL accessible to reviewers without credentials, demonstrating end-to-end functionality clearly and reliably.\n2. Documentation fully covers issuer onboarding, listing logic, metadata rules, and testnet integration in a reviewer-friendly structure.\n3. Close-out report and final video must clearly present milestone achievements, deliverable completion, and system behavior using real workflow examples.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Public demo URL with working access, showing all modules behaving as documented.\n2. GitHub folder containing all Markdown documentation, workflow diagrams, integration instructions, and reference material.\n3. Final Catalyst close-out report and close-out video uploaded and included in the repository, demonstrating real system behavior end-to-end.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Thomas Wedler**: project management and trading-related content\n\nExperienced financial trader and entrepreneur. Ex Shell, Vattenfall, Masefield senior futures and options trader. Individual floor trader at Singapore Exchange. Tom has been building and deploying programs for automated market making and energy derivatives since 2014. 15 years Derivatives experience at multi-national organizations working closely with industry bodies and speaker at market conferences and workshops. Involved in crypto trading since 2014 and DeFi/oracles since 2018. Plutus Pioneer, Marlowe Pioneer and Atala Prism Pioneer.\n\nThomas is a certified Superforecaster with the Good Judgment Project and winner of the inaugural Hybrid Forecasting Challenge at SAGE / University of Southern California.\n\n[https://www\\.linkedin\\.com/in/thomas\\-wedler\\-18960/](https://www.linkedin.com/in/thomas-wedler-18960/)\n\nRole in Catalyst: Challenge Team (Fund 8–10), Sub-circle3, Catalyst Coordinators (funded proposers), Veteran Proposal Assessor, Reviewer in funded project milestone reporting Fund 10–14.\n\n**June Akra**: project management and risk-management related content, community\n\n**Sapient developer team**: to provide UI front-end and API for the portal.\n\nFounding member of BlockCarbon, financial market expert and academic with vast experience in risk management, derivatives and commodities. Experience for various risk functions in 2 billion-dollar AUM fund. Holder of Master degree in Investment with distinction and awarded Draper Prize. Certified Quantitative Finance (CQF) alumni London. Experienced video editor, content creator with combined 50,000 followers on social media, NFT collector and creator. Certified python AI practitioner, Plutus Pioneer &amp; Atala Prism Pioneer.\n\n[https://www\\.linkedin\\.com/in/june\\-a\\-a3a0b4174](https://www.linkedin.com/in/june-a-a3a0b4174)\n\nRole in Catalyst: Challenge Team (Fund 7–10), Sub-circle3, Catalyst Coordinators (funded proposers), Veteran Proposal Assessor, Reviewer in funded project milestone reporting (PoA pilot) Fund 9–14.\n\n**Sapient team members upon demand:**\n\nData scientist, Senior fullstack developer / head architect, LLM engineer, data engineer\n\n[https://www\\.18hall\\.com/sapient\\-predictive\\-analytics/](https://www.18hall.com/sapient-predictive-analytics/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"We use 2 standardized hourly rates:\n\nDevelopment: 200 ADA/hour\n\nOffice &amp; Project Management: 150 ADA/hour\n\n**Milestone Allocation**\n\n**Milestone 1: Data onboarding flow \\+ issuer schema finalized**\n\n(100 dev hrs + 50 PM hrs = 27,500 ADA)\n\n- Includes onboarding form, CSV schema, validator, issuer proof folders.\n\n**Milestone 2: Marketplace listing workflow \\+ metadata engine**\n\n(125 dev hrs + 40 PM hrs = 31,000 ADA)\n\n- Covers listing states, metadata generator, proof-of-listing artifacts.\n\n**Milestone 3: Investor dashboard \\+ simulation layer \\+ AI Liquidity Engine \\(v1\\)**\n\n(120 dev hrs + 40 PM hrs = 30,000 ADA)\n\n- Dashboard UI, simulation logic, AI-driven liquidity recommendations.\n\n**Milestone 4: Cardano testnet integration \\+ AI Liquidity Execution \\(v2\\)**\n\n(125 dev hrs + 40 PM hrs = 31,000 ADA)\n\n- On-chain mint/burn operations, testnet workflow, AI-triggered transactions.\n\n**Milestone 5: Public demo \\+ documentation \\+ close\\-out report &amp; video**\n\n(120 dev hrs + 40 PM hrs = 30,000 ADA)\n\n- Public demo environment, full documentation, Catalyst close-out materials.\n\nTotal = 149,500 ADA (within the 200,000 ADA cap).\n\nIn HashiFlo, project management hours already cover documentation, reporting, issuer coordination, and community outreach to Japanese agriculture stakeholders. These activities are included in the PM allocation, ensuring transparency and engagement without the need for a separate marketing budget.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"HashiFlo delivers high output with disciplined use of funds by expanding the proven foundation from Fund 14 into a scalable, Japan-ready RWA onboarding pipeline. The project focuses strictly on data, infrastructure, and on-chain feasibility - avoiding marketing spend, token engineering, or speculative modules, ensuring every ADA directly advances ecosystem capability.\n\nWe maintain a transparent cost structure:\n\n• 200 ADA/hour for technical development (validators, issuer pipeline upgrades, metadata automation, testnet integration).\n\n• 150 ADA/hour for operations (issuer coordination, compliance preparation, documentation, community outreach).\n\nBecause Fund 14 already established the data pipeline, schema, and initial testnet feasibility, Fund 15 resources can concentrate fully on scaling verified assets, strengthening validation logic, and introducing automated liquidity intelligence - all without duplicating past costs.\n\nThe resulting deliverables - a reusable verification pipeline, issuer onboarding for Japan, early-stage AI-driven liquidity logic, and a working testnet prototype - provide immediate, shared utility for every future RWA project on Cardano.\n\nWith a proven delivery track record across multiple funds, HashiFlo offers high impact at low cost: each ADA contributes to real, verifiable, Cardano-native RWAs that other teams can build upon.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400058","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"RWA","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1764}