{"pr_id":"019ac254-b5f1-7444-967a-3c6f64fb2a99","title":"Cardano High School Scholars Club for Underserved Areas","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"In many underserved communities, students face  barriers to education, especially in emerging fields like blockchain technology , limiting their opportunities to participate in the digital economy.","solution":"we will provide students with practical experience By integrating Cardano’s blockchain technology into the curriculum, equipe them with in-demand  and inspire them to pursue careers in blockchain","proposer_name":"Sunday Dominic","proposer_relevant_experience":"Project Lead : Sunday Dominic\n\nRole: Oversee the entire project, coordinate between stakeholders, manage timelines, and ensure alignment with the project’s goals.\n\nCurriculum Developer: Mautin Olayemi\n\nRole: Design and refine the blockchain curriculum, ensuring it’s age-appropriate, engaging, and aligned with educational standards.\n\nCommunity Engagement Coordinator: Ojo Christiana\n\nRole: Build and maintain relationships with partner schools, organize events, and ensure active involvement of the community.\n\nBlockchain Team lead: Fasonda James\n\nRole: Provide technical expertise, support student projects, and ensure that the curriculum accurately reflects current blockchain trends and practices.\n\nEvaluation Specialist: Sulaimon Fanimokun\n\nRole: Design and implement assessment tools, analyze data on student performance, and produce impact reports.","url":null,"funds":55000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Cardano High School Scholars Club for Underserved Areas","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Sunday Dominic","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":55000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"In many underserved communities, students face  barriers to education, especially in emerging fields like blockchain technology , limiting their opportunities to participate in the digital economy.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"we will provide students with practical experience By integrating Cardano’s blockchain technology into the curriculum, equipe them with in-demand  and inspire them to pursue careers in blockchain","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.youtube.com/watch?v=v444Y5JKwTg","https://www.instagram.com/reel/DNkRHtbstQM/?igsh=MTBsdTJkaWtnNGJh","https://drive.google.com/file/d/1B4CKeyfgevVl14llSuCEd9WNKsOP8IfA/view?usp=drivesdk","https://12miles.com.ng/","https://drive.google.com/drive/folders/1JNYcieHBG_wZrHkXLLWsCD6j9jByzwBM"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Fully open source","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Training","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Who We’re Targeting:\n\nWe’re focusing on high school students in underserved communities, particularly in rural areas where access to quality STEM education and technology exposure is limited.\n\n\n\nHow We’ll Reach Them:\n\nWe’ll collaborate with local schools and education authorities, conduct in-person workshops during school hours, and leverage trained facilitators to ensure a hands-on, engaging learning experience.\n\n\n\nWhy This Matters for Cardano:\n\nBy introducing blockchain technology and the Cardano ecosystem to these students, we’re fostering early adoption and literacy, paving the way for a more inclusive and diverse blockchain community in the future. It also aligns with Cardano’s mission to drive positive social impact and education.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"Curriculum Development: Redesigning and refining the hands-on blockchain curriculum focused on Cardano for high school students.\n\nTeacher Training: Conducting workshops and training sessions for educators to effectively deliver the curriculum.\n\nIn-Person Trainning: Organizing and facilitating 10 weeks hands-on blockchain workshops at partner schools to over 5000 high school students.\n\nStudent Projects: Encouraging students to work on real-world blockchain projects, such as building simple DApps or creating smart contracts.\n\nCommunity Engagement: Hosting events and mentorship sessions to connect students with blockchain professionals.\n\nAssessment and Feedback: Conducting evaluations to measure student progress and gather feedback for continuous improvement.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"Student Engagement: Measuring the number of students participating in the program and their level of involvement in activities and projects.\n\nKnowledge Acquisition: Assessing improvements in students' understanding of blockchain concepts, through quizzes, tests, and projects.\n\nProject Completion: Tracking the number of student projects completed, such as DApps or smart contracts, and their quality.\n\nTeacher Feedback: Collecting feedback from educators on the effectiveness of the curriculum and training.\n\nCommunity Impact: Evaluating the broader impact on the community, such as increased awareness and interest in technology careers.\n\nLong-Term Outcomes: Monitoring the progression of students into further education or tech-related careers.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Our proposed solution, the Cardano High School Scholars Club, directly addresses the educational gap in underserved communities by providing a structured, hands-on blockchain curriculum. We leverage Cardano’s technology to teach students foundational concepts in blockchain, smart contracts, and decentralized applications. This immersive approach not only builds technical skills but also boosts confidence, critical thinking, and problem-solving abilities. Ultimately, this solution empowers students, opens up new career pathways, and fosters long-term community growth in the tech sector.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The Cardano High School Scholars Club will have a far-reaching positive impact on the broader Cardano community by cultivating a new generation of blockchain-literate individuals. As over 5000 students gain hands-on experience, they become potential contributors, developers, and advocates for Cardano, driving innovation and adoption. This infusion of fresh talent and diverse perspectives will strengthen the Cardano ecosystem, foster community growth, and enhance the network’s reputation for education and inclusivity. Ultimately, this initiative will help build a robust pipeline of Cardano enthusiasts and innovators, propelling the ecosystem forward.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"12 Miles is a formally incorporated organization with a proven track record of delivering impactful technology education to underserved communities since 2020. Over the past three years, we have trained more than 11,000 students in STEM and digital skills. In 2025 alone, thanks to the support of Cardano Project 1300167, we trained over 5,000 students, directly reaching rural high schools. Our work has been recognized by local education authorities and even covered on TVC News [https://www\\.youtube\\.com/watch?v=v444Y5JKwTg](https://www.youtube.com/watch?v=v444Y5JKwTg) , highlighting our credibility and the tangible impact of our programs.\n\nWe operate with transparency, accountability, and a structured approach. All our programs are carefully documented, with attendance sheets, student assessments, and facilitator reports ensuring clear records of participation and learning outcomes.\n\nValidation of Approach\n\nWe validate the feasibility of our programs through:\n\nPilot Testing: Running small-scale programs in select schools to test curriculum, logistics, and student engagement.\n\nContinuous Assessment: Using pre- and post-program evaluations to measure learning outcomes.\n\nStakeholder Feedback: Gathering input from students, teachers, and school administrators to refine delivery.\n\nPublic Recognition: Media coverage and endorsements from educational authorities further validate the effectiveness and credibility of our programs.\n\nThis combination of demonstrated experience, documented outcomes, and continuous feedback ensures that 12 Miles can deliver the proposed project with a high level of trust and accountability.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Curriculum Development & School Onboarding","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A refined, age-appropriate Cardano-focused blockchain curriculum for high school students (modules, slides, worksheets, facilitator guide).\n\n\n\nRecruitment and onboarding of 8–12 target underserved high schools.\n\n\n\nTraining of facilitators/educators on content delivery and Cardano tools","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Curriculum reviewed and approved by internal team + external educator for clarity and feasibility.\n\n\n\nSigned onboarding confirmation from each participating school.\n\n\n\nFacilitator training completed.\n\n\n\nAssessment tools tested during a dry run.\n\n\n\nProgram timetable agreed upon with each school.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"PDF package of curriculum + facilitator guide.\n\n\n\nSigned school onboarding letters / MoUs.\n\n\n\nAttendance record of facilitator training + training report.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"In-Person Program Delivery Across Underserved High Schools","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Full delivery of Cardano High School Scholars Club across the selected schools.\n\n\n\nWeekly in-person teaching sessions covering blockchain basics, Cardano ecosystem, wallets, smart contracts, and DApp exploration.\n\n\n\nStudent participation in hands-on exercises (setting up wallets, interacting with testnet, simple smart contract logic).\n\n\n\nOngoing monitoring, attendance tracking, and classroom support.\n\n\n\nMid-program review to identify student challenges and adjust learning pace.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Minimum of 70% attendance rate across all participating schools.\n\n\n\nAt least 3–4 practical blockchain activities completed by students.\n\n\n\nFacilitators follow weekly lesson plan structure.\n\n\n\nZero virtual sessions—100% in-person delivery.\n\n\n\nMid-program student feedback collected.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Attendance sheets signed by teachers.\n\n\n\nPhotos/videos of classroom activities.\n\n\n\nWeekly session reports submitted.\n\n\n\nMid-program feedback summary.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":25000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Cardano NEXTGEN  Tech Conference & Quizathon for High school","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Successful Organization of the Conference\n\n\n\nA fully in-person, one-day tech conference for secondary school students in underserved communities.\n\n\n\nIncludes keynote sessions, workshops, interactive tech demos, and student showcases.\n\n\n\nAttendance of at least 800 students across 8-12 participating schools.\n\n\n\nQuizathon Competition Execution\n\n\n\nA competitive, team-based technology quiz (Quizathon) covering blockchain, robotics, AI, and 21st-century skills.\n\n\n\nTop-performing students recognized with awards or certificates.\n\n\n\nEvent designed to encourage collaboration, problem-solving, and practical knowledge applicatio","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Conference successfully held within the scheduled date. \n\nMinimum student participation: at least 90% of registered students attend.\n\nQuizathon executed with all schools represented, and at least 80% of students participate in at least one quiz round.\n\nPositive feedback collected from students, teachers, and school administrators regarding engagement, learning, and experience.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Official attendance register signed by students and school coordinators.\n\n\n\nConference program, event photos, and videos showing workshops, keynote sessions, and Quizathon rounds.\n\n\n\nQuizathon results and certificates issued to winners and participants.\n\n\n\nFeedback reports from students, teachers, and facilitators documenting learning outcomes and participant satisfaction.\n\n\n\nMedia coverage, press releases, or social media posts highlighting the event.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Project Lead : Sunday Dominic\n\nRole: Oversee the entire project, coordinate between stakeholders, manage timelines, and ensure alignment with the project’s goals.\n\nCurriculum Developer: Mautin Olayemi\n\nRole: Design and refine the blockchain curriculum, ensuring it’s age-appropriate, engaging, and aligned with educational standards.\n\nCommunity Engagement Coordinator: Ojo Christiana\n\nRole: Build and maintain relationships with partner schools, organize events, and ensure active involvement of the community.\n\nBlockchain Team lead: Fasonda James\n\nRole: Provide technical expertise, support student projects, and ensure that the curriculum accurately reflects current blockchain trends and practices.\n\nEvaluation Specialist: Sulaimon Fanimokun\n\nRole: Design and implement assessment tools, analyze data on student performance, and produce impact reports.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Milestone 1: Curriculum Development &amp; School Onboarding – 15,000 ADA\n\nBreakdown:\n\nCurriculum Design &amp; Development – 6,000 ADA\n\nCreation of modules, slides, facilitator guide, worksheets, assessments\n\nPilot Testing &amp; Review – 2,500 ADA\n\nDry-run with small student groups, external educator review\n\nFacilitator Training – 3,500 ADA\n\nWorkshops for teacher/facilitator onboarding, stipends\n\nSchool Onboarding &amp; Coordination – 3,000 ADA\n\nEngagement with schools, MoUs, scheduling, logistics\n\nMilestone 2: Program Delivery &amp; Student Engagement – 25,000 ADA\n\nBreakdown:\n\nIn-Person Teaching Sessions – 12,000 ADA\n\nClassroom delivery, teaching materials, equipment, facilitator stipends\n\nHands-on Student Activities – 6,000 ADA\n\nWallet setup, smart contracts, mini DApps, project materials\n\nMonitoring &amp; Evaluation – 4,000 ADA\n\nAttendance tracking, mid-program assessment, feedback collection\n\nTravel &amp; Logistics – 3,000 ADA\n\nTransport to schools, accommodation (if needed), daily operational costs\n\nMilestone 3: Conference &amp; Quizathon – 15,500 ADA\n\nBreakdown:\n\nOrganizing the Conference – 6,000 ADA\n\nVenue, setup, materials, event branding, logistics\n\nQuizathon Prizes &amp; Incentives – 5,000 ADA\n\nStudent awards, certificates, recognition items\n\nMentorship &amp; Guest Speakers – 4,000 ADA\n\nInviting blockchain experts, facilitators, and keynote sessions","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The cost of the project presents significant value for the Cardano ecosystem by creating a sustainable pipeline of blockchain-literate students who can become future developers, innovators, and advocates for Cardano. By investing in high-quality education, we’re fostering long-term growth and adoption of Cardano technology, ensuring that the community is enriched with knowledgeable individuals who can drive innovation forward.\n\n\n\nAdditionally, the program helps bridge the digital divide by bringing cutting-edge blockchain education to underserved communities, thereby increasing Cardano’s reach and impact. The cost is effectively an investment in the ecosystem’s future, ensuring that Cardano remains at the forefront of blockchain technology and education.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1300167","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Training","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1766}