{"pr_id":"019abf41-6778-76b3-a007-6b832a63230a","title":"DeFi BTC Staking on Cardano Smart Contract","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"BTC liquidity on Cardano remains low due to high fees, complex bridging processes, and the steep learning curve of Cardano DeFi","solution":"We will build a BTC-focused DeFi dApp enabling Bitcoin holders to join Cardano DeFi seamlessly using only their BTC wallets, powered by Cardano smart contracts","proposer_name":"Nguyen Thi An","proposer_relevant_experience":"Project Team:\n\n1. Nguyen Thi An (Project Lead): 15++ years of experience managing financial and digital solution projects. Extensive PO experience in blockchain, leading product development and delivery.\n    1. [https://www\\.linkedin\\.com/in/nguyen\\-thi\\-an\\-4a586171/](https://www.linkedin.com/in/nguyen-thi-an-4a586171/)\n2. Trieu Dinh Nguyen (Solution Architect &amp; Smart Contract Engineer): 5++ years in blockchain engineering with deep expertise in Cardano smart contracts. Skilled in system architecture, microservices, API design, and backend development (Python/Golang)\n    1. [https://www\\.linkedin\\.com/in/tdnguyennd/](https://www.linkedin.com/in/tdnguyennd/)\n3. Tran Viet Anh (Full-Stack Engineers): 5++ years of experience in frontend, backend systems, and microservice integration. Specialized in Cardano development, delivering dApp UI, backend services, and indexers.\n    1. [https://www\\.linkedin\\.com/in/tva2710/](https://www.linkedin.com/in/tva2710/)","url":null,"funds":196000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"DeFi BTC Staking on Cardano Smart Contract","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Nguyen Thi An","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":196000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":9,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"BTC liquidity on Cardano remains low due to high fees, complex bridging processes, and the steep learning curve of Cardano DeFi","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will build a BTC-focused DeFi dApp enabling Bitcoin holders to join Cardano DeFi seamlessly using only their BTC wallets, powered by Cardano smart contracts","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":{"links":[]},"sub_fields":null},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Our project depends on Wanchain to bridge native BTC into WBTC on Cardano. This integration is essential for enabling BTC liquidity and participation in Cardano DeFi.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Smart contract will be opensource","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Staking","group":"DeFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"BTC Grow introduces a new way to bring native BTC liquidity into Cardano DeFi using a fully trust-minimized cross-chain flow. Unlike previous wrapped-asset attempts, BTC Grow uses:\n\n\n\n- Native Bitcoin locking on script of Bitcoint chain\n- Direct minting of wBTC on Cardano, stored in a non-custodial smart contract\n- Automated supply into Danogo’s Flexible Lending Pool, enabling BTC to earn real yield from borrower demand\n\n\n\nSelf-custodial withdraw and redemption, allowing users to burn wBTC and unlock BTC back to their wallets\n\n\n\nThis creates a first-of-its-kind BTC-to-Cardano yield pipeline where users maintain full custody across both chains.\n\nIt also extends Cardano’s DeFi ecosystem by enabling BTC-backed borrowing, leveraged exposure, and new liquidity flows that have not existed on Cardano before.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The mainnet dApp will allow users to perform a fully functional BTC staking and yield flow, including:\n\n\n\n**User\\-facing functionality**\n\n\n\n- Stake BTC directly from a Bitcoin wallet.\n- View staking balance, accumulated rewards, transaction history, and health metrics.\n- Withdraw yield or redeem principal back to BTC at any time.\n- Track transaction status across Bitcoin, Wanchain, and Cardano chains.\n\n\n\n**System\\-automated functionality \\(no action needed from user\\)**\n\n\n\n- Lock BTC in Wanchain MPC vaults.\n- Mint wBTC on Cardano and supply it to Danogo Flexible Pool.\n- Manage liquidity, pool positions, and yield accumulation.\n- Burn wBTC and release BTC back to the user on redemption.\n\nThe MVP will be accessible on BTC Grow mainnet dApp with real BTC and verifiable on-chain records across all three chains.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Mainnet KPIs will focus on measurable, on-chain user adoption and liquidity:\n\n\n\n- **BTC Liquidity Supplied:** ~1M ADA equivalent of BTC supplied into Danogo Flexible Pool in the first month.\n- **Active BTC Wallets**: ≥20 wallets staking BTC on mainnet, forming the initial liquidity base.\n- **Yield Distribution Events**: Verified on-chain supply/withdraw/redeem transactions showing actual yield earned in the Flexible Pool.\n\n\n\nThese indicators provide clear proof of system utility, adoption, and long-term value for the ecosystem.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**1\\. Problem We Are Solving**\n\n\n\nIt is currently very difficult for BTC holders to participate in Cardano DeFi. The onboarding process requires bridging, technical knowledge, and multiple platforms, which creates high friction and prevents BTC liquidity from reaching Cardano. As a result, BTC — the world’s largest crypto asset — is almost entirely absent from Cardano DeFi.\n\n\n\n**2\\. Our Approach**\n\n\n\nBTC Grow solves this problem by providing a one-click BTC staking dApp:\n\n\n\n- a. Users only need their Bitcoin wallet, without needing any Cardano knowledge.\n- b. BTC is locked in a native Bitcoin script, ensuring full self-custody.\n- c. Wanchain bridges native BTC into wBTC on Cardano.\n- d. wBTC is automatically supplied into the Danogo Flexible Lending Pool, generating real yield from borrowers.\n\n\n\nThis approach removes cross-chain complexity, maximizes security for BTC holders, and enables yield generation in a fully transparent, on-chain manner on Cardano.\n\n\n\n**3\\. Who We Will Engage**\n\n\n\n- a. BTC holders who want to earn yield without leaving the Bitcoin chain.\n- b. Cardano DeFi users who need BTC liquidity for trading, borrowing, and leverage.\n- c. Ecosystem protocols (DEXs, stablecoins, derivatives) that can integrate with BTC liquidity to expand Cardano’s market depth.\n\n\n\n**4\\. Why This Solution Is Unique**\n\n\n\n- a. One-click UX: Simplifies BTC onboarding into Cardano.\n- b. Self-custodial & transparent: BTC stays locked on Bitcoin; wBTC is managed by audited Cardano smart contracts.\n- c. Cross-chain synergy: Combines Bitcoin security, Wanchain bridging, and Cardano DeFi infrastructure.\n- d. Ecosystem enabler: Deep BTC liquidity unlocks leverage trading, BTC perpetuals, and BTC-backed stablecoins.\n\n\n\n**5\\. How We Will Measure Impact**\n\n\n\n- a. BTC Liquidity Supplied: Target ~$1M BTC TVL in the first months after launch, realistic for an initial rollout and significant enough to strengthen lending pools.\n- b. Unique Suppliers: At least 20 wallets actively supplying BTC in the first month, establishing a core supplier base and validating usability of the system.\n\n\n\n**6\\. Why This Matters to Cardano**\n\n\n\nUnlocking BTC liquidity is a strategic missing piece for Cardano DeFi. BTC is the largest and most demanded crypto asset for leverage, trading, and hedging. By bringing BTC to Cardano in a seamless, self-custodial way, BTC Grow increases TVL, attracts new users, and enables advanced financial products — positioning Cardano as a competitive DeFi ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**Positive Impact & Measuring Impact**\n\n\n\n- Unlock BTC Liquidity: BTC Grow enables Bitcoin holders to supply liquidity directly into Cardano DeFi, bringing high-value BTC capital into lending and trading.\n- Lower Bridge Cost: Collaboration with Wanchain reduces bridging fees by ~10x, significantly cutting the cost of BTC inflow.\n- New Cross-Chain UX: BTC Grow introduces a framework for BTC wallets to interact directly and permissionlessly with Cardano smart contracts, setting a new standard for seamless cross-chain user experience.\n\n\n\n**How Impact Will Be Measured**\n\n\n\n- On-chain metric: Target ~$1M BTC TVL supplied into Cardano within the first month after mainnet launch.\n\n\n\n\n\n**How Outputs Will Be Shared**\n\n- Public Dashboards: Transparent TVL and pool activity.\n- Catalyst Updates: Regular progress reports shared with the community.\n- Open Source: Smart contracts and wallet-integration code published on GitHub for reuse.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our team has extensive experience building secure blockchain products, including smart contract development, cross-chain integrations, high-performance backend systems, and UX-focused dApps. Each core member has multiple years of hands-on experience in blockchain engineering, financial systems, and digital product delivery. This background demonstrates our capability to design and implement complex on-chain and off-chain architectures with a high level of reliability.\n\n**To ensure trust and accountability, we follow a transparent and disciplined development process:**\n\n- Milestone-based execution with clearly defined technical deliverables\n- Public repositories for smart contracts, backend services, and frontend code\n- Internal peer review for all smart contract and system components\n- Independent external audit before launch\n- Regular Catalyst progress updates and financial reporting\n\n**Feasibility will be validated through a structured multi\\-phase approach:**\n\n- Technical integration tests across Bitcoin, Wanchain, and Cardano smart contracts\n- End-to-end flow testing (stake → supply → withdraw → redeem)\n- Public testnet release for community testing and open feedback\n- Collection of usage metrics to verify stability and performance\n\nWith a team experienced in blockchain architecture, secure smart contract development, and cross-chain system design, along with a clear verification and reporting framework, we are positioned to deliver this project with strong trust, accountability, and technical feasibility.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Design Phase","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Research Wanchain bridge flow (BTC lock/unlock, metadata type 9/8, smgID update).\n- Custody model: BTC vault non-custodial (MPC), wBTC self-custodial on Cardano.\n- Smart contract constraint specification: Bridge Asset, Router, Flexible Pool integration.\n- System architecture: BFF, Indexer, Router Agent, APIs, FE flows.\n- Wireframes for staking, withdrawal, and transaction history.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Research document approved by core team with bridge mechanics and custody boundaries.\n- Constraint specification reviewed (value conservation, routing, metadata validation, timelock/refund, anti-replay).\n- Architecture diagrams validated for completeness.\n- Wireframes confirmed ready for implementation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Business Constraint document describing all validators and policy scripts.\n- Repository entry with architecture diagrams (component, context, sequence flows).\n- Approved Figma wireframes aligned with backend design.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":40000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"First Stake Transaction","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Implement BTC testnet transaction flow to lock BTC into Wanchain Vault.\n- Wanchain bridge mints wBTC on Cardano preprod and stores it in the Bridge Asset contract.\n- Implement BFF and APIs for quota, fee, smgID, OTA generation, and order submission.\n- Integrate frontend to connect wallets, initiate staking, and confirm transaction status.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- BTC testnet wallets (Unisat/Xverse) connect and lock BTC successfully.\n- Minted wBTC visible in Bridge Asset contract on Cardano preprod.\n- End-to-end staking transaction verifiable across BTC testnet → Wanchain → Cardano preprod.\n- At least 10 successful staking transactions executed on testnet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Deployed Bridge Asset smart contract and specification files (mint logic, metadata rules, UTxO flow).\n- Verified transaction hashes across all chains.\n- Frontend screenshots showing wallet connection, signing, and minted wBTC confirmation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Supply Bot to Flexible Pool","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Develop automated bot to monitor Bridge Asset for wBTC deposits and supply them into Flexible Pool.\n- Enforce contract constraints: value conservation, output validation, idempotent execution.\n- Extend Indexer to track pool positions, transaction history, and user-linked details.\n- Update FE dashboard with “Your Position”, rewards, and transaction history.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Bot supplies minted wBTC automatically without manual intervention.\n- Supply transactions logged and verifiable on Cardano preprod.\n- Dashboard accurately displays positions, staking rewards, and transaction details.\n- ≥10 automated supply operations executed successfully on testnet.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public repository with bot source code and README.\n- Dashboard screenshots showing updated position and history.\n- ≥10 transaction hashes on Cardano preprod confirming automated supply.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Withdraw, Redeem BTC & Public Testnet Launch","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Implement withdrawal flow: users sign with BTC wallet to request redemption.\n- Router Agent withdraws wBTC from Flexible Pool into Bridge Asset.\n- Implement burn logic in Bridge Asset to release BTC on Wanchain.\n- Integrate full withdraw → burn → redeem pipeline with automated multi-chain status tracking.\n- Update frontend with withdraw/redeem UI and real-time Market Info.\n- Deploy full system (SCs, BFF, Indexer, Router Agent, FE) to Cardano preprod + BTC testnet.\n- Publish guides and onboarding for public testnet users.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Users initiate withdrawal using BTC wallet signature.\n- wBTC successfully withdrawn and burned, releasing BTC on BTC testnet.\n- ≥10 complete withdraw → redeem transactions executed and verifiable.\n- Public testnet dApp live with accurate multi-chain status updates.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Repository updates: withdraw + burn logic, contract specs, deployment artifacts.\n- Verified Cardano + BTC testnet transaction hashes showing full redemption flow.\n- Screenshots of withdraw/redeem UI with transaction progress and confirmations.\n- Public testnet link with user guides and documentation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":66000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mainnet Release & Completion Report ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Deploy BTC Grow to Cardano mainnet: staking, supply, withdraw, redeem using real BTC.\n- Compile final project report (research, design, implementation, testing).\n- Produce video showcasing system architecture and flows.\n- Publish outputs via Catalyst and community channels.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Platform live and functional with full end-to-end BTC flow.\n- Final report includes all technical deliverables and evidence.\n- Showcase video uploaded and shared.\n- Public Catalyst update delivered.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Mainnet deployment package with all SCs and deployed addresses.\n- Execution report listing ≥20 mainnet transactions and initial BTC TVL.\n- YouTube link to final video.\n- Catalyst post linking report + video.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Project Team:\n\n1. Nguyen Thi An (Project Lead): 15++ years of experience managing financial and digital solution projects. Extensive PO experience in blockchain, leading product development and delivery.\n    1. [https://www\\.linkedin\\.com/in/nguyen\\-thi\\-an\\-4a586171/](https://www.linkedin.com/in/nguyen-thi-an-4a586171/)\n2. Trieu Dinh Nguyen (Solution Architect &amp; Smart Contract Engineer): 5++ years in blockchain engineering with deep expertise in Cardano smart contracts. Skilled in system architecture, microservices, API design, and backend development (Python/Golang)\n    1. [https://www\\.linkedin\\.com/in/tdnguyennd/](https://www.linkedin.com/in/tdnguyennd/)\n3. Tran Viet Anh (Full-Stack Engineers): 5++ years of experience in frontend, backend systems, and microservice integration. Specialized in Cardano development, delivering dApp UI, backend services, and indexers.\n    1. [https://www\\.linkedin\\.com/in/tva2710/](https://www.linkedin.com/in/tva2710/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Estimated Project Duration: 8 months\n\n\n\n**1\\. Smart Contract Development \\(50,000 ADA\\)**\n\n\n\n- Bridge Asset contracts (mint, burn, withdraw).\n- Flexible Pool integration (supply & redeem flow).\n- Babel Fee & routing logic.\n- Deployment scripts and core unit tests.\n\n\n\n**2\\. Front\\-End dApp & UI/UX \\(40,000 ADA\\)**\n\n\n\n- BTC and Cardano wallet connection.\n- Staking, withdraw, and redeem pages.\n- Dashboard (Positions, Rewards, History).\n- Market Info components (TVL, Borrow, Collateral, HF, Liquidity).\n- Streamlined Figma design and prototypes.\n\n\n\n**3\\. Backend Services & Infrastructure \\(40,000 ADA\\)**\n\n\n\n- BFF service layer and APIs.\n- Indexer for Bridge Asset & Flexible Pool (optimized scope).\n- Router Agent (light version) and supply bot logic.\n- Hosting & monitoring (leveraging shared Danogo infrastructure).\n\n\n\n**4\\. Cross\\-Chain Integration \\(30,000 ADA\\)**\n\n\n\n- BTC wallet signing & monitoring.\n- Wanchain API usage (quota, fee, smgID).\n- Metadata validation & uniqueId mapping.\n- End-to-end transaction flow across BTC → Wanchain → Cardano.\n- Reuse of existing code components where possible.\n\n\n\n**5\\. Testing & Audit \\(26,000 ADA\\)**\n\n\n\n- Testnet deployments (BTC testnet + Cardano preprod).\n- End-to-end stake → supply → withdraw tests.\n- External audit with a reduced scope focused on Bridge Asset logic.\n- Code review and bug fixing.\n\n**6\\. Project Management & Reporting \\(10,000 ADA\\)**\n\n\n\n- Milestone tracking and coordination.\n- Essential documentation (system design, constraints, architecture).\n- Catalyst reporting and financial updates.\n- Final report and a simplified showcase video.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Value for Money for the Cardano Ecosystem\n\nThe requested budget of 196,000 ADA is proportional to the scope of delivering a secure cross-chain DeFi protocol. Costs are aligned with standard blockchain development rates, with smart contract engineering and audits as the most resource-intensive.\n\n\n\n- Smart Contract (~25%): Critical for securing user funds and ensuring transparency.\n- Application Development (~40%): Covers frontend, backend, indexers, and bots for usability and quality control.\n- Cross-Chain Integration (~15%): Specialized development for Wanchain APIs, BTC wallet signing, and metadata validation.\n- Testing & Audit (~10%): ensures that the smart contract audit and testing processes are conducted professionally and securely.\n- Project Management & Reporting (~5%): Dedicated to Catalyst updates, public documentation, and a final report + video for knowledge sharing.\n\n\n\nBy enabling BTC holders to supply liquidity directly into Cardano, the project targets ~$1M BTC TVL in the first month, strengthening lending pools and diversifying liquidity. This ensures the budget directly translates into measurable economic and technical value for the Cardano ecosystem","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Staking","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1767}