{"pr_id":"019aa852-735a-760e-85c2-657e625da8bd","title":"ATLAS - Privacy-Focused Yield Tokenization","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano lacks unified yield: fragmented assets, no standard wrapper, no yield marketplace, no fixed-rate tools, hindering liquidity, composability, risk hedging, and institutional-grade participation.","solution":"Atlas unifies Cardano yield with CSY, enabling PT/YT trading, fixed income, and liquidity unlocks. With Midnight privacy and cross-chain reach, it becomes the yield layer powering advanced DeFi.","proposer_name":"Oliver Radivojevic","proposer_relevant_experience":"Atlas is being delivered by a joint effort between the Titans Core Team and FIWORK, a blockchain engineering studio led by seasoned experts in DeFi, infrastructure, and Plutus development. Titans provides product direction, ecosystem experience, revenue-model expertise, and operational oversight, while FIWORK supplies the engineering force responsible for designing, implementing, and testing the protocol across all five development milestones.\n\n**Titans / Atlas Team:**\n\nOliver Radivojevic - CEO &amp; Founder: [https://www\\.linkedin\\.com/in/o\\-r\\-893341136/](https://www.linkedin.com/in/o-r-893341136/) / [https://x\\.com/Apex\\_333](https://x.com/Apex_333)\n\nCJ O'Heany - Product Manager: [https://www\\.linkedin\\.com/in/cjoheany](https://www.linkedin.com/in/cjoheany) / [https://www\\.cjoheany\\.com](https://www.cjoheany.com)\n\nCJ is a multidisciplinary game developer, marketer, and product designer.  With experience spearheading the design and development on much of the Titans catalogue including the PFP NFT collection, Stronghold NFT collection, and Titan token design.  CJ is devoted to creating simple, elegant, and effective product designs for the Atlas platform.\n\nAlexandru Campurean - Marketing Manager:  [https://linktr\\.ee/sic236](https://linktr.ee/sic236) / [https://x\\.com/Sic2336](https://x.com/Sic2336)\n\nSic is a Web3 veteran who entered the blockchain space in 2019. Over the past several years, he has supported a wide range of projects across multiple chains, serving as Marketing Lead, Community Manager, and Business Developer. With deep experience in ecosystem growth and user engagement, Sic is dedicated to advancing the Web3 space and setting Atlas for long-term success.\n\n**FIWORK Team:**\n\nFIWORK Website: [https://www\\.fiwork\\.co/](https://www.fiwork.co/)\n\nCarlos Rene – FIWORK Founder &amp; Technical Lead: [https://www\\.linkedin\\.com/in/ccerrato147/](https://www.linkedin.com/in/ccerrato147/)\n\nCarlos is a veteran innovator with over 15 years of experience in AI, startups, and enterprise systems. As the founder of FIWORK and creator of DEGA, he leads the overall engineering strategy for Atlas. Carlos oversees protocol architecture, R&amp;D, cross-chain considerations, and technical alignment with Cardano and Midnight standards.\n\nDavid Alvarado – Project Manager &amp; Operations: [https://www\\.linkedin\\.com/in/david\\-alvarado\\-restrepo/](https://www.linkedin.com/in/david-alvarado-restrepo/)\n\nDavid manages execution across all engineering milestones, coordinating delivery timelines, QA cycles, and communication between Titans and FIWORK. His background in digital product management and agile operations ensures the project remains on schedule, aligned, and optimized for efficient delivery.\n\nPavel Espitia – Lead Software Engineer: [https://co\\.linkedin\\.com/in/pavelespitia](https://co.linkedin.com/in/pavelespitia)\n\nPavel brings 17 years of software engineering experience, including eight years specializing in blockchain. He is responsible for the design and implementation of Atlas’ core systems — including the Plutus validators, off-chain transaction builder, backend architecture, and security-driven development standards. His focus on scalable, high-assurance engineering ensures Atlas is built to institutional requirements.\n\nTogether, Titans and FIWORK form a cohesive, highly capable team with deep experience in Cardano development, DeFi architecture, and secure system design. This partnership provides the technical and operational strength required to bring Atlas from concept to full public deployment.","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"ATLAS - Privacy-Focused Yield Tokenization","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Oliver Radivojevic","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":5,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano lacks unified yield: fragmented assets, no standard wrapper, no yield marketplace, no fixed-rate tools, hindering liquidity, composability, risk hedging, and institutional-grade participation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Atlas unifies Cardano yield with CSY, enabling PT/YT trading, fixed income, and liquidity unlocks. With Midnight privacy and cross-chain reach, it becomes the yield layer powering advanced DeFi.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://medium.com/@houseoftitans/atlas-white-paper-5e904a736f2f","https://x.com/MidnightNtwrk/status/1987165502074916964?s=20","https://x.com/IOHK_Charles/status/1987202818042962306?s=20"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"ATLAS has no external organizational dependencies that limit its ability to launch or operate. The Titans Core Team leads the project’s architecture, design, and protocol direction. For execution, Titans has contracted FIWORK/DEGA — a proven blockchain engineering studio — to deliver development, QA, and DevOps work. This is a structured service relationship, not a dependency on another protocol or external system. No other organizations or infrastructure are required for ATLAS to function once deployed.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Atlas will retain its core smart contract architecture and backend systems as proprietary IP to protect security, prevent fork-based exploits, and ensure long-term protocol integrity. While documentation and integration guides will be publicly available, the underlying codebase will not be open-sourced and will remain licensed under a closed, protocol-governed model.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Yield","group":"DeFi"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"In DeFi today, the concept of yield tokenization, splitting a staked asset into tradable “principal” and “yield” components, has already been proven to be a multi-billion dollar market.  Pendle Finance, on Ethereum, has pioneered this model reaching a $1.1+ billion market cap in 2024, with TVL currently at $5+ billion and $PENDLE’s price exploding by +590% through 2024 clearly displays strong demand within this sector.\n\n\n\nLikewise, Spectra Finance (formerly APWine) is another Ethereum-based PT/YT splitting protocol, focusing on stablecoin yield markets and permissionless pools.  Spectra’s TVL reached ~$190+ million in early 2025.  The key takeaway is that the value in yield-trading protocols is tied to the project’s TVL and revenue. As the protocol continues to generate consistent value, in both Pendle and Spectra’s cases, the token and project value rise accordingly.\n\n\n\nThat being said, Ethereum has a vastly different ecosystem and depth of liquidity compared to Cardano, as it has only recently been incubating similar products.  Optim Finance takes a different approach to ADA yield, essentially acting as a Cardano yield aggregation and bond platform, as opposed to a PT/YT marketplace.  Offering Liquidity Bonds (on-chain fixed-yield bonds) and the OADA/sOADA two-token system for enhanced ADA staking yields.  This OADA mechanism creates 1:1 ADA-backed synthetic tokens and a staked sOADA variant accruing staking yield.  While still boosting ADA staking income, this does not create a secondary yield marketplace that Atlas is aiming to create.\n\n\n\nAtlas looks to disrupt this nascent space by combining the proven market mechanics with new features.  Atlas will tokenize staked assets into tradable Principal and Yield tokens, unlocking immediate liquidity from staking.  Where Atlas differs primarily are threefold: privacy and compliance, cross-chain structure, and asset-backed ecosystem integrations that competitors are currently lacking.\n\n\n\nCreated by the same visionary minds behind Titans, Atlas is being built from the ground up for operations within Cardano by default, and soon to have Midnight integrations soon after MVP.  Our partnership with the Midnight Foundation ensures our launch will be smooth and stable with exclusive access to their elite suite of experts in marketing, partnerships, and developer support.  Atlas will bring privacy-enhanced, compliant yield markets, cross-chain interoperability, and composable DeFi architecture.  This level of privacy is not available within the Cardano ecosystem or even with industry juggernauts like Pendle.\n\n\n\nAtlas iterates on Pendle’s yield-splitting in a Cardano-centric context, by packaging institutional-grade design and revenue incentives.  Fixed yields, hedging, speculative trading, and yield markets are all offered under private and compliant protocol.  This captures both retail and institutional demand, a feature that other leading protocols across Web3 struggle to capture.  Atlas is leveraging Cardano’s strengths while filling gaps left by other competitors.  Combining private, cross-chain yield markets and fee-sharing makes Atlas a compelling next step in the growing yield-tokenization ecosystem.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Atlas’ MVP will deliver a fully functional, public testnet deployment that demonstrates the complete user experience of Cardano Standardized Yield (CSY), Principal Tokens (PT), Yield Tokens (YT), and Atlas’ time-weighted AMM. Throughout development, each milestone produces an independently testable layer of the system—beginning with a deterministic simulator used to validate the AMM, quoting engine, liquidity operations, and early frontend flows. Subsequent milestones expand this simulator to include the full CSY/PT/YT lifecycle, before transitioning into live Plutus implementations of the AMM and tokenization stack.\n\n\n\nBy the final milestone, all simulated components are replaced with actual smart contracts, the batcher is fully integrated, and Atlas operates end-to-end on Cardano testnet. Users will be able to wrap assets into CSY, split them into PT/YT, trade through the AMM, provide liquidity, observe maturity behavior, and test real transaction flows. The completed prototype will be made publicly accessible through a dedicated Atlas testnet interface, supported by full API documentation and open UAT testing for the community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Success for Atlas will be demonstrated through the real adoption of Cardano Standardized Yield (CSY) and the PT/YT marketplace. The most direct indicators of impact are the number of CSY wrapping transactions, the volume of PT and YT minting and merging operations, and total swaps and liquidity interactions executed through Atlas’ time-weighted AMM. Each of these actions requires a Cardano transaction and represents the protocol’s core value being used in practice.\n\n\n\nAdditional success metrics include TVL deposited into Atlas markets, total liquidity provided to PT/CSY pools, daily swap volume, and user participation in maturity-based redemptions. As the batcher executes multi-leg PT↔CSY↔YT routes, the frequency and size of these batched transactions will provide another clear signal of protocol utility and user demand.\n\n\n\nOff-chain indicators complement these blockchain metrics, such as the number of unique users interacting with the testnet prototype, the speed and clarity of UAT feedback, community participation in public testing, and integrations or interest from Cardano dApps evaluating CSY as a new shared yield primitive. Together, these measures provide a realistic and transparent framework for evaluating Atlas' early traction and long-term potential to significantly expand on-chain economic activity across Cardano DeFi.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Atlas directly addresses the aforementioned gaps by creating the first standardized yield layer for Cardano.  It begins by wrapping yield-bearing assets into Cardano Standardized Yield (CSY) tokens.  These are Atlas’s unified token format that abstracts all yield sources, normalizing how yield is accrued, valued, and represented.  This creates a predictable interface that any protocol can integrate, enabling interoperability and composability between previously isolated assets.  Once wrapped, CSY tokens can be split into Principal Tokens (PT), and Yield Tokens (YT), allowing users to separate the underlying deposit from its future yield, and unlocks a whole suite of entirely new financial behaviors.\n\n\n\nAtlas will position itself as Cardano’s first on-chain yield marketplace.  Atlas provides an environment where yield can be bought, sold, hedged, or speculated on, just like any other financial asset.  This transforms yield from a passive and locked volume into an active market, enabling fixed-income strategies, directional yield trading, and efficient liquidity extraction.\n\n\n\nAtlas is also proud to be partnered with Midnight, with integration planned soon after the MVP launch.  Midnight’s privacy-focused zero-knowledge layer grants users and institutions a secure and compliant trading ecosystem, resolving one of Cardano’s largest institutional adoption challenges.  Furthermore, Midnight’s chain agnostic feature suite allows Atlas to scale far beyond the scope of Cardano, unlocking previously trapped liquidity and accessing cross-chain markets. Atlas is positioned as the bridge between private institutional finance and public decentralized markets.\n\n\n\nCardano cannot fully mature without a unified yield standard and a marketplace that turns yield into a liquid, composable asset class.  Today, yield is fragmented, inaccessible, and difficult to manage.  This causes unneeded friction for users, limiting Cardano’s competitiveness, and preventing enterprise-grade products from emerging.  Atlas’ universal yield wrapper, principal-yield split market, time-weighted AMM, privacy-enabled execution, and chain-agnostic infrastructure will unlock the next generation of Cardano DeFi.\n\n\n\nWe envision Atlas as the missing yield layer that makes Cardano competitive, attractive to institutions, and capable of supporting the next generation of decentralized financial innovation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Atlas inherently generates sustained on-chain activity because every core function of the protocol is executed and settled directly on the Cardano ledger.  The system is built around CSY – the Cardano Standardized Yield wrapper – and the transformation into PT and YT tokens under strict maturity rules.  Each step of this lifecycle requires smart-contract enforcement occurring entirely on-chain.  Wrapping ADA-denominated yield into CSY, splitting that into PT and YT, merging or redeeming them at or after maturity, and interacting with the PT/CSY AMM all produce verifiable on-chain transactions.  These operations are not optional or cosmetic, they are the basis of how users obtain Atlas’ CSY exposure and how the protocol maintains parity (CSY = PT + YT), time-weighted discounting (PT_price = e^(−r·T)), and the integrity of the market.\n\n\n\nThe PT/CSY AMM itself is another major generator of transaction volume.  The AMM enforces a time-weighted invariant on-chain (x^(1−t)·y^(1−t) = k), validates minOut and validity parameters, updates pool reserves, charges fees, and mints or burns LP shares.  All swaps. Liquidity deposits, and withdrawals require ledger-level execution governed by Plutus validators.  Due to the MVP routing YT trades through atomic multi-leg transactions, every YT market action applies multiple transactions on-chain.  As TVL grows, liquidity providers adjust positions, pools are rebalanced, and traders respond to changing implied yields, each behavior translates directly into sustained transactions.\n\n\n\nAtlas will also introduce a unique on-chain driver of activity through its Stake Validator.  ADA delegated in each market’s vault is registered, staked, and later withdrawn exclusively through validator-controlled transactions.  The protocol staking rewards on-chain, forwarding them to the configured beneficiary or vault triggers predictable per-epoch interactions.  These flows cannot be executed off-chain or abstracted away due to their necessity in how the CSY flow works to reflect ADA yield.\n\n\n\nLastly, the protocol’s off-chain batcher produces atomic multi-leg trades, fee swaps, and scheduled liquidity operations consistently.  Each successful batch results in signed transactions submitted to the chain recorded in persistent batch logs.  This creates an additional layer of routine on-chain activity scaling with usage and market participation.\n\n\n\nAtlas requires Cardano, relying heavily on its UTxO-level determinism, validator-enforced invariants, reference inputs, stake credentials, and native tokens to guarantee security and correctness.  Every essential function for Atlas’ operations; wrapping, unwrapping, splitting, merging, swapping, LP operations, fee handling, staking flows, and batched routes execute through Plutus validators.  Atlas verifiably contributes to increased transaction volume, deeper liquidity movement, and consistent smart-contract engagement across the network.  This is the foundation of a high-utility, yield-driven DeFi system that transforms Cardano’s staking economy into clear on-chain transactional demand.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"The Atlas team is uniquely positioned to deliver this project with high trust and technical reliability.  Being developed by the proven team behind Titans, and in partnership with Fiwork -- a nine-engineer blockchain studio with deep experience building high-assurance infrastructure across Cardano. This combined team brings extensive expertise in Plutus engineering, off-chain systems, AMM design, yield-tokenization logic, and large-scale backend architecture. The protocol’s design has already been validated through a detailed five-month roadmap, a deterministic simulator, and a fully scoped set of milestones that progressively move from off-chain modeling to real on-chain contracts.\n\n\n\nFeasibility is ensured through Atlas’ modular architecture, which cleanly separates on-chain validators, off-chain quoting and transaction building, and database-backed state management. Each component is independently testable, allowing us to validate every part of the system before integration. The deterministic simulator used in Milestones 1 and 2 allows the team to confirm that all AMM math, CSY/PT/YT logic, time-gated constraints, and user flows behave exactly as intended before being moved into Plutus. Once the real validators are implemented in Milestones 3 and 4, they are reinforced with strict unit tests, datum schemas, value-conservation checks, and maturity-based rule enforcement. This ensures that each on-chain element is mathematically correct, secure, and resistant to failure before public release.\n\n\n\nFeasibility will be ensured at the testnet MVP milestone.  This public phase allows the Cardano community to validate wrapping, splitting, trading, LP provisioning, maturity progression, and reward flows in a real environment. With this structured, test-driven delivery process and a team with demonstrated success in complex on-chain engineering, the Atlas project is not only feasible, but positioned for accountable, transparent, and verifiable delivery from prototype to launch.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Token Protocol Simulation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Building on the AMM layer, this milestone expands the simulator to include a complete CSY/PT/YT workflow.  This will cover wrapping underlying assets (ADA) into CSY, then splitting these interface-level tokens into PT and YT, merging before maturity, and redeeming at maturity.  The frontend is extended with a full portfolio interface, displaying token balances, maturities, and action availability as time-based constraints evolve.  The database is expanded to include markets, wrapper metadata, and simulated user positions.\n\n\n\nThis milestone will ensure that the full token model is validated before Plutus development begins, granting the public a working demonstration of Atlas’ core value proposition and functionality.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Token Protocol backend + UI, updated OpenAPI, integrated dev instance demonstrating tokenization flows with simulated data.\n\n- Backend deployed and functional for wrap/split/redeem with the simulator.\n\n- Frontend simulates wrap, split, redeem and shows positions per maturity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Atlas will provide the following as proof of completion:\n\n- A Github or equivalent repository with source code\n- Up-to-date technical documentation\n- Video showcasing the milestones and features","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"AMM Smart Contracts","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"With both major components simulated, this second milestone introduces the first on-chain deliverables.  These include the AMM validator, the LP minting policy, and the pool datum structure.  These Plutus scripts implement the time-weighted invariant, input-side fees, protocol fee sharing, min-out checks, and maturity gating.\n\nA comprehensive unit test suite verifies the correctness of proportional liquidity, invariant enforcement, and failure modes.  This milestone establishes the secure, verifiable foundation for the real liquidity pools that will power Atlas.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Plutus sources, Unit Test Suite & Report (fee calc, minOut, proportional liquidity, invalid transitions rejection), Technical Documentation (datum/redeemer, security notes).\n\n- Scripts compile and pass unit tests\n- Logic matches AMM technical specification (formulas above)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Atlas will provide the following as proof of completion:\n\n- A Github or equivalent repository with source code\n\n- Up-to-date technical documentation\n\n- Video showcasing the milestones and features","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Token Protocol Smart Contracts (Plutus)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The third and penultimate milestone completes the on-chain tokenization stack with Plutus implementations for the CSY wrapper, PT/YT minting and merging, vault identity, and configuration reference UTxO logic.  These scripts will define core economic and time-gated rules that govern value conservation, yield claims, maturity windows, and configuration anchoring.\n\n\n\nDebugging, unit testing, and technical documentation ensure consistent behavior and verifiable token lifecycles.  At this stage, the entire protocol exists on-chain, ready for full integration.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Plutus sources for all modules.\n- Unit Test Suite (mint/burn rules, time-gated logic pre/post maturity, nonce progression, fee accounting).\n- Technical Documentation (Vault/Config datums and redeemers).\n- Contracts compile and pass tests.\n- On-chain rules match Token Protocol specification.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Atlas will provide the following as proof of completion:\n\n- A Github or equivalent repository with source code\n\n- Up-to-date technical documentation\n\n- Video showcasing the milestones and features","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Unified Integration, Testing, and Testnet Deployment","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The fifth and final milestone will replace all simulated logic with live contracts. This will unify the backend, frontend, batcher, and database with real on-chain interactions.  The batcher is fully implemented to support atomic multi-leg routing for YT markets, protocol fee sweeping, and staking reward withdrawals for ADA-based yields.\n\n\n\nDeployment tooling will be prepared, including reference scripts, config UTxO creation, and first-market bootstrapping.  A public testnet instance is planned to launch with a complete end-to-end user flow for wrapping, splitting, trading, LP provision, maturity progression, and reward handling.  Final QA, reporting, and UAT community testing will be the deliverable for this milestone, with a full mainnet launch planned soon after this milestone.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Fully integrated code (backend, frontend, Plutus).\n\n- Deployment/runbook docs.\n\n- Public testnet instance.\n\n- Final E2E test report (wrap→split, PT↔CSY swaps, routed YT via PT/CSY, LP add/remove, fee sweep, maturity boundary behavior, and stake-withdraw job).\n\n- Application operational on public testnet, all user flows functional end-to-end from UI to on-chain.\n\n- All simulated logic removed, live smart contracts in place.\n\n- System stable and ready for formal UAT sign-off.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Atlas will provide the following as proof of completion:\n\n- A Github or equivalent repository with source code\n\n- Up-to-date technical documentation\n\n- Video showcasing the milestones and features\n\n- Public testnet launch of the MVP for UAT and further iterations available.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":50000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Atlas is being delivered by a joint effort between the Titans Core Team and FIWORK, a blockchain engineering studio led by seasoned experts in DeFi, infrastructure, and Plutus development. Titans provides product direction, ecosystem experience, revenue-model expertise, and operational oversight, while FIWORK supplies the engineering force responsible for designing, implementing, and testing the protocol across all five development milestones.\n\n**Titans / Atlas Team:**\n\nOliver Radivojevic - CEO &amp; Founder: [https://www\\.linkedin\\.com/in/o\\-r\\-893341136/](https://www.linkedin.com/in/o-r-893341136/) / [https://x\\.com/Apex\\_333](https://x.com/Apex_333)\n\nCJ O'Heany - Product Manager: [https://www\\.linkedin\\.com/in/cjoheany](https://www.linkedin.com/in/cjoheany) / [https://www\\.cjoheany\\.com](https://www.cjoheany.com)\n\nCJ is a multidisciplinary game developer, marketer, and product designer.  With experience spearheading the design and development on much of the Titans catalogue including the PFP NFT collection, Stronghold NFT collection, and Titan token design.  CJ is devoted to creating simple, elegant, and effective product designs for the Atlas platform.\n\nAlexandru Campurean - Marketing Manager:  [https://linktr\\.ee/sic236](https://linktr.ee/sic236) / [https://x\\.com/Sic2336](https://x.com/Sic2336)\n\nSic is a Web3 veteran who entered the blockchain space in 2019. Over the past several years, he has supported a wide range of projects across multiple chains, serving as Marketing Lead, Community Manager, and Business Developer. With deep experience in ecosystem growth and user engagement, Sic is dedicated to advancing the Web3 space and setting Atlas for long-term success.\n\n**FIWORK Team:**\n\nFIWORK Website: [https://www\\.fiwork\\.co/](https://www.fiwork.co/)\n\nCarlos Rene – FIWORK Founder &amp; Technical Lead: [https://www\\.linkedin\\.com/in/ccerrato147/](https://www.linkedin.com/in/ccerrato147/)\n\nCarlos is a veteran innovator with over 15 years of experience in AI, startups, and enterprise systems. As the founder of FIWORK and creator of DEGA, he leads the overall engineering strategy for Atlas. Carlos oversees protocol architecture, R&amp;D, cross-chain considerations, and technical alignment with Cardano and Midnight standards.\n\nDavid Alvarado – Project Manager &amp; Operations: [https://www\\.linkedin\\.com/in/david\\-alvarado\\-restrepo/](https://www.linkedin.com/in/david-alvarado-restrepo/)\n\nDavid manages execution across all engineering milestones, coordinating delivery timelines, QA cycles, and communication between Titans and FIWORK. His background in digital product management and agile operations ensures the project remains on schedule, aligned, and optimized for efficient delivery.\n\nPavel Espitia – Lead Software Engineer: [https://co\\.linkedin\\.com/in/pavelespitia](https://co.linkedin.com/in/pavelespitia)\n\nPavel brings 17 years of software engineering experience, including eight years specializing in blockchain. He is responsible for the design and implementation of Atlas’ core systems — including the Plutus validators, off-chain transaction builder, backend architecture, and security-driven development standards. His focus on scalable, high-assurance engineering ensures Atlas is built to institutional requirements.\n\nTogether, Titans and FIWORK form a cohesive, highly capable team with deep experience in Cardano development, DeFi architecture, and secure system design. This partnership provides the technical and operational strength required to bring Atlas from concept to full public deployment.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Atlas is structured around a four-milestone development plan.  We have already been developing the deterministic AMM simulator, backend quoting engine, early frontend UX, core database schemas, and OpenAPI documentation.  This has established the foundation for the remaining on-chain work.\n\n\n\nCatalyst funding is requested for each following milestone budgeted at 50,000 ADA, reflecting equivalent engineering complexity, infrastructure requirements, and QA needs. The total funding requested is 200,000 ADA.\n\n\n\nMilestone 1- CSY/PT/YT Token Protocol Simulation (50,000 ADA)\n\nExpands the simulator to include the full token lifecycle: CSY wrapping, PT/YT splitting and merging, maturity logic, and expanded portfolio and market interfaces. This milestone demonstrates Atlas’ yield-tokenization mechanics end-to-end before touching Plutus.\n\n\n\nMilestone 2 - AMM Smart Contracts (50,000 ADA)\n\nImplements the on-chain AMM validator, LP minting policy, time-weighted invariant enforcement, input-side fees, and a full unit test suite. This establishes Atlas’ foundational liquidity and pricing engine directly on Cardano.\n\n\n\nMilestone 3 - Token Protocol Smart Contracts (50,000 ADA)\n\nDelivers Plutus implementations for the CSY wrapper, PT/YT mint/merge rules, vault identity logic, maturity constraints, and configuration reference UTxO enforcement. This completes the on-chain tokenization architecture that underpins all yield markets.\n\n\n\nMilestone 4 - Full Integration & Public Testnet Deployment (50,000 ADA)\n\nUnifies all components—smart contracts, backend, frontend, batcher, and database into a live public testnet. Includes deployment tooling, multi-leg routing for YT markets, staking reward flows, protocol fee handling, QA, and UAT with the Cardano community.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The Atlas project represents exceptional value for the Cardano community by delivering the first standardized yield layer and an on-chain marketplace for composable yield assets. For a total funding request of 200,000 ADA, the project will deliver a fully functional prototype with live smart contracts, multi-leg AMM routing, tokenized principal and yield instruments (PT/YT), and a public testnet ready for community testing and feedback.\n\n\n\nEach milestone is tightly scoped to provide independently testable and auditable components, ensuring that every ADA spent directly advances the ecosystem’s infrastructure. Beyond the immediate technical deliverables, Atlas unlocks liquidity for previously siloed yield-bearing assets, enables new financial behaviors like yield trading, fixed-income strategies, and hedging, and establishes a platform that institutional and retail participants can safely and transparently interact with.\n\n\n\nBy creating a reusable, composable standard (CSY) and demonstrating robust on-chain integrations, Atlas maximizes the impact of every dollar of funding, building infrastructure that benefits future protocols, developers, and users alike. The structured milestone plan, coupled with rigorous testing and audit-ready documentation, ensures that the Cardano commu","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Yield","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1771}