{"pr_id":"019ac2d3-4278-7a35-8419-108795492583","title":"Voices on Chain: Access for Ethiopia’s Youth and Women","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Most Ethiopian youth and women have never used blockchain tools due to low digital exposure, lack of local training, and no beginner-friendly entry points into Cardano or Web3 ecosystems.","solution":"We will run hands-on workshops and mentoring to teach 300 Ethiopian youth and women how to use Cardano wallets, NFTs, and tools, making blockchain practical and locally relevant.","proposer_name":"Nahom Behailu Geremew","proposer_relevant_experience":"The project is delivered by a coordinated group of professionals with experience in training, technical support, community engagement, and program management. Each member contributes to a defined role that supports the successful delivery of the Cardano Youth and Women Blockchain Activation Program.\n\n**Rani Mesele, Project Lead**\n\nRani oversees planning, coordination, logistics, and communication with partners. She ensures that workshop schedules, recruitment activities, and reporting tasks are carried out on time. She manages the daily operations of the program and maintains the overall structure and quality of delivery.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/rani\\-mesele\\-a02075254/](https://www.linkedin.com/in/rani-mesele-a02075254/)\n\n**Yohannes Abebe Yirga, Training Lead**\n\nYohannes designs and delivers the training curriculum. He facilitates the workshops, organizes practical demonstrations, and ensures that blockchain concepts are taught in a clear and accessible way for new learners. He monitors learner progression and supports participants during follow-up sessions.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/yohannes\\-abebe\\-yirga\\-3a5710192/](https://www.linkedin.com/in/yohannes-abebe-yirga-3a5710192/)\n\n**Dagim Jida, Technical Mentor**\n\nDagim provides technical support during all hands-on activities. He guides participants through wallet setup, ADA transactions, NFT minting, and introductory dApp usage. He assists beginners with troubleshooting and ensures that each learner gains practical experience with Cardano tools.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/dagim\\-jida\\-b5b70423a/](https://www.linkedin.com/in/dagim-jida-b5b70423a/)\n\n**Hana Terefe, Partnerships and Outreach Coordinator**\n\nHana leads recruitment and external outreach. She manages relationships with universities, women-led organizations, youth centers, and community groups. She coordinates joint events, participant sourcing, and outreach communication throughout the program.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/hana\\-terefe\\-2226a07b/](https://www.linkedin.com/in/hana-terefe-2226a07b/)\n\n**Rodas Yohannes, Community Manager**\n\nRodas manages the participant community. She oversees the Telegram group, supports learners between workshops, shares updates and instructions, and encourages consistent engagement. Her work helps maintain participant interest and retention across the six-month program.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/rodas\\-yohannes\\-6a5a96341/](https://www.linkedin.com/in/rodas-yohannes-6a5a96341/)\n\n**Nahom B\\. Geremew, Monitoring and Evaluation Officer**\n\nNahom tracks program metrics and learning outcomes. He documents attendance, wallet creation, ADA transactions, and participant engagement. He prepares KPI reports, survey summaries, and the final impact documentation for the Cardano community.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/hom\\-nbg/](https://www.linkedin.com/in/hom-nbg/)","url":null,"funds":22000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Voices on Chain: Access for Ethiopia’s Youth and Women","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Nahom Behailu Geremew","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":22000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Most Ethiopian youth and women have never used blockchain tools due to low digital exposure, lack of local training, and no beginner-friendly entry points into Cardano or Web3 ecosystems.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will run hands-on workshops and mentoring to teach 300 Ethiopian youth and women how to use Cardano wallets, NFTs, and tools, making blockchain practical and locally relevant.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":{"links":[]},"sub_fields":null},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All outputs of this project will be released as fully open source. Training materials, workshop content, onboarding guides, and project documentation will be published under the Creative Commons Attribution 4.0 (CC BY 4.0) license. Any code samples or technical resources created during the program will be released under the MIT License. No proprietary IP will be retained.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Training","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We are targeting youth and women in Addis Ababa who remain underrepresented in blockchain adoption. Most have never interacted with wallets, NFTs, ADA, or dApps. These groups are high-potential future builders and community contributors, but lack access to contextual and beginner-friendly onboarding.\n\nOur outreach focuses on students, young professionals, women in digital and creative sectors, and community organizers. Participants will be recruited through partnerships with universities, women-led organizations, youth centers, Telegram communities, and direct outreach through trusted networks.\n\nThis matters for Cardano because Ethiopia has one of Africa’s largest youth populations. Training 300 participants, creating more than 120 wallets, and increasing local usage of Cardano tools expands grassroots adoption in East Africa and supports long-term ecosystem growth, new project teams, and future Catalyst participation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"# **Key activities of the project**\n\n\nOur activities combine education, onboarding, and community support.\n\n\n\n**Education and Awareness**\n\n\n\n• Eight in-person or hybrid workshops introducing Cardano basics\n\n• Technical sessions covering wallet setup, ADA transfers, and NFT minting\n\n• Follow-up webinars and short virtual lessons\n\n• Pre and post surveys to measure learning\n\n\n\n**Onboarding and Activation**\n\n\n\n• Wallet creation for 300 participants\n\n• ADA test transactions\n\n• NFT demonstrations\n\n• Beginner-level interactions with dApps and identity tools\n\n\n\n**Community Building**\n\n\n\n• Formation of Cardano-focused youth and women groups\n\n• Support for ongoing activity on Telegram and Discord\n\n• Final showcase event for demos and micro-projects\n\n• Support for drafting early-stage Catalyst ideas\n\n\n\n**Partnerships**\n\n\n\n• Collaboration with universities, youth centers, and women-led groups\n\n• Shared events and ongoing communication\n\n• Documentation and reporting for the Cardano ecosystem","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"# Success metrics\n\n\n\n\n**Education**\n\n\n\n• Eight workshops delivered\n\n• Three hundred participants trained\n\n• Knowledge improvement measured through surveys\n\n• Retention across multiple sessions\n\n\n\n**Onboarding**\n\n\n\n• One hundred twenty or more wallets created\n\n• Number of ADA transactions completed\n\n• NFT activities executed\n\n• dApp interactions recorded\n\n\n\n**Community Engagement**\n\n\n\n• Three to five Cardano groups formed\n\n• Growth in Telegram and Discord activity\n\n• Number of returning participants\n\n• Satisfaction rating of at least 75 percent\n\n• Number of success stories and case studies\n\n\n\n**Long\\-Term Outcomes**\n\n\n\n• Ten or more micro-projects\n\n• Thirty participants drafting Catalyst proposals\n\n• Growth in public awareness of Cardano in Ethiopia","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We will deliver a six-month Cardano Youth and Women Blockchain Activation Program that trains three hundred young people and women in practical blockchain use. Participants will create wallets, complete ADA transactions, mint simple NFTs, and interact with dApps through guided, hands-on sessions.\n\n\n\nThe program includes eight in-person and hybrid workshops supported by an online learning mini-portal and a Telegram group. All material is tailored to the local context and designed for complete beginners. We will work with universities, tech clubs, and women-led organizations to recruit participants and co-host events.\n\n\n\nThis approach directly addresses low awareness and limited access by giving learners real usage experience and a clear pathway into the Cardano ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The program produces measurable and verifiable adoption in a region with high potential. With three hundred trained participants, more than one hundred twenty wallets created, and direct on-chain activity, the project strengthens Cardano’s presence in Ethiopia’s youth and women sectors.\n\n\n\nIt supports the wider community by expanding global reach, increasing regional representation in Catalyst, and building a pipeline of new contributors, developers, and community organizers. Participants will leave with practical skills, active wallets, and community connections that encourage continued engagement.\n\n\n\nImpact is fully traceable through transaction logs, wallet confirmations, community activity, and project outputs.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Stella Events** has delivered multiple youth and community programs. The team is equipped for workshop delivery, logistical planning, partnership coordination, and impact tracking.\n\n\n\nAccountability Measures\n\n\n\n- Public progress reports\n- Wallet confirmations\n- Attendance and engagement logs\n- Survey data\n- Milestone-based updates\n\n\n\nThe project is scoped to match the team’s proven capacity.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Program Setup, Recruitment, and Pilot Workshops","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Establishes the full foundation of the program. It includes finalizing the curriculum, deploying the learning mini-portal, completing partnerships with universities and women-led groups, and launching a recruitment campaign. At least 100 participants will be registered across the first cohorts. Two pilot workshops will be delivered to validate teaching materials and ensure that the training flow is clear for absolute beginners. Participants will complete wallet setup, early ADA test transactions, and initial NFT demonstrations. Feedback will be collected and used to refine the curriculum before the main training phase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The curriculum must be completed in full, reviewed for accuracy, and approved for delivery. All core lessons, workshop guides, and participant handouts must be finalized and uploaded to the learning portal. The portal must be accessible to the public and contain clear onboarding instructions, schedules, and program expectations. Recruitment must achieve a minimum of one hundred confirmed participants across partner institutions, with verified contact details and assigned workshop slots. Two pilot workshops must be delivered, each covering wallet setup, basic ADA test transactions, and introductory NFT demos. Participant attendance must be recorded, and all learners should successfully complete wallet creation and at least one guided transaction. Feedback forms must be collected from participants and mentors, analyzed, and used to refine the curriculum before entering the main training phase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include the final curriculum document, dated and approved for delivery. A complete participant registration list will verify achievement of the recruitment target. A publicly accessible link to the learning portal will confirm deployment, along with a screenshot of the portal homepage showing the uploaded curriculum and schedule. Attendance sheets from both pilot workshops will confirm delivery and engagement. Screenshots of completed wallet setups and ADA transactions will demonstrate successful onboarding. A compiled feedback summary, including participant comments and mentor notes, will verify that review and refinement took place before the next phase.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":7500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Main Training Phase and On-Chain Activation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Delivers the core program. Four to six major workshops will train an additional 200 participants in hands-on Cardano use. Activities include wallet creation, ADA transactions, NFT minting, and guided exploration of beginner-friendly dApps. By the end of the milestone, the program will have trained at least 300 people in total and created more than 120 active wallets. Participants will move from passive understanding to real interaction with the Cardano network. Community groups will be formed inside universities and learning centers to support ongoing peer learning.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A minimum total of three hundred participants must be trained through four to six workshops held between March and May. Each workshop must include guided wallet creation, live ADA transfers, NFT minting demonstrations, and walkthroughs of beginner-accessible dApps. At least one hundred twenty new and functioning Cardano wallets must be created during this period, each confirmed by transaction logs. ADA transactions must be completed by participants during workshops to ensure real on-chain engagement. At least three Cardano community groups must be formed in universities or youth centers, with documented leadership and member lists. Each workshop must produce a written report detailing attendance, learning outcomes, technical challenges, and participant engagement.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include detailed logs of wallet addresses created during the training, along with screenshots of successful ADA test transactions completed by participants. Attendance sheets for all workshops will confirm total participation. Summaries of each workshop, including the number of participants, activities conducted, and technical outcomes, will validate delivery. Membership lists of the newly formed community groups will confirm that grassroots structures have been established. Additional evidence may include photos of workshops, mentor logs, and records from dApp exploration activities. Together, these documents will demonstrate active and verifiable Cardano onboarding at scale.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Micro-Projects, Catalyst Preparation, Showcase, and Reporting","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Focuses on consolidation and long-term continuity. Participants form teams to create at least 10 micro-projects such as basic NFTs, community-driven prototypes, or early dApp ideas. Structured Catalyst sessions introduce proposal writing, budgeting, and planning. At least 30 participants will draft early-stage project concepts aligned with Catalyst categories. A final showcase event will highlight participant projects, attract new community members, and strengthen partnerships. The milestone concludes with a full KPI report and a continuity plan for ongoing Cardano activity in local groups.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"At least ten micro-projects must be created by participant teams. These may include NFT collections, small prototype ideas, simple dApp concepts, wallet-based tools, or community initiatives. Each project must have a clear description, intended purpose, and at least one tangible output such as an NFT asset, documentation, or a small demo. A minimum of thirty participants must begin drafting Catalyst proposal ideas, with each draft containing a problem statement, proposed solution, target users, and high-level milestones. A final showcase event must be held with no fewer than one hundred attendees, including participants, partners, and community members. A full KPI report must be completed, summarizing total attendance, wallet numbers, on-chain activity, group formation, and learning outcomes. A continuity plan must outline how community groups, mentors, and partner institutions will maintain activity after the program ends.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include written summaries of all micro-projects, including links to NFTs, prototype files, or documented concepts. Draft Catalyst proposals from participants will verify engagement with the broader ecosystem. Photos and recordings from the final showcase event will demonstrate public presentation of learner work. A detailed KPI report will document participant numbers, wallets created, transactions executed, micro-projects completed, and community groups formed. The continuity plan will be included as a formal document outlining follow-up steps, community ownership structures, communication channels, and future roadmap opportunities. These materials collectively confirm that the program delivered long-term, verifiable impact.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":4000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"The project is delivered by a coordinated group of professionals with experience in training, technical support, community engagement, and program management. Each member contributes to a defined role that supports the successful delivery of the Cardano Youth and Women Blockchain Activation Program.\n\n**Rani Mesele, Project Lead**\n\nRani oversees planning, coordination, logistics, and communication with partners. She ensures that workshop schedules, recruitment activities, and reporting tasks are carried out on time. She manages the daily operations of the program and maintains the overall structure and quality of delivery.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/rani\\-mesele\\-a02075254/](https://www.linkedin.com/in/rani-mesele-a02075254/)\n\n**Yohannes Abebe Yirga, Training Lead**\n\nYohannes designs and delivers the training curriculum. He facilitates the workshops, organizes practical demonstrations, and ensures that blockchain concepts are taught in a clear and accessible way for new learners. He monitors learner progression and supports participants during follow-up sessions.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/yohannes\\-abebe\\-yirga\\-3a5710192/](https://www.linkedin.com/in/yohannes-abebe-yirga-3a5710192/)\n\n**Dagim Jida, Technical Mentor**\n\nDagim provides technical support during all hands-on activities. He guides participants through wallet setup, ADA transactions, NFT minting, and introductory dApp usage. He assists beginners with troubleshooting and ensures that each learner gains practical experience with Cardano tools.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/dagim\\-jida\\-b5b70423a/](https://www.linkedin.com/in/dagim-jida-b5b70423a/)\n\n**Hana Terefe, Partnerships and Outreach Coordinator**\n\nHana leads recruitment and external outreach. She manages relationships with universities, women-led organizations, youth centers, and community groups. She coordinates joint events, participant sourcing, and outreach communication throughout the program.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/hana\\-terefe\\-2226a07b/](https://www.linkedin.com/in/hana-terefe-2226a07b/)\n\n**Rodas Yohannes, Community Manager**\n\nRodas manages the participant community. She oversees the Telegram group, supports learners between workshops, shares updates and instructions, and encourages consistent engagement. Her work helps maintain participant interest and retention across the six-month program.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/rodas\\-yohannes\\-6a5a96341/](https://www.linkedin.com/in/rodas-yohannes-6a5a96341/)\n\n**Nahom B\\. Geremew, Monitoring and Evaluation Officer**\n\nNahom tracks program metrics and learning outcomes. He documents attendance, wallet creation, ADA transactions, and participant engagement. He prepares KPI reports, survey summaries, and the final impact documentation for the Cardano community.\n\nLinkedIn: [https://www\\.linkedin\\.com/in/hom\\-nbg/](https://www.linkedin.com/in/hom-nbg/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Team Compensation**\n\n**11,000 ADA**\n\n• Coordination\n\n• Training\n\n• Mentoring\n\n• Reporting\n\n\n\n**Workshops and Logistics**\n\n**4,000 ADA**\n\n• Venue\n\n• Materials\n\n• Transportation\n\n\n\n**Learning Portal and Content**\n\n**2,500 ADA**\n\n• Hosting\n\n• Module development\n\n• Teaching tools\n\n\n\n**Outreach and Partnerships**\n\n**2,500 ADA**\n\n• Recruitment\n\n• Media work\n\n• Collaboration efforts\n\n\n\n**Monitoring and Evaluation**\n\n**1,500 ADA**\n\n• Surveys\n\n• Tracking\n\n• Documentation\n\n\n\n**Total 21,500 ADA**","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"At approximately **75 ADA per participant**, this proposal provides direct, practical onboarding rather than theoretical outreach. Every learner creates a wallet, completes transactions, and joins a community group.\n\n\n\nThe structure builds long-term visibility in universities and women-led organizations, enabling future expansion without significant additional cost.\n\n\n\nThis creates high-value adoption from a relatively small budget.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Training","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1773}