{"pr_id":"019ac1b0-bd89-7e6c-a218-89295405ad13","title":"West Africa's Cardano Developer Hub ","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"To address critical talent and infrastructure gaps threatening three years of Cardano advocacy in Burkina Faso and preventing Francophone West Africa's meaningful ecosystem contribution.","solution":"Inkuba Hub will establish West Africa's first Cardano developer center, training 100+ developers in Haskell Plutus through structured education, university onboarding workshops, and expert mentorship.","proposer_name":"Laurentine Djatsa","proposer_relevant_experience":"Laurentine Djatsa: Project Lead\n\nInkuba Hub lead, constitutional delagate, Member of the Intersect MCC Commettee, Host of Cardano Francophne Corner, Vice Chair of Cardano Africa-Asia Coalission. Has been advocating Cardano in Burkina Faso for the past 3 years\n\n\n\nBetsaleel: Technical Lead : Passionate about blockchain, I actively work on smart contracts on EVM chains and Cardano, with a strong focus on security and the comparison between the EUTXO and Account/Balance models. His achievements include:\n\nConnecting a Mobile Money system to the blockchain to enable secure money transfers (EVM chain), Developing a decentralized voting system combining USSD and smart contracts (EVM chain), Implementing a stablecoin on a private blockchain (EVM chain), Deploying smart contracts integrating Chainlink Automation, VRF, and Price Feeds for secure and automated interactions.\n\n\n\nBarthelemy, Education Coordinator: Blockchain developer and trainig Facilitator at Coxygene, Engeneer at Ministry of Digital Transition, Postal Services, and Electronic Communications\n\n\n\nAime Niko Kam, Operation Manager: He facilitated several workshops aimed at educating young people on the very essence of the Cardano blockchain. Very active within the ecosystem, he contributes to the promotion of blockchain technologies and participates in initiatives designed to train and support youth in the opportunities offered by Web3.\n\nHe aspires to build an environment of learning and innovation that serves social and economic development, where blockchain technology will hold a place of great importance. As a constitutional delegate he participated actively in the Cardano constitution ratification un has a good understandig of the Cardano governance","url":null,"funds":56250,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"West Africa's Cardano Developer Hub ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Laurentine Djatsa","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":56250,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":10,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"To address critical talent and infrastructure gaps threatening three years of Cardano advocacy in Burkina Faso and preventing Francophone West Africa's meaningful ecosystem contribution.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Inkuba Hub will establish West Africa's first Cardano developer center, training 100+ developers in Haskell Plutus through structured education, university onboarding workshops, and expert mentorship.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.inkubahub.org/","https://x.com/InkubaA","https://youtu.be/wbr3BVT87G4?si=zSktADxDczKfUFzH","https://forum.cardano.org/t/forum-10000-codeurs-inkuba-hub-inspires-the-next-generation-of-blockchain-developers-in-burkina-faso/147165"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"1. University Partnerships : Successful implementation depends on formalizing agreements with partner universities in Burkina Faso to host onboarding workshops and provide access to student populations for recruitment. 2. Facility Acquisition : Securing an appropriate physical space in Ouagadougou with suitable size, location, and baseline infrastructure is critical before operations can begin, though preliminary site assessments have been conducted. 3. Technical Mentorship Network : Building connections with experienced Cardano developers globally who can provide remote mentorship to bridge expertise gaps until local capacity is fully developed.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Educational Materials : All curriculum documentation, learning modules, tutorials, and training materials developed for Haskell and Plutus education will be published as open-source resources under permissive licenses, with both French and English versions available.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Training","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Outreach Strategy:\n\nWe will reach these audiences through multiple sourced channels. Our established Cardano community in Burkina Faso, built and grown to 150+ active members, provides immediate access to motivated developers. The Cardano Francophone Corner, which we host, connects us to French-speaking blockchain enthusiasts across West Africa and creates regional awareness. Partnerships with computer science departments at key universities enable direct access to student populations through campus workshops. We'll leverage social media campaigns on platforms popular in West Africa, collaborate with existing tech hubs and innovation spaces, and utilize targeted outreach through local developer meetups and tech conferences. Additionally, word-of-mouth referrals from our existing trained developers will create organic growth as they become ambassadors for the program.\n\n\n\nValue to Cardano:\n\nThis matters profoundly to Cardano for several interconnected reasons. Francophone Africa represents 120+ million people in a region experiencing rapid digital transformation, smartphone adoption growth, and increasing demand for financial technology solutions—yet it remains dramatically underrepresented in Cardano's developer ecosystem. By training 100+ developers in this strategic region and onboarding more people, we expand Cardano's global footprint in a market poised for blockchain adoption while diversifying the ecosystem beyond traditional tech hubs. These developers will eventually propose or build solutions addressing real-world challenges unique to emerging markets—financial inclusion for the 76% unbanked population, agricultural supply chain transparency, digital identity systems, and remittance optimization—creating use cases that can be replicated across similar markets globally. The French-language educational resources we produce will benefit the entire Francophone Cardano community worldwide. Furthermore, increasing African participation in Cardano governance through Project Catalyst brings diverse perspectives that strengthen ecosystem decision-making. Ultimately, Cardano's vision of providing blockchain technology for the many, not the few, requires presence in regions like West Africa where the technology can deliver transformative impact. Inkuba Hub transforms this vision into measurable reality.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"1. Facility Establishment and Infrastructure Setup\n\n\n\nSecure and furnished dedicated workspace in Ouagadougou with collaborative areas and meeting rooms\n\nInstall reliable internet connectivity with backup systems and power infrastructure\n\nEquip facility with 20+ workstations and necessary technical equipment\n\nEstablish learning management systems and community platforms\n\n\n\n2. Structured Developer Training Programs\n\n\n\nDeliver comprehensive bootcamps covering blockchain fundamentals, Haskell programming, and Plutus smart contract development\n\nConduct weekly technical workshops on specialized Cardano development topics\n\nProvide beginner, intermediate, and advanced learning tracks with assessment frameworks\n\nCreate certification pathways for completed training modules\n\n\n\n3. University Workshops\n\n\n\nOrganize onboarding workshops at partner universities to introduce students to Cardano technology \n\nRecruit promising students for continued training at the center\n\nBuild relationships with computer science faculty for long-term collaboration\n\n\n\n4. Technical Mentorship Programs\n\n\n\nConnect local developers with experienced Cardano developers globally for guidance\n\nProvide regular technical office hours and problem-solving sessions\n\nFacilitate peer-to-peer learning and code review sessions\n\n\n\n5. Community Building and Events\n\n\n\nHost regular meetups bringing together developers, entrepreneurs, and blockchain enthusiasts\n\nOrganize a hackathon focused on solving local challenges with Cardano solutions\n\nFacilitate networking sessions connecting participants with industry and potential collaborators\n\nManage online community platforms for continuous engagement\n\n\n\n6. French-Language Resource Development\n\n\n\nTranslate core Cardano documentation and educational materials into French\n\nCreate localized tutorials, guides, and case studies\n\nDevelop French-language video content and learning resources\n\nContribute resources back to the global Cardano ecosystem\n\n\n\n8. Open-Source Contributions\n\n\n\nEncourage participants to contribute to Cardano open-source projects\n\nDocument implementation approaches and lessons learned\n\nCreate reusable tools and frameworks benefiting the broader ecosystem\n\nPublish case studies of African blockchain implementations\n\n\n\n9. Sustainability Planning and Partnership Development\n\n\n\nDevelop revenue generation models including corporate training services\n\nBuild relationships with local businesses and organizations for implementing partnerships\n\nCreate pathways for graduate employment and entrepreneurship\n\n\n\n10. Monitoring, Evaluation, and Reporting\n\n\n\nTrack key performance indicators across all program activities\n\nConduct regular impact assessments measuring skill development and project outcomes\n\nMaintain transparent financial and operational reporting\n\nDocument and share progress with the Cardano community and stakeholders","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"Developer Training and Education:\n\nTrain 100+ developers in Cardano blockchain fundamentals, Haskell, and Plutus development within 12 months\n\nCertify at least 10 developers in advanced Plutus smart contract development\n\nConduct minimum 12 technical workshops covering specialized Cardano topics\n\nDeliver 2+ university onboarding workshops reaching 500+ students\n\n\n\nInfrastructure and Operations:\n\nEstablish fully operational physical facility with 20+ workstations\n\nHost 25+ developers simultaneously in collaborative workspace\n\nDeploy functional learning management system with all curriculum materials\n\n\n\nCommunity Growth and Engagement:\n\nGrow active Cardano community from 150 to 250+ members\n\nOrganize a  major hackathons with 30+ participants each\n\nHost 8 community meetups and networking events\n\n\n\nUniversity Partnerships:\n\nLeverage existing formalized partnership with 1 university and establish 1 additional university partnership through signed MOU\n\nEstablish clear pathways for continued student engagement beyond initial workshops\n\n\n\nEcosystem Contributions:\n\nPublish French-language tutorials and documentation resources\n\n\n\nTechnical Competence:\n\nEstablish mentorship network with active mentors supporting developers","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Inkuba Hub's proposed solution transforms three years of Cardano advocacy groundwork into permanent, sustainable infrastructure by establishing West Africa's first dedicated Cardano developer center in Ouagadougou, Burkina Faso.\n\n\n\nThe Solution Framework:\n\nWe will create a fully-equipped physical innovation hub with reliable internet connectivity, collaborative workspaces, and 20+ workstations where developers can consistently access the infrastructure needed for blockchain development—eliminating the connectivity and equipment barriers that currently prevent progress. This facility becomes the anchor for all our activities, providing a stable environment for learning and building.\n\n\n\nOur structured educational program addresses the talent development gap through three progressive tracks. The Foundation Track introduces blockchain fundamentals and Cardano ecosystem basics to newcomers. The Builder Track provides intensive training in Haskell programming and Plutus smart contract development, taking developers from basic concepts to functional implementation. The Advanced Track focuses on complex smart contract development, optimization, and real-world application architecture. This modular approach allows developers to enter at appropriate skill levels and progress systematically, supported by dedicated instructors and comprehensive French-language learning materials.\n\n\n\nUniversity partnerships extend our reach beyond the center's physical walls. Leveraging our existing formalized partnership and adding one additional university collaboration, we'll conduct onboarding workshops that introduce students to Cardano blockchain technology and create pathways for continued learning at our facility. This addresses the unrealized partnership problem by activating these relationships with concrete programs while building a sustainable pipeline of new talent from academic institutions.\n\n\n\nTechnical mentorship connects our local developers with experienced Cardano developers globally, bridging the expertise gap that isolation creates. Through regular mentorship sessions, code reviews, and technical guidance, developers receive the support needed to overcome complex challenges and advance their capabilities. This network ensures our developers aren't learning in a vacuum but are connected to the broader Cardano ecosystem.\n\n\n\nCommunity activation through a hackathon, regular meetups, and collaborative events solves the isolation problem by creating a vibrant local ecosystem where developers can share knowledge, collaborate on projects, and maintain motivation. These events also raise broader awareness about Cardano's capabilities while identifying practical use cases relevant to West African contexts.\n\n\n\nHow This Addresses the Core Problems:\n\nThe continuity problem is solved by creating permanent infrastructure and ongoing programs rather than one-off workshops. Developers can progress from beginner to advanced levels with consistent support over months and years rather than facing a cliff after initial training.\n\n\n\nThe university partnership challenge is addressed by activating our existing relationship and adding another through concrete workshop programs that demonstrate value to academic institutions while creating student pathways to our center.\n\n\n\nGeographic underrepresentation is directly tackled by establishing dedicated Cardano infrastructure in Francophone West Africa, ensuring this 120+ million person region becomes an active contributor rather than an overlooked market.\n\n\n\nThe infrastructure gap is eliminated through our physical facility, reliable connectivity, and technical equipment, removing the environmental barriers that prevent consistent development work.\n\n\n\nThe isolation challenge is solved through community building, mentorship networks, and regular collaborative events that connect local developers with each other and the global Cardano ecosystem.\n\n\n\nThis comprehensive solution doesn't just train developers—it creates the complete ecosystem infrastructure needed to transform Francophone West Africa into an active, contributing region within the global Cardano community while addressing critical local challenges through blockchain technology.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Developer Ecosystem Expansion and Diversification:\n\nInkuba Hub will significantly expand Cardano's global developer base by training 100+ developers in a region currently underrepresented in the ecosystem. This isn't merely adding numbers—it's strategic diversification that reduces geographic concentration risk and brings fresh perspectives to Cardano development. Francophone West Africa represents 120+ million people in rapidly digitalizing economies, and establishing a developer presence here positions Cardano ahead of competing blockchain platforms in a strategic growth market. These developers will become long-term contributors, building applications, participating in governance, and training the next generation, creating compound returns on the initial investment.\n\n\n\nUnique Use Case Development:\n\nWest African developers face challenges largely unknown in traditional tech hubs—limited banking infrastructure serving 76% unbanked populations, agricultural supply chains needing transparency for smallholder farmers, cross-border remittance inefficiencies, and digital identity gaps. Our developers will be equipped to build solutions addressing these real-world problems, creating use cases and implementation patterns that can be replicated across similar emerging markets globally. These African-specific applications demonstrate Cardano's versatility and practical utility beyond speculative use cases, strengthening the narrative that Cardano delivers real-world value in challenging environments.\n\n\n\nFrench-Language Resource Contribution:\n\nBy creating comprehensive educational materials, documentation, and tutorials in French, we significantly expand Cardano's accessibility across Francophone Africa, Europe, Canada, and other French-speaking regions worldwide. These open-source resources fill a critical gap in the ecosystem's language diversity, lowering barriers for millions of potential developers and users who can now engage with Cardano in their native language. This linguistic expansion multiplies the project's impact far beyond Burkina Faso.\n\n\n\nGovernance Participation and Perspective Diversity:\n\nTraining developers in West Africa naturally increases African participation in Project Catalyst and other Cardano governance mechanisms. This brings diverse perspectives to treasury allocation decisions, technical priorities, and strategic direction—perspectives shaped by different economic contexts, infrastructure challenges, and use case priorities than those dominating current governance discussions. More diverse governance makes better decisions and ensures Cardano truly serves global needs rather than concentrated regional interests.\n\n\n\nBrand Strengthening and Narrative Impact:\n\nSuccessfully establishing a thriving Cardano developer hub in West Africa strengthens Cardano's positioning as the blockchain platform committed to global adoption and real-world impact. This provides powerful narrative evidence for Cardano's vision of \"blockchain for the many, not the few,\" distinguishing it from competitors focused primarily on wealthy markets. The story of African developers building solutions on Cardano resonates across media, conferences, and community channels, enhancing ecosystem brand value.\n\n\n\nNetwork Effect Acceleration:\n\nEach developer trained becomes a local advocate and educator, creating exponential awareness growth across their networks. As these developers build applications, they onboard users to Cardano wallets and services, driving transaction volume and network activity. The university partnerships create institutional relationships that can expand into research collaborations, further education programs, and broader academic engagement with Cardano technology.\n\n\n\nCompetitive Ecosystem Positioning:\n\nWhile other blockchain platforms discuss African expansion theoretically, Inkuba Hub represents concrete action—permanent infrastructure, trained developers, and real applications. This first-mover advantage in Francophone West Africa establishes Cardano as the default blockchain platform in the region before competitors mobilize, creating lasting network effects and developer loyalty.\n\n\n\nLong-term Sustainability and Continuous Value Generation:\n\nUnlike one-time educational initiatives, the permanent infrastructure we create continues generating value indefinitely. As the center achieves financial sustainability through diverse revenue streams, it becomes a self-perpetuating asset for the Cardano ecosystem—continuously training developers, incubating projects, and expanding adoption without requiring ongoing treasury funding. This transforms a one-time investment into a permanent value-generation engine.\n\n\n\nUltimately, Inkuba Hub's impact extends far beyond the 55,000 Ada investment. It establishes Cardano's presence in a strategic region, creates lasting infrastructure, expands the developer ecosystem meaningfully, and demonstrates that Cardano's vision of inclusive, global blockchain adoption is achievable reality rather than aspirational rhetoric.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Demonstrated Track Record and Established Credibility:\n\nOur capability to deliver with high trust and accountability is proven through three years of consistent Cardano advocacy work in Burkina Faso. We have successfully trained over 10 developers in blockchain fundamental, with over 10 currently continuing with Haskell and Plutus, 5 of which have been registered for certification at EBU thanks to our collaboration with Coxygene. We have built an active community of 150+ members, and established formal partnerships with universities—all accomplished with minimal resources and demonstrating our commitment, competence, and ability to execute in challenging environments. As a Constitutional Delegate within the Cardano ecosystem and host of the Cardano Francophone Corner, a member of the Community and Membership Commettee at Intersect MBO, Co-chair of Cardano Africa-Asia Coalision, and currently hosting a CATS hackathon in Burkina Faso, I have established credibility within the broader Cardano community and demonstrated understanding of ecosystem governance, values, and strategic priorities.\n\n\n\nExisting Infrastructure and Relationships:\n\nUnlike proposals starting from zero, Inkuba Hub already exists as an established organization with operational experience, community relationships, and institutional partnerships in place. We have one formalized university partnership ready to activate and preliminary agreements with additional institutions. Our existing network of trained developers provides immediate participants for advanced programs. This foundation significantly reduces execution risk—we're scaling proven activities rather than testing untested concepts.\n\n\n\nTransparent Financial Management:\n\nWe will implement rigorous financial accountability through monthly financial reports detailing all expenditures with supporting documentation, quarterly progress reports against defined milestones and success metrics, and public sharing of key outcomes through community channels and the Cardano Francophone Corner platform. All financial records will be maintained using professional accounting systems with clear audit trails. We commit to responding promptly to community questions and concerns, maintaining open communication channels throughout implementation.\n\n\n\nTechnical Competence:\n\nOur core team brings proven capabilities: Our Technical Lead has hands-on Cardano development experience and the facilitation skills to translate complex concepts for new learners. Our Education Coordinator understands local learning patterns and has curriculum development experience. Our Operations Manager has managed technology hubs in West African contexts and knows how to overcome regional infrastructure challenges. This combination of technical, educational, and operational expertise ensures we can execute effectively.\n\n\n\nFeasibility Validation Approach:\n\nWe will validate our approach through multiple mechanisms:\n\nParticipant Feedback Systems : Regular surveys and assessments capturing developer satisfaction, learning outcomes, and perceived value to identify necessary adjustments quickly.\n\n\n\nSkills Assessment : Objective technical evaluations measuring participant progress from baseline through completion, validating that our educational approach actually builds capabilities.\n\n\n\nCommunity Engagement Metrics : Tracking attendance patterns, community growth, online engagement, and retention rates to assess whether we're creating sustainable interest versus temporary enthusiasm.\n\n\n\nExternal Validation : Seeking feedback from global Cardano developers and technical experts who can objectively assess the quality of our participants' work and our program's effectiveness.\n\n\n\nCommunity Accountability:\n\nBeyond formal reporting, we commit to ongoing community engagement through regular updates on the Cardano Francophone Corner, participation in ecosystem forums and events, open invitation for community members to visit the facility, and responsiveness to questions and concerns raised through any channel. We view accountability not as a burden but as an opportunity to build trust and demonstrate the value of investing in African blockchain development.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Facility Establishment and Curriculum Development ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Secure and furnished 200+ square meter facility in Ouagadougou with collaborative workspaces\n\nInstall reliable internet connectivity with backup systems and power infrastructure\n\nEquip facility with 20+ workstations and necessary technical equipment\n\nRecruit and onboard Technical Lead, Education Coordinator, and Operations Manager\n\nDeploy learning management system and community platforms\n\nComplete structured curriculum covering blockchain fundamentals, Haskell, and Plutus development\n\nDevelop French-language learning materials, tutorials, and documentation\n\nCreate assessment frameworks and certification pathways\n\nFinalize instructor guides and teaching materials","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"A signed lease agreement for a  space in Ouagadougou is provided.\n\n\n\nPrimary internet connection is installed with a minimum guaranteed speed .\n\nAn itemized inventory list is provided, confirming at least 20 complete workstations \n\n\n\nAll computers have the necessary development software pre-installed (e.g., a Haskell toolchain, Plutus development environment, VS Code).\n\n\n\nSigned employment contracts for the three key roles (Technical Lead, Education Coordinator, Operations Manager) are provided (with sensitive details redacted for public sharing).\n\n\n\nA master curriculum document is delivered, outlining the complete scope and sequence for both the \"Foundation\" and \"Builder\" tracks.\n\n\n\nFor all modules, a full set of slides/visual aids in French is provided.\n\n\n\nA clear framework document outlines the criteria for successful completion of each track.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Document: The master curriculum document (PDF format) containing the detailed scope and sequence for both tracks.\n\n\n\nDocument: A signed statement or email from both the Technical Lead and Education Coordinator stating: \"We have reviewed and approved the final curriculum for implementation.\"\n\n\n\nDocument Pack: A zip file or a link to a cloud folder containing:\n\n\n\nAll presentation slide decks (e.g., PowerPoint/Google Slides) for every module.\n\n\n\nThe solution sets for the tutorials.\n\n\n\nTranslated technical documentation.\n\n\n\nDocument: A statement from the Education Coordinator confirming: \"All curriculum materials have been consolidated, are error-free, and are ready for the inaugural bootcamp.\"","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":19000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"University Onboarding Workshops","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"These are the concrete items you will produce and present as proof of completion. They are the direct evidence that the workshops were successful and the partnerships are active.\n\n\n\nPartnership Portfolio: A consolidated document package containing:\n\n\n\nOne signed Memorandum of Understanding (MOU) with a new university partner.\n\n\n\nA Partnership Activation Report for the existing partner, including meeting notes or a joint statement of work.\n\n\n\nWorkshop Execution Package: A complete set of documents and assets from the workshops, including:\n\n\n\nA Master Workshop Report listing all 6 workshops with dates, locations, and facilitator names.\n\n\n\nDigitized Attendance Sheets proving a minimum of 300 unique student attendees.\n\n\n\nPhotographic & Video Evidence (a curated gallery/montage) showing active participation and engagement during the events.\n\n\n\nThe final Presentation Decks and Educational Materials used in all sessions.\n\n\n\nVerified Talent Pipeline: A structured and actionable list of potential future developers, evidenced by:\n\n\n\nA Student Interest Database (in CSV format, with privacy compliance) containing the contact information of 45+ students who opted-in for further training.\n\n\n\nThe published \"Student Pathway\" Document or web page that outlines the next steps for these students (e.g., \"Apply for our Bootcamp,\" \"Join our Advanced Haskell Study Group\").\n\n\n\nParticipant Feedback Analysis: A formal summary of the participant experience, comprising:\n\n\n\nA Feedback Analysis Report that synthesizes the data from all collected feedback forms.\n\n\n\nRaw Feedback Data (in a spreadsheet) showing that ≥80% satisfaction rate was achieved.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Partnerships Formalized:\n\nAt least one existing university partnership is activated, confirmed by a joint announcement or kick-off meeting.\n\n\n\nOne new, additional university partnership is formalized through a signed Memorandum of Understanding (MOU). The MOU must explicitly mention collaboration on blockchain education and student outreach.\n\n\n\nWorkshops Executed:\n\n\n\nA minimum of 2 distinct workshops are conducted across the partnered universities.\n\n\n\nThe workshops have a combined total attendance of at least 300 unique students.\n\n\n\nEach workshop covers a pre-defined curriculum, including: Introduction to Blockchain, The Cardano Ecosystem, and Career Opportunities in Web3.\n\n\n\nPipeline Established:\n\n\n\nAt least 30% of the workshop attendees (i.e., 45+ students) formally express interest in further training by registering on a dedicated list or the center's community platform.\n\n\n\nA clear and documented \"pathway\" is created (e.g., a flyer, a web page) outlining the next steps for students, such as applying for the developer bootcamp or joining advanced study groups.\n\n\n\nFeedback Collected:\n\n\n\nA standardized feedback form is administered at the end of each workshop.\n\n\n\nThe aggregate feedback data shows that over 80% of respondents rated the workshop content and presentation as \"Satisfactory\" or higher.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"For Partnerships:\n\n\n\nDocument: A scanned copy of the signed MOU with the new university partner (with sensitive clauses redacted).\n\n\n\nDocumentary Proof: An event agenda, meeting minutes, or dated photographs showing the activation meeting with the existing partner.\n\n\n\nFor Workshops Executed:\n\n\n\nDocument: A \"Workshop Report\" that includes:\n\n\n\nA list of all 6 workshops with dates, locations, and names of the lead facilitator.\n\n\n\nSigned attendance sheets from each workshop (scanned copies).\n\n\n\nPhotographs and/or a short video montage from the events.\n\n\n\nDocument: Copies of the presentation slides and any handouts used in the workshops.\n\n\n\nFor Pipeline Established:\n\n\n\nDocument: A spreadsheet (e.g., CSV file) of the 45+ students who registered for further information, including their contact details (handled in accordance with privacy laws).\n\n\n\nDocument/Visual: A copy of the \"pathway\" document or a screenshot of the web page given to students.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":5000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Advanced Training and Mentorship Network","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Successful graduates of our inaugural developer bootcamp will be priority candidates for our Advanced Plutus Development track. This advanced program is designed for the most dedicated and skilled builders who demonstrate the potential to become leaders in the Cardano ecosystem.\n\n\n\nAdmission to this elite cohort will be based on:\n\n\n\nPerformance and project work in the foundational bootcamp.\n\n\n\nA demonstrated commitment through participation and collaboration.\n\n\n\nA formal expression of interest and interview.\n\n\n\nThis selective process ensures that our most limited resources—expert mentor time and advanced training—are invested in the developers with the highest potential, maximizing the impact and quality of the resulting certified experts.\"","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Second Cohort Completed:\n\n\n\nA second cohort of developers is successfully recruited and undergoes advanced Plutus development training.\n\n\n\nMentorship Network Operational:\n\n\n\nA formal mentorship network is established with a minimum of active, vetted mentors.\n\n\n\nEvidence is provided that at least 80% of the advanced cohort participants are actively engaged with a mentor (e.g., through a matched list or meeting logs).\n\n\n\nAdvanced Certification Achieved:\n\n\n\nA rigorous assessment for \"Advanced Plutus Smart Contract Development\" is created and administered.\n\n\n\nA minimum of 10 developers from the advanced cohort successfully pass this assessment and receive certification.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"For the Second Cohort:\n\n\n\nDocument: A list of the second cohort's participants and their completion status.\n\n\n\nFor the Mentorship Network:\n\n\n\nDocument: A Mentorship Program Framework outlining the structure, roles, and expectations for mentors and mentees.\n\n\n\nDocument: A Mentor Registry listing the 8+ mentors, their areas of expertise, and brief bios.\n\n\n\nData: A Mentor-Mentee Matching Log and sample meeting logs/feedback forms to prove active engagement.\n\n\n\nFor the Specialized Workshops:\n\n\n\nDocument: A Workshop Series Report listing all 12 workshops, their topics, dates, and facilitators.\n\n\n\nDocument: Aggregated attendance records for the workshop series.\n\n\n\nAssets: Presentation slides and code repositories from the delivered workshops.\n\n\n\nFor Advanced Certification:\n\n\n\nDocument: The Advanced Certification Exam and the grading rubric used.\n\n\n\nDocument: A Certification Registry listing the names/certificate IDs of the 10+ certified developers.\n\n\n\nPortfolio: A Showcase of Advanced Projects from the certified developers, demonstrating complex smart contract functionality (e.g., links to GitHub repositories).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":6000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Hackathon and Close Out Report","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Event Report: A summary document including the event agenda, participant list (with 30+ names/IDs), rules, and a description of the judging process.\n\n\n\nVisual Evidence: A professional photo gallery and a short (2-3 minute) highlight video showcasing the energy, teamwork, and presentations.\n\n\n\nWinners' Announcement: A formal document or public blog post announcing the winning teams and their projects.\n\n\n\nHackathon Project Portfolio:\n\n\n\nA compiled document or a dedicated GitHub repository featuring the top 5-8 projects.\n\n\n\nCommunity Growth & Engagement Metrics:\n\n\n\nDashboard Screenshots: Proof of community platform (Discord, Telegram) growth, showing the member count increased to 200+.\n\n\n\nParticipant Feedback & Testimonials:\n\n\n\nAggregated Feedback Data: A summary of feedback forms showing a high satisfaction rate (e.g., >80%).\n\n\n\nVideo Testimonials: 3-5 short videos from participants and judges discussing their experience and the quality of the projects.\n\n\n\nPart B: Close Out Report (The Final Project Summary)\n\n\n\nComprehensive Final Report:\n\n\n\nExecutive Summary: A high-level overview of the project's journey and top-level achievements.\n\n\n\nMetrics Dashboard: A consolidated report against all success criteria, detailing:\n\n\n\nTotal developers trained and certified.\n\n\n\nNumber of university partnerships formalized and students reached.\n\n\n\nCommunity growth metrics from start to finish.\n\n\n\nNumber of projects and prototypes developed.\n\n\n\nEconomic Impact Summary: Data on job placements, entrepreneurial opportunities supported, and any initial revenue generated.\n\n\n\nLessons Learned: An honest reflection on what worked, what didn't, and recommendations for others.\n\n\n\nAsset Handover Package:\n\n\n\nLinks to All Project Assets: A centralized list with links to the complete curriculum, all tutorials, the project portfolios from bootcamps, and the hackathon portfolio. This ensures all created materials remain accessible to the Cardano community.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Major Hackathon Executed:\n\n\n\nA hackathon event is hosted with a minimum of 30 participants.\n\n\n\nThe event has a clear theme (e.g., \"Solving Local Challenges with Cardano,\" \"DeFi for Africa\").\n\n\n\nA minimum of 8 viable project concepts are pitched during the event.\n\n\n\nCommunity Meetups Sustained:\n\n\n\nA minimum of 10 community meetups or networking events are held before and after the hackathon.\n\n\n\nMeetups cover a variety of formats (e.g., workshops, project demos, guest speaker sessions).\n\n\n\nCommunity Growth Achieved:\n\n\n\nThe active community (measured by members in Discord/Telegram, event attendees) grows from 150 to 300+ members.\n\n\n\nThere is a measurable increase in engagement (e.g., messages, questions, pull requests) on community platforms.\n\n\n\nProject Prototypes Documented:\n\n\n\nThe top 3-5 projects from the hackathon are documented with a project pitch, concept note, and a link to a GitHub repository containing the code.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"For the Hackathon:\n\n\n\nEvent Documentation: A \"Hackathon Report\" including the event agenda, rules, and list of participants (with redacted names/IDs for privacy).\n\n\n\nVisual Proof: A photo gallery and a short (2-3 minute) video montage of the hackathon, showing team formation, coding, and presentations.\n\n\n\nProject Log: A list of all 8+ project concepts that were worked on, including team names and project descriptions.\n\n\n\nFor Community Meetups:\n\n\n\nEvent Calendar: A list of all 10+ meetups with dates, topics, and facilitator names.\n\n\n\nAttendance Records: Aggregated sign-in sheets or digital attendance records for the meetup series.\n\n\n\nFor Community Growth:\n\n\n\nMetrics Dashboard: Screenshots from your community platform (e.g., Discord) showing the member count growing from 150 to 200+.\n\n\n\nEngagement Report: A brief report highlighting increased activity (e.g., \"a 50% increase in monthly messages\") in the community channels.\n\n\n\nFor Project Prototypes:\n\n\n\nPortfolio Document: A \"Hackathon Project Portfolio\" (PDF) featuring the top 3-5 projects, including:\n\n\n\nProject name and description.\n\n\n\nTeam members.\n\n\n\nProblem it solves.\n\n\n\nLink to the GitHub repository.\n\n\n\nTestimonials: Select quotes or short video testimonials from 3-5 participants about their hackathon experience.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":11,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":4000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Laurentine Djatsa: Project Lead\n\nInkuba Hub lead, constitutional delagate, Member of the Intersect MCC Commettee, Host of Cardano Francophne Corner, Vice Chair of Cardano Africa-Asia Coalission. Has been advocating Cardano in Burkina Faso for the past 3 years\n\n\n\nBetsaleel: Technical Lead : Passionate about blockchain, I actively work on smart contracts on EVM chains and Cardano, with a strong focus on security and the comparison between the EUTXO and Account/Balance models. His achievements include:\n\nConnecting a Mobile Money system to the blockchain to enable secure money transfers (EVM chain), Developing a decentralized voting system combining USSD and smart contracts (EVM chain), Implementing a stablecoin on a private blockchain (EVM chain), Deploying smart contracts integrating Chainlink Automation, VRF, and Price Feeds for secure and automated interactions.\n\n\n\nBarthelemy, Education Coordinator: Blockchain developer and trainig Facilitator at Coxygene, Engeneer at Ministry of Digital Transition, Postal Services, and Electronic Communications\n\n\n\nAime Niko Kam, Operation Manager: He facilitated several workshops aimed at educating young people on the very essence of the Cardano blockchain. Very active within the ecosystem, he contributes to the promotion of blockchain technologies and participates in initiatives designed to train and support youth in the opportunities offered by Web3.\n\nHe aspires to build an environment of learning and innovation that serves social and economic development, where blockchain technology will hold a place of great importance. As a constitutional delegate he participated actively in the Cardano constitution ratification un has a good understandig of the Cardano governance","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"1. Facility Establishment & Curriculum Development (Months 1-3)\n\nAllocation: 25,000 ADA (34.5%)\n\n\n\nFacility Setup (Rent, Deposit, Utilities): 8,000 ADA\n\n\n\nEquipment & Infrastructure (20+ workstations, internet, power): 5,000 ADA\n\n\n\nCore Team Salaries (Partial): 6,000 ADA\n\n\n\nCurriculum Development Labor & Materials: 6,000 ADA\n\n\n\nThis is the highest-cost phase due to significant capital expenditure (facility, equipment) and the intensive labor required to develop the foundational educational IP from scratch.\n\n\n\n2. University Onboarding Workshops \n\nAllocation: 7,000 ADA (9.1%)\n\n\n\nWorkshop Logistics & Materials: 2000 ADA\n\n\n\nFacilitation & Staff Labor: 4000 ADA\n\n\n\nPartnership Development & Follow-up: 1,000 ADA\n\n\n\nCovers the costs of activating partnerships and delivering workshops to 150+ students, creating the essential talent pipeline for future bootcamps.*\n\n\n\n3. First Developer Bootcamp Completion \n\nAllocation: 12 250 ADA\n\n\n\nInstruction & Mentorship Labor: 9,000 ADA\n\n\n\nParticipant Support & Logistics: 3,250 ADA\n\n\n\nJustification: The core educational program. Costs cover intensive instruction, support resources, and the verification of learning outcomes for the first cohort of 25-30 developers.\n\n\n\n4. Advanced Training and Mentorship Network \n\nAllocation: 8000 ADA \n\n\n\nAdvanced Instruction & Mentor Stipends: 5,000 ADA\n\n\n\nWorkshop Development & Delivery (12 specialized workshops): 1,500 ADA\n\n\n\nProgram Management & Certification(EBU): 1,500 ADA\n\n\n\n*Justification: Focuses on high-value, expert-level training. Costs include stipends for 8+ mentors and specialized instruction to produce certified Plutus developers.*\n\n\n\n5. Community Activation and First Hackathon (Month 8)\n\nAllocation: 4000 ADA\n\n\n\nHackathon Prizes & Incentives: 1,500 ADA\n\n\n\nEvent Logistics: 1,500 ADA\n\n\n\nCommunity Management & Marketing (for 10+ meetups): 1,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The total investment of 56,250 ADA is a highly strategic and efficient allocation of resources that will establish a permanent, growing hub for Cardano in West Africa. The value for money is demonstrated through a focus on long-term infrastructure, low cost-per-outcome, and the creation of self-sustaining ecosystem value.\n\n\n\nHere’s a breakdown of the value proposition:\n\n\n\n1. Investment in Lasting Infrastructure, Not Short-Term Costs\n\nThe largest cost (25,000 ADA) builds a permanent foundation.\n\n\n\nThe Physical Hub: The facility, workstations, and power infrastructure create a dedicated Cardano innovation center that will operate for years, hosting countless future developers, events, and projects long after this initial project concludes.\n\n\n\nReusable Educational IP: The curriculum and French-language materials are a permanent, open-source public good. They will be used to train thousands of future Francophone developers at virtually no additional cost to the Cardano ecosystem, eliminating the need to fund this from scratch again.\n\n\n\n2. Unbeatable Cost-Efficiency in Talent Development\n\nThe direct investment in training delivers highly skilled developers at a fraction of the global market rate.\n\n\n\nFirst Bootcamp (12,250 ADA for 25-30 developers): This represents a cost of approximately ~408-490 ADA per trained developer.\n\n\n\nAdvanced Training (8,000 ADA for 10+ certified experts): This invests about ~800 ADA per certified advanced Plutus developer.\n\n\n\nContext: Compared to the multi-thousand-dollar cost of similar technical training globally, this represents extraordinary leverage, especially for cultivating talent in a high-potential, underserved market.\n\n\n\n3. Strategic, High-Leverage Activities\n\nThe budget is allocated to activities that create multiplicative effects, not one-off events.\n\n\n\nUniversity Pipeline (7,000 ADA): This doesn't just pay for workshops; it formally integrates Cardano into the academic system, creating a structured, recurring funnel of hundreds of students into the ecosystem.\n\n\n\nMentorship Network (Part of 8,000 ADA): A small investment in mentor stipends creates a self-perpetuating cycle where graduates teach the next cohort, dramatically increasing the project's reach and impact without a linear cost increase.\n\n\n\nCommunity & Hackathon (4,000 ADA): This small investment catalyzes organic growth, innovation, and project creation. The 30+ hackathon participants will build the first wave of locally-relevant Cardano prototypes.\n\n\n\nConclusion: A High-Impact Ecosystem Investment\n\n\n\nThis budget is not an expense, but a strategic investment that delivers:\n\n\n\nA Permanent Physical Hub: A lasting asset for the ecosystem.\n\n\n\n50+ Trained Developers: A direct injection of skilled builders.\n\n\n\nA Replicable Educational Engine: Scalable, open-source training materials.\n\n\n\nA Sustainable Talent Pipeline: Formal partnerships with universities.\n\n\n\nA Vibrant Innovation Community: Activated through events and mentorship.\n\n\n\nEvery ADA is directed towards creating tangible, verifiable, and lasting value that will bootstrap the Cardano ecosystem in Francophone Africa, making this a project of exceptional strategic value for money.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Training","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1775}