{"pr_id":"019ac173-4299-7603-b585-c0e3083361f4","title":"Seasons of Collaboration: Funding the ODIN Initiative","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Governance efforts in the Cardano ecosystem struggle with healthy collaboration, limiting its ability to deliver transformative, decentralized change.","solution":"Guided 12-week program that strengthens Cardano’s governance by teaching practical collaboration, decision-making, and proposal skills—enabling more confident, capable, active on-chain participation.","proposer_name":"ODIN Community","proposer_relevant_experience":"ODIN has created significant value in the broader web3 ecosystem by fostering human connection, enabling decentralized collaboration, and promoting effective governance principles. Its origins trace back to Catalyst-funded book clubs, which laid foundational ideas. Early collaborations among key organizations like Gimbalabs, Cardano4Climate, and WADA led to the birth of both Andamio and ODIN. ODIN's study and application of S3 governance principles have directly influenced the organizational structures and decision-making processes of entities such as Gimbalabs, Andamio, and multiple Intersect committees and the Intersect Steering Committee, and Constitutional Governance Workstreams.\n\nODIN serves as a training and proving ground for working in a decentralized manner, where results are the clearest indicator of success. The network is also actively developing methods for direct and fair compensation for contributors, connecting purpose, meaning, and collaboration with the creation of individual value within the Cardano ecosystem and beyond.\n\nODIN's team makes space for people dedicated to decentralized work. We have defined community roles including our Cultivator (a role facilitating weekly efforts, meetings and coordination) and Harvester (a role focused on gathering the results and enabling reflection and evolution). We will continue defining new roles as needed. Our individuals include:\n\n**Newman Lanier** (see: [https://github\\.com/Newman5\\)](https://github.com/Newman5)) - background in educational technology and knowledge management, focused on healthy mechanisms of enabling loose coherence between autonomous individuals and groups, so their efforts can be mutually impactful while blending the boundaries and breaking down silos. LinkedIn: ([https://www\\.linkedin\\.com/in/newman5/\\)](https://www.linkedin.com/in/newman5/))\n\nServes as Cultivator and ODIN treasury trustee.\n\n**Nori Nishigaya** (see: [https://github\\.com/xeeban/xeeban\\)\\)](https://github.com/xeeban/xeeban))) - founder and Zen practitioner, focuses on community management and practicing the fundamentals of collaboration. He brings an integrated perspective from books such as Reinventing Organizations, Brave New Work, Work With Source, and other materials focusing on methods of decentralization and effective collaboration. He is a subject matter expert on Sociocracy, Teal organizations, Agile, and Software Development. He works to cultivate decentralized group cultures to enable trust, clarity, and autonomy. LinkedIn: ([https://www\\.linkedin\\.com/in/nishigaya/\\)](https://www.linkedin.com/in/nishigaya/))\n\nServes as Source, Cultivator, and ODIN treasury trustee.\n\n**Jeremy Bolander** - our resident philosopher focuses on the active study of integration between theories and daily applicability in the practices of decentralized collaboration. He brings these materials to light of day at [http://CollaborativeSparks\\.org](http://CollaborativeSparks.org), CSparks Github project,  and in his contributing role to the new governance models (styg) and open standards being piloted for teams like Xerberus.\n\n[https://github\\.com/Jeremy\\-l3/Steward\\_of\\_value](https://github.com/Jeremy-l3/Steward_of_value)\n\n[https://github\\.com/orgs/ODIN\\-Initiative/projects/5](https://github.com/orgs/ODIN-Initiative/projects/5)\n\n[https://docsend\\.com/view/pfizrix6sqhje7tg](https://docsend.com/view/pfizrix6sqhje7tg)\n\nHas served as Harvester and Specific-Source for Collaborative Sparks\n\n**Randall Harmon** - coding smart contracts, designing tokenomics and application infrastructure to enable decentralized collaboration at massive scale. Continuous study of collaboration and effectiveness. Designs group and project definitions to enable clarity and autonomy. Randall's Now Page ([https://discord\\.com/channels/1105907191690575882/1105923907107684473/1392250071663251517\\)](https://discord.com/channels/1105907191690575882/1105923907107684473/1392250071663251517)) LinkedIn ([https://www\\.linkedin\\.com/in/randall\\-harmon\\-aa52765/\\)](https://www.linkedin.com/in/randall-harmon-aa52765/))\n\n**Lewis Nduati** - Developer with a focus on developer tools, smart contract workflows, and enabling faster onboarding for new builders as well as - climate justice. Active contributor in ODIN’s Season of Collaboration. [https://www\\.linkedin\\.com/in/lewisnduati/](https://www.linkedin.com/in/lewisnduati/)\n\n**Tevo Kask** (see: [https://linktr\\.ee/tevosaks\\)](https://linktr.ee/tevosaks)) - Miro master, facilitator of swarms, Treasury Guild core contributor, SingularityNET Ambassador, has served as a Harvester\n\nODIN Community","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Seasons of Collaboration: Funding the ODIN Initiative","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"ODIN Community","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":4,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Governance efforts in the Cardano ecosystem struggle with healthy collaboration, limiting its ability to deliver transformative, decentralized change.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Guided 12-week program that strengthens Cardano’s governance by teaching practical collaboration, decision-making, and proposal skills—enabling more confident, capable, active on-chain participation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.odin.eco/","https://collaborativesparks.org/signs-of-cardano-pains/","https://www.youtube.com/playlist?list=PLYueNF0lzhQ1cYjJ8DYvenOiSrOplS4Pb","https://www.youtube.com/playlist?list=PLYueNF0lzhQ380Pg0oXd761foGHASzoXb"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Creative Commons - https://creativecommons.org/licenses/by-nc/4.0/deed.en","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Connected Community","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We will target:\n\n- DReps & DRep candidates\n- Intersect members & working groups\n- Governance-focused community contributors\n- Community hub leaders across regions\n- Newcomers seeking a guided pathway into governance\n- Teams preparing Catalyst proposals\n- Builders & educators who want better decision-making structure\n- Grassroots Cardano advocates and local community organizers\n- Active governance participants (DReps, Constitutional Committee, Intersect members)\n- Community contributors\n- Emerging leaders in Cardano’s grassroots networks\n- Members of institutions open to cultural change\n\n\n\nHealthy collaboration is the foundation of decentralization. By equipping individuals across roles and factions with shared practices, Season of Collaboration helps governance evolve from performative decentralization toward actual community-powered decision-making. This strengthens Cardano’s resilience, pluralism, and ability to deliver meaningful change.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"Our 3-month Season of Collaboration will involve outreach, facilitation, and project management. Activities include: \n\n- Outreach across Cardano hubs, governance groups, and events\n- Weekly guided collaboration sessions\n- Pattern literacy training (forces, topographies, collaboration dynamics)\n- Mentorship for governance and proposal development\n- Documentation of learnings and case studies\n- A public showcase event\n- Contribution back to the Collaborative Sparks pattern library","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"**Output Metrics**\n\n- 12+ weekly practice sessions delivered, with public summaries\n- 20-30 participants completing at least 2 sessions\n- 4–6 groups using the s3 governance patterns together \n- 20+ updated or new collaboration patterns published publicly\n- 3+ governance case studies documenting real collaboration learning\n- 3 open community workshops or governance outreach events\n\n**Adoption\\-Focused Metrics**\n\n- 15+ participants taking an on-chain governance action (voting, delegating, signaling, etc.)\n- 10+ governance or proposal drafts emerging from groups\n- 5+ groups using on-chain contribution or recognition flows\n- 3+ tokenomics or incentive experiments activated\n- 10+ new governance participants onboarded to wallet-based governance tools\n- 30% increase in governance confidence across the cohort","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**Perception of the Problem**\n\nCardano’s governance processes, while innovative, are currently struggling to translate the ideals of decentralization into consistent, effective collaboration. CIP-1694, the Cardano Constitution, and DRep liquid democracy have created powerful tools, but the human capacity and understanding to use them (see: [https://collaborativesparks\\.org/cardano\\-gov\\-challenges/\\)](https://collaborativesparks.org/cardano-gov-challenges/)) lags behind the technical achievements.\n\nWe see recurring patterns of unhealthy collaboration: concentration of influence in founding institutions, lobbying and self-dealing in budget processes, and a tendency for governance actions to be driven by a small set of actors rather than the broader community.\n\nThese dynamics frustrate contributors, limit diversity of input, and stall truly transformative change. Without deliberate investment in the skills, structures, and shared language of healthy collaboration, governance will limp forward — iterating without clear direction, and missing the chance to inspire and empower the whole ecosystem.\n\n**Reasons for Our Approach**\n\nSeason of Collaboration is a 12-week guided learning-by-doing program that builds practical governance and collaboration skills through hands-on practice, pattern-based learning, and structured community facilitation.\n\nParticipants learn to:\n\n- process governance tensions\n- use Sociocracy and consent-based decision-making\n- design and refine proposals\n- coordinate across groups\n- practice healthy conflict navigation\n- participate confidently in Cardano governance\n\nThis creates a repeatable pathway from awareness → capability → on-chain participation.\n\n\n\n**Why This Works**\n\n\n\nODIN has spent the last three years developing a shared pattern library of collaboration and governance dynamics — used today across Gimbalabs, Andamio, Intersect committees, Xerberus, and grassroots Cardano communities. The Season of Collaboration provides the structure, mentorship, and facilitation to help contributors practice these skills in real community scenarios.\n\n\n\nRather than teaching theory, we train people in the actual substance of collaboration that governance requires.\n\n\n\nODIN’s Season of Collaboration directly targets these gaps by creating a safe, practical, and engaging environment where community members can practice effective collaboration — not just discuss it.\n\n\n\nWe use a pattern library that names and normalizes common dysfunctions, while offering tested alternatives such as consent-based decision-making, sociocratic peer development, and healthy conflict navigation. This approach works because it doesn’t rely on theoretical training alone — participants learn by doing, week after week, in real interactions that mirror the tensions, diversity, and complexity of Cardano governance itself.\n\n\n\nBy pairing structured facilitation with open, self-organizing sprints, we foster trust, improve decision quality, and help participants develop actionable proposals that reflect broad, plural input. This method has already proven successful in smaller communities, and scaling it into the Cardano ecosystem will create a culture of collaboration that enables governance processes to function as intended.\n\n\n\n\n\n**Who We Engage**\n\n- Community hub leaders across regions\n- Newcomers seeking a guided pathway into governance\n- Teams preparing Catalyst proposals\n- DReps &amp; DRep candidates\n- Intersect members &amp; working groups\n- Governance-focused community contributors\n- Builders &amp; educators who want better decision-making structure\n- Grassroots Cardano advocates and local community organizers\n\n**Importance to Cardano**\n\nThis initiative directly strengthens Cardano’s long-term governance capacity by:\n\n- preparing contributors to participate in on-chain decision-making in Cardano and in decentralized orgs operating on Cardano\n- fostering the development of collaborative skills and culture for all Cardano participants including DReps\n- lowering the barrier to entry for governance newcomers\n- expanding the network of contributors who can be healthy contributors to governance in decentralized orgs\n- enabling community groups to coordinate better across regions and factions\n- reducing governance bottlenecks caused by fragmentation, conflict, and low confidence\n\nEvery funded project in Cardano benefits when participants know how to collaborate effectively. Season of Collaboration makes that capability accessible, trainable, and repeatable across the ecosystem.\n\n\n\n**Relevance and Timeliness**\n\nThe recent Poison Piggy incident underscored that Cardano’s resilience depends not only on technical robustness but also on the ecosystem’s ability to collaborate effectively under pressure. As highlighted in our accompanying analysis, “What the Poison Piggy Incident Revealed About Cardano’s Human Layer,” ([https://jeremy723866\\.substack\\.com/p/what\\-the\\-poison\\-piggy\\-incident\\-revealed\\)](https://jeremy723866.substack.com/p/what-the-poison-piggy-incident-revealed)) the recovery depended on shared understanding, rapid decentralized coordination, and trusted communication pathways. Season of Collaboration directly addresses these human-layer challenges by training participants in the real-world governance, facilitation, and collaboration skills that such incidents demand.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The Season of Collaboration builds capacity within the Cardano community to work together effectively on transformative initiatives. By blending real-time practice, pattern-based learning, and continuous mentorship, we help participants bridge the gap between ideas and implemented, sustainable change.\n\n\n\nIn the short term, this program delivers:\n\n- Stronger collaboration skills through practical use of Sociocracy, consent-based decision-making, and ODIN’s pattern library\n- Action-ready proposals that align with Cardano’s mission and values\n- Increased engagement by drawing in diverse participants — from governance contributors to builders, educators, and network stewards\n\n\n\nOver time, the cumulative impact grows:\n\n- Participants carry their skills and tools into other Cardano initiatives, multiplying the value of each Season’s investment\n- The pattern library becomes a shared memory of what works (and what doesn’t) in decentralized collaboration, lowering the learning curve for new contributors\n- Community-led projects are more resilient, transparent, and accountable — making Cardano’s governance and ecosystem more credible to the outside world\n\n\n\nOur work recognizes that global change starts with local change. While we may not have direct control over large institutions, we do have influence with the people inside them — and by equipping those people with the skills and structures of healthy collaboration, we seed transformation from the ground up.\n\n\n\nScaling this program will not only expand the reach of these benefits, it will also create a repeatable model that other networks in the Cardano ecosystem can adapt for their own communities, making collaborative excellence a defining feature of Cardano’s culture.\n\n\n\nODIN has been impacting the community in many ways over the years, including:\n\n\n\n- MCC\n- ICC\n- Gov workstreams\n- Treasury Guild\n- Gimbalabs\n- Andamio\n- Xerberus","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our team provides verifiable, publicly accessible evidence of governance, collaboration, research, and decentralized coordination capability.\n\n**Evidence of Experience**\n\n- Collaborative Sparks Pattern Library (60+ governance &amp; collaboration patterns): [https://collaborativesparks\\.org](https://collaborativesparks.org)\n- Season of Collaboration (2024–2025) documentation: [https://drive\\.google\\.com/drive/folders/1\\_muxCkeCpXQpGcDTg4IRdS4CKuCRhv5w?usp=sharing](https://drive.google.com/drive/folders/1_muxCkeCpXQpGcDTg4IRdS4CKuCRhv5w?usp=sharing)\n- ODIN Study Groups (CIP-1694, governance,, etc.): [https://drive\\.google\\.com/drive/folders/1eq6ktSinCTmHiIzppp6y3eDZeR8sOER0?usp=sharing](https://drive.google.com/drive/folders/1eq6ktSinCTmHiIzppp6y3eDZeR8sOER0?usp=sharing)\n- Leadership Book Clubs &amp; governance training ecosystem (Reinventing Organizations, Work With Source. Etc since 2022): [https://www\\.youtube\\.com/playlist?list=PLYueNF0lzhQ1cYjJ8DYvenOiSrOplS4Pb](https://www.youtube.com/playlist?list=PLYueNF0lzhQ1cYjJ8DYvenOiSrOplS4Pb)  [https://www\\.youtube\\.com/playlist?list=PLYueNF0lzhQ380Pg0oXd761foGHASzoXb](https://www.youtube.com/playlist?list=PLYueNF0lzhQ380Pg0oXd761foGHASzoXb)\n- Season of Collaboration pilot results: [https://docs\\.google\\.com/document/d/1Xt0vwSKElNf1RfHublTrTtcljzclwilL8oZ\\-TXHh\\-3s/edit?usp=sharing](https://docs.google.com/document/d/1Xt0vwSKElNf1RfHublTrTtcljzclwilL8oZ-TXHh-3s/edit?usp=sharing)\n\n**Impact to Date**\n\nOur methodologies, patterns, and facilitation practices influence:\n\n- Intersect Steering Committee\n- Membership &amp; Community Committee (MCC)\n- Constitutional Governance Workstreams\n- Gimbalabs\n- Andamio\n- Photrek R&D\n- Xerberus governance model and open standards development\n- SugularityNet Ambassador's Program\n\nODIN’s approach blends governance theory with practical, embodied skill-building — the missing layer needed for decentralization to function at scale.\n\n**Pathway to Adoption \\(Required Category Section\\)**\n\nTarget On-Chain Actions\n\nOur program prepares participants for five main types of on-chain activities::\n\n1. Enable mission-aligned groups to progress from collaborative practice into on-chain actions such as contribution recognition, incentive flows, governance signaling, and tokenomics engagement.\n2. Develop direct audiences for onchain transactions in ODIN's s3 governance app; and between project owners, Odin staff and collaborators\n3. Participating in Intersect, Ecosystem or Constitutional governance workflows\n4. Enabling informed representative governance through skilled delegation and the cultivation of capable, collaboration-trained DReps.\n5. Open and developing channels for Cardano community members to participate in groups seeking more liquid capital, creating opportunities for Cardano holders to be leveraging their holdings with impactful Cardano based ventures\n\nPathway to Adoption\n\n1. Join collaborative spaces\n2. Contributors enter ODIN’s practice sessions, working groups, and community collaboration environments.\n3. Develop shared intentions &amp; governance literacy\n4. Using S3 patterns and ODIN facilitation, groups learn alignment building, tension processing, and participatory decision-making.\n5. Engage in structured, incentivized collaboration\n6. Governance working groups and S3 processes help teams navigate roles, responsibilities, and value creation.\n7. Form governance-ready groups around real work\n8. As contributors coordinate effectively, they become stable groups capable of authentic governance participation.\n9. Activate purpose-driven on-chain behaviors\n10. Groups begin using on-chain tools for:\n11. contribution recognition\n12. incentive flows\n13. project governance signals\n14. tokenomics-based engagement\n15. Expand on-chain adoption through aligned missions\n16. Cardano holders engage not just as speculators but as active participants backing missions and ventures they trust.\n\nThis creates a repeatable, scalable pipeline from ecosystem engagement → governance literacy → active on-chain participation.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Community Mobilization & Pattern Foundations","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Outreach campaign (social media, Cardano forums, spaces, newsletters)\n- Onboarding calls introducing Season of Collaboration and ODIN’s culture and patterns for governance skill-building\n- Selection of weekly themes for first month via community tension-processing\n- Pattern orientation sessions for new participants","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Delivered reports of outreach efforts and the results we measured\n- Delivered reports on participation and engagement levels achieved\n- First month’s weekly themes decided through a collaborative process\n- Pattern orientation materials are publicly accessible","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Screenshots & links to outreach posts and campaigns\n- List of participants onboarded with anonymized participation stats\n- Public meeting notes showing tension-processing → theme selection\n- Published orientation materials (GitHub repo, Miro board, or similar)","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Deep Collaboration Sprints","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Six weeks of 1-week collaboration sprints focused on chosen patterns and governance skill practice\n- Weekly community calls for sharing progress, learning, and feedback\n- Continuous development of documented patterns responding to real-world needs\n- Ongoing outreach & onboarding for late joiners\n- Mentorship provided for proposal and initiative design and governance skills","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Active contributing participants and their outputs have been monitored and logged\n- New and iterated patterns have been updated in pattern library\n- Mentorship-supported proposals have been prepared for Cardano-related initiatives\n- Public documentation of weekly progress","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Sprint summaries with attendance records and key outputs\n- Report of new and updated patterns (e.g. changelog)\n- Log of governance proposal activities within ODIN and the broader network (participant-reported)\n- Recording archive of weekly community calls","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Harvest & Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Showcase event(s) presenting developed patterns, proposals, and collaboration case studies\n- Final outreach push to share results across Cardano community channels\n- Evaluation report with KPIs and qualitative stories of transformation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Showcase with community members (live or async)\n- Proposals from Season participants submitted to Catalyst or other Cardano projects and networks have been logged\n- Evaluation report published and shared in governance forums","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Overall: Event recordings and participation stats\n- Overall: Contributor survey results (aggregated and anonymized)\n- Published evaluation report with KPI metrics and qualitative insights","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"ODIN has created significant value in the broader web3 ecosystem by fostering human connection, enabling decentralized collaboration, and promoting effective governance principles. Its origins trace back to Catalyst-funded book clubs, which laid foundational ideas. Early collaborations among key organizations like Gimbalabs, Cardano4Climate, and WADA led to the birth of both Andamio and ODIN. ODIN's study and application of S3 governance principles have directly influenced the organizational structures and decision-making processes of entities such as Gimbalabs, Andamio, and multiple Intersect committees and the Intersect Steering Committee, and Constitutional Governance Workstreams.\n\nODIN serves as a training and proving ground for working in a decentralized manner, where results are the clearest indicator of success. The network is also actively developing methods for direct and fair compensation for contributors, connecting purpose, meaning, and collaboration with the creation of individual value within the Cardano ecosystem and beyond.\n\nODIN's team makes space for people dedicated to decentralized work. We have defined community roles including our Cultivator (a role facilitating weekly efforts, meetings and coordination) and Harvester (a role focused on gathering the results and enabling reflection and evolution). We will continue defining new roles as needed. Our individuals include:\n\n**Newman Lanier** (see: [https://github\\.com/Newman5\\)](https://github.com/Newman5)) - background in educational technology and knowledge management, focused on healthy mechanisms of enabling loose coherence between autonomous individuals and groups, so their efforts can be mutually impactful while blending the boundaries and breaking down silos. LinkedIn: ([https://www\\.linkedin\\.com/in/newman5/\\)](https://www.linkedin.com/in/newman5/))\n\nServes as Cultivator and ODIN treasury trustee.\n\n**Nori Nishigaya** (see: [https://github\\.com/xeeban/xeeban\\)\\)](https://github.com/xeeban/xeeban))) - founder and Zen practitioner, focuses on community management and practicing the fundamentals of collaboration. He brings an integrated perspective from books such as Reinventing Organizations, Brave New Work, Work With Source, and other materials focusing on methods of decentralization and effective collaboration. He is a subject matter expert on Sociocracy, Teal organizations, Agile, and Software Development. He works to cultivate decentralized group cultures to enable trust, clarity, and autonomy. LinkedIn: ([https://www\\.linkedin\\.com/in/nishigaya/\\)](https://www.linkedin.com/in/nishigaya/))\n\nServes as Source, Cultivator, and ODIN treasury trustee.\n\n**Jeremy Bolander** - our resident philosopher focuses on the active study of integration between theories and daily applicability in the practices of decentralized collaboration. He brings these materials to light of day at [http://CollaborativeSparks\\.org](http://CollaborativeSparks.org), CSparks Github project,  and in his contributing role to the new governance models (styg) and open standards being piloted for teams like Xerberus.\n\n[https://github\\.com/Jeremy\\-l3/Steward\\_of\\_value](https://github.com/Jeremy-l3/Steward_of_value)\n\n[https://github\\.com/orgs/ODIN\\-Initiative/projects/5](https://github.com/orgs/ODIN-Initiative/projects/5)\n\n[https://docsend\\.com/view/pfizrix6sqhje7tg](https://docsend.com/view/pfizrix6sqhje7tg)\n\nHas served as Harvester and Specific-Source for Collaborative Sparks\n\n**Randall Harmon** - coding smart contracts, designing tokenomics and application infrastructure to enable decentralized collaboration at massive scale. Continuous study of collaboration and effectiveness. Designs group and project definitions to enable clarity and autonomy. Randall's Now Page ([https://discord\\.com/channels/1105907191690575882/1105923907107684473/1392250071663251517\\)](https://discord.com/channels/1105907191690575882/1105923907107684473/1392250071663251517)) LinkedIn ([https://www\\.linkedin\\.com/in/randall\\-harmon\\-aa52765/\\)](https://www.linkedin.com/in/randall-harmon-aa52765/))\n\n**Lewis Nduati** - Developer with a focus on developer tools, smart contract workflows, and enabling faster onboarding for new builders as well as - climate justice. Active contributor in ODIN’s Season of Collaboration. [https://www\\.linkedin\\.com/in/lewisnduati/](https://www.linkedin.com/in/lewisnduati/)\n\n**Tevo Kask** (see: [https://linktr\\.ee/tevosaks\\)](https://linktr.ee/tevosaks)) - Miro master, facilitator of swarms, Treasury Guild core contributor, SingularityNET Ambassador, has served as a Harvester\n\nODIN Community","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Milestone 1: Foundation & Onboarding \\(20,000 ADA\\)**\n\n\n\nDeliverables: Launch outreach, onboarding flow, set up facilitation systems, run initial sessions of 3-month sprint cycle.\n\n\n\nBudget allocation:\n\n- Marketing & Outreach – 6,000 ADA\n- (Branding, community calls, promo materials, social campaigns)\n- Facilitation & Hosting – 6,000 ADA\n- (Skilled hosts/trainers to onboard participants into collaborative practices)\n- Project Management – 5,000 ADA\n- (Admin setup, coordination, milestone tracking)\n- Documentation & Reporting – 3,000 ADA\n- (Onboarding guide, first transparency report, setup of public project dashboard)\n\n\n\n**Milestone 2: Practice & Iteration \\(20,000 ADA\\)**\n\n\n\nDeliverables: Core 3-month sprint in full swing — themed weekly cycles, collaborative skill-building, peer mentorship.\n\n\n\nBudget allocation:\n\n- Marketing & Outreach – 5,000 ADA\n- (Ongoing participant recruitment, spotlighting success stories, weekly updates)\n- Facilitation & Hosting – 8,000 ADA\n- (Weekly practice sessions, feedback cycles, conflict support, pattern integration)\n- Project Management – 4,000 ADA\n- (Scheduling, resource allocation, tension-tracking)\n- Contingency and Adaptation – 3,000 ADA\n- (adjust sessions when capacity is limited)\n\n\n\n**Milestone 3: Consolidation & Scaling \\(20,000 ADA\\)**\n\n\n\nDeliverables: Evaluation, reflection, and publication of results; proposals for next Season; wider community adoption.\n\n\n\nBudget allocation:\n\n- Marketing & Outreach – 4,000 ADA\n- (Highlighting outcomes, shareable case studies, community showcase events)\n- Facilitation & Hosting – 6,000 ADA\n- (Harvesting learnings, final community workshops, scaling strategies)\n- Project Management – 5,000 ADA\n- (Final reporting, budget reconciliation, coordination of next steps)\n- Impact Evaluation & Knowledge Products – 5,000 ADA\n- (Publishing the updated pattern library, public report, recorded learnings, governance recommendations for Cardano)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project gives the treasury a high-leverage investment in the long-term success of Cardano governance and community-led innovation.\n\n\n\n**Strengthens Governance Capacity**\n\n- CIP-1694 and the Cardano Constitution create the rules, but healthy governance requires the skills and culture to work well within them.\n- Season of Collaboration turns governance theory into practical, repeatable skills, producing contributors who are better prepared to design, evaluate, and implement governance actions.\n\n\n\n**Increases the Return on All Funded Projects**\n\n- Many Catalyst-funded projects fail to achieve transformative impact, not because of poor ideas, but because teams lack the collaboration, decision-making, and feedback structures to execute impactful efforts effectively.\n- By training and mentoring participants before and during their projects, we reduce waste, improve delivery rates, and ensure that good ideas don’t die in execution.\n\n\n\n**Delivers a Reusable Asset to the Ecosystem**\n\n- The ODIN pattern library and program framework become a shared infrastructure for collaboration, available to all Cardano projects and future Seasons without needing to start from scratch.\n- This creates ongoing value beyond the funding period — each future participant benefits from the cumulative learning of previous cohorts.\n\n\n\n**Demonstrates Tangible Impact**\n\n- Through measurable KPIs (proposals developed, skills adopted, cross-team collaborations formed), Catalyst will get hard data on how this investment directly strengthens the ecosystem.\n- Our reporting and documentation will show not only what was achieved, but how the skills learned in the Season ripple outward into other Cardano initiatives.\n\n\n\n**Builds Cultural Resilience**\n\n- Healthy, skilled collaboration reduces factionalism, lobbying dominance, and burnout — all threats to decentralized governance.\n- Investing in the people and the culture creates a stable, adaptable foundation for the community to thrive through future challenges.\n\n\n\nIn short: The treasury gets more than a 3-month program — it will be invested in the people, patterns, and practices that will make every other funded initiative more effective, aligned, and resilient.\n\n\n\n**Recognition & Endorsements**\n\n\n\nOur Fund 14 governance proposal received strong endorsements from:\n\n- A Cardano Foundation governance contributor curating high-impact governance proposals: [https://forum\\.cardano\\.org/t/fund\\-14\\-assessments\\-through\\-a\\-governance\\-lens/149644](https://forum.cardano.org/t/fund-14-assessments-through-a-governance-lens/149644)\n- Multiple governance educators and DReps\n    - [https://forum\\.cardano\\.org/t/distributed\\-decision\\-making\\-list\\-of\\-proposals\\-endorsed\\-by\\-rodrigo/149613/4](https://forum.cardano.org/t/distributed-decision-making-list-of-proposals-endorsed-by-rodrigo/149613/4)\n    - [https://x\\.com/RodrigoPacini/status/1971654093874884788](https://x.com/RodrigoPacini/status/1971654093874884788)\n\n\n\nThese endorsements praised the clarity, rigor, and real-world utility of our pattern-based governance framework.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Connected Community","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1777}