{"pr_id":"019abc03-1114-7f3d-b684-09aec2d5628a","title":"Hydra x402: USDM & HFT-DeFi Plugin inside ChatGPT/Claude","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"AI apps like ChatGPT and Claude can’t connect to Cardano wallets to make high-frequency trades or stablecoin payments, while Solana, Base, and Ethereum already have Multiple working integrations.","solution":"Hydra x402 plugin links Cardano wallets to ChatGPT/Claude, enabling high-speed transactions & DeFi trades directly inside AI, a major UX upgrade that makes Cardano usable with multi-billion-user apps.","proposer_name":"Nucast - Sricharan Ganta","proposer_relevant_experience":"**Sricharan Ganta, CEO** @ Nucast - [https://www\\.linkedin\\.com/in/sricharangm](https://www.linkedin.com/in/sricharangm) , [https://x\\.com/Charanz1309](https://x.com/Charanz1309)\n\nSricharan is a entrepreneur and business development strategist with over eight years of experience in business-driven roles and over four years of experience in the web3 domain. He has a successful track record of delivering innovative products on the Cardano Blockchain. As the CEO of Nucast, Charan is extremely passionate about community building and pioneering solutions. He currently leads a dynamic team of 15+ professionals at Nucast Labs. Additionally, he holds a Masters in Computer Science from the University of Central Missouri, USA.\n\n**Sam Jeffrey M, CTO** @ Nucast - [https://x\\.com/samjefree](https://x.com/samjefree)\n\nBuilding tech on Cardano for 5+ years. Worked as Plutus Consultant at Gimbalabs. Awarded the Presidential Award for Innovation 2021 by the Government of India.\n\n**Nucast Labs** ([https://www\\.nucast\\.io/](https://www.nucast.io/) , [https://labs\\.nucast\\.io/](https://labs.nucast.io/) ) : Successfully built various scalable Cardano dapps. Nucast is proud to host a highly skilled and experienced development team of 15+ members with over 30 years of combined industry experience.","url":null,"funds":130000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Hydra x402: USDM & HFT-DeFi Plugin inside ChatGPT/Claude","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Nucast - Sricharan Ganta","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":130000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":5,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"AI apps like ChatGPT and Claude can’t connect to Cardano wallets to make high-frequency trades or stablecoin payments, while Solana, Base, and Ethereum already have Multiple working integrations.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Hydra x402 plugin links Cardano wallets to ChatGPT/Claude, enabling high-speed transactions & DeFi trades directly inside AI, a major UX upgrade that makes Cardano usable with multi-billion-user apps.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.nucast.io/","https://www.x402.org/","https://x.com/NucastIO"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"MIT Licence","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"AI","group":"Development & Tools"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Hydra x402 brings Cardano into major AI platforms in a way that has not been done before. It lets everyday users connect a Cardano wallet directly inside ChatGPT or Claude and complete simple blockchain actions through natural language. Other ecosystems such as Solana and Base have started exploring AI connectors, but Cardano has no comparable solution that provides direct wallet access, USDM payments, and Hydra accelerated settlement inside an AI interface.\n\n\n\nThe innovation comes from three combined advances. First, the connector works inside the AI environment where hundreds of millions of users already spend time, which removes the usual friction of switching tools or installing new applications.\n\nSecond, Hydra x402 uses a safe and minimal permission model so the AI can build transactions while the user still controls every signature through standard CIP-30 processes.\n\n\n\nThird, it introduces a payment rail built around USDM and the x402 protocol. This translates user intent into deterministic Cardano transactions that can execute at high speed using Hydra mini ledgers. This creates a new category of use cases for Cardano such as streaming micro-payments, AI generated invoices, and real time small business workflows.\n\nNo existing Cardano solution provides these capabilities inside AI applications or unlocks access to new users at this scale.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The MVP will demonstrate a working Cardano wallet connector that operates inside ChatGPT and Claude. Users will be able to open their settings, enable Hydra x402, and connect a Lace, Eternl, or Begin wallet using the standard CIP-30 interface. Once connected, the AI can perform simple, permissioned tasks such as reading balances, generating receive addresses, preparing payments, or checking transaction status. All actions require explicit user approval.\n\nThe MVP will also demonstrate USDM and ADA mainnet transactions executed through natural language. The connector will translate user instructions into valid Cardano transactions that the wallet can sign. When applicable, the MVP will route repeated small transactions through a Hydra fast path so the user can experience near instant confirmations for use cases like micro-payments and business invoicing.\n\n\n\nThe prototype will be publicly accessible through connector feature inside ChatGPT and Claude, along with an open source repository and documentation that explains how developers can build on the x402 standard. Reviewers and community members will be able to test every capability directly inside the AI platform.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"The MVP will target clear on chain outcomes such as 1,500 to 3,000 AI initiated Cardano transactions, Hydra fast path performance above 100 micro transactions per second during controlled stress tests, and 200 to 400 repeated payment sessions processed through Hydra. These metrics show real usage and confirm that the connector can translate natural language instructions into reliable onchain activity.\n\n\n\nFunctional success will be demonstrated through stable CIP 30 signing across Lace, Eternl, and Begin Wallet, full support for balance checks, address generation, transaction preparation and signing, and deterministic transaction building validated through reproducible test vectors. Consistent MCP connector performance inside ChatGPT and Claude across major browsers will confirm the reliability of the integration.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"![](https://ik.imagekit.io/rt68ucjjc/Sync/Nucast%201st.png)\n\n# **Why Cardano Needs an AI–Wallet Bridge Now**\nThe rapid rise of AI-native applications: ChatGPT, Claude, Gemini, etc has changed user expectations. In Solana, Base, and EVM ecosystems, AI agents can already **connect to wallets, submit transactions, conduct high\\-frequency DeFi operations, and execute stablecoin payments** in real time.\n\nCardano, despite its security and scientific rigor, currently lacks a production-ready interface layer that allows users to transact natively inside AI systems like ChatGPT, Claude or Gemini with $ADA, DeFi protocols or stablecoins such as $USDM.\n\nThis creates key blockers:\n\n- **No seamless way for popular AI platforms to access Cardano wallets\\.**\n- **No real\\-time, low\\-latency pathway** for high-frequency DeFi actions on Cardano.\n- **Cardano lacks integration with multi\\-billion\\-user AI platforms** which is hindering adoption and growth, particularly because other Top 10 chains have it already.\n- No on-chain Cardano tx from within popular AI apps\n\nCardano is falling behind in the single fastest-growing UX frontier.\n\n# Our Solution: Hydra x402 - Connect Cardano Wallets to AI Applications  (ChatGPT/Claude)\n\n\n**Hydra x402** is an open-source connector designed to bring **native Cardano wallet access and Hydra\\-accelerated payments** directly into AI platforms such as **ChatGPT** and **Claude**.\n\n\n\n![](https://ik.imagekit.io/rt68ucjjc/Sync/hudraa.png)\n\n![](https://ik.imagekit.io/rt68ucjjc/Sync/Frame%2032%20(1).png)\n\nUsers can enable it inside the AI interface just like any other plugin:\n\n**Settings → Connectors → Search “Hydra x402” → Enable → Connect Wallet**\n\nOnce activated, the connector allows AI applications to interact with a user’s Cardano wallet in a strictly controlled, non-custodial, and permission-based way. It focuses exclusively on simple payment operations, balance checks, and address generation, making it easy for everyday users to use ADA and USDM inside their AI workflows.\n\nBy placing Cardano inside ChatGPT and Claude, Hydra x402 brings the ecosystem into platforms that already have massive user bases. ChatGPT has **about 800 million weekly active users**, and **Claude has about 18\\.9 million monthly active users**. This exposes Cardano to one of the largest AI user populations in the world. As more users connect wallets through these platforms, Cardano benefits from increased transactions, more active addresses, and new use cases driven by AI-assisted payments, invoicing, micro-transactions, and business automation.\n\n# Core Capabilities\n**1\\. AI Wallet Connect**\n\nHydra x402 exposes a safe, minimal set of wallet actions to ChatGPT/Claude:\n\nView wallet balances (ADA, USDM, native assets)\n\n- Generate receive addresses\n- Prepare/send simple payments\n- Verify transaction history\n- Sign transactions with explicit user approval\n\nThis turns the AI interface into a **universal wallet dashboard**, while the user always retains control through standard CIP-30 signing flows.\n\n**2\\. USDM and DeFi Payment Rail for AI**\n\nHydra x402 introduces a **natural\\-language, AI\\-driven payment and DeFi execution rail for Cardano**, powered by **USDM** and the broader Cardano DeFi ecosystem. It allows ChatGPT, Claude, and other AI agents to interpret user intent and convert it into secure, signed blockchain transactions.\n\nUsers can issue commands such as:\n\n- **“Send 25 USDM to my business wallet\\.”**\n- **“Generate a USDM invoice for 45 USD\\.”**\n- **“Show all incoming USDM payments from this month\\.”**\n- **“Swap 100 ADA to USDM at the best available rate\\.”**\n\nHydra x402 translates natural language → builds a deterministic transaction → routes it through the user’s wallet for signing → and leverages Hydra for accelerated execution and settlement.\n\n**3\\. Hydra Fast\\-Path Payments**\n\nHydra x402 uses Hydra mini-ledgers to speed up specific operations such as rapid micro-payments\n\n- subscription-style recurring payments\n- small business invoicing\n- peer-to-peer transfers\n- high-frequency streaming payments\n- payroll batch issuance\n\nThis lets users (and businesses) experience **sub\\-second confirmations** when performing repeated small-value transactions.\n\n**4\\. The x402 API Standard**\n\n- **Open protocol for internet\\-native payments \\-** “x402 is an open protocol for internet-native payments… enables users to pay for resources via API without registration, emails, OAuth, or complex signatures.”\n- **Built around HTTP 402 Payment Required \\-** It revives the HTTP 402 status code so APIs/websites can demand payment before returning content.\n- **Chain\\-agnostic\\-** it is a chain-agnostic standard for payments on top of HTTP.\n- **No protocol\\-level fees \\-** The site explicitly says: “x402 as a protocol has 0 fees for either the customer or the merchant.”\n- **Designed for APIs, agents and AI clients**\n\nRead more: [https://www\\.x402\\.org/](https://www.x402.org/)\n\n# User Experience in ChatGPT or Claude\n1. Open **Settings → Connectors**\n2. Search “**Hydra x402**”\n3. Enable connector\n4. Connect any Cardano wallet:\n- Lace\n- Nami\n- Eternl\n- Begin\n\n5.Use natural language commands:\n\n- “What’s my ADA and USDM balance?”\n- “Receive address for my business wallet?”\n- “Send 10 USDM to this address.”\n- “Confirm if this payment arrived.”\n- “Pay 2 ADA via Hydra fast-path.”\n\nEverything is simple, secure, non-custodial, and user-approved.\n\n# **How it works**\n![](https://ik.imagekit.io/rt68ucjjc/Sync/diagram-export-11-25-2025-11_28_44-PM.png)\n\nHydra x402 is built as an MCP-based server connector that allows ChatGPT, Claude, and other LLM platforms to securely interact with Cardano wallets through a browser-embedded CIP-30 wallet-connect layer. The connector operates as a lightweight MCP service exposing a minimal, payment-focused command set: balance queries, address generation, payment construction, and transaction signing while the user’s browser wallet (Lace, Nami, Eternl, begin or hardware extensions) provides non-custodial CIP-30 signing.\n\nThe x402 engine converts each instruction from the AI into a properly structured Cardano transaction (built TX) ready for the user to sign. **Instead of passing every payment through base\\-layer settlement, the MCP can optionally route approved transactions through a Hydra fast\\-path channel\\.** In this model, Hydra serves as a **scalable, low\\-latency micro\\-ledger spun** up specifically to batch, process, or rapidly finalize repeated small-value payments. By using a Hydra head, payment flows achieve **near\\-instant** **confirmation** while minimizing on-chain load, making AI-initiated micro-transactions, recurrent transfers, or burst-payment workloads significantly more efficient.\n\nAll interactions are permissioned, deterministic, and protected by x402 safety schemas to prevent unauthorized actions, creating a secure and reliable bridge between AI applications and Cardano’s wallet and payment infrastructure.\n\n# Examples from other ecosystems:\n**Solana Labs ChatGPT Plugin** Official Solana Labs ChatGPT plugin that lets ChatGPT read wallet data and interact with the Solana network: [https://chatgpt\\.solanalabs\\.com](https://chatgpt.solanalabs.com) Solana Labs\n\n**ChatGPT Plugin \\(GitHub\\)** – Open-source ChatGPT plugin code for checking balances, viewing NFTs, and more on Solana: [https://github\\.com/solana\\-labs/chatgpt\\-plugin](https://github.com/solana-labs/chatgpt-plugin)\n\n**Solana GPT Connect** - [https://arena\\.colosseum\\.org/projects/explore/solana\\-chatgpt\\-kit](https://arena.colosseum.org/projects/explore/solana-chatgpt-kit)\n\n**Coinbase Payments MCP \\(Base / EVM\\)** – Wallet + onramp + x402 payments MCP that lets AI chat agents (Claude, Gemini, ChatGPT via MCP) hold wallets and send stablecoin payments over Base: [https://docs\\.cdp\\.coinbase\\.com/payments\\-mcp/welcome](https://docs.cdp.coinbase.com/payments-mcp/welcome)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Hydra x402 gives Cardano a direct presence inside leading AI platforms such as ChatGPT and Claude by enabling native wallet connectivity and simple USDM and ADA payments through natural language. This allows Cardano users to access their wallets, send or receive payments, and create invoices inside the tools they already use every day. It also makes Cardano usable for small businesses, freelancers, and developers who want fast and low-cost payment flows powered by Hydra.\n\n\n\n**How this benefits the Cardano community**\n\n\n\n• Increases real utility for ADA and USDM.\n\n• Creates the first AI wallet bridge for Cardano.\n\n• Demonstrates practical use of Hydra for fast payments.\n\n• Helps bring new users into the ecosystem through familiar AI interfaces.\n\n\n\n**How we will measure impact**\n\n\n\n• Number of users who enable the Hydra x402 connector.\n\n• Number of wallets connected through CIP-30.\n\n• Count and volume of USDM and ADA payments initiated through the connector.\n\n• Feedback collected from users, developers, and small businesses.\n\n\n\n**How we will share outputs**\n\n\n\nWe will publish everything open source, provide public documentation, share guides with the community, run demos in Cardano spaces, and make the connector simple for any team to adopt or extend.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Proven Track Record**:Our team has deployed blockchain solutions that required meticulous planning and robust technical implementation, recognized for their innovation and impact. Our previous Projects can be found at [https://www\\.nucast\\.io/](https://www.nucast.io/)\n\n\n\n**Development Team**: Our developers have extensive experience in blockchain development, particularly on the Cardano platform. They have contributed to successful Cardano-based projects and are proficient in cardano dapp development.\n\n\n\n**Strong Partnerships**: We have established relationships with key platform operators, service providers, developers, ensuring the solution is well-positioned for adoption and scalability.\n\n\n\n**Community Engagement**: Our team actively contributes to the Cardano community, demonstrating our commitment to the ecosystem’s growth and values.\n\n\n\n**Budgeting and Financial Reporting**: We will maintain a transparent budget and provide for the community according to the catalyst guidelines. Regular updates on our progress, challenges, and milestones will be shared with the Cardano community via forums and social media. We will actively seek and incorporate community feedback.\n\n\n\nWe will validate our approach through Hydra-enabled testnet deployments, building on our proven experience with Hydra-based subscriptions and a successfully implemented pay-as-you-go SDK.\n\n\n\nTo ensure trust and accountability, we operate with open-source transparency. All code, smart contracts, and documentation will be released under the MIT License and made publicly available for community review. Development progress will be shared via GitHub, with detailed milestones and deliverables tracked in real time.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Kickoff and SRS ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"This milestone establishes the foundation for Hydra x402 by completing all initial setup work, aligning the team, and preparing the full project specification. We will create the GitHub repository, initial folder structure, planning documents, and a comprehensive SRS defining the MCP connector, CIP-30 integration, and Hydra fast-path flows.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The internal team reviews and approves the SRS, ensuring it accurately captures the project goals, technical approach, functional requirements, and constraints. The repository must be created with an organized structure, containing planning documents and the finalized SRS. The system must be ready for architecture design.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A public GitHub repository will contain the completed SRS in PDF format, along with the initial project structure and planning documentation. Anyone in the community can verify the presence of the SRS, repository organization, and readiness for further development.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"High-Level Architecture and Component Design","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will deliver all high-level technical designs required for Hydra x402 to function reliably and scale. This includes component diagrams, data flow diagrams, integration points between MCP, CIP-30, x402 transaction builder, and Hydra heads. The architecture will form a complete blueprint for developers during implementation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All diagrams and documents must define system modules, communication flows, transaction lifecycles, and Hydra fast-path behavior. The team must validate that the design is technically feasible and that it supports clean integration with AI apps. Documentation must be uploaded to the repository in a structured format.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A dedicated GitHub folder will contain all finalized architecture diagrams, component documents, and supporting materials. Community members will be able to review the architecture and understand how each part of Hydra x402 will be built and integrated.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"MCP Connector Development and Testing (Hydra x402 Prototype)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will develop the functional Hydra x402 MCP connector, including the payment command set, transaction builder, CIP-30 wallet-connect flow, and optional Hydra fast-path routing. A working prototype will be deployed on testnet to validate end-to-end operations from AI instruction to final transaction settlement.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The prototype must run successfully on the Cardano testnet and demonstrate wallet connection, transaction construction, and Hydra-enabled rapid settlement. Basic automated test scripts and a readable setup guide must be included. All features must pass internal testing for reliability and correctness.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Evidence will include testnet transaction links, GitHub commits showing implemented modules, testing scripts, and a recorded demo video. The video will show the connector interacting with a wallet and performing payments through x402 and Hydra, ensuring transparent verification.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":38000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Documentation, Publication, and Project Close-Out","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"We will complete all final deliverables required for a clean and transparent close-out. This includes a comprehensive final report that explains the full development process, results, and recommendations. A summary video will be produced to help the community understand how Hydra x402 works and how to use the connector.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The final report must be published as a public PDF and include technical explanations, design decisions, limitations, and next steps. A clear summary video must be shared on public channels. Documentation, guides, and usage instructions must be fully updated in the repository for community access.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"The evidence will consist of links to the final PDF report, the public summary video, and updated GitHub documentation. Community members will be able to review the full project history and outputs, ensuring transparency and accountability.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":32000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Sricharan Ganta, CEO** @ Nucast - [https://www\\.linkedin\\.com/in/sricharangm](https://www.linkedin.com/in/sricharangm) , [https://x\\.com/Charanz1309](https://x.com/Charanz1309)\n\nSricharan is a entrepreneur and business development strategist with over eight years of experience in business-driven roles and over four years of experience in the web3 domain. He has a successful track record of delivering innovative products on the Cardano Blockchain. As the CEO of Nucast, Charan is extremely passionate about community building and pioneering solutions. He currently leads a dynamic team of 15+ professionals at Nucast Labs. Additionally, he holds a Masters in Computer Science from the University of Central Missouri, USA.\n\n**Sam Jeffrey M, CTO** @ Nucast - [https://x\\.com/samjefree](https://x.com/samjefree)\n\nBuilding tech on Cardano for 5+ years. Worked as Plutus Consultant at Gimbalabs. Awarded the Presidential Award for Innovation 2021 by the Government of India.\n\n**Nucast Labs** ([https://www\\.nucast\\.io/](https://www.nucast.io/) , [https://labs\\.nucast\\.io/](https://labs.nucast.io/) ) : Successfully built various scalable Cardano dapps. Nucast is proud to host a highly skilled and experienced development team of 15+ members with over 30 years of combined industry experience.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Milestone 1: Project Kickoff and SRS**\n\nTotal: 30,000 ADA\n\nProject Manager: 8,000 ADA\n\nSenior Cardano Developer: 15,000 ADA\n\nOperational &amp; Research Costs: 7,000 ADA\n\nThis milestone covers initial planning, drafting of the Software Requirements Specification (SRS), repository setup, technical scoping, and coordination required to establish a solid foundation for the project.\n\n**Milestone 2: High\\-Level Architecture and Component Design**\n\nTotal: 30,000 ADA\n\nProject Manager: 5,000 ADA\n\nSenior Cardano Developer: 18,000 ADA\n\nJunior Cardano Developer: 7,000 ADA\n\nThis includes development of all high-level system architecture diagrams, component designs, Hydra integration flows, and planning for wallet and MCP connection layers.\n\n**Milestone 3: MCP Connector Development and Testing \\(Hydra x402 Prototype\\)**\n\nTotal: 38,000 ADA\n\nProject Manager: 8,000 ADA\n\nSenior Cardano Developer: 20,000 ADA\n\nJunior Cardano Developer: 10,000 ADA\n\nThis milestone funds the core development of the Hydra x402 prototype, including the MCP connector, wallet integration, transaction builder logic, Hydra execution, testing, debugging, and deployment of a public demo on testnet.\n\n**Milestone 4: Final Documentation, Publication, and Project Close\\-Out**\n\nTotal: 32,000 ADA\n\nProject Manager: 7,000 ADA\n\nSenior Cardano Developer: 25,000 ADA\n\nThis covers final reporting, documentation, user guides, developer materials, community updates, video summarization, and preparing the repository for long-term use and transparency.\n\nTotal Budget: 130,000 ADA","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Hydra x402 delivers strong value for the Cardano ecosystem because it creates the first direct bridge between Cardano wallets and major AI platforms such as ChatGPT and Claude. This unlocks a completely new category of users and transactions that are not reachable through existing tools. By enabling simple, natural-language USDM and ADA payments, the project increases real transaction activity, expands wallet usage, and supports the adoption of Cardano’s stablecoin infrastructure.\n\n\n\nThe budget is focused entirely on development, testing, documentation, and delivery of open-source code. Each milestone corresponds to real engineering work that is required to build MCP connectivity, CIP-30 wallet integration, the x402 transaction layer, and the Hydra fast-path. The requested costs are proportional to typical blockchain development rates and are aligned with the scale of the technical components involved.\n\n\n\nThe connector creates long-term value because it enables new use cases such as AI-supported payments, invoicing, micro-transactions, automated business flows, and faster Hydra-backed settlement. As more users connect their wallets inside AI assistants, Cardano gains more active addresses, more transactions, and more visibility across the AI ecosystem. All results, code, and documentation will be fully open source, allowing any developer or project to reuse and extend the work at no additional cost to the community.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400081","sub_fields":null},{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400082","sub_fields":null},{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400070","sub_fields":null},{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400010","sub_fields":null},{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400087","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"AI","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1778}