{"pr_id":"019aab3e-17d5-71f6-9383-0df16be9ed02","title":"Cardinex: ZK-Private Cardiology AI","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"High-quality cardiology data is essential for medical AI, yet hospitals cannot contribute it without risking patient privacy. This barrier slows innovation and blocks detection accuracy breakthroughs.","solution":"Cardinex allows hospitals to contribute privacy-preserving heart data for AI training using Cardano zero-knowledge proofs. This boosts accuracy and opens a major new market for blockchain adoption.","proposer_name":"Sapient Predictive Analytics Pte Ltd","proposer_relevant_experience":"Thomas Wedler: project management and trading-related content\n\nExperienced financial trader and entrepreneur. Ex Shell, Vattenfall, Masefield senior futures and options trader. Individual floor trader at Singapore Exchange. Tom has been building and deploying programs for automated market making and energy derivatives since 2014. 15 years Derivatives experience at multi-national organizations working closely with industry bodies and speaker at market conferences and workshops. Involved in crypto trading since 2014 and DeFi/oracles since 2018. Plutus Pioneer, Marlowe Pioneer and Atala Prism Pioneer.\n\nThomas is a certified Superforecaster with the Good Judgment Project and winner of the inaugural Hybrid Forecasting Challenge at SAGE / University of Southern California.\n\n[https://www\\.linkedin\\.com/in/thomas\\-wedler\\-18960/](https://www.linkedin.com/in/thomas-wedler-18960/)\n\nRole in Catalyst: Challenge Team (Fund 8-10), Sub-circle3, Catalyst Coordinators (funded proposers), Veteran Proposal Assessor, Reviewer in funded project milestone reporting Fund 10 - 14.\n\nJune Akra: project management and risk-management related content, community\n\nSapient developer team: to provide UI front-end and API for the portal\n\nFounding member of BlockCarbon, financial market expert and academic with vast experience in risk management, derivatives and commodities. Experience for various risk functions in 2 billion dollar AUM fund. Holder of Master degree in Investment with distinction and awarded Draper Prize. Certified Quantitative Finance (CQF) alumni London. Experienced video editor, content creator with combined 50,000 followers on social media, NFT collector and creator. Certified python AI practitioner, Plutus Pioneer &amp; Atala Prism Pioneer.\n\n[https://www\\.linkedin\\.com/in/june\\-a\\-a3a0b4174](https://www.linkedin.com/in/june-a-a3a0b4174)\n\nRole in Catalyst: Challenge Team (Fund 7-10), Sub-circle3, Catalyst Coordinators (funded proposers), Veteran Proposal Assessor, Reviewer in funded project milestone reporting (PoA pilot) Fund 9 - 14.\n\nSapient team members upon demand:\n\nData scientist, Senior fullstack developer / head architect, LLM engineer, data engineer\n\n[https://www\\.18hall\\.com/sapient\\-predictive\\-analytics/](https://www.18hall.com/sapient-predictive-analytics/)","url":null,"funds":164500,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Cardinex: ZK-Private Cardiology AI","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Sapient Predictive Analytics Pte Ltd","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":164500,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":10,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"High-quality cardiology data is essential for medical AI, yet hospitals cannot contribute it without risking patient privacy. This barrier slows innovation and blocks detection accuracy breakthroughs.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Cardinex allows hospitals to contribute privacy-preserving heart data for AI training using Cardano zero-knowledge proofs. This boosts accuracy and opens a major new market for blockchain adoption.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://www.sapientswarm.com","https://github.com/Sapient-Predictive-Analytics/cardinex","https://drive.google.com/file/d/1M41OUwdIUS2rVMj35VSsp3PLYQVRuR-e/view?usp=sharing","https://github.com/Sapient-Predictive-Analytics/cardinex/blob/main/INTEGRATION.md"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Code will be fully open source (MIT License). Non-software material ranging from datasets to videos will be under a Create Commons license.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Privacy","group":"Identity & Security"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Cardinex introduces a new model for medical AI collaboration: clinics keep cardiac data entirely local, whether ECG, PPG, MRI, or echo, while Cardano verifies dataset quality, consent, and integrity through zero-knowledge proofs. Instead of anonymising and exporting patient data, we enable AI analysis on encrypted datasets with provable lineage. This creates a privacy-first approach not available in current cardiology AI or blockchain health solutions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Our MVP demonstrates the full workflow of privacy-enhanced AI training with medical datasets: local cardiology data processing, ZK proof generation, smart contract-based verification on Cardano testnet (likely Preprod), and controlled access for encrypted AI analysis. It includes an appealing, clinic-friendly frontend for providers, a proof-service backend, and a smart-contract-based dataset registry. The prototype will be publicly accessible on MIT License via a hosted demo environment and an open GitHub repository containing reproducible testnet transactions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Success is measured through verifiable on-chain actions: number of registered cardiac datasets, volume of ZK-verified submissions, successful testnet transactions such as transfers or purchases of anonymised datasets or access tokens, and the continuity of datasets through the validation process. Off-chain metrics include proof generation reliability, clinic partner engagement, and benchmark accuracy of AI analyses run on encrypted data. For full KPI metrics see also the Impact section.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Cardiology AI relies on rich ECG and PPG datasets, but hospitals face a crucial limitation: sharing physiological data often means exposing patient identities or sensitive clinical histories. Even with anonymisation, health providers remain concerned about regulatory risk, cross-border compliance, and the permanent nature of digital data leakage. This prevents clinics from contributing to shared datasets, and locks advanced AI models away from the medical teams that need them most.\n\n.\n\nCardinex addresses this barrier by introducing a privacy-preserving AI layer built on Cardano. The core idea is simple: clinics retain full control of their raw ECG/PPG data, while zero-knowledge proofs (ZKPs) allow external parties to verify dataset quality, consent, and integrity without ever seeing patient identities. At the same time, Sapient’s proprietary cardiology AI can analyse encrypted data, opening a path to collaborative diagnostic research that previously required trust or disclosure.\n\n.\n\nAt the heart of Cardinex is a prototype built using modern ZK proof systems and Cardano’s extended UTxO architecture. Clinics prepare ECG/PPG data locally, convert signals into secure commitments, and generate proofs that the dataset meets required criteria such as the presence of specific demographic distributions, signal quality benchmarks, or clinical flags like arrhythmia and hypertension indicators. These proofs can be cryptographically verified on Cardano without revealing anything about individual patients.\n\n![](https://raw.githubusercontent.com/Sapient-Predictive-Analytics/cardinex/main/media/cardinexFlow.png)\n\n.\n\nFrom the clinic’s perspective, the workflow remains straightforward. Records remain in internal storage. A small, local application performs signal preprocessing, produces metadata summaries, and runs a ZK proof generator. Only the proof and non-identifying hashes are submitted to Cardano. There is no transfer of raw signals and no point where patient identity becomes visible to external researchers or buyers. For AI researchers, Cardinex provides the opposite half of the puzzle: access to data that is mathematically guaranteed to meet certain criteria. Researchers can browse dataset summaries on-chain-compiled from cryptographically verified metadata, knowing that each item has passed strict private validation checks. Once purchased, decryption keys or access tokens can be released through an off-chain workflow tied to the on-chain transaction, enabling secure retrieval of anonymised ECG/PPG bundles that meet the verified criteria.\n\nSapient's Cardinex prototype will enable trusted marketplaces where each party participates without compromising the other, starting with our own clinic collaborations and Sapient being the buyer of datasets.\n\n![](https://raw.githubusercontent.com/Sapient-Predictive-Analytics/cardinex/main/media/ECG_class.jpg)\n\n_Open source datasets exists, but their frequent use introduce bias and more independent data is needed to improve algorithm accuracy\\. The major obstacle to this is privacy risk\\._\n\n.\n\nWhether the data comes from ECG, PPG, echocardiography, or cardiac MRI, even the smallest leak of metadata or imaging markers carries regulatory and reputational risks. This challenge is visible in the global research landscape. Initiatives such as PhysioNet (MIT-BIH) or the Cardiac Atlas Project aggregate datasets from multiple centres, including MRI studies, consensus contour datasets, congenital heart disease cohorts, paired 3D echo scans, and multi-ethnic cohorts with thousands of subjects. As more and more AIs are trained on these easily available datasets, bias is introduced making models less useful when moving on from training data.\n\n.\n\nCardinex creates a trusted marketplace where each party participates without compromising the other:\n\n• Clinics retain custody of their raw data and comply with local regulations.\n\n• Researchers gain reliable, structured cardiology datasets with verified provenance.\n\n• Patients never have their identity exposed.\n\n• Cardano becomes the privacy-assurance layer for cross-clinic medical AI collaboration.\n\nTechnically, Cardinex makes use of Aiken-based smart contracts on Cardano for dataset registration, proof verification, and payment interaction. These contracts interact with off-chain ZK components capable of expressing constraints such as\n\n• demographic category validation,\n\n• consent validity checks,\n\n• dataset size thresholds,\n\n• verification that metadata summaries accurately represent the underlying encrypted records,\n\n• lineage and integrity checks for auditability.\n\n.\n\nThis separation of concerns regarding proof generation off-chain, verification on-chain plays to Cardano’s strengths and keeps the system efficient even with modest transaction volumes.\n\nFor developers and ecosystem builders, Cardinex offers a reusable blueprint: a lightweight ZK integration architecture using Cardano for provenance, access control, and settlement. For Cardano itself, this demonstrates a high-value enterprise use case in regulated healthcare, showcasing how zero-knowledge proofs can enable new categories of dApps beyond DeFi and NFTs.\n\nSapient Predictive Analytics brings extensive experience in AI and data science, allowing the consortium to focus the Catalyst-funded effort on the **privacy infrastructure**, ZK circuits, and Cardano integration, while leveraging our existing cardiology AI models for realistic prototyping. The result is a credible pathway toward real adoption: clinics can finally collaborate on stronger AI without exposing sensitive patient data, and Cardano becomes the network that guarantees privacy, consent, and integrity across borders.\n\n.\n\nCardinex aims to deliver a working prototype demonstrating the full workflow from clinic data preparation to proof generation, on-chain verification, and controlled AI analysis access. This grant will enable the research, engineering, and ecosystem integration needed to validate the model and prepare for real-world deployment with partner clinics.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**Impact**\n\nCardinex delivers direct, long-term value to the broader Cardano community by positioning the ecosystem at the forefront of a rapidly expanding field: privacy-preserving medical AI. Healthcare data is one of the highest-value, most heavily regulated data types in the world. A blockchain that can guarantee patient anonymity, validate data integrity, and confirm clinical consent without revealing identities stands to unlock entire categories of enterprise adoption. Zero-knowledge proofs (ZKPs) provide exactly this capability, and Cardano’s extended-UTxO model is particularly well suited for verifiable, deterministic workflows. Cardinex demonstrates this advantage through a concrete, real-world use case: cross-clinic cardiology AI collaboration where privacy is not optional but a regulatory core requirement.\n\nOur work showcases how Cardano can function as a neutral verification and coordination layer for encrypted datasets. Clinics retain custody of raw ECG/PPG, MRI, or 3D echo data, while the chain only verifies proofs of dataset usefulness, consent, lineage, and integrity.\n\n.\n\nThis creates a pathway for medical institutions, research networks, and AI teams to collaborate without the exposure risks that normally block such partnerships. This promises to further boost the rapid advancements of AI in medical settings, with Cardano blockchain adoption part of the solution. Privacy-first applications are increasingly in demand across Asia-Pacific and globally, and Cardinex helps position Cardano as a natural choice for regulated industries seeking mathematically enforced confidentiality rather than trust-based systems.\n\n![](https://raw.githubusercontent.com/Sapient-Predictive-Analytics/cardinex/main/media/ai_echo.jpeg)\n\n_Example of a totally AI driven echocardiography workflow\\. The AI did all the work on this screen, taking a 3D echo exam and automatically segmenting the anatomy, contoured all the chambers, found the ideal views to display and then calculated all the measurements in seconds\\._\n\n.\n\nThe project also aligns with the upcoming Midnight Network, Cardano’s data-protection partner chain. Midnight’s focus on confidential smart contracts, selective disclosure, and regulated data handling pairs naturally with our architecture. By building now on Cardano with ZK verification, Cardinex becomes a strong candidate for future cross-chain deployments where Midnight handles confidential privacy logic and Cardano manages settlement, aggregation, and token-based access. This modularity and open source expansion strengthens both ecosystems and showcases Cardano’s multi-chain design in a real medical context.\n\n.\n\nFor builders, Cardinex provides a reusable technical pattern: a lightweight ZK pipeline for off-chain proof generation and on-chain verification using Aiken smart contracts. Developers can repurpose this framework for other high-sensitivity domains such as genomics, clinical trials, insurance, credential verification, and confidential enterprise analytics. As zero-knowledge demand accelerates across the blockchain space, Cardinex gives Cardano a production-ready exemplar that demonstrates both feasibility and competitive differentiation.\n\n.\n\nSapient brings additional impact through its background in financial machine-learning research, particularly ensemble forecasting and decision-support systems. Our team builds algorithms that individually match or slightly exceed human performance but, when combined via ensemble logic inspired by the Condorcet Jury Theorem and “wisdom-of-crowds” models, deliver significantly stronger results. Because these algorithms are modular and domain-agnostic, they can be safely contributed as open-source components to uplift the entire Cardano AI ecosystem. Any team building predictive tools for medical, financial, or other applications, can integrate them to achieve more stable and more accurate predictive signals.\n\n.\n\nCardinex also aligns with broader ecosystem momentum. Charles Hoskinson has publicly highlighted healthcare as a strategic frontier, investing in medical centers and advocating for patient-controlled privacy solutions. Intersect and IOG have both expressed interest in ZK-enhanced governance, regulated data, and verifiable computation. This project speaks directly to those priorities, offering a practical, clinically relevant demonstration of what ZK-enabled Cardano applications can achieve today.\n\n.\n\nBy delivering a working prototype on testnet, Cardinex provides immediate utility, advances Cardano's reputation in high-value enterprise sectors, and establishes a privacy architecture that other teams can adopt. It directly contributes to Cardano’s long-term vision of enabling secure, equitable data exchange in critical industries and positions the ecosystem as a leader in zero-knowledge healthcare innovation.\n\n.\n\n**Key Performance Indicators \\(KPIs\\)**\n\n1. ZK Proof Reliability – 95%+ successful proof generation in prototype. Our goal is that ≥95% of ECG/PPG or imaging-based datasets submitted through the proof-service generate valid ZK proofs without manual intervention. This demonstrates technical robustness and real deployability in clinical settings.\n2. On-Chain Verification Success – ≥90% of submitted proofs verified on testnet. We target at least 90% of proof submissions being successfully validated by the Aiken smart contract on Cardano testnet. This measures system stability, contract correctness, and alignment with eUTxO constraints.\n3. Dataset Registrations – 20–40 verified dataset entries. A realistic target for a research-focused prototype is 20–40 dataset registrations (e.g., ECG segments, MRI-derived metadata bundles, or echo feature summaries) submitted across internal testing and early collaborator clinics.\n4. Marketplace Interaction – 50–100 testnet transactions. We aim to generate 50–100 total testnet transactions demonstrating the full workflow: dataset registration, metadata retrieval, access-purchase flow, and decryption key delivery. This ensures the solution is benchmarked end-to-end.\n5. AI Performance Benchmark – ≥5% improvement via ensemble comparison. Using anonymised test datasets, Sapient’s AI should demonstrate at least a 5% measurable performance increase (e.g., F1-score, AUROC) when integrating ensemble techniques over baseline single-model performance—showcasing real AI uplift relevant to cardiology.\n6. Latency Benchmark – ZK proof generation under 30 seconds (avg). On a modern workstation, the prototype should complete proof generation in &lt;30 seconds on average for individual dataset summaries. This sets a viable performance baseline for clinical use.\n7. External Developer Adoption – at least 3 ecosystem teams test the repo. We target 3 external Cardano dev teams (wallets, ZK teams, medical-data builders, or Midnight-aligned projects) to pull, review, or test the open-source repo. This ensures cross-team engagement and helps Cardano’s ZK ecosystem grow.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Sapient Predictive Analytics enters this project with a proven foundation in AI research, Cardano development, and the disciplined execution of complex Catalyst-funded deliverables. Our team brings the combination of technical depth, clinical data understanding, and cryptographic integration required to deliver a high-trust, privacy-preserving medical AI prototype.\n\n.\n\nSapient have previously collaborated with cardiology labs in the US, Singapore, and Korea to strengthen AI prediction performance using ensemble methods that consistently outperform baseline clinical and LLM-based benchmarks. We are also in ongoing discussions with AI Singapore and with a major hospital in Singapore (name withheld for confidentiality at this stage) to co-create and validate this prototype. These combined experiences demonstrate that privacy-preserving model fusion, enabled through zero-knowledge techniques, can unlock meaningful clinical collaboration without ever exposing sensitive medical data. This approach offers clear commercial potential and the ability to deliver measurable, life-saving impact in real healthcare environments.\n\n.\n\n**Demonstrated Delivery in Cardano AI &amp; Data Engineering**\n\nSapient has successfully completed multiple Catalyst-funded AI projects, delivering Cardano-native machine learning systems, inference models, and data-driven tooling. These projects have already passed milestone review, proving our ability to design, implement, and ship highly specialized AI solutions within the Cardano ecosystem. Our track record ensures that Cardinex benefits from the same rigor, documentation quality, and reproducible engineering standards.\n\nWe successfully completed projects ([https://milestones\\.projectcatalyst\\.io/projects/1100277](https://milestones.projectcatalyst.io/projects/1100277) and [https://milestones\\.projectcatalyst\\.io/projects/1100299\\)](https://milestones.projectcatalyst.io/projects/1100299) which proves our capability to deliver specialized AI solutions for the Cardano ecosystem. We developed Catalyst-specific language models and comprehensive data analysis platforms, demonstrating exactly the kind of machine learning expertise required for cybersecurity threat detection and behavioral analytics.\n\n.\n\n**Deep Expertise in Ensemble ML and High\\-Stakes Prediction**\n\nOur team originates from financial machine-learning research, where modelling environments require precision, reliability, and statistical discipline. We specialize in combining independent algorithms into ensemble architectures, drawing from principles like collective intelligence, ensembles methods and wisdom-of-crowds models, to achieve significantly higher predictive power than any single method. This approach makes our proprietary ensemble components ideal for open-source contributions: each module can independently improve external models, benefitting the wider Cardano AI community without reliance on monolithic pipelines.\n\n![](https://raw.githubusercontent.com/Sapient-Predictive-Analytics/cardinex/main/media/Interface.jpg)\n\n.\n\n**Clinical AI Alignment and Structured Data Handling Capability**\n\nThe Cardinex prototype is grounded in modalities used across cardiology (ECG, PPG, cardiac MRI, 3D echo), and derived clinical measurements. With access to structured datasets such as those from the Cardiac Atlas Project we can benchmark anonymisation fidelity, metadata extraction, and ZK-validatable summaries against known research standards. Our existing medical-signal preprocessing experience ensures we can generate clinically meaningful features before encryption, enabling realistic testing of the full pipeline.\n\n.\n\n**Zero\\-Knowledge Proof Integration with Cardano**\n\nOur prototype leverages emerging ZK proof tooling, designed for off-chain proof generation and on-chain verification via Aiken smart contracts. Rather than promising speculative technology, we are building on established workflows already demonstrated in the ecosystem: deterministic verification, structured public inputs, and well-defined proof boundaries. This modular architecture ensures feasibility while enabling future cross-pollination with Cardano’s confidential-computation sibling chain, the Midnight Network. Cardinex is intentionally designed to bridge this transition: off-chain circuits remain stable, while verification logic can migrate from Cardano L1 to Midnight once its privacy layer matures.\n\n.\n\n**High Accountability Through Open Source and Public Testnet Deployment**\n\nAll prototype components: ZK circuits, Aiken validators, backend proof service, and frontend interface will be open-sourced under the MIT License. The system will be deployed to a public Cardano testnet for transparent inspection by developers, auditors, researchers, and community members. This ensures accountability, fosters ecosystem reuse, and allows third-party teams to validate key assumptions about performance, reliability, and privacy guarantees.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Clinical Data Workflow, Privacy Architecture & Initial ZK Pipeline Specification","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Open-source repository with Cardinex project overview, dataflow diagrams, and initial privacy architecture.\n2. Defined clinical workflow for ECG/PPG and imaging modalities (MRI/echo) with structured metadata extraction requirements.\n3. Zero-knowledge validation framework specification (circuit constraints, public/private inputs, verification boundaries).\n4. Prototype preprocessing scripts for anonymised metadata extraction.Draft Aiken smart-contract interface for dataset registration and verification logic.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Repository contains clear documentation describing how clinical datasets will be processed, committed, and validated.\n2. ZK pipeline specification outlines core constraints without binding the project to a single proving system.\n3. Preprocessing scripts successfully generate example metadata commitments using public cardiac datasets.\n4. Contract interfaces provide enough structure for future implementation and testnet deployment.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Public GitHub repository URL with architecture docs, workflow diagrams, and preprocessing code.\n2. Example metadata commitments and anonymised dataset summaries.\n3. Short video walkthrough of repository structure and design rationale.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":49350,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"ZK Circuit Prototype, Proof-Service Backend & Metadata Validation Logic","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Prototype ZK circuit implementing core checks: demographic bins, dataset size minima, structural metadata validation.\n2. Proof-service backend capable of running the circuit, generating proofs, and preparing public inputs.\n3. Test harness for validating correctness using sample ECG/PPG or MRI datasets.\n4. Modular design allowing substitution of ZK frameworks (Halo2, Noir) without altering external interface.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Circuit prototype generates valid proofs for test datasets with ≥90% success rate.\n2. Backend exposes proof generation as a reproducible API endpoint.\n3. Public inputs match the structure defined in Milestone 1.\n4. Test harness demonstrates proof stability under multiple dataset configurations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Public repository update containing the circuit folder, backend code, and test harness.\n2. CLI or API demonstration showing proof generation and validation workflow.\n3. Video demonstration explaining circuit logic and proof-service operation.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":32900,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"50 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Smart Contracts, Testnet Deployment & On-Chain Verification","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Smart contracts for dataset registration, ZK verification, and controlled access logic.\n2. Integration layer bridging the proof-service outputs with testnet submission scripts.\n3. PreProd testnet deployment of the dataset registry contract.\n4. Reference transaction set demonstrating dataset submission, proof verification, and state continuity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Contract(s) compiles successfully and verifies submitted proofs on testnet\n2. End-to-end transaction flow shows registration UTxO creation, proof validation, and consistent on-chain metadata.\n3. Documentation explains how developers can reproduce the testnet process locally.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Public PreProd deployment addresses and example transaction URLs.\n2. Updated GitHub documentation covering contract usage and verification logic.\n3. Video demonstration of testnet validation transactions and contract walkthrough.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":24675,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Frontend Integration, Encrypted Access Workflow & AI Benchmarking","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Minimal frontend enabling dataset submission, proof generation requests, and browsing of verified dataset summaries.\n2. Encrypted access workflow triggered by successful testnet purchase transaction.\n3. Benchmark evaluation of Sapient’s cardiology AI on anonymised datasets, demonstrating expected ensemble uplift.\n4. Public API endpoints enabling external developers to interact with the prototype.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Frontend can submit at least five datasets end-to-end into the testnet pipeline.\n2. Access workflow securely delivers encrypted bundles or keys following on-chain purchase events.\n3. AI benchmark demonstrates ≥5% improvement via ensemble comparison on anonymised test datasets.\n4. API documentation is clear, versioned, and reproducible.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Public demo environment URL and GitHub frontend repository.\n2. Benchmark charts, summary metrics, and anonymised example outputs.\n3. Video showing full user flow from dataset submission to encrypted access and AI analysis.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":24675,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Milestone: Public Launch, Documentation Finalisation & Close-out Report/Video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Public prototype launch on Cardano testnet, with social media posts for visibility.\n2. Final technical documentation: architecture, ZK pipeline, API reference, and reproducibility guide.\n3. Public Project Close-out Report.\n4. Public Close-out Video.\n5. Developers package: integration guides and contract examples.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Prototype accessible publicly with stable testnet endpoints and clear usage instructions.\n2. Documentation provides enough detail for external developers to fork and extend the system.\n3. Close-out Report summarises achievements, metrics, risks, and future roadmap.\n4. Close-out Video presents functionality, lessons learned, and next steps.\n5. Technical documentation and developers package are open source and suitable for other projects to collaborate on Cardinex.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Link to the project's public repository.\n2. Link to social media visibility posts of the launch.\n3. Published Close-out Report (PDF or markdown) and Close-out Video link.\n4. Public announcement post summarising the Cardinex prototype launch.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":10,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":32900,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Thomas Wedler: project management and trading-related content\n\nExperienced financial trader and entrepreneur. Ex Shell, Vattenfall, Masefield senior futures and options trader. Individual floor trader at Singapore Exchange. Tom has been building and deploying programs for automated market making and energy derivatives since 2014. 15 years Derivatives experience at multi-national organizations working closely with industry bodies and speaker at market conferences and workshops. Involved in crypto trading since 2014 and DeFi/oracles since 2018. Plutus Pioneer, Marlowe Pioneer and Atala Prism Pioneer.\n\nThomas is a certified Superforecaster with the Good Judgment Project and winner of the inaugural Hybrid Forecasting Challenge at SAGE / University of Southern California.\n\n[https://www\\.linkedin\\.com/in/thomas\\-wedler\\-18960/](https://www.linkedin.com/in/thomas-wedler-18960/)\n\nRole in Catalyst: Challenge Team (Fund 8-10), Sub-circle3, Catalyst Coordinators (funded proposers), Veteran Proposal Assessor, Reviewer in funded project milestone reporting Fund 10 - 14.\n\nJune Akra: project management and risk-management related content, community\n\nSapient developer team: to provide UI front-end and API for the portal\n\nFounding member of BlockCarbon, financial market expert and academic with vast experience in risk management, derivatives and commodities. Experience for various risk functions in 2 billion dollar AUM fund. Holder of Master degree in Investment with distinction and awarded Draper Prize. Certified Quantitative Finance (CQF) alumni London. Experienced video editor, content creator with combined 50,000 followers on social media, NFT collector and creator. Certified python AI practitioner, Plutus Pioneer &amp; Atala Prism Pioneer.\n\n[https://www\\.linkedin\\.com/in/june\\-a\\-a3a0b4174](https://www.linkedin.com/in/june-a-a3a0b4174)\n\nRole in Catalyst: Challenge Team (Fund 7-10), Sub-circle3, Catalyst Coordinators (funded proposers), Veteran Proposal Assessor, Reviewer in funded project milestone reporting (PoA pilot) Fund 9 - 14.\n\nSapient team members upon demand:\n\nData scientist, Senior fullstack developer / head architect, LLM engineer, data engineer\n\n[https://www\\.18hall\\.com/sapient\\-predictive\\-analytics/](https://www.18hall.com/sapient-predictive-analytics/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Cardinex – Budget Breakdown \\(Total: 164,500 ADA over 10 months\\)**\n\nThis budget reflects realistic market-rate compensation for AI, blockchain, ZK, and clinical-data engineering work. Costs include internal staff, external specialists, infrastructure, documentation, and closeout deliverables.\n\n.\n\n**Core AI &amp; Blockchain/ZKP Development – 65,000 ADA \\(40%\\)**\n\nTotal Hours: 400 hours\n\nAI Research &amp; Model Integration – 90 hours (13,500 ADA)\n\nCardiology feature pipelines, encrypted model adaptation, ensemble benchmarking.\n\nZero-Knowledge Circuit Design – 70 hours (12,250 ADA)\n\nConstraint systems for consent verification, dataset hashing, metadata integrity.\n\nProof-Service Engineering – 80 hours (12,000 ADA)\n\nProver backend, circuit execution API, reproducible witness generation.\n\nBlockchain Smart Contract Development – 60 hours (9,000 ADA)\n\nDApp pipelining, API structure and integration of AI/ZKP parts - 75 hours (11,000 ADA)\n\nAiken validator logic, dataset registry, proof verification, testnet integration.\n\nSmart contract Review – 25 hours (7,250 ADA)\n\nExternal dev reviewing ZK correctness and privacy model.\n\n.\n\n**Clinical Data Engineering &amp; Workflow Logic – 32,500 ADA \\(20%\\)**\n\nTotal Hours: 185 hours\n\nClinical Data Pipeline Development – 60 hours (9,000 ADA)\n\nECG/PPG preprocessing, metadata extraction, anonymisation strategy.\n\nMRI/ECHO Structural Feature Integration – 40 hours (6,000 ADA)\n\nSupport for Atlas-compatible datasets and cross-modality consistency.\n\nConsent Workflow Implementation – 45 hours (6,750 ADA)\n\nLocal keypair logic, signature flows, template hashing.\n\nBackend Integration &amp; Storage Abstraction – 30 hours (4,500 ADA)\n\nEncrypted bundle preparation and secure transfer mechanism.\n\nClinical Advisory &amp; Validation – 10 hours (6,250 ADA)\n\nExternal cardiology consultant validating dataset structure and metadata logic.\n\n.\n\n**Frontend, UX &amp; Testnet User Flows – 22,000 ADA \\(13%\\)**\n\nTotal Hours: 145 hours\n\nDataset Submission UI – 45 hours (6,750 ADA)\n\nClinic-facing interface for consent, metadata, and proof generation triggers.\n\nDataset Browser &amp; Verification Panel – 45 hours (6,750 ADA)\n\nFrontend visualization of proof verification status and dataset summaries.\n\nIntegration Testing – 35 hours (5,250 ADA)\n\nFull pipeline walkthroughs, error handling, UX refinements.\n\nAccess Workflow UX – 20 hours (3,250 ADA)\n\nEncrypted dataset retrieval after testnet payment confirmation.\n\n.\n\n**Infrastructure, Compute &amp; Security – 18,000 ADA \\(11%\\)**\n\nCloud Compute &amp; GPUs – 7,000 ADA\n\nTraining benchmarks, encrypted inference tests, prover performance trials.\n\nSecure Storage &amp; Environments – 5,000 ADA\n\nDataset handling, repository mirrors, CI/CD for ZK circuits.\n\nSecurity Hardening &amp; DevOps – 6,000 ADA\n\nContainer isolation, environment audits, automated testnet deployment.\n\n.\n\n**Project Management, Clinic Liaison, Reporting &amp; Documentation – 24,000 ADA \\(15%\\)**\n\nTotal Hours: 240 hours\n\nClinic Liaison, Outreach &amp; Integration – 150 hours (15,000 ADA)\n\nGuides for medical teams, integration calls with interested doctors.\n\nCore Project Management – 50 hours (5,000 ADA)\n\nArchitecture, privacy model, integration guides, reproducibility docs.\n\nLightpaper &amp; MVP open source designs; Communication Materials – 40 hours (4,000 ADA)\n\nDesign-ready lightpaper, diagrams, ecosystem outreach content.\n\n.\n\n**Contingency, ADA Fluctuation &amp; Non\\-Payroll Costs – 3,000 ADA \\(2%\\)**\n\nBuffer for ADA risk management, unexpected clinic data formatting needs, or infrastructure adjustments.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"**Value for Money**\n\nThis project offers exceptional value for the Cardano ecosystem because it delivers a high-impact, technically sophisticated prototype at a budget of **164,500 ADA** while accelerating Cardano’s position in one of the most commercially and socially important blockchain verticals: **privacy\\-preserving medical AI\\.**\n\n**\\.**\n\nCardinex provides the community with three types of value:\n\n(1) foundational infrastructure,\n\n(2) reusable open source zero-knowledge tooling, and\n\n(3) a landmark demonstration of Cardano’s real-world, regulated-sector potential.\n\nOn the infrastructure side, the delivered components consisting of a ZK proof-service, Aiken validators, dataset registry, encrypted access workflow, and reproducible testnet deployment, become long-term public goods. All code is released under an MIT license, enabling Cardano developers, ZK researchers, Midnight teams, and enterprise partners to reuse or extend it without friction. The architecture is modular, so circuits, provers, or identity frameworks (DIDs, VCs, ZK-SNARKs) can be swapped in as the ecosystem evolves. This reduces long-term maintenance costs while ensuring the prototype remains relevant as Cardano’s privacy stack matures.\n\n.\n\nThe project also provides **value through risk\\-managed execution**. Medical data workflows require strict handling standards, and our plan incorporates multiple layers of mitigation:\n\n• using anonymised open cardiac datasets for development,\n\n• performing all raw-data operations locally rather than on-chain,\n\n• structuring the ZK logic to verify usefulness, consent, and integrity without revealing patient information,\n\n• and designing the entire pipeline to avoid reliance on any single proving backend.\n\n.\n\nBy abstracting the ZK interface, the team can adapt to changes in tooling (Halo2, Midnight etc.) without causing delays or requiring scope changes, ensuring reliable delivery within the approved budget.\n\n.\n\nFrom an ecosystem-growth perspective, the impact extends beyond the immediate prototype. Cardinex represents a flagship use case for Cardano’s extended-UTxO model in regulated industries, positioning the chain as a serious contender for healthcare, clinical research networks, and AI governance. As the Midnight Network matures, Cardinex can serve as an early example of cross-chain privacy infrastructure: ZK proofs verified on Cardano, while more advanced confidential logic can be migrated or mirrored on Midnight. This reinforces the long-term vision of Cardano as a multi-layer ecosystem designed for verifiable computation and regulated data flows.\n\n.\n\nFinally, the societal value is substantial. Privacy-preserving medical AI directly addresses global bottlenecks: clinics cannot legally or ethically share sensitive cardiac data, yet cardiology AI requires diverse, multi-centre datasets to achieve clinical-grade accuracy. By enabling encrypted collaboration through verifiable proofs while never exposing patient identities, Cardinex supports a pathway toward safer diagnostics, improved early detection, and ultimately, lives saved. The broader Cardano community benefits not only from the technical outputs but from demonstrating that blockchain can meaningfully contribute to one of humanity’s most important public-health challenges. In total, the project delivers high-leverage technical assets, real enterprise relevance, and long-term ecosystem benefits that far exceed the cost.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400058","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Privacy","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1787}