{"pr_id":"019ac324-84aa-7d6c-bf6a-82df91037dbf","title":"Gamified Community Participation Platform in Argentina","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Low civic participation and distrust in services persist because reporting local problems feels pointless. In Argentina, trust in institutions is low; citizens lack feedback and verifiable progress.\n","solution":"Web MVP that gamifies community action: report and verify issues, earn Cardano-backed badges and levels, and anchor key events and evidence on Cardano to keep tracking transparent and tamper-evident.\n","proposer_name":"Alex Barros","proposer_relevant_experience":"Our delivery team is lean but covers all critical capabilities for a prototype-level build:\n\n- Product & UX Lead – aligns the IDEA and research with Catalyst requirements, defines user journeys, and owns acceptance criteria.\n- Frontend Engineer – develops the web app, map, reporting UI, timelines, profiles, and dashboards.\n- Backend Engineer – implements backend services and databases, duplicate detection, XP/level and badge logic, and notification services -  designs anchor transaction formats and daily digest patterns, integrates with existing indexer/explorer tools, and prepares the path for potential on-chain badge implementations.\n- Community & Research Coordinator – works with Argentine volunteers, monitors usage, and gathers qualitative insights.\n\n\n\nParticularly, the proposer ( [https://www\\.linkedin\\.com/in/alex\\-b\\-g/](https://www.linkedin.com/in/alex-b-g/) ) has before developed blockchain based projects in argentina, as well as co-founding the argentine blockchain foundation. With said foundation, we were funded during Catalyst fund 14, and are currently developing said projects. During fund 14, the proposer is not part of any of the projets proposed by said foundation, and has created 2 distinct individual proposals that will not share any team members and will have no overlap whatsoever.","url":null,"funds":147000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Gamified Community Participation Platform in Argentina","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Alex Barros","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":147000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":12,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Low civic participation and distrust in services persist because reporting local problems feels pointless. In Argentina, trust in institutions is low; citizens lack feedback and verifiable progress.\n","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Web MVP that gamifies community action: report and verify issues, earn Cardano-backed badges and levels, and anchor key events and evidence on Cardano to keep tracking transparent and tamper-evident.\n","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://citizen-gamify-1770.replit.app"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"The project will not be open source but we are commited to sharing periodic reports and finding along the way, as well as creating a comprehensive final close-out report that will be publically available.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Connected Community","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Existing civic apps and prior Catalyst tools often keep engagement data and incentives off-chain, with limited portability or transparent, verifiable impact. Our MVP anchors key moments in issue timelines and civic actions on Cardano, adds Cardano-backed reputation snapshots and digital badges, and packages this as a reusable rails stack for cities and communities in Argentina. It becomes an entry point for Cardano into community-improvement technology, with direct, measurable impact on local neighborhoods.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The MVP will demonstrate a complete civic engagement loop: citizens create geolocated reports with photos, validate and support existing reports, see transparent status updates, and earn levels and badges when they contribute. An admin console shows how a city government, as well as a community NGO, could triage, moderate, and communicate. Dashboards summarize anchored events and participation. It will run on a public Cardano testnet, with a hosted web app and an open repository.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"By month 12, in a simulated pilot: ≥300 on-chain events (issue anchors and daily digest anchors), ≥150 evidence hashes, ≥100 badge/level achievements reflected in digests, ≥100 active users, ≥400 in-app interactions (comments/supports), and at least three end-to-end simulated “fix” journeys from report to closure. Success = public testnet URL and a verification guide so any voter can independently check transactions and confirm claims.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Argentina faces a combination of low civic participation and record-low trust in public institutions. Our platform tackles this by turning community action into something visible, symbolically rewarded, and verifiable on Cardano. Citizens see that when they speak up, their actions leave a trace anchored to an open, tamper-evident ledger, not just an opaque inbox under the absolute control of some unknown bureaucrat.\n\n# **Core concept**\n\n\nThe solution is a web platform for Argentine communities where residents report local problems (potholes, trash on the street, broken lights, unsafe spaces, and many others), support existing reports, and follow a transparent timeline of what happens next.\n\nBehind the scenes, the core civic data lives off-chain in our database, but we anchor it to Cardano in a targeted way:\n\nWhen an issue is created and when it is resolved in the simulated workflow, we compute hashes of the relevant evidence and write minimal anchor transactions.\n\n\n\nOnce per day, we compute a digest hash summarizing that day’s off-chain events (reports, supports, comments, XP updates, badge assignments) and anchor that digest as a separate transaction.\n\n\n\nBy turning local issues and civic contributions into Cardano-anchored evidence and reputational snapshots, we combine concrete neighborhood benefits in Argentina with a reusable Cardano-based pattern for anchoring public data and participation. This positions Cardano as a natural backbone for civic innovation and public-good infrastructure, not just financial use cases.\n\nAfter 12 months, we will have a product that can be deployed in a live environment by any of the institutions and entities that we mention as ideal partners.\n\n# **_User flows_**\n\n\n**Report & evidence**\n\n\n\nA resident opens the web app, sees a city map, and taps “Report an issue”.\n\nThey take or upload a new photo, confirm GPS location, choose a category, and add a short description.\n\nBefore creating a new entry, we use a simple heuristic for duplicates: we check for existing issues in a short radius (for example, 50–100 meters), in the same category, and within a recent time window. If a likely match exists, the user is invited to “join” that thread by adding new evidence and support instead of spamming new reports. We do not claim perfect deduplication; the goal is to provide helpful hints, not strict guarantees.\n\n\n\n**Conversation & status**\n\nEach issue has a timeline: creation, community comments, and official-style status changes (Open → Under Review → In Progress → Resolved), driven in the MVP by moderators simulating a city government or NGO workflow.\n\nWhen an issue is created or resolved, we compute an evidence hash and write a minimal anchor to Cardano. Intermediate statuses are stored off-chain and are covered by the daily digest anchors. This yields a verifiable chain of key events while keeping costs and complexity under control.\n\n\n\n**XP, levels and badges**\n\nEach constructive action gives experience points (XP): filing reports, contributing good evidence, commenting constructively, participating in polls.\n\nAs residents accumulate XP, they level up and unlock honorific titles (for example, “Neighborhood Helper”, “Public Spaces Guardian”).\n\nReaching specific thresholds or showing certain patterns of action also grants digital participation badges (for example, “Public Spaces Guardian” for repeated green-space reports, or “Street Safety Watcher” for lighting and sidewalk issues).\n\nIn the MVP, these levels and badges are stored off-chain in our database, but they are included in the digest hashes that we anchor on Cardano. This gives them a Cardano-backed audit trail without requiring individual token minting in this first phase.\n\n\n\n# On-chain & technical design\n\n\n**Evidence anchoring**\n\n\n\nOff-chain, the platform stores reports, images, and metadata in an encrypted database.\n\nFor each issue creation and simulated resolution, we derive a hash of the evidence bundle and write a minimal record to Cardano (hash + event type + schema version + reference ID).\n\nOnce per day, the backend computes a deterministic digest hash over that day’s off-chain events (including reports, supports, comments, XP updates and badge assignments) and anchors that digest as a separate transaction.\n\nThis provides tamper-evidence without exposing personal data and allows us to evolve the off-chain data model while still being able to verify integrity against past anchors using the verification kit.\n\n\n\n**Badges & reputation**\n\n\n\nIn the MVP, badges and levels are off-chain entities: they live in our database and are surfaced in the user’s profile and dashboards. Their existence and evolution are reflected in the periodic digest hashes that we anchor to Cardano. If needed, we can later prove that a given badge record was already part of a prior snapshot.\n\nThis design keeps implementation simple while still aligning with the long-term vision of turning badges into full on-chain assets in a future phase. The MVP shows the pattern: Cardano-backed reputation and participation proofs, with a clear path to upgrade when appropriate.\n\n\n\n**Privacy**\n\n\n\nPersonal information stays off-chain. Hashing and encryption ensure that only authorized parties (for example, a future city client or NGO) can reconstruct full evidence while the public chain proves integrity and timing. Location and photo data are kept off-chain; Cardano only sees hashes and minimal classification metadata.\n\nWallets and user accounts\n\nFor the simulated pilot, residents use standard web accounts (for example, email-based access or another simple identity method) to interact with the platform. All on-chain anchors are submitted from a platform-managed Cardano wallet on testnet, which is dedicated to this project.\n\n\n\nFor each user action that triggers an anchor, we record which accounts were involved and which transaction IDs were created. In the “My Cardano Activity” section of the app, users can see the list of anchors associated with their contributions, together with explorer links to each transaction, without having to manage keys or balances directly.\n\nIn future phases, we can add an option for residents or institutions to connect their own Cardano wallets for advanced features, but the MVP keeps key management simple and safe by centralizing anchor submission in a dedicated platform wallet.\n\n\n\n**Architecture**\n\n\n\nFrontend: modern web app with map UI, report form, timeline view, profiles, and badge/level views.\n\nBackend: services for validation, duplicate detection (using radius and time-window heuristics), XP logic, level and badge assignment, notifications, and simulated workflows.\n\nCardano integration: a lightweight service responsible for creating per-issue anchors and daily digest anchors from the platform wallet and recording their transaction IDs. We rely on existing Cardano indexer/explorer infrastructure to look up transactions and metadata when needed. Dashboards primarily read from our database; Cardano serves as an independent proof layer rather than the main analytics data store.\n\n\n\n# **For cities and community NGOs**\n\n\nFrom the start, the platform is designed to be operated either by a local government or by a local NGO focused on community improvement:\n\n\n\nA **local government** could use it as a hosted platform to receive reports, communicate progress, and publish a transparent log of works and budgets. Cardano becomes the neutral trust layer that backs up what the city claims. In a production deployment, the platform can be integrated with the city’s existing account systems so residents log in using the same credentials they already use for municipal services.\n\n\n\nA **community NGO** can operate the same platform even without formal governmental support. Volunteers update statuses when they see real-world changes (for example, a volunteer sees road works starting where a pothole was reported and marks it as “In Progress”). This creates a citizen-led mirror of how the city is performing, backed by Cardano-anchored evidence and digest snapshots, bringing transparency and accountability in areas where it is often lacking.\n\nThe 12-month work ends with a simulated pilot that demonstrates exactly how a city or NGO could adopt the platform, and therefore with a ready-to-use product.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"In Argentina, low civic participation and deep mistrust of institutions reinforce each other: people rarely see tangible outcomes from their complaints, so they disengage, and institutions receive less constructive feedback. Our platform is designed to reverse this cycle by making every step of civic action traceable, explainable, and anchored on Cardano.\n\nImpact on communities, local governments, and NGOs\n\n\n\n**Communities**\n\n\n\nResidents gain a simple, beautiful interface to report problems, support their neighbors’ reports, and see visible progress over time.\n\nSymbolic progression, levels, and badges make consistent contributors visible and appreciated, reinforcing a culture of shared responsibility instead of apathy.\n\n\n\n**Local governments **\n\n\n\nOnce adopted by a city or town, our platform can provide a ready-made digital channel for residents to raise issues and track responses.\n\nOn-chain anchors and daily digest transactions act as a public, independent log that backs up the narrative of improvement with verifiable evidence.\n\n\n\n**Local NGOs**\n\n\n\nNGOs focused on community improvement can run campaigns (for example, “cleaner public spaces”, “safer streets”) and use our platform to coordinate volunteers, collect evidence, and show impact to donors and partners.\n\nThe Cardano-anchored participation records and badge snapshots allow them to highlight community leaders with transparent, data-backed contribution histories.\n\n\n\n**Impact on civic\\-tech**\n\n\n\nOur research shows that modern civic platforms combine mobile reporting, maps, and gamification to increase engagement, yet most rely entirely on centralized data stores.\n\n\n\nBy anchoring evidence and daily digests on Cardano and representing participation with Cardano-backed badges and reputation snapshots, we demonstrate how:\n\nCivic data can have a verifiable audit trail without sacrificing privacy.\n\nGamification can be rooted in real, inspectable contributions rather than opaque point systems.\n\nA civic platform can be both operationally practical and open to ecosystem reuse, via open-source components and clear documentation.\n\n\n\nThis contributes a high-quality reference implementation for civic-tech teams in Argentina and across Latin America who want to explore blockchain-backed transparency but lack a concrete starting point.\n\n\n\n# Strategic value for Cardano\n\n\nFor **Cardano**, our project is a tangible proof that the chain can underpin high-frequency, low-value real-world interactions with social meaning.\n\nEach anchored issue and daily digest transaction is a live example of Cardano securing public interest data.\n\nResidents who may never have considered using a blockchain interact with Cardano-backed achievements and verifiable histories in a non-speculative, socially meaningful context.\n\n\n\nLocal governments and NGOs that later adopt the platform will see Cardano not as a trading venue, but as the invisible infrastructure that keeps their commitments honest and verifiable.\n\nWe believe this combination – concrete community benefit in Argentina plus a replicable technical pattern – positions Cardano as a natural backbone for civic innovation and public-good infrastructure.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Existing groundwork**\n\n\n\nWe have already conducted detailed research into civic engagement and digital participation, mapping common features, user flows, and architectural approaches.\n\n\n\n- Our IDEA document defines the core mechanics of our platform:\n- Map-based reporting with photos and rich status history.\n- Duplicate detection and +1 support with location- and time-window–based suggestions.\n- Gamified XP, levels, and symbolic badges as non-monetary rewards for consistent participation.\n\n\n\nThis reduces uncertainty and helps us focus the MVP on the most impactful and feasible features.\n\n\n\n**Team roles and capacity**\n\n\n\nWhile this proposal is submitted by a single named applicant (Alex Barros), the delivery plan assumes a compact but complete team:\n\n- Product & UX Lead – translates the IDEA vision into detailed flows, writes acceptance criteria, and ensures the product fits the category requirements.\n- Frontend Engineer – builds the web app, map interface, reporting UI, timelines, profiles, and dashboards.\n- Backend Engineer – designs backend services and database schemas, duplicate detection, XP/level and badge rules, and notification logic. Implements anchor transaction patterns (per-issue and daily digest), integrates with existing indexer/explorer infrastructure, and prepares the path for potential on-chain badge implementations in future phases\n\n\n\n\n\n**Feasibility**\n\n\n\nThe requested budget and 12-month timeline are appropriate for a focused prototype with a clear path from concept to simulated pilot.\n\n\n\nWe keep the scope intentionally focused:\n\n\n\n- One main client (web), no native mobile apps in this phase.\n- One clear on-chain feature set: per-issue anchors (issue creation and simulated resolution) and daily digest anchors, with badges and XP data anchored indirectly through those digests and no complex tokenomics or financial logic in the MVP.\n- A simulated pilot with volunteers instead of a live integration with city systems, which avoids political and procurement complexity at the prototype stage.\n- On-chain interactions are all submitted from a dedicated platform wallet on testnet, which simplifies key management while still providing a verifiable on-chain trail for all civic events.\n- Risks are addressed through:\n- Clear milestones with concrete Outputs, Acceptance Criteria, and Evidence.\n- A privacy-preserving architecture that hashes and encrypts sensitive data off-chain.\n- Strict adherence to Catalyst rules on incentives by using only symbolic, non-monetary rewards.\n\n\n\nGiven the groundwork, realistic scope, and strong alignment with the category, we consider the project feasible within 12 months and the requested budget.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Whitepaper, Planning & UX Foundation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Whitepaper and technical specification that describe the problem context, user personas, gamification model (XP, levels, titles, badges), privacy approach, Cardano anchoring patterns (per-issue anchors and daily digest anchors), and the high-level wallet and indexer strategy.\n2. Delivery and governance plan for the 12-month MVP, including roadmap by milestone, backlog of epics and user stories, risk register, and initial adoption scenarios for cities and community NGOs.\n3. UX flows, information architecture, and high-fidelity prototypes for reporting, timelines, profiles, dashboards, and the “My Cardano Activity” section, agreed by the core team as the baseline for implementation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Whitepaper and technical specification are published in a version-controlled repository, covering at least the components listed above and aligned with Catalyst rules on non-monetary incentives.\n2. Roadmap, backlog, and risk register are available in project management tooling, with each epic mapped to a milestone and explicit dependencies and assumptions documented.\n3. Stakeholders can click through UX prototypes that cover end-to-end flows (report → support → comment → status view → profile → activity view), and the team signs off that these are sufficiently stable for development in Milestones 2 and 3.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Public or shareable link to the whitepaper and technical specification (PDF and/or markdown) with a tagged release “M1”.\n2. Screenshots and exports from the project management tool showing roadmap, backlog, and risk register, plus a short written explanation of key risks and mitigations.\n3. Design prototype link and a recorded walkthrough video of the core UX flows used for internal and Catalyst reporting.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":22050,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"10 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":" Backend & Cardano Anchors","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Testnet backend services and database schemas for issues, comments, XP, levels, badges, and user accounts, including basic duplicate detection (radius and time-window heuristics).\n2. Cardano integration layer implementing per-issue anchor transactions for issue creation and simulated resolution from a dedicated platform wallet, plus daily digest anchors that hash snapshots of off-chain activity (reports, supports, comments, XP updates, badge assignments).\n3. Integration with existing Cardano indexer/explorer infrastructure and a backend-powered “activity feed” endpoint that combines transaction IDs and off-chain data to show recent anchored events.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. In a test environment, new users can register, submit issues and comments that are stored in the database, and trigger per-issue anchors according to the design; duplicate suggestions work using simple radius and time-window rules.\n2. At least 120 successful testnet transactions are executed across per-issue anchors and daily digest anchors, with documented verification steps showing how to recompute hashes from exported data and match them to on-chain metadata.\n3. The backend can reconstruct a list of recent anchored events by combining stored transaction IDs with responses from an external Cardano indexer/explorer; the “activity feed” endpoint returns a structured list of events with chain references.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Repository links with backend code, schema definitions, and tests, as well as a short technical note explaining duplicate detection and the anchoring approach.\n2. CSV of transaction IDs with instructions for verification via a Cardano explorer, plus sample recomputation of hashes from the database to match on-chain digests.\n3. Screenshots or logs from the “activity feed” as seen in a developer tool or simple admin page, demonstrating combined off-chain and on-chain data.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":36750,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Frontend App, Admin Console & Dashboards","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Frontend web application implementing the citizen-facing flows (reporting, evidence, support, comments, timelines, profiles, badges, levels and titles), integrated with the backend and Cardano anchoring layer from Milestone 2.\n2. Admin console for configuring categories, moderating content, and changing issue statuses with audit logs.\n3. Metrics dashboard showing counts of per-issue anchors, daily digest anchors, active users, XP levels, badges, and participation by area, plus a simulation toolkit with scripted “city-style” and “NGO-style” workflows to run realistic scenarios without an institutional partner.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. In a staging environment, users can complete end-to-end flows from report creation to status resolution using the web app; the interface works across mainstream desktop and mobile browsers.\n2. Moderators can update statuses via the console; each issue creation and simulated resolution emits the appropriate anchors and appears in the public timeline, the admin audit log, and the citizen-facing views.\n3. The dashboard shows real-time metrics for per-issue anchors, daily digest anchors, badges, XP levels, and active users; date and area filters work as expected, and the toolkit includes at least two predefined scenarios (local government and NGO) with step-by-step instructions and seeded data.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Deployed staging URL and demo video of the citizen-facing web app showing full flows from report creation to resolution, including XP gain and leveling.\n2. Demo video of the admin console, including status changes and audit log views.\n3. Dashboard screenshots and link, plus sample JSON/CSV exports of metrics and a documentation pack (PDF or markdown) describing simulation scripts and how to run them.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":36750,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Simulated Pilot & Verification Kit","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Simulated pilot with Argentine volunteers executing at least three full “fix journeys” from report to closure across selected neighborhoods and issue categories.\n2. Public verification kit: repository, testnet URL, transaction index for per-issue and daily digest anchors, badge and level catalog, and a step-by-step guide for checking claims (including how to recompute hashes from exported data).\n3. Exported KPI datasets and preliminary summary tables (issues, anchors, users, XP levels, badges) prepared as input for the final close-out report.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. Pilot logs show three journeys with multiple reporters, supporters, comments, and status changes, all anchored on-chain according to the design (issue and daily digest anchors).\n2. A new user (such as a Catalyst voter) can follow the verification guide and confirm that the verification kit and transaction index are sufficient to check claims against on-chain data.\n3. KPI data (including ≥300 on-chain events, ≥150 evidence hashes, ≥100 badge/level achievements, ≥100 active users, ≥400 in-app interactions) is exported into structured datasets and summary tables suitable for final analysis in the close-out report.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Video walkthrough of the simulated pilot and anonymized datasets for issues, users, XP levels, and badges.\n2. Public links to repository, live testnet deployment, transaction CSV, and verification guide.\n3. Shared KPI datasets (for example, CSV or JSON) and preliminary summary tables, stored in the repository or documentation, ready to be used in the final report.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":11,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":29400,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Close-Out Report & Knowledge Sharing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"1. Final written close-out report summarizing KPIs, comparison to targets, qualitative feedback from participants, and proposed roadmap for future phases (including potential on-chain badge implementations and production deployments).\n2. Public-facing summary for the Cardano community and potential partners (for example, Catalyst forum post, blog article, or presentation deck) explaining results, lessons learned, and how others can reuse the code and patterns.\n3. Documented backlog and technical post-mortem capturing remaining issues, technical debt, and prioritized next steps for future funding rounds or external adopters.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"1. The final report includes KPI tables, analysis of successes and shortfalls, lessons learned, and a clear description of future technical evolution and adoption paths.\n2. At least one public summary (forum post, blog, or similar) is published and shared in a relevant Cardano community channel, linking to the verification kit, repository, and final report.\n3. The backlog and post-mortem are recorded in the project’s repository or project management tool, with issues and epics clearly labeled as candidates for future work and external contributions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"1. Link to the final close-out report (PDF and/or markdown) in the repository or shared drive\n2. URLs or screenshots of public posts or presentations shared with the Cardano community, including any feedback threads.\n3. Export or screenshots from the backlog/project management tool showing the documented post-mortem, remaining issues, and prioritized roadmap items for future development.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":12,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":22050,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Our delivery team is lean but covers all critical capabilities for a prototype-level build:\n\n- Product & UX Lead – aligns the IDEA and research with Catalyst requirements, defines user journeys, and owns acceptance criteria.\n- Frontend Engineer – develops the web app, map, reporting UI, timelines, profiles, and dashboards.\n- Backend Engineer – implements backend services and databases, duplicate detection, XP/level and badge logic, and notification services -  designs anchor transaction formats and daily digest patterns, integrates with existing indexer/explorer tools, and prepares the path for potential on-chain badge implementations.\n- Community & Research Coordinator – works with Argentine volunteers, monitors usage, and gathers qualitative insights.\n\n\n\nParticularly, the proposer ( [https://www\\.linkedin\\.com/in/alex\\-b\\-g/](https://www.linkedin.com/in/alex-b-g/) ) has before developed blockchain based projects in argentina, as well as co-founding the argentine blockchain foundation. With said foundation, we were funded during Catalyst fund 14, and are currently developing said projects. During fund 14, the proposer is not part of any of the projets proposed by said foundation, and has created 2 distinct individual proposals that will not share any team members and will have no overlap whatsoever.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Budget & Costs (1500 characters max)\n\n\n\nTotal requested: ₳147,000 over 12 months.\n\n\n\nBy milestone:\n\n\n\n1. Milestone 1 – Whitepaper, planning & UX foundations: ₳22,050 (15%)\n2. Milestone 2 – Backend & Cardano anchors: ₳36,750 (25%)\n3. Milestone 3 – Frontend app, admin console & dashboards: ₳36,750 (25%)\n4. Milestone 4 – Simulated pilot & verification kit: ₳29,400 (20%)\n5. Final Milestone – Close-out & knowledge sharing: ₳22,050 (15%)\n\n\n\n\n\nAll funds are dedicated to development, operations, research, and documentation for future work. We do not allocate any part of the budget to ADA giveaways, airdrops, or monetary prize schemes.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"For **₳147,000**, our project delivers a working Cardano-based civic engagement MVP on testnet, open-source components, and a practical demonstration of blockchain utility for Argentine communities.\n\n\n\n**The ecosystem gains:**\n\n\n\nA complete, verifiable product that communities and Cardano advocates can demo to local governments and NGOs.\n\nA repeatable pattern for anchoring civic data, XP-based progression, levels, and symbolic participation badges on Cardano via per-issue anchors and daily digest hashes.\n\n\n\nOn-chain activity tied to real social value (reports, status updates, contributions), not speculation.\n\nDocumentation and a verification kit that reduce the cost and risk for future teams building on similar ideas.\n\nWe believe this is a cost-effective way to open Cardano to the civic sector in Argentina, create a compelling public narrative around real-world impact, and lay the groundwork for deeper integrations in future Catalyst funds.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Have you previously submitted a project in Catalyst that was funded and is not yet completed?","description":"Do you have not yet completed projects?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/tagInput","title":"Project ID's","description":"If you answered “yes” to the previous question, please select first how many there are in total and then list all IDs for any projects you are currently involved in that have not been completed yet.","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Project ID","description":"Seven digit project ID from Catalyst website","format":null,"answer":"1400121","sub_fields":null}]}]},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Connected Community","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1788}