{"pr_id":"019ac2c0-82ee-78c6-94f5-c784e1741e20","title":"DeFi Beginners Pathway: Cardano Learning Program","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"There is growing interest in DeFi in the region, but the lack of clear education in Spanish makes many users afraid to interact with Cardano, limiting its adoption and real understanding.","solution":"Launch an online course in Spanish that teaches DeFi from scratch and its use on Cardano. In 10 hours distributed over 3 months, users will gain confidence and will be able to interact with ADA safely","proposer_name":"Erick Valadez","proposer_relevant_experience":"Erick Valadez — Project Lead / Content Producer\n\n\n\nX: [https://x\\.com/FilozoFlow](https://x.com/FilozoFlow)\n\n\n\nRole:\n\n\n\nResponsible for planning, producing, and executing the course.\n\nRecording and editing the educational content.\n\nDesign of presentations, quick guides, and downloadable materials.\n\nManagement of the platform where the course will be published.\n\nCoordination of the community group and collection of feedback.\n\nPreparation of the Final Report and delivery of KPIs to Catalyst.\n\n\n\nExperience:\n\nCardano Ambassador in Mexico, with a background delivering workshops, conferences, and educational sessions on blockchain and the Cardano ecosystem in universities across the country. Experienced in creating digital courses, managing educational platforms, and producing audiovisual content. Has collaborated with crypto communities in Mexico and LATAM, promoting adoption through accessible education.\n\n\n\nAudiovisual Editor (External Collaborator)\n\n\n\nRole:\n\n\n\nSupport in professional video editing.\n\nAudio cleanup, on-screen text, and visual optimization.\n\nPreparation of the final material in a format compatible with online platforms.\n\n\n\nJustification:\n\nEnsures the course has professional quality, clear audio, and a proper visual presentation for beginner students.\n\n\n\nSkills gaps and recruitment\n\n\n\nIf the workload or the number of students grows, the following could be added:\n\n\n\nEditing Assistant, to speed up audiovisual deliveries.\n\nCommunity Moderator, to manage increased interaction.\n\n\n\nThese positions do not affect the viability of the project, as the critical functions are covered by the core team.\n\n\n\nWhy this team can execute successfully:\n\n\n\nReal experience in education, blockchain, and Cardano.\n\nProven technical ability to create digital content.\n\nActive relationships with Cardano communities in Mexico and LATAM.\n\nCommitment to Spanish-language education to remove adoption barriers.","url":null,"funds":24000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"DeFi Beginners Pathway: Cardano Learning Program","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Erick Valadez","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":24000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":4,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"There is growing interest in DeFi in the region, but the lack of clear education in Spanish makes many users afraid to interact with Cardano, limiting its adoption and real understanding.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Launch an online course in Spanish that teaches DeFi from scratch and its use on Cardano. In 10 hours distributed over 3 months, users will gain confidence and will be able to interact with ADA safely","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://drive.google.com/file/d/106iTJZ7hJH83HgBxysr0IdvNDRrXmQrj/view","https://www.youtube.com/watch?v=KYmYswDjgWc"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All of the projects outputs will be published","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Education","group":"Education"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"The project is aimed at beginners in Mexico and LATAM who feel interested in cryptocurrencies and ADA, but who still do not understand DeFi or trust their own ability to use it. We will reach them through digital outreach, social media, introductory educational content, and partnerships with local communities.\n\n\n\nThis initiative is important for Cardano because it transforms curiosity into real knowledge, reduces the fear of interacting with the technology, and creates new users capable of using ADA, exploring DeFi, and actively participating in the ecosystem. By opening a clear educational path, we build a base of informed users who strengthen the adoption and growth of Cardano in the region.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"- Design of the course’s educational content\n\n\n\nCreation of the beginner-oriented DeFi program, structured into simple modules with practical examples and a focus on Cardano. Includes guides, exercises, and audiovisual material.\n\n\n\n- Production of the course in online format\n\n\n\nRecording videos, editing, creating presentations, downloadable resources, and a student access platform. Ensures the quality and accessibility of the content.\n\n\n\n- Preparation of free introductory material\n\n\n\nPublishing short videos, infographics, and basic explanations to attract people who are afraid of DeFi and make it easier for them to enter the course.\n\n\n\n- Outreach campaign in Mexico and LATAM\n\n\n\nPromoting the program through social media, Cardano communities, local partners, and targeted ads to reach audiences interested in entering the ecosystem.\n\n\n\n- Implementation of the course over 3 months\n\n\n\nDelivery of the online program (10 total hours), access to modules, and follow-up sessions to resolve doubts and reinforce learning.\n\n\n\n- Participant evaluations and feedback\n\n\n\nApplying quizzes, measuring understanding, and analyzing progress to ensure that students gain real confidence and skills.\n\n\n\n- Post-course follow-up and support\n\n\n\nOptional support for students interested in continuing to deepen their knowledge of Cardano, DeFi, and ecosystem tools.\n\n\n\n- Documentation and final project report\n\n\n\nCollecting evidence, metrics, learnings, and results in a final report for Catalyst.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"KPIs\n\n\n\n1. 100 participants enrolled in the course during the 3-month implementation.\n2. 70% course completion rate among students.\n3. 80% participant satisfaction, measured through surveys.\n4. 100% of the educational content produced, including videos, guides, and presentations.\n5. 3 main modules completed, covering basic DeFi concepts and their use on Cardano.\n6. At least 50 students demonstrating practical understanding through applied exercises.\n7. 30% increase in community interaction (comments, questions, requests for more content).\n8. A final report with metrics, testimonials, and analysis of ecosystem progress.\n9. Dissemination in 3 digital Cardano communities in LATAM.\n10. At least 20 students expressing intent to continue exploring DeFi tools on Cardano.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The project proposes creating an accessible, clear, and fully Spanish online course that teaches DeFi from scratch with a practical focus on the Cardano ecosystem. This solution directly addresses the main problem: thousands of people in Mexico and LATAM want to enter the crypto world, but fear of the technology and the lack of simple educational resources hinder their adoption.\n\n\n\nThe program is designed especially for beginners. It uses real examples, simple language, and guided exercises that allow anyone to understand how Decentralized Finance works without needing prior knowledge. In addition, the course integrates real demonstrations of Cardano usage, showing how to interact with ADA and ecosystem tools safely and responsibly.\n\n\n\nThe project will benefit new users, cryptocurrency enthusiasts, local communities, and people interested in learning without technical barriers. By offering a clear entry path, it fosters confidence and transforms curious individuals into active users. This is essential for Cardano, as it drives adoption, promotes understanding, and helps more people participate in its financial ecosystem.\n\n\n\nWhat makes this solution unique is its approach fully adapted to the reality of LATAM: accessible, in Spanish, beginner-friendly, and with a direct impact on education and adoption. This course not only teaches DeFi; it opens the door for more people to use Cardano with safety, confidence, and a deep understanding of its technological value.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"The project will help more people in Mexico and LATAM enter the world of Decentralized Finance without fear or confusion. Many users want to use cryptocurrencies, but the lack of clear education in Spanish holds them back. This course breaks that barrier and creates a safe, accessible, and guided entry point into Cardano.\n\n\n\nThe main impact will be transforming insecure beginners into informed users who understand how DeFi works and how to interact with ADA without risks. This generates real adoption, recurring users, new communities, and a solid foundation for ecosystem growth in the region.\n\n\n\nTraining new users, teaching good practices, and allowing them to experience DeFi clearly creates a multiplier effect: the trained individuals share their knowledge, recommend Cardano, and become natural ambassadors of the ecosystem. This strengthens Cardano’s presence in markets where education is the key to growth.\n\n\n\nImpact KPIs\n\n\n\n1. 100 participants enrolled in the course.\n2. 70% completion of the main modules.\n3. 80% satisfaction in post-course surveys.\n4. 50 students completing practical exercises applied to Cardano.\n5. 30% increase in interaction within Cardano–LATAM communities.\n6. 3 digital communities spreading the course and participating in the program.\n7. 20 students interested in continuing to learn about DeFi on Cardano.\n8. A final report documenting results, learnings, and feedback.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"The project will be carried out by a team with experience in digital education, community building, and blockchain technology outreach in Mexico and LATAM. As a Cardano ambassador, I have direct experience delivering workshops, courses, and conferences about the ecosystem, as well as collaborating with universities and tech communities. This ensures an organized, responsible, and results-oriented execution.\n\n\n\nThe course production, content structure, and learning platform will be developed using tools I already manage, supported by prior experience creating educational material. In addition, I have contacts within crypto communities in LATAM, which facilitates the program’s outreach and dissemination.\n\n\n\nThe project’s feasibility is validated through:\n\n\n\nA clear educational plan divided into progressive modules.\n\n\n\nRecorded content, which ensures consistency and scalability.\n\n\n\nEvaluations and surveys that measure participants’ progress and real satisfaction.\n\n\n\nVerifiable evidence such as metrics, feedback, and community participation.\n\n\n\nOngoing digital support to accompany users throughout the process.\n\n\n\nThe project can be executed with high levels of confidence because it is based on familiar tools, a proven educational format, and a clear strategy for attracting beginner users. All this, combined with the team’s prior experience in Cardano and DeFi, ensures that the objectives are met and that the results are evident and measurable.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Production of the fundamental modules of the DeFi Beginners Pathway course","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Production of 3 introductory videos (1 hour each).\n\n\n\nTopics covered:\n\n\n\nBasic personal finance\n\n\n\nBlockchain fundamentals\n\n\n\nIntroduction to Cardano and wallet creation\n\n\n\nDownloadable complementary material: presentations, quick guides, summaries.\n\n\n\nMini-quizzes that the student completes asynchronously.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Videos recorded and edited with professional quality.\n\n\n\nDidactic materials reviewed and optimized for beginners.\n\n\n\nFunctional mini-tests within the platform.\n\n\n\nInitial feedback (closed pilot) with at least 80% positive comments.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Folder with the 3 final videos.\n\n\n\nPDFs and presentations used.\n\n\n\nPilot feedback form.\n\n\n\nScreenshots from the system showing quiz functionality.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":6000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Production of the intermediate modules on DeFi in Cardano","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Production of 4 intermediate videos (1 hour each).\n\n\n\nTopics covered:\n\n\n\nIntroduction to DeFi (concepts and risks)\n\n\n\nDeFi platforms on Cardano: Liqwid, Minswap, DripDropz\n\n\n\nSecurity and best practices with ADA\n\n\n\nRecorded demonstrations: transactions, wallet usage, staking\n\n\n\nComplementary materials: step-by-step tutorials, visual guides.\n\n\n\nPractical exercises that the student will complete independently.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Videos correctly recorded and edited.\n\n\n\nTutorials and guides available for download.\n\n\n\nPractical exercises designed clearly and understandably.\n\n\n\nInternal feedback with at least 80% reported clarity.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Final videos uploaded to the platform.\n\n\n\nPDFs of tutorials and guides.\n\n\n\nScreenshots of the exercises available on the platform.\n\n\n\nPilot feedback forms.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":6000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final modules, full course assembly, and community activation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Production of 3 final videos (1 hour each):\n\n\n\nLending, borrowing, and yield farming on Cardano\n\nBasic ADA management strategies\n\nFinal application mini-project\n\n\n\nAssembly of the full course (10 total hours).\n\nUpload of all materials and quizzes.\n\nCreation of the online community (Telegram/Discord/Facebook group).\n\nSetup of the space to receive asynchronous feedback.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All 10 final modules published and functional.\n\nComplete platform with materials and quizzes.\n\nCommunity created and active with at least 50 initial members.\n\nInternal validation of the course user experience (UX).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Screenshots of the full published course.\n\nFinal recordings and PDFs.\n\nLink to the active community group.\n\nInternal usability validation report.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":6000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final project report and impact video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Final report documenting:\n\n\n\nResults\n\nKPIs\n\nParticipation\n\nFeedback received\n\nAdoption impact\n\n\n\nProfessional video with highlights, text testimonials, and course screenshots.\n\n\n\nDelivery of all evidence required by Catalyst.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Final report delivered according to Catalyst guidelines.\n\nMP4 video with a clear impact narrative.\n\nComplete record of asynchronous interactions (feedback and community).\n\nOrganized documentation for auditing.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"PDF of the final report.\n\nProject video.\n\nFolder with screenshots of comments, community activity, and completed questionnaires.\n\nCourse usage data.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":5000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Erick Valadez — Project Lead / Content Producer\n\n\n\nX: [https://x\\.com/FilozoFlow](https://x.com/FilozoFlow)\n\n\n\nRole:\n\n\n\nResponsible for planning, producing, and executing the course.\n\nRecording and editing the educational content.\n\nDesign of presentations, quick guides, and downloadable materials.\n\nManagement of the platform where the course will be published.\n\nCoordination of the community group and collection of feedback.\n\nPreparation of the Final Report and delivery of KPIs to Catalyst.\n\n\n\nExperience:\n\nCardano Ambassador in Mexico, with a background delivering workshops, conferences, and educational sessions on blockchain and the Cardano ecosystem in universities across the country. Experienced in creating digital courses, managing educational platforms, and producing audiovisual content. Has collaborated with crypto communities in Mexico and LATAM, promoting adoption through accessible education.\n\n\n\nAudiovisual Editor (External Collaborator)\n\n\n\nRole:\n\n\n\nSupport in professional video editing.\n\nAudio cleanup, on-screen text, and visual optimization.\n\nPreparation of the final material in a format compatible with online platforms.\n\n\n\nJustification:\n\nEnsures the course has professional quality, clear audio, and a proper visual presentation for beginner students.\n\n\n\nSkills gaps and recruitment\n\n\n\nIf the workload or the number of students grows, the following could be added:\n\n\n\nEditing Assistant, to speed up audiovisual deliveries.\n\nCommunity Moderator, to manage increased interaction.\n\n\n\nThese positions do not affect the viability of the project, as the critical functions are covered by the core team.\n\n\n\nWhy this team can execute successfully:\n\n\n\nReal experience in education, blockchain, and Cardano.\n\nProven technical ability to create digital content.\n\nActive relationships with Cardano communities in Mexico and LATAM.\n\nCommitment to Spanish-language education to remove adoption barriers.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Production of Fundamental Modules\n\nCost: 6,000 ADA\n\nBreakdown:\n\nRecording and editing of 3 introductory videos: 3,000 ADA\n\nDesign of presentations, quick guides, and PDFs: 1,500 ADA\n\nCreation of quizzes and platform setup: 800 ADA\n\nPedagogical review + internal pilot: 700 ADA\n\nTotal Milestone 1: 6,000 ADA\n\nProduction of Intermediate Modules (DeFi on Cardano)\n\nCost: 6,000 ADA\n\nBreakdown:\n\nRecording and editing of 4 intermediate videos: 3,200 ADA\n\nDesign of step-by-step tutorials and materials: 1,300 ADA\n\nCreation of asynchronous practical exercises: 1,000 ADA\n\nTechnical validation of real demonstrations: 500 ADA\n\nTotal Milestone 2: 6,000 ADA\n\nProduction of Final Modules + Full Course Assembly\n\nCost: 6,000 ADA\n\nBreakdown:\n\nRecording and editing of 3 final videos: 3,000 ADA\n\nFull course assembly (10 hours): 1,500 ADA\n\nUpload of content, quizzes, and materials: 1,000 ADA\n\nCreation and setup of the online community: 500 ADA\n\nTotal Milestone 3: 6,000 ADA\n\nFinal Report + Documentary Video\n\nCost: 5,000 ADA\n\nBreakdown:\n\nWriting of the Final Report for Catalyst: 2,000 ADA\n\nEditing of the project impact video: 2,000 ADA\n\nOrganization of evidence, KPIs, and final metrics: 1,000 ADA\n\nTotal Milestone 4: 5,000 ADA\n\nContingency Fund (5%)\n\n1,000 ADA\n\nThis fund covers unforeseen issues related to:\n\nEditing adjustments\n\nTechnical corrections on the platform\n\nReplacement of audiovisual material\n\nMinor updates needed during production\n\n\n\nADA-USD rate: 0.40","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"In a region where interest in cryptocurrencies is enormous but the lack of education creates fear and insecurity, a clear, accessible, Spanish-language course can make the difference between a user who walks away… and one who adopts Cardano with confidence.\n\n\n\nThis budget is reasonable because it covers only the essentials: recording, editing, educational design, material production, and the creation of a community space where students can stay connected to Cardano after finishing the course. There are no inflated costs or unnecessary expenses; every ADA is transformed into concrete, useful, and long-term content.\n\n\n\nIn addition, producing 10 hours of professional educational material with this budget is highly efficient compared to common costs of digital course creation. In Mexico and LATAM, audiovisual and pedagogical production is more accessible, which allows a complete course to be created with a moderate budget and made available to the entire community.\n\n\n\nThe true value lies in what this course will generate: people who understand what Cardano is, how to use ADA, how to enter DeFi without fear, and how to take advantage of the ecosystem’s tools. This not only attracts new users; it creates natural ambassadors, multiplies adoption, and strengthens Cardano in one of the regions with the greatest growth potential in the world.\n\n\n\nThis project takes every ADA and turns it into education, confidence, and a future for Cardano in LATAM.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Education","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1789}