{"pr_id":"019ab350-4f8b-7183-bc0a-cda9a64dea4a","title":"V2 Inheritance Dapp for Web3 and the Real World - GenWealth ","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"There is no safe, easy-to-use solution to leave your Crypto as an Inheritance or recover it if you lose the seedphrase, without putting your assets at risk.","solution":"Create a self-custodial Dapp where you create a smart contract Will, where your heirs can claim the Inheritance, or a recovery plan for your crypto. Inheritance firms will use it in real world.\n","proposer_name":"GenWealth","proposer_relevant_experience":"**Rafael Cardoso – Project Manager **- [https://www\\.linkedin\\.com/in/rafael\\-cardoso\\-2b03ba146/](https://www.linkedin.com/in/rafael-cardoso-2b03ba146/)\n\n\n\nProduct Creation and launch of  Will Easy, an online will creation app in the UK.\n\n- Product team, led team training, marketing campaigns, and business development to secure the first 20 clients and 5 partnerships with inheritance professionals.\n\nLaunched a Hospitality Team Management Software, securing the two largest pilot programs with over 80 restaurants.\n\nFounded Events Circle for Deep Funding (Decentralized AI Grants Program on Cardano), achieving:\n\n- 550% growth in event attendance.\n- Creation of Community Hubs to decentralize growth, resulting in 573 new contributors and a 66% increase in community members within 3 months.\n\nAt Emurgo Academy, led the creation of the Cardano DeFi Course.\n\n**Leo – Lead Developer** - [https://github\\.com/leo42](https://github.com/leo42) - [https://www\\.linkedin\\.com/in/holleman\\-leandros\\-90260a74/](https://www.linkedin.com/in/holleman-leandros-90260a74/)\n\n- 4+ years of blockchain development, full-stack experience in both front-end and back-end.\n- Lead developer for AnetaBTC V2, the largest wrapped BTC DApp on Cardano.\n- Developed KeyPact (Broclan) Multisig Wallet on Cardano.\n- Pioneered smart-wallet functionalities on Cardano, enabling self-custodial programmable wallets via smart contracts.\n- Operates the BSP Cardano Stakepool, with 957 delegators and over 28M ADA staked.\n- Elected Member of the Intersect Technical Steering Committee\n\n**Lia  – UI/UX Designer**\n\n- 9 years of experience in graphic design and UI/UX design.\n- Skilled in creating intuitive, user-friendly interfaces for Web3 applications and decentralized platforms.","url":null,"funds":200000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"V2 Inheritance Dapp for Web3 and the Real World - GenWealth ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"GenWealth","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":200000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":11,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"There is no safe, easy-to-use solution to leave your Crypto as an Inheritance or recover it if you lose the seedphrase, without putting your assets at risk.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Create a self-custodial Dapp where you create a smart contract Will, where your heirs can claim the Inheritance, or a recovery plan for your crypto. Inheritance firms will use it in real world.\n","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://genwealth.app","https://x.com/genwealth_app","https://whitepaper.genwealth.app/","https://www.youtube.com/watch?v=6nQiNY0wZwA","https://www.canva.com/design/DAG28K6xbHk/QSRT1-sLOEb2VGozgFYuHA/edit?utm_content=DAG28K6xbHk&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No Dependencies.  We have an internal team that will develop this solution","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"The Smart contracts developed under this proposal will be open source under GPL (GNU General Public License), which ensures any improvements to the code should be distributed in the same license, meaning they should be open source, and are prevented from being turned into proprietary software.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Financial Services","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"What solution do you use currently for Inheritance? What solution do you have for recovery?\n\n\n\nCurrently, we are missing a safe, easy-to-use solution on Cardano, that allows you to leave crypto as Inheritance or recover crypto if you lose the seed phrase. Our goal as GenWealth is to solve this problem for Cardano. We’ve built a first version of our solution on testnet: ([https://www\\.youtube\\.com/watch?v=6nQiNY0wZwA](https://www.youtube.com/watch?v=6nQiNY0wZwA) ), and tested it with crypto users and Inheritance professionals. \n\n\n\nFrom the feedback with testing, and from having a deeper understanding of the needs of users, we decided to change our architecture for a better product market fit, and also to allow for these Inheritance professionals to use our technology to manage real-world inheritance.\n\n\n\nWhile we do have competitors on other blockchains trying to solve the problem of Inheritance and recovery, we are the only ones working with smart contracts and closely collaborating with Inheritance firms, to turn this solution into a software professionals can use on a daily basis to manage real-world Inheritance more efficiently.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"Once this proposal is completed, you will have a Non-Custodial Crypto Inheritance Dapp on Cardano Testnet. You will be able to create a smart wallet, which you control from your own self-custodial wallet, and you have all the typical self-custodial wallet functionalities. \n\n\n\nHowever, on top of that, using smart contracts, you can create a will, specifying your beneficiaries, the share of the assets you want to leave them, or even specific assets you would like them to have. For beneficiaries, when the time comes and you’re no longer here, they connect the wallet and claim their share of the Inheritance, which is validated by the smart contract.\n\n\n\nAdditionally, you will have a section for recovery, where you can create a recovery plan using other wallets you control in case you ever lose the seed phrase.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Short- Term Impact\n\n- Deliver Front-end Prototype\n- Run Front-end usability tests (20 crypto users, 10 inheritance pros),\n- Validate core features, and identify high-impact UX improvements\n- Deliver working smart contracts with Crypto Inheritance and Recovery Capabilities.\n- Launch V2 Dapp on testnet\n\n\n\nLong-Term Impact:\n\n- Secure 1625M ADA (5% of 12.6B held in self-custody) with our Inheritance and Recovery Features\n- $14.4B in Bitcoin (2% of $707B held in self-custody) on Cardano with our Inheritance and Recovery Features\n- Potentially attract 742K  Bitcoin users (2% of 37.1M) to Cardano to use our Dapp for its non-custodial Inheritance features\n- Capturing 0.5% of $84T in global inheritance over 20 years could bring $420B in tokenized assets to Cardano, plus respective transaction volume.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Crypto inheritance doesn’t work, and the consequences are enormous.\n\nStories like Stefan Thomas, who lost access to $700 million in Bitcoin, are not rare. An estimated 20% of all Bitcoin supply is lost forever because users have no reliable way to recover crypto if they lose the seed phrase, or to leave it as an Inheritance without putting it at risk.\n\nThis is not just a Bitcoin issue. It affects every blockchain, including Cardano.\n\nAnd the scale of the problem is only growing:\n\n- $6 trillion in crypto will pass through inheritance in the next 20 years (VanEck).\n- $84 trillion in total assets will be inherited globally (Merrill Lynch).\n\nWithout effective solutions, billions or even trillions risk being lost or delayed for years in inefficient estate processes.\n\nGenWealth is here to fix this.\n\n**Our Solution**\n\nGenWealth is building a crypto inheritance and recovery DApp that lets users define their own rules for Inheritance and create a “Plan B” for crypto recovery.\n\nWe combine secure smart contracts with a simple interface to make inheritance safe, self-custodial, and accessible for everyone.\n\n**1\\. Blockchain\\-Based Wills**\n\nUsers can create a fully programmable on-chain will:\n\n- Add beneficiaries\n- Assign specific assets or percentages\n- Set inheritance rules\n- You have total freedom to use your assets while alive\n- Will is updatable to ensure your latest wishes are respected\n\nWhen the time comes, beneficiaries connect their wallet and claim their share.\n\nSmart contracts handle the rest: automatically, securely, and without intermediaries.\n\n**2\\. Smart\\-Contract Recovery \\(Plan B\\)**\n\nUsers can define:\n\n- “Safety wallets” for recovery.\n- An inactivity deadline\n\nIf you lose access to the seedphrase, you can regain control over your GenWealth smart wallet, all the assets, and the Will through a secure, self-custodial recovery process, based on smart contracts.\n\n**3\\. Designed with Professionals**\n\nWe tested the first version of GenWealth, which you can find here: [https://www\\.youtube\\.com/watch?v=6nQiNY0wZwA](https://www.youtube.com/watch?v=6nQiNY0wZwA)  with crypto users and inheritance firms.\n\nThese firms want to adopt GenWealth because today’s inheritance execution:\n\n- Costs with will execution represent 3–10% of the Total Inheritance.\n- Takes months to years to complete\n- Relies on outdated manual processes\n- GenWealth can cut these delays and reduce costs to around 1% while providing a more accurate, secure record of a person’s wishes.\n\n**Why This Proposal Matters**\n\nDuring testing, we discovered the need to redesign our architecture to support critical long-term features:\n\n- Executor permissions (professionals can create wills without ever touching assets)\n- Simplified DeFi integration\n- Modular smart-contract logic\n- Support for multi-chain expansion (Cardano → Bitcoin → others)\n\n\n\nInstead of pushing our early version to mainnet, we are building a future-proof architecture, that better suits Real World Inheritance Processes, and that is flexible enough to adapt to Inheritance Law in the different world jurisdictions. This flexibility, ensures that users or professionals can create legally compliant wills using our solution, and their knowledge.\n\n\n\nThis proposal funds the development of a complete, redesigned Dapp.\n\n\n\nWe will follow an approach of starting with the development of the front-end, which will allow us to:\n\n\n\n- Validate requirements with users and inheritance firms\n- Refine the UX\n- Refine the architecture before finalizing smart-contract development\n\n\n\nThe insights from testing will refine our smart contract development and the architecture to reach a stronger product-market fit.\n\n\n\nThis ensures we build the right system, one that users, lawyers, and regulators will trust for decades.\n\n\n\n**Why Cardano**\n\n\n\nCardano is the ideal foundation for inheritance:\n\n\n\n- Built using functional programming\n- Highly secure and deterministic\n- Over seven years of uninterrupted operation\n- A perfect fit for self-custodial financial applications\n- ISO 20022 compliant — the messaging standard banks use, important for integration with TradFi.\n\n\n\nInheritance is a trillion-dollar global industry, and Cardano is uniquely positioned tp become a crucial backbone for Inheritance Management and Execution. We just need to build it, and find the right product-market fit.\n\n\n\n**Our Smart Contract Architecture**\n\n\n\nGenWealth will deliver an open-source suite of smart contracts that mirror how inheritance works in the real world:\n\n\n\n- Create legally compliant wills on-chain\n- Assign specific assets and asset shares to beneficiaries\n- Enforce inheritance rules automatically\n- Support professional executors with specific permissions for their activity.\n- Enable safe crypto recovery\n- Allow fractionalization and advanced asset distribution\n\n\n\nThese contracts were designed with direct input from inheritance firms to ensure practicality in real-world estate management.\n\n\n\nThey will:\n\n\n\n- Reduce delays\n- Cut execution costs from 3–10% to ~1%\n- Provide a transparent, tamper-proof, user-controlled system\n- Become a core building block for other DApps on Cardano\n\n\n\n**Open Source and Community Benefits**\n\n\n\nWe chose an open-source approach so the entire ecosystem benefits:\n\n\n\n- Developers can audit, improve, and extend the contracts\n- Other DApps can integrate inheritance logic\n- The architecture can support broader asset management use cases\n- Security is strengthened through transparency\n- The community can help shape a key piece of Cardano infrastructure\n\n\n\nGenWealth becomes not just a product, but a foundation others can build on.\n\n\n\n**Our Vision**\n\n\n\nGenWealth is creating a unified inheritance ecosystem that serves:\n\n- \n- Everyday crypto users\n- Web3 communities (Cardano and Bitcoin first)\n- Inheritance firms, lawyers, and executors\n\n\n\nOur long-term mission is simple:\n\nMake inheritance and recovery safe, automatic, and universal.\n\n\n\nBy combining an intuitive front-end, a secure smart-contract suite, and integration with tokenized real-world assets, GenWealth will make Inheritance easy and efficient.\n\n\n\nThis proposal is one key step toward securing the future of inheritance on Cardano and bringing a trillion-dollar industry into the modern age.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**Short\\-Term**\n\n\n\nThis proposal builds the smart-contract foundation for legally compliant, self-custodial inheritance on Cardano.\n\n\n\n It enables GenWealth’s platform, allows other DApps to integrate inheritance features, and opens the door for inheritance firms to begin testing real-world use cases.\n\n\n\n**Medium\\-Term**\n\n\n\nGenWealth will launch a mainnet DApp that protects billions in user wealth.\n\n With ~$12.6B in self-custodied ADA at risk, securing even 20% means safeguarding $2.5B.\n\n If just 10% of Cardano wallets use GenWealth, that’s 480,000 users and more than 17M on-chain transactions, boosting network activity and adoption.\n\n\n\n**Long\\-Term**\n\n\n\nGenWealth expands to Bitcoin and the real world**\\.**\n\n\n\nWith $717B in self-custodied crypto at risk and $84T passing through global inheritance, even small market shares translate into tens of billions in protected assets and major tokenization flows.\n\n\n\n This positions Cardano as the blockchain powering secure, compliant, real-world financial processes.\n\n\n\n**Why It Matters**\n\n\n\nSupporting this proposal accelerates Cardano’s role in securing user wealth, driving large-scale tokenization, and making inheritance safe for everyone — in Web3 and beyond.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"GenWealth’s approach is grounded in practical validation and strong product–market fit.\n\nWe prioritize building the front-end first so we can test directly with crypto users and inheritance professionals, refine the user experience, and validate requirements before investing in complex smart-contract development.\n\nWe have already proven our ability to deliver.\n\nOur first DApp, built and launched on testnet, confirmed that decentralized inheritance and recovery works.\n\nIt allowed us to gather hands-on feedback from users and inheritance firms, shaping our new, future-proof smart contract architecture.\n\nOur development is led by Leandros Holleman, one of Cardano’s most capable engineers. His track record includes:\n\n- AnetaBTC V2 — the leading wrapped Bitcoin protocol on Cardano\n- KeyPact — an advanced multi-sign wallet solution\n- Pioneering work in smart wallet technology, a core component of GenWealth’s architecture\n\n\n\nOur team also includes members with direct inheritance industry experience, and we’ve conducted the legal research needed to ensure our solution is compliant in real-world estate processes.\n\n\n\nOn the business and execution side, GenWealth is supported by two major accelerators:\n\n- CV Labs Accelerator Program\n- Techstars Cardano Founder Project\n\n\n\nThese programs provide high-level mentorship, technical guidance, and go-to-market support, strengthening our ability to deliver a successful product.\n\nGenWealth is not starting from zero, we are following the best startup development practices, creating solutions and iterating with the feedback of real users and experts in the industry, to create solutions with product market fit.\n\nThis proposal continues that momentum with a clear, achievable path toward mainnet deployment, of a solution that benefits of all the learnings and feedback from previous iterations","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Creation of the Front-end","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"GenWealth has bootstrapped the development of our V2 screens, as our F14 proposal did not get funding. You can see the screens here: [https://framer\\.com/projects/GenWealth\\-App\\-\\-jHsxTCOt1Gon0w4W6Hjs\\-5OEeE](https://framer.com/projects/GenWealth-App--jHsxTCOt1Gon0w4W6Hjs-5OEeE)\n\n\n\nIn this phase, we will implement the code to create these screens, following the UI/UX designs created. Feedback gathered between the design and development phases will be incorporated to refine and optimize the final screens.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Code for all screens implemented, ensuring the following core functionalities:\n\n- Core wallet features – send, receive, and related operations\n- Will creation and inheritance management – including asset allocation and beneficiary setup\n- Crypto recovery workflows – enabling secure retrieval of assets in case of loss or inactivity","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Link to an environment with all the front-end pages developed where you can see all the created screens.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":28000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Launch Prototype Publicly","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"In this milestone, we will complete the following activities:\n\n\n\n- Develop a simulation prototype using React.\n- Conduct internal quality assurance testing and resolve identified bugs.\n- Prepare the necessary infrastructure to support deployment.\n- Launch the prototype to the public.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"We will deliver a public React environment that hosts interactive screens simulating the DApp’s core workflows. The simulation will enable stakeholders to access and test the Screens:\n\n- Core wallet features – send, receive, and related operations\n- Will creation and inheritance management – including asset allocation and beneficiary setup\n- Crypto recovery workflows – enabling secure retrieval of assets in case of loss or inactivity\n\n\n\nThe simulation will be deployed to a publicly accessible URL.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Link to the simulation where you can test the React prototype created in this milestone, that simulates the usage of the Dapp.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":28000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":" Testing Sessions with Crypto User and Inheritance Professionals","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"In this milestone, we will carry out the following work:\n\n\n\n- Define the process and requirements for Testing Sessions\n- Carry out 20 Testing Sessions with Crypto Users and Inheritance Professionals\n- Report summarizing user feedback, usability issues, and feature requests","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Document with Process and Requirement from Testing Sessions.\n\n\n\nRecordings or Notes from Each Individual User Testing Session\n\n\n\nFinal Report from the Feedback, and the conclusions we gathered from the 20 User Testing sessions","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Link to PDF with Process and Requirement from Testing Sessions\n\nLink to Google Drive with Notes or Recordings from individual testing sessions\n\nLink to PDF with Final Report","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":36000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Development of Inheritance and Recovery Smart Contracts ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"In this milestone, we will deliver our set of 7 modular smart contracts for our complete inheritance suite:\n\n**Smart Wallet Contract** – Implements core wallet functionalities fully managed through a smart contract, enabling secure and programmable asset management.\n\n**Minting Contract **– Contract for Minting your smart wallet and managing ownership permissions.\n\n**Host Config Contract** – Allows to configure ownership and plan B for crypto recovery, giving a set of other wallets permission to recover the smart wallet.\n\n**Attorney Contract **– Allows Smart Wallet Owner to set an attorney or an executor, along with clearly defined permissions for their role in managing the inheritance process.\n\n**Inheritor Contract** – A Contract that allows you to define beneficiaries and the share of the assets they should inherit.\n\n**Inheritance Asset List Contract** – Smart Contract that allows you to leave specific assets to beneficiaries\n\n**Fractionalization Contract** – Supports the division of NFTs and tokenized real-world assets (RWAs) into fractional shares, enabling compliance with inheritance laws and facilitating distribution among multiple beneficiaries.\n\nAll the contracts will undergo internal testing.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Deliver Open Source Aiken Smart Contract for Smart Wallet\n\nDeliver Open Source Aiken Smart Contract for Minting\n\nDeliver Open Source Aiken Smart Contract for Config Host Contract\n\nDeliver Open Source Aiken Smart Contract for Attorney Contract\n\nDeliver Open Source Aiken Smart Contract for Inheritor Contract\n\nDeliver Open Source Aiken Smart Contract for Inheritance Asset List Contract\n\nDeliver Open Source Aiken Smart Contract for Fractionalization Contract","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Link to GitHub with Smart Wallet Contract\n\nLink to GitHub with Minting Contract\n\nLink to GitHub with Config HostContract\n\nLink to GitHub with Attorney Contract\n\nLink to GitHub with Inheritor Contract\n\nLink to GitHub with Inheritance Asset List Contract\n\nLink to GitHub with Fractionalization Contract","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":9,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":87000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #5","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Offchain Code Development and Testnet Launch","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"In this milestone, we will deliver the off-chain code that connects the Front-end to the developed smart contracts, and launch our Dapp on the Cardano Testnet. Additionally we will deliver the final close out report and video for this proposal.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- GenWealth self-custodial Crypto Inheritance and Recovery Dapp is Live on Cardano Testnet for anyone to test\n- Final Close-out Report is Public and acessible to everyone\n- Final Close Out Video is Public and acessible to everyone","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to the GenWealth self-custodial Crypto Inheritance and Recovery Dapp is Live on Cardano Testnet \n- Link to Final Close Out Report \n- Link to Final Close Out Video","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":11,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":87000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Rafael Cardoso – Project Manager **- [https://www\\.linkedin\\.com/in/rafael\\-cardoso\\-2b03ba146/](https://www.linkedin.com/in/rafael-cardoso-2b03ba146/)\n\n\n\nProduct Creation and launch of  Will Easy, an online will creation app in the UK.\n\n- Product team, led team training, marketing campaigns, and business development to secure the first 20 clients and 5 partnerships with inheritance professionals.\n\nLaunched a Hospitality Team Management Software, securing the two largest pilot programs with over 80 restaurants.\n\nFounded Events Circle for Deep Funding (Decentralized AI Grants Program on Cardano), achieving:\n\n- 550% growth in event attendance.\n- Creation of Community Hubs to decentralize growth, resulting in 573 new contributors and a 66% increase in community members within 3 months.\n\nAt Emurgo Academy, led the creation of the Cardano DeFi Course.\n\n**Leo – Lead Developer** - [https://github\\.com/leo42](https://github.com/leo42) - [https://www\\.linkedin\\.com/in/holleman\\-leandros\\-90260a74/](https://www.linkedin.com/in/holleman-leandros-90260a74/)\n\n- 4+ years of blockchain development, full-stack experience in both front-end and back-end.\n- Lead developer for AnetaBTC V2, the largest wrapped BTC DApp on Cardano.\n- Developed KeyPact (Broclan) Multisig Wallet on Cardano.\n- Pioneered smart-wallet functionalities on Cardano, enabling self-custodial programmable wallets via smart contracts.\n- Operates the BSP Cardano Stakepool, with 957 delegators and over 28M ADA staked.\n- Elected Member of the Intersect Technical Steering Committee\n\n**Lia  – UI/UX Designer**\n\n- 9 years of experience in graphic design and UI/UX design.\n- Skilled in creating intuitive, user-friendly interfaces for Web3 applications and decentralized platforms.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Milestone 1 – Creation of the Front\\-End**\n\n\n\n**Tasks:**\n\nDevelop application screens based on final UI/UX designs\n\n\n\n**Cost Breakdown:**\n\nDeveloper: $4,500 × 2.5 months = $11 250\n\n\n\n**Salary Benchmark:**\n\nExperienced front-end developer average in Portugal : $5,300/month([https://www\\.shecodes\\.io/salaries/portugal/front\\-end\\-developer\\)](https://www.shecodes.io/salaries/portugal/front-end-developer))  → Our rate: $4,500 (15% below average)\n\n\n\n**Milestone 2 – Public Prototype Launch**\n\n\n\n**Tasks:**\n\n\n\nPrepare simulation prototype using React\n\nInternal QA testing & bug fixing\n\nInfrastructure setup & public launch\n\n\n\n**Cost Breakdown:**\n\n\n\nDeveloper: $5,000 × 2 months = $10,000\n\n\n\nProject Manager: $3,500 × 0.5 months = $1750\n\n\n\nTotal: $11,750\n\n\n\n\n\n**Salary Benchmark:**\n\nSenior Software Engineer (React) average in Portugal: $6,025/month ([https://www\\.payscale\\.com/research/PT/Job=Senior\\_Software\\_Engineer/Salary/5e7807e6/React\\.js\\)](https://www.payscale.com/research/PT/Job=Senior_Software_Engineer/Salary/5e7807e6/React.js)) → Our rate: $5,000 (17% below average)\n\n\n\nProduct Manager average: $4,170/month → Our rate: $3,500 (16% below average)\n\n\n\n**Milestone 3 – User Testing with Crypto Users & Inheritance Professionals**\n\n\n\n**Tasks:**\n\n\n\nDefine process & requirements for testing sessions\n\nConduct 25 sessions with crypto users and inheritance professionals\n\nProduce final feedback report with recommended changes\n\n\n\n**Cost Breakdown:**\n\n\n\nDeveloper: $5,000 × 1 months = $5,000\n\n\n\nProject Manager: $3,500 × 2 months = $7,000\n\n\n\nTester incentives: $100 × 25 testers = $2,500\n\n\n\nTotal: $14,500\n\n\n\n**Competitive rate for the development of this smart contract suite:**\n\n\n\nThe average Web3 developer salary in Portugal is $8,750 per month ([https://web3\\.career/web3\\-salaries/portugal\\)\\.](https://web3.career/web3-salaries/portugal).) We have secured an above-average developer for a highly competitive rate of $7,000 per month, which will be used for our cost calculations.\n\n\n\n**Milestone 4 – Modular Open Source Contracts Development **\n\n\n\n**Deliverables: **Development, testing, and documentation of 7 smart contracts: the Smart Wallet Contract, Minting Contract, Host Config Contract, Attorney Contract, and Inheritor Contract.\n\n\n\n**Duration**: 5 months\n\n\n\n**Cost: **5 × $7,000 = $35,000\n\n\n\n**Milestone 5 – Offchain Code Development and Testnet Launch**\n\n\n\n**Deliverables: **Development of off-chain code and launch of the Dapp on Testnet.\n\n\n\n**Duration:** 2 months\n\n\n\nCost: 2 × $7,000 = $14, 000\n\n\n\n**Total USD:** $86,500\n\n\n\nCurrent ADA price (at time of writing): $0.40\n\n\n\n**Total in ADA: **200,000 ADA\n\n\n\nGenWealth has the funds to cover the slight difference between the current price of ADA and the overal cost of the proposal. Any appreciation in the price of ADA, will be invested in the development of this solution.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Our proposal delivers high-impact functionality at a cost far below market rates, thanks to an experienced team and efficient development approach. For a relatively small budget, Cardano gains a solution addressing one of the largest upcoming global transitions:\n\n\n\n- $6 trillion in crypto and $84 trillion in total assets will pass through inheritance in the next 20 years.\n\n\n\nGenWealth positions Cardano at the center of this massive opportunity.\n\n\n\nWe have already built a V1 of our Dapp, and we've initiated the process of building this V2 that better aligns with market needs and provides the technical flexibility to adapt to different inheritance jurisdictions in a compliant manner.  \n\n\n\nThis proposal accelerates the next stage: a full-featured DApp that connects real users, both Web3 and traditional inheritance firms, to Cardano.\n\n\n\n**Why This Is High Value for Cardano**\n\n\n\n- Real-world adoption: Inheritance firms using GenWealth will tokenize real-world assets directly on Cardano, bringing significant RWA volume on-chain.\n- New on-chain activity: Will creation, asset tokenization, ownership transfers, and contract updates generate continuous transactions.\n- Institutional engagement: Estate planners and legal professionals begin interacting with Cardano infrastructure, extending Cardano beyond typical crypto use cases.\n\n\n\n**Strong Incentives for Adoption**\n\n\n\n- Web3 Users: A simple, wallet-like interface with powerful recovery and inheritance features, enhancing security without adding complexity.\n- Inheritance Firms: Immutable records, easier updates, faster execution, and drastically reduced costs (currently 3–10% of estate value).\n\n\n\nIn Short, supporting this proposal means backing a low-cost, high-impact solution that solves a critical problem in crypto (inheritance & recovery) and modernizes real-world inheritance processes, bringing real-world assets, institutions, and long-term utility to Cardano.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Financial Services","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1790}