{"pr_id":"019ac286-8692-7410-886e-6b7919d79826","title":"Liquidation as a Service on Cardano","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"DeFi protocols lack a unified, reliable liquidation system, causing slow liquidations, fragmented liquidity, and increased risk of bad debt.","solution":"Liquidation Market provides a plug-and-play engine that monitors positions and automates secure, efficient liquidations for DeFi platforms, replacing custom in-house systems.","proposer_name":"Samir Idris","proposer_relevant_experience":"Samir Idris - Experienced Aiken Smart contract developer and Full Stack Developer; GitHub: [https://github\\.com/scisamir/](https://github.com/scisamir/)\n\n\n\nAbdulrauf Yahaya - Full Stack Developer and Cardano Blockchain Engineer; GitHub: [https://github\\.com/AbYahaya](https://github.com/AbYahaya)","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Liquidation as a Service on Cardano","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Samir Idris","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"DeFi protocols lack a unified, reliable liquidation system, causing slow liquidations, fragmented liquidity, and increased risk of bad debt.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Liquidation Market provides a plug-and-play engine that monitors positions and automates secure, efficient liquidations for DeFi platforms, replacing custom in-house systems.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://drive.google.com/file/d/1Gy963l2YmCOF3z6VGR4qtzUupsv9-Jo3/view?usp=sharing"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"MIT License; Yes, they will be released as open source","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Infrastructure","group":"Development & Tools"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Liquidation market is an infrastructural protocol that provides automated and efficient liquidation execution for lending, borrowing, derivatives, and leverage trading platforms in decentralized finance (DeFi). Instead of each protocol building its own liquidation logic, Liquidation Market or LaaS offers a plug-and-play module that continuously monitors user positions, detects undercollateralized positions, and executes liquidations reliably, securely, and with optimal capital efficiency.\n\nIn essence, LaaS is a liquidation engine-for-hire that other DeFi platforms integrate to offload risk management.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"**How Liquidation\\-as\\-a\\-Service Works \\(Top\\-Level\\)**\n\n\n\n**High\\-Level Flow:**\n\n1. User opens a leveraged/borrow position on Protocol A\n2. Protocol A integrates LaaS via a liquidation adapter contract\n3. LaaS continuously monitors user risk\n4. When HF < 1, LaaS triggers liquidation\n5. Liquidator bot or liquidity pool pays off debt\n6. Collateral+premium is seized and redistributed to LaaS liquidity providers.\n7. Protocol A remains solvent\n\n\n\n**What the product \\(LaaS\\) Provides**\n\ncontinuously tracks:\n\n- Collateral and debt values\n- Oracle price feeds\n- Volatility and price deviations\n- Health factor of every position\n\n\n\nIt uses off-chain indexers or on-chain notifiers to detect risks faster than traditional on-chain\n\nbots.\n\n\n\n**Automated Liquidation Execution**\n\nOnce a position becomes unsafe in any integrated defi protocol, our liquidator bot:\n\n1. Verifies oracle prices and risk parameters\n2. Calculates liquidation amount\n3. Executes the liquidation transaction\n4. Collects incentives (bonuses, penalties)\n5. Repays debt on behalf of the protocol\n\n\n\nThe system ensures fast execution even during high congestion or volatility.\n\n\n\n**LaaS can support:**\n\n- Lending protocols\n- Stablecoin platforms\n- Leverage protocols\n- Perp DEXes\n- Options vaults\n\nAnd many other CDP based protocols that are liquidatable\n\n\n\nIt becomes a standardized liquidation back-end for multiple DeFi products across the\n\necosystem. So users don’t have to deploy capital in different protocols but deploy a single\n\ncapital in a single platform but earn liquidation premiums/bonuses across multiple protocols.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"**Realistic Measures of Success for Liquidation Market**\n\n\n\nSuccess for LaaS can be measured by protocol adoption, operational efficiency, and ecosystem impact using a small set of on-chain metrics.\n\n\n\n**Key Metrics**\n\n\n\n1. Protocol Adoption\n\n\n\n- Number of DeFi platforms integrated with LaaS\n- Total value of positions under monitoring (TVL)\n\n\n\n2. Operational Efficiency\n\n\n\n- Number of successful liquidations executed\n- Average liquidation execution time from Health Factor <1\n\n\n\n3. Liquidity Provider Performance\n\n\n\n- Total capital deployed in LaaS liquidity pools\n- Average liquidation rewards distributed to liquidity providers\n\n\n\n4. Risk Mitigation\n\n\n\n- Number or percentage of positions liquidated before going into bad debt\n- Protocol solvency preserved for integrated platforms\n\n\n\nThese metrics provide transparent, verifiable proof of LaaS effectiveness while keeping tracking manageable. They focus on adoption, efficiency, capital utilization, and risk reduction, capturing the core value delivered by the protocol.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"The proposed solution is Liquidation Market (LaaS), a plug-and-play, infrastructure-level liquidation engine for DeFi protocols. LaaS continuously monitors user positions across multiple integrated platforms, tracks collateral and debt values, observes oracle prices, and calculates health factors in real time. When a position becomes undercollateralized, LaaS automatically executes the liquidation, repays the debt, and distributes the seized collateral and liquidation premium to liquidity providers.\n\n\n\nThis solution directly addresses the problem in several ways:\n\n\n\n**Unified and Standardized Liquidation System:** By serving multiple protocols through a single backend, LaaS eliminates fragmented liquidation infrastructure.\n\n\n\n**Faster and Reliable Execution:** Continuous monitoring and automated liquidations ensure positions are closed before they become bad debt, even during periods of high network congestion or market volatility.\n\n\n\n**Capital Efficiency and Liquidity Optimization:** Liquidity providers can participate once and earn liquidation premiums across multiple protocols, improving capital deployment and reducing the need for separate liquidity in each platform.\n\n\n\n**Reduced Protocol Risk:** By outsourcing liquidation to a reliable, monitored system, integrated protocols can maintain solvency and focus on product development rather than building and maintaining their own liquidation engines.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Liquidation Market (LaaS) will provide a reliable, standardized, and automated liquidation infrastructure for DeFi protocols built on Cardano. By offering a shared backend for lending platforms, stablecoins, leverage trading, and derivatives protocols, LaaS strengthens the security, reliability, and efficiency of the Cardano DeFi ecosystem.\n\n\n\nSome of the benefits it provides:\n\n\n\n**Improved Protocol Safety**\n\nBy ensuring fast and accurate liquidations, LaaS reduces the risk of bad debt and insolvency, protecting users’ funds and enhancing trust in Cardano-based DeFi platforms.\n\n\n\n**Capital Efficiency**\n\nLiquidity providers can participate once and earn liquidation incentives across multiple protocols, maximizing capital utilization and incentivizing broader liquidity participation on Cardano.\n\n\n\n**Ecosystem Standardization**\n\nLaaS provides a unified liquidation solution, reducing fragmentation and enabling new projects to integrate quickly without building custom liquidation engines. This fosters faster innovation and onboarding of new protocols.\n\n\n\n**Enhanced User Experience**\n\nBy automating liquidations, LaaS reduces delays and operational failures, providing a smoother, more predictable experience for users interacting with Cardano DeFi platforms.\n\n\n\n**Community Growth and Adoption**\n\nA reliable liquidation infrastructure encourages more developers to build on Cardano, driving adoption, increasing TVL, and expanding the overall DeFi ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our team has extensive experience in blockchain and DeFi development, including smart contract engineering, protocol integration, and risk management. We are familiar with Cardano’s Plutus smart contracts (using Aiken), decentralized finance best practices, and security standards. This ensures that Liquidation Market (LaaS) will be implemented with robust, secure, and efficient architecture.\n\n\n\nWe will maintain high levels of trust and accountability through:\n\n\n\nOpen-source components: Key contracts and monitoring logic will be auditable by the community.\n\n\n\nTransparent on-chain operations: All liquidations, collateral tracking, and reward distributions are executed on-chain and can be independently verified.\n\n\n\nRegular audits: We will engage external security firms to review smart contracts and system integrations before deployment.\n\n\n\nGovernance and reporting: Protocol parameters, fees, and liquidator incentives will be transparent, with clear reporting on performance metrics.\n\n\n\nValidation of the App\n\nLaaS will be validated through:\n\n\n\nTestnet deployment: Simulating liquidations on realistic test scenarios with multiple protocols and varying market conditions.\n\n\n\nOn-chain metrics tracking: Measuring liquidation execution speed, collateral recovered, and LP rewards to ensure effectiveness.\n\n\n\nCommunity beta testing: Partnering with early Cardano DeFi protocols to test real-world integration before mainnet rollout.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Development and Internal Testing","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Complete core liquidation engine including adapter contracts, liquidator logic, reward distribution system, and monitoring modules. Comprehensive unit tests and simulation scripts for multiple DeFi scenarios included.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All aiken smart contracts compile successfully without errors, pass extensive unit and integration tests, and demonstrate successful liquidation simulations across multiple hypothetical market conditions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Verified GitHub repository containing all smart contracts, unit test results, simulation logs, and detailed developer documentation proving functionality and correctness.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Testnet Deployment and Validation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"LaaS fully deployed on Cardano testnet, integrated with early partner protocols. On-chain metrics tracking liquidation execution, health factor monitoring, and LP reward calculations implemented for validation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Successful execution of all testnet liquidations across multiple integrated partner protocols, with accurate calculation and distribution of liquidation rewards, continuous monitoring of health factors, full resolution of any issues identified during testing, and demonstration of reliable performance under varying simulated market conditions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Verified on-chain testnet transactions, metric dashboards, integration reports from partner protocols, and test documentation demonstrating proper functioning and performance optimization.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Mainnet Launch and Ecosystem Integration","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Fully audited smart contracts deployed on Cardano mainnet. Active liquidity pools for LPs, automated liquidation operations running, additional protocol integrations completed, and transparency reporting system implemented.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"All mainnet liquidations execute accurately and reliably across integrated protocols under real market conditions, with precise calculation and distribution of LP rewards, successful integration of additional DeFi protocols, full implementation of all external audit recommendations, and demonstration of consistent system performance, security, and transparency through on-chain metrics and dashboards.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Verified mainnet transactions, audit reports, operational on-chain dashboards, and public transparency reports demonstrating live liquidations, reward distribution, and protocol integrations.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Project Close-out Report and Video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"A comprehensive final project report documenting the design, development, deployment, and validation of LaaS, including all on-chain metrics, liquidation performance data, LP reward distributions, protocol integrations, lessons learned, and next steps. A 2-3 minute professional video demonstrating the system in action, highlighting key features, performance, and ecosystem impact.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The project close-out report clearly summarizes all milestones, on-chain metrics, and KPIs, demonstrating successful development, testnet validation, and mainnet operations. The video effectively communicates LaaS functionality, shows live liquidation events or simulations, and is suitable for public presentation to the Cardano community and Catalyst reviewers.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Final report submitted as a PDF or web-accessible document including charts, screenshots, and detailed metrics. Video uploaded to a public or private link with demonstration of system features, performance data, and integration highlights. Feedback from internal review or pilot partners confirming accuracy and completeness.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Samir Idris - Experienced Aiken Smart contract developer and Full Stack Developer; GitHub: [https://github\\.com/scisamir/](https://github.com/scisamir/)\n\n\n\nAbdulrauf Yahaya - Full Stack Developer and Cardano Blockchain Engineer; GitHub: [https://github\\.com/AbYahaya](https://github.com/AbYahaya)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"The total budget for the Liquidation Market (LaaS) project is 60,000 ADA, allocated across four key milestones.\n\n\n\nMilestone 1: Development and Internal Testing is allocated 20,000 ADA to cover the development of the core liquidation engine, including adapter contracts, liquidator logic, reward distribution systems, and monitoring modules, as well as comprehensive unit testing and simulation of liquidations across multiple DeFi scenarios.\n\n\n\nMilestone 2: Testnet Deployment and Validation is allocated 15,000 ADA to support deployment on the Cardano testnet, integration with early partner protocols, tracking and validating on-chain metrics for liquidation performance and LP rewards, performance optimization, and resolution of any issues identified during testing.\n\n\n\nMilestone 3: Mainnet Launch and Ecosystem Integration receives 25,000 ADA for the deployment of fully audited contracts on the Cardano mainnet, activation of liquidity pools, execution of live liquidations, integration with additional DeFi protocols, and preparation of transparency reports.\n\n\n\nMilestone 4: Project Close-out Report and Video does not require additional funding, as it involves preparing a detailed final project report and a 2–3 minute video demonstrating the system’s functionality.\n\n\n\nThe budget also covers all necessary resources, including smart contract developers, back-end engineers for monitoring and liquidator bots, front-end developers for dashboards, external audits, testnet infrastructure costs, and documentation and reporting.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The total budget of 60,000 ADA represents strong value for money for the Cardano ecosystem because it supports the development of a shared infrastructure service that benefits multiple DeFi protocols rather than a single platform. By investing in LaaS, Cardano gains a reliable, standardized, and automated liquidation engine that enhances protocol security, reduces the risk of bad debt, and increases trust in the ecosystem.\n\n\n\nThe allocation is focused on core development, rigorous testing, secure mainnet deployment, and audit processes, ensuring that funds are spent on delivering a high-quality, robust system. By providing liquidity providers with the ability to earn rewards across multiple protocols, the project maximizes capital efficiency and ecosystem participation without requiring duplication of infrastructure.\n\n\n\nAdditionally, the project includes transparent reporting, dashboards, and a demonstration video to provide measurable evidence of outcomes, making the spending auditable and accountable. For the Cardano community, this investment translates into safer, more efficient DeFi protocols, greater adoption, and a foundation for future innovations, delivering lasting ecosystem value that extends well beyond the initial expenditure.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Infrastructure","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1792}