{"pr_id":"019ac1b7-ae18-7fa1-82a6-1c68c34cf457","title":"[MIDN]  Hydra Scaling to Midnight Privacy - For The Masses","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"The technical friction of Cardano's evolution (from Hydra to Midnight) currently lacks short,  hindering the accessible, mass-market on-ramp required to engage and educate the next billion users.","solution":"AI-accelerated adaptation of \"Cardano For The Masses\" into viral short-form educational content for mass dissemination, utilizing an autonomous AI presenter.","proposer_name":"Hoan Le","proposer_relevant_experience":"**Hoan Le : Technical Lead & Support Management **\n\n\n\nExpertise: IT Engineer from [FPT](https://fptsoftware.com/)(a leading technology university and company in Vietnam), with deep expertise in technology.\n\n\n\nRole: Technical Oversight & Support Team Management. Hoan Le is responsible for the technical specialty and overall management of the support team, ensuring smooth project execution. This role includes evaluating and integrating AI video generation tools, managing production pipelines, and guaranteeing the technical quality of the video outputs.\n\n\n\nTelegram : @Dukee9999\n\n\n\n**Nguyen Tuan Anh \\- Media Lead & Content Producer ** \n\n\n\nSkills: Freelancer CamOp (Camera Operator) in the film industry, Content Creator, and Video Producer, with 4 years of experience as a YouTube and TikTok editor in the Crypto space. He has experience collaborating with top Vietnamese football teams to create viral videos on TikTok about sports and fashion.\n\n\n\nResponsibilities: Creating engaging, visual short video content formats and optimizing them for TikTok. He is primarily responsible for using AI tools to generate videos, ensuring smooth graphics, accurate lip-syncing, and viral effects.\n\n\n\nCrypto: [https://www\\.tiktok\\.com/@tkventuresvn](https://www.tiktok.com/@tkventuresvn)\n\n\n\n\n\n\n\n[Sports Content](https://www.tiktok.com/@venesto.2022/video/7352171581042412808?is_from_webapp=1&sender_device=pc&web_id=7354205701403231760)\n\n\n\n[Fashion Content](https://www.tiktok.com/@venesto.2022/video/7287027392613272834                     https://www.tiktok.com/@venesto.2022/video/7312833289709047047)\n\n\n\nContact: [X](https://twitter.com/nguyen_fx/likes) - Telegram: Ciigi_01,\n\n\n\n\n\nThe combined expertise of Nguyen Tuan Anh and Hoan Le is uniquely suited to this AI-powered media project. Tuan Anh's four years of crypto media experience and proven ability to create viral content directly guarantee high TikTok engagement and mass appeal. Hoan Le, with his strong FPT technical foundation, ensures seamless AI tool integration, robust workflow, and high-quality output control. This blend of viral creativity and technical feasibility ensures the project delivers the most effective, technically sound educational product. Their deep commitment to the Cardano ecosystem reinforces their determination to deliver the best possible outcome.","url":null,"funds":45000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"[MIDN]  Hydra Scaling to Midnight Privacy - For The Masses","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Hoan Le","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":45000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":3,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"vi","sub_fields":null},{"ref":"#/definitions/singleLineHttpsURLEntry","title":"Original Document Link","description":"Provide a link to the original proposal document in its original language","format":null,"answer":"https://x.com/CardanoBook","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"The technical friction of Cardano's evolution (from Hydra to Midnight) currently lacks short,  hindering the accessible, mass-market on-ramp required to engage and educate the next billion users.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"AI-accelerated adaptation of \"Cardano For The Masses\" into viral short-form educational content for mass dissemination, utilizing an autonomous AI presenter.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://x.com/CardanoBook","https://app.heygen.com/signup","https://www.minimax.io","https://lovo.ai/","https://labs.google/flow/about"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"no dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Yes. The project will publicly disclose the source code for any automation processes (if applicable) and the scripts/AI algorithms used to create the videos . This encourages community contribution, enhances transparency, and allows other developers to learn from, customize, or build upon the project's solution.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Social Media","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Targeting & Outreach: We target the Vietnamese Cardano community and the next billion users seeking accessible crypto education. We reach them by creating AI-accelerated viral short-form videos optimized for YouTube and TikTok. Distribution is maximized through our massive existing community channels (Telegram, X), ensuring immediate, low-cost dissemination.\n\n\n\nWhy it Matters: This project addresses the technical friction of Cardano's evolution (from Hydra to Midnight). By providing crucial privacy education via the 'For The Masses' format, we build the essential educational infrastructure needed for successful mass onboarding and adoption.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"The project is structured around 3 milestones to produce 9 high-quality videos in 3 months. Key activities include:\n\n\n\nAI System Setup: Selecting, registering, and establishing the complete AI-powered video production workflow using specialized tools (e.g., ElevenLabs, Pika Labs).\n\n\n\nContent Production: Researching, scripting, and producing 9 videos covering core concepts, DUST/NIGHT tokens, and advanced features (ZKP, Minotaur Consensus).\n\n\n\nDissemination: Launching the content on YouTube and leveraging our large established community channels for immediate, massive reach.\n\n\n\nReporting: Submitting comprehensive milestone reports, tracking progress, and managing project adherence.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"Success is measured by verifiable production output, quality, and community impact:\n\n\n\nProduction: Successful completion and publishing of 9/9 high-quality, 3-5 minute videos on the project’s YouTube channel within 3 months.\n\n\n\nQuality: All videos must meet the high standards for visual/audio quality, confirming the successful implementation of the AI-accelerated workflow.\n\n\n\nReach & Engagement: Demonstrated successful content dissemination through verifiable posts across our large community channels (Telegram, X).\n\n\n\nAccountability: Timely submission of comprehensive project reports, providing clear evidence of completion for each milestone.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**Problem Statement, Rationale, and Approach**\n\n\n\n\n\nThe Cardano ecosystem is developing strongly, but accessing and deeply understanding complex concepts such as UTXO, Plutus, Hydra, or Voltaire remains a major barrier for general users, especially newcomers. The book &quot;Cardano For The Masses&quot; has been translated into Vietnamese to address the lack of easily digestible materials. However, in the current digital era, users' attention spans are shrinking, and long-form content formats like books or traditional podcasts are no longer engaging enough to rapidly and widely disseminate knowledge to billions of potential users.\n\n\n\n\n\nThe core issue is the &quot;indigestibility&quot; of technical and academic information in a world that prioritizes short, visual, and highly entertaining content. Although there have been efforts in translation and adaptation to podcasts, truly &quot;bringing Cardano to the masses&quot; requires a more groundbreaking approach, suitable for modern content consumption trends. Platforms like TikTok have proven the extraordinary viral power of short video content, capable of reaching all ages and social strata. However, producing high-quality videos with smooth presenters and engaging graphics requires significant traditional resources and costs.\n\n\n\n\n\nThe project's approach is to maximize the power of Artificial Intelligence (AI) to transform the core content from the book &quot;Cardano For The Masses&quot; into a series of short videos, featuring an AI presenter and vivid graphics, optimized for the TikTok platform. Utilizing advanced AI tools like HeyGen, LipDub AI, Vozo AI, Adobe Firefly, simpleshow will allow the creation of videos with an MC capable of natural lip-syncing, smooth graphics, and appealing visual effects, turning complex concepts into easily understandable and engaging content . Tools such as OpusClip and Klap will further support optimizing these videos for TikTok's format and algorithm, ensuring strong viral potential.\n\n\n\n\n\n**Who The Proposal Attracts**\n\nThis proposal will attract a large audience, especially those new to or just beginning to engage with Cardano:\n\n- New Users &amp; Gen Z: Individuals who prioritize short, visual, and easily understandable content on social platforms like TikTok.\n- Existing Cardano Community: Those who want an effective tool to introduce Cardano to friends, family, or newcomers.\n- Educators &amp; Influencers: Can use these videos as supplementary material or a source of inspiration for creating their own educational content.\n- Investors &amp; Analysts: Can quickly grasp the core concepts of Cardano in a concise manner.\n\n**Impact of the Solution**\n\nThe project &quot;AI-Powered Cardano For The Masses: Video Shorts for Global Education&quot; will bring profound and specific impacts:\n\n- Effective Mass Education: Transforms Cardano's complex concepts into &quot;snackable&quot; content, helping millions of new users access and understand the ecosystem quickly and engagingly.\n- Increased Cardano Brand Awareness: Brings Cardano to a vast new audience on TikTok, a platform with global reach, enhancing the ecosystem's awareness and image.\n- Fostering Adoption &amp; Participation: When knowledge is widely accessible and easy to understand, it encourages more people to engage in Cardano activities, from using DApps to participating in governance voting.\n- Creating a New Educational Model: Pioneers the use of AI to produce large-scale, cost- and time-effective blockchain educational content, opening new avenues for knowledge transfer in the future.\n\n**Uniqueness of the Solution**\n\nThe uniqueness of the solution lies in the groundbreaking combination of advanced AI technology, high-quality educational content from the &quot;Cardano For The Masses&quot; book, and a strategy focused on the TikTok platform.\n\n- AI-Powered MC &amp; Smooth Graphics: More than just simple animation, the project uses AI to create an MC with natural lip-syncing ability and smooth motion graphics, providing a professional and engaging viewing experience superior to traditional educational videos.\n- Optimized for TikTok: Videos are specifically designed for the short format (2-3 seconds) and TikTok's algorithm, utilizing tools like OpusClip and Klap to maximize virality and interaction, turning technical content into a trend.\n- Core Content from Trusted Source: The project does not create new content but distills the essence from the already translated and vetted &quot;Cardano For The Masses&quot; book, ensuring the accuracy and depth of the knowledge.\n- Leveraging Existing Community: The proposer already has a solid community foundation with tens of thousands of active members on Telegram and X. This ensures that the videos have a large potential user base immediately upon launch, helping to spread the impact naturally and effectively.\n\n**Why the Achieved Result is Important for Cardano**\n\nThe success of this project carries strategic significance for the development and sustainability of the Cardano ecosystem:\n\n- Expanding Global Reach: TikTok is one of the platforms with the largest user base globally, especially among the youth. Reaching this demographic will help Cardano expand its influence beyond the existing community, attracting the next generation of users and developers.\n- Democratizing Knowledge: By transforming complex knowledge into easily accessible content, the project helps democratize information about Cardano, lowering the barrier to entry and encouraging more diverse participation.\n- Enhancing Competitive Position: In the context of fierce competition among blockchains, the ability to creatively, effectively, and popularly convey its message will create a significant competitive advantage for Cardano, attracting attention from investors, developers, and new users.\n- Strengthening the Network Effect: A better-educated community will be more active in building, using, and promoting Cardano, creating a positive feedback loop that drives sustainable innovation and growth for the entire ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**The project Hydra Scaling to Midnight Privacy \\- For The Masses   will not start from zero\\.**\n\n\n\nThis is the continuation of a long-term process, full of effort and dedication that has been proven through action. The project is committed to utilizing the credibility, experience, and established platforms to maximize its impact.\n\n\n\n**Solid Foundation and Established Community Value**\n\n\n\nThe activities of the proposer over the years have created a solid foundation, demonstrating trust and outreach capabilities.\n\n\n\n**Personal Credibility and Core Community:** Maintaining and developing the Telegram group [StakingADA 3 with over 3,000 members](https://t.me/StakingADA/1) is evidence of the ability to build a quality community, gathering experienced investors and SPOs. This is not just a discussion group but a \"family\" where trust is built. \n\n\n\n\n\n**Media Potential and Influence: **The time spent working with the largest and most reputable Vietnamese crypto Telegram and YouTube channel, which has 65,000 active members, demonstrates the ability to reach a large number of crypto users, extending beyond the current Cardano community. This ensures the project has a strong communication channel to attract new users.\n\n\n\n**Long\\-term Commitment: **The long-term dedication is further demonstrated by having many followers. The spread of value for Project Catalyst has helped build strong trust and support from the community, which will generate a powerful ripple effect when this project is introduced.\n\n\n\n**Project Outputs and Measurement Methods**\n\nThe project will generate specific outputs, measured by clear metrics, reflecting the real value delivered to the community.\n\n\n\nOutputs:\n\n\n\nAI-powered Short Video Series with MC on TikTok: High-quality videos featuring a natural lip-syncing MC and vivid graphics,  posted periodically on the project's TikTok channel.\n\n\n\nContent Scripts: Detailed scripts for each video, distilled knowledge from the \"Cardano For The Masses\" book.\n\n\n\nProcess Documentation: Guidance on the AI video production workflow","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**Reliability and High Commitment**\n\n\n\nThe project team is built on a foundation of trust and long-term practical experience within the Cardano ecosystem. The core leadership leverages established expertise gained from successfully executed [Project Catalyst\\-funded initiatives \\(e\\.g\\., Fund 11\\)\\.](https://milestones.projectcatalyst.io/projects/1100053) This experience demonstrates the capacity for transparent planning, rigorous execution, and meeting the stringent reporting requirements of decentralized governance.\n\n\n\nCrucially, this project benefits from the active collaboration and support of the proposers who successfully delivered the previous highly impactful educational project. Furthermore, the feasibility is significantly enhanced because the foundational knowledge and operational model stem from the open-source nature of that prior success, providing a proven blueprint for implementation.\n\n\n\nThe team's dedication is evident through many years of active participation in large communities : [Telegram group](https://t.me/StakingADA/1)and other media channels - even before Catalyst emerged. This long-standing commitment, coupled with the strong endorsement and support from the community and the original author—due to the reputation of the past successful delivery—ensures sustained momentum and trust for the development of the Cardano ecosystem. Every team member has a specific, well-defined role, guaranteeing close monitoring at every stage.\n\n\n\n\n\n**Feasibility Verification: Planning to Test the Approach**\n\n\n\nThe method of utilizing AI to create videos featuring a presenter and smooth graphics is not only groundbreaking but highly feasible, thanks to the team's existing experience and capacity. The experience of translating the book and adapting content to a podcast on the [YouTube channel](https://www.youtube.com/@taichinh-taman5516) has demonstrated the team's ability to convert complex content into an easily digestible format for the community. This process will be similarly applied, replacing manual steps with AI tools to optimize efficiency.\n\n\n\nThe team will conduct a series of initial tests (Proof of Concept) using free or low-cost AI tools such as HeyGen, LipDub AI, Vozo AI, Adobe Firefly, and simpleshow to evaluate the quality and effectiveness of the models for generating lip-syncing presenters, graphics, and effects. Tools like OpusClip and Klap will also be tested to optimize for TikTok. This verifies the feasibility of the approach before moving into mass production.\n\n\n\n**Current Capacity: Experience and Suitability Rationale**\n\nThe project team possesses a comprehensive skillset, ranging from blockchain expertise and community communication to professional content production.\n\n\n\n**Specific Team Suitability:**\n\n\n\n**Hoan Le :** Technical Lead / IT Engineer: : [As an IT Engineer](https://fptsoftware.com/)  with extensive technology experience and the leader of the technical support team, Hoan Le is ideally suited to oversee the project's core technical challenge: the AI implementation. He will be responsible for evaluating and selecting the most appropriate AI tools, ensuring the video output meets high project standards and confirming the overall technical feasibility of the AI-powered workflow.\n\n\n\n**Nguyen Tuan Anh :** Content Producer / Media Lead: :[With 4 years of experience as a YouTube and TikTok editor in the Crypto field,](https://www.tiktok.com/@tkventuresvn) Nguyen Tuan Anh brings the necessary expertise in crafting engaging content and optimizing for viral distribution. His background in creating viral videos for major football teams ensures that the complex technical content from the \"Cardano For The Masses\" book will be transformed into visually appealing and highly attractive short videos, addressing the critical need for \"snackable\" information.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Content Expansion & TikTok Interaction Optimization","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"In the first month, the project will focus on building the technical foundation and producing the initial short videos, affirming the feasibility of the AI-powered methodology:\n\n\n\nAI Tool Setup: Completion of selection, registration, and setup of specialized AI tools for MC lip-syncing, graphics, and short video optimization (e.g., HeyGen, OpusClip, Klap).\n\n\n\nWorkflow Creation: Establishment of the complete short video production workflow, from distilling \"Cardano For The Masses\" content and scriptwriting to AI production, post-production, and final deployment on TikTok.\n\n\n\nScript Finalization: Completion of detailed scripts for the initial 15 short videos, focusing on the most fundamental and engaging Cardano concepts from the book.\n\n\n\nVideo Deployment: Production and posting of the 15 completed videos on the project's new TikTok channel to begin building content and attracting viewers.\n\n\n\nOfficial Announcement: Formal announcement of the project's launch and TikTok channel across established, reputable community channels (including the large-subscriber [YouTube channel](https://www.youtube.com/@taichinh-taman5516)and the major [Vietnamese stake pool Telegram group](https://t.me/StakingADA/1)).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Necessary AI tools are registered and operational, demonstrating the capability to generate MC lip-syncing and smooth graphics.\n\n\n\nAt least 15 complete short video scripts have been team-approved, distilled from the content of the \"Cardano For The Masses\" book.\n\n\n\n15 initial short videos have been successfully produced and posted on the project's TikTok channel.\n\n\n\nEach video is 2-3 seconds long, exhibits professional image and sound quality, and features a natural lip-syncing MC.\n\n\n\nProject launch is announced across reputable community channels, demonstrating outreach capability: the [YouTube channel](https://www.youtube.com/@taichinh-taman5516) (29k subscribers), the [Cardano\\.vn](https://cardano.vn/), and the reputable [Telegram group](https://t.me/StakingADA/1) (3k members, including major Vietnamese stake pool operators).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Specific evidence will be provided to verify the completion of the milestone:\n\n\n\nInvoices or screenshots confirming registration for the necessary AI services.\n\n\n\nThe script files for the 15 completed videos.\n\n\n\nThe project's TikTok channel link, showing the 15 posted videos.\n\n\n\nA compiled demo video showcasing the quality of the image, MC lip-sync, and graphics.\n\n\n\nLinks to the announcement posts on the [YouTube](https://www.youtube.com/@taichinh-taman5516) community tab ,[Cardano\\.vn](https://cardano.vn/), and the reputable [Telegram group](https://t.me/StakingADA/1) - 3k members/devs/SPOs","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":" Expand Content & Optimize TikTok Engagement","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"The second month will focus on expanding content depth and optimizing interaction potential on TikTok:\n\n\n\nContent Expansion: Finalize detailed scripts for the next 15 short videos, delving into other important chapters and content within the \"Cardano For The Masses\" book.\n\n\n\nVideo Production: Produce and post 15 completed videos on the project’s TikTok channel, maintaining a consistent posting frequency to maximize interaction.\n\n\n\nOptimization Strategy: Execute A/B testing with various video formats, titles, hashtags, and posting times to determine the most optimal strategy for the TikTok algorithm.\n\n\n\nData Analysis: Analyze initial interaction data (views, likes, comments, shares) to adjust and improve content quality and outreach strategy.\n\n\n\nCommunity Update: Update project progress and new videos across existing community channels.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"For this milestone to be considered complete, the following criteria must be met:\n\n\n\n15 new short video scripts have been completed and approved.\n\n\n\n15 new videos have been successfully produced and posted on the project’s TikTok channel, bringing the total video count to 30.\n\n\n\nVideos continue to maintain high quality in terms of image, sound, and MC lip-sync.\n\n\n\nA preliminary performance analysis report on TikTok video efficiency is available, including interaction metrics and optimization recommendations.\n\n\n\nInformation about the new videos is announced on reputable community channels, further demonstrating outreach capability.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Specific evidence will be provided to verify the completion of the milestone:\n\n\n\nThe script files for the 15 completed videos.\n\n\n\nThe project’s TikTok channel link, showing a total of 30 posted videos.\n\n\n\nA TikTok data analytics report (screenshots from TikTok Analytics) covering views, interactions, and follower growth for the posted videos.\n\n\n\nLinks to the progress update posts on the proposer’s communication channels.\n\n\n\nLinks to the announcement posts on the [YouTube](https://www.youtube.com/@taichinh-taman5516) community  ,[Cardano\\.vn](https://cardano.vn/), and the reputable [Telegram](https://t.me/StakingADA/1) group - 3k members/devs/SPOs","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15105,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Content Finalization, Deployment & Final Reporting","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"In the final month, the project will conclude content production, optimize performance, and prepare the final project reports:\n\n\n\nContent Finalization: Completion of detailed scripts for the final 15 short videos , covering summary or specialized content from the \"Cardano For The Masses\" book.\n\n\n\nVideo Deployment: Production and posting of 15 completed videos on the project's TikTok channel, bringing the total video count to 45.\n\n\n\nFinal Promotion: Execution of final communication and marketing campaigns on the proposer's existing channels to increase awareness and attract new users to the TikTok channel.\n\n\n\nData Analysis: Collection and final analysis of TikTok channel performance data (total videos, total views, interaction rate, follower growth) based on the defined KPIs.\n\n\n\nFinal Report Preparation: Preparation of the final project report, including achieved results, impact analysis, and future development plans.\n\n\n\nCode Disclosure: Public disclosure of the source code for any automation processes and the utilized AI scripts/algorithms","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"For this milestone to be considered complete, the following criteria must be met:\n\n\n\n15 final short video scripts have been completed and approved.\n\n\n\n15 final videos have been successfully produced and posted on the project’s TikTok channel, bringing the total video count to 45.\n\n\n\nThe \"AI-Powered Cardano For The Masses\" TikTok channel is publicly deployed and operating stably, achieving the set KPIs for views and interaction.\n\n\n\nThe final project report has been completed and submitted as required by Catalyst.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Specific evidence will be provided to verify the completion of the milestone:\n\n\n\nThe script files for the 15 completed videos.\n\n\n\nThe project’s TikTok channel link, showing a total of 45 posted videos.\n\n\n\nA detailed statistical report on TikTok channel performance (views, interaction, followers) and other KPIs.\n\n\n\nThe final project report submitted to Catalyst.\n\n\n\nThe link to the source code repository on GitHub (if applicable).\n\n\n\nLinks to the announcement posts on the [YouTube](https://www.youtube.com/@taichinh-taman5516) community  [,Cardano\\.vn](https://cardano.vn/), and the reputable [Telegram group](https://t.me/StakingADA/1) - 3k members/devs/SPOs","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":14983,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Hoan Le : Technical Lead & Support Management **\n\n\n\nExpertise: IT Engineer from [FPT](https://fptsoftware.com/)(a leading technology university and company in Vietnam), with deep expertise in technology.\n\n\n\nRole: Technical Oversight & Support Team Management. Hoan Le is responsible for the technical specialty and overall management of the support team, ensuring smooth project execution. This role includes evaluating and integrating AI video generation tools, managing production pipelines, and guaranteeing the technical quality of the video outputs.\n\n\n\nTelegram : @Dukee9999\n\n\n\n**Nguyen Tuan Anh \\- Media Lead & Content Producer ** \n\n\n\nSkills: Freelancer CamOp (Camera Operator) in the film industry, Content Creator, and Video Producer, with 4 years of experience as a YouTube and TikTok editor in the Crypto space. He has experience collaborating with top Vietnamese football teams to create viral videos on TikTok about sports and fashion.\n\n\n\nResponsibilities: Creating engaging, visual short video content formats and optimizing them for TikTok. He is primarily responsible for using AI tools to generate videos, ensuring smooth graphics, accurate lip-syncing, and viral effects.\n\n\n\nCrypto: [https://www\\.tiktok\\.com/@tkventuresvn](https://www.tiktok.com/@tkventuresvn)\n\n\n\n\n\n\n\n[Sports Content](https://www.tiktok.com/@venesto.2022/video/7352171581042412808?is_from_webapp=1&sender_device=pc&web_id=7354205701403231760)\n\n\n\n[Fashion Content](https://www.tiktok.com/@venesto.2022/video/7287027392613272834                     https://www.tiktok.com/@venesto.2022/video/7312833289709047047)\n\n\n\nContact: [X](https://twitter.com/nguyen_fx/likes) - Telegram: Ciigi_01,\n\n\n\n\n\nThe combined expertise of Nguyen Tuan Anh and Hoan Le is uniquely suited to this AI-powered media project. Tuan Anh's four years of crypto media experience and proven ability to create viral content directly guarantee high TikTok engagement and mass appeal. Hoan Le, with his strong FPT technical foundation, ensures seamless AI tool integration, robust workflow, and high-quality output control. This blend of viral creativity and technical feasibility ensures the project delivers the most effective, technically sound educational product. Their deep commitment to the Cardano ecosystem reinforces their determination to deliver the best possible outcome.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Products & Services\n\n\n\nThe project utilizes specific resources to ensure high-quality, cost-effective content delivery:\n\n\n\n1. Software & AI Services\n\nThe project relies on paid cloud AI services for production, including:\n\n\n\nMC & Lip-Sync: HeyGen, LipDub AI, Vozo AI\n\n\n\nGraphics & Video: Adobe Firefly, simpleshow\n\n\n\nTikTok Optimization: OpusClip, Klap\n\n\n\nVoice Generation: ElevenLabs\n\n\n\n2. Hardware\n\nThe project will utilize the team's existing hardware (personal computers, basic microphones) to save costs, eliminating the need for additional investment.\n\n\n\n3. Professional Services\n\nProject Management & Coordination: Ensuring the project remains on schedule.\n\n\n\nContent Creation & Distillation: Scriptwriting for short videos based on the core content of the \"Cardano For The Masses\" book.\n\n\n\nVideo Production & Editing: Utilizing AI tools for rough video creation, followed by post-production editing and finalization using software.\n\n\n\nCommunication & Community Management: Managing the TikTok channel and other social platforms, engaging with the community to disseminate information.\n\n\n\nContingency Plan for Budget Overruns\n\nIn case the sponsored budget is exceeded, the project has the following solutions:\n\n\n\nPersonal Financing: The team will prioritize using personal funds to cover small incidental expenses, ensuring no interruption to the project schedule.\n\n\n\nCost Optimization: Adjusting the use of AI tools to more cost-effective packages or using open-source alternatives, or extending the production timeline if necessary to reduce cost pressure.\n\n\n\nLeveraging Community Effect: Utilizing the proposer's existing communication channels (Telegram with 3k members, X with 39k followers) for free promotion, minimizing marketing costs.\n\n\n\nGoal Re-evaluation: If cost overruns are severe, the team will re-evaluate and may reduce the number of videos produced to ensure the highest possible quality for the committed core videos.\n\n\n\nAdvertising, Marketing, Management & Documentation\n\nAll costs related to these categories have been calculated within the total budget. The project will fully utilize existing communication channels to reach the target audience and create a widespread effect. Detailed progress reports and final project summary documentation will be fully and transparently completed and submitted to relevant parties as requested. Project management will be executed rigorously to ensure maximum efficiency.\n\n\n\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nBreakdown base cost: \n\n\n\n**Milestone 1: AI Platform Setup & Production of First 3 Videos **\n\n\n\nThis phase incurs the highest cost due to the required investment in professional AI tools and initial setup.\n\n\n\nTools & Software (4,500 ADA): The largest expense, covering annual/quarterly licensing fees for essential professional AI services (e.g., Runway ML, ElevenLabs) to ensure high-end video quality from the start.\n\n\n\nPersonnel (6,333 ADA): Fixed compensation for the core team (PM, Media, Idea Specialist) dedicated to initial planning, technical integration, and scripting the first 3 episodes.\n\n\n\nProduction & Post-Production (1,500 ADA): Direct costs for script finalization and running the AI models to generate the first 3 rough videos.\n\n\n\nManagement & Reporting (600 ADA): Costs related to project setup and establishing the financial oversight mechanism.\n\n\n\nMarketing & Communication (500 ADA): Budget for the initial announcement and graphic creation for the launch.\n\n\n\n**Milestone 2: Core Production & Optimization **\n\n\n\nThis phase focuses on maintaining consistent production (3 subsequent videos) and refining content based on initial feedback.\n\n\n\nPersonnel (6,333 ADA): Fixed compensation for the team dedicated to producing the next 3 episodes (Episodes 4-6) and conducting performance analysis.\n\n\n\nProduction & Post-Production (1,600 ADA): Production costs for the next 3 videos, with a slight increase reflecting higher post-production effort during content refinement.\n\n\n\nMarketing & Communication (1,000 ADA): Funds allocated for strategic mid-project promotion and community interaction.\n\n\n\nManagement & Reporting (600 ADA): Continued costs for management oversight and progress tracking.\n\n\n\nTools & Software (500 ADA): Reduced cost, covering only necessary monthly maintenance fees for the licensed AI tools.\n\n\n\n**Milestone 3: Final Production, Promotion Push & Reporting **\n\n\n\nThe final phase covers the last set of videos, the primary marketing push, and final reporting.\n\n\n\nPersonnel (6,334 ADA): Final month's compensation for completing the last 3 episodes (Episodes 7-9) and compiling project documentation.\n\n\n\nProduction & Post-Production (1,700 ADA): Highest production cost, ensuring the final 3 videos meet the peak quality standard before delivery.\n\n\n\nMarketing & Communication (1,500 ADA): The largest marketing allocation, dedicated to the final widespread dissemination campaign and community engagement push.\n\n\n\nManagement & Reporting (800 ADA): Increased cost to cover project auditing, financial closure, and the preparation of the final, detailed Catalyst reporting documentation.\n\n\n\nTools & Software (500 ADA): Final month's maintenance fees for utilized AI platforms.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"**Investment Value and Cost Optimization**\n\n\n\nThe project \"Hydra Scaling to Midnight Privacy - For The Masses\" represents an extremely efficient investment that delivers superior value to the Cardano ecosystem. The following arguments clarify why the proposed budget is reasonable and optimized for maximum cost-effectiveness.\n\n\n\n**Objective Argument on Investment Value**\n\n\n\n- High-Quality Product from Deep Expertise: The project invests significant effort into every step of the production process, from distilling the content of the book \"Cardano For The Masses\" to scriptwriting and AI video production. All video content is processed by advanced AI models and reviewed by a team experienced in both blockchain and digital content production, ensuring accuracy, clarity, and engagement for all audiences.\n\n\n\n- Experienced Team Highly Suited for TikTok: The project team consists of members with deep expertise in Cardano and, notably, experience in producing viral content on YouTube and TikTok. Solid knowledge of blockchain and experience in short-form content creation ensure the final product is not only informationally valuable but also capable of powerful dissemination on the TikTok platform.\n\n\n\n- Leveraging Existing Community: One of the biggest advantages is the project's large and active community across platforms like Telegram, X, and YouTube. Support from this community allows for immediate access to thousands of target viewers, maximizing the project's reach without significant marketing expenditure. This drastically minimizes the risk of video acceptance and usage, providing high initial value for the investment.\n\n\n\n- Pioneering Blockchain Education via AI on TikTok: This project is pioneering the use of AI technology to create a professional educational and informational tool about the Cardano ecosystem, especially on the TikTok platform. The project is building a new, efficient, and scalable content distribution model, setting a new standard for information management and education in blockchain ecosystems.\n\n\n\n**Demonstrating Appropriate and Optimized Costs**\n\n\n\nTo prove that the budget is entirely reasonable, the project conducted a market survey on the cost of developing similar solutions and compared it to this project's proposed cost.\n\n\n\n- Market Survey Comparison: According to sources on 2D animated video production costs, the expense can range from $1,000 to $3,000 USD or even higher per minute of video. Other sources cite an average price of $3,000–$7,000 USD per minute for a comparable product. The lowest cost for a product in this segment is $2,000 USD per minute\n\n\n\n- AI Cost Optimization: Based on these prices, the cost of producing a series of 45 short videos (each 2-3 seconds long) featuring a lip-syncing MC and smooth graphics using traditional methods (hiring MCs, filming, editing, manual graphics) could amount to tens of thousands of dollars per minute of video, leading to a massive total cost. However, by leveraging advanced AI technology and optimizing the production workflow, the project can deliver a comprehensive solution with a total budget of 45,000 ADA. Assuming an exchange rate of $1 \\text{ ADA} = 0.70 \\text{ USD}$, this total budget is equivalent to approximately $31,500 USD. This demonstrates that the cost per video and the overall efficiency of the project are significantly lower than the market price for an equivalent solution developed traditionally.\n\n\n\n\n\n- Resource Optimization: The project utilizes readily available translation resources (from a Fund 11 project), excluding this cost from the budget. The project also leverages the team's existing hardware to minimize initial investment costs. This ensures that every ADA funded is used most effectively for the development and deployment of the TikTok channel.\n\n\n\n**Other Factors Affirming Investment Value**\n\n\n\n- Long-Term Educational Value: The project does not just create immediate products but also builds a valuable knowledge library through short videos, helping the community and new developers easily access and understand Cardano.\n\n\n\n\n\n- Transparency and Commitment: The project is committed to using the budget transparently and effectively and will provide clear periodic reports for sponsors to monitor progress. This builds trust and ensures the highest level of accountability.\n\n\n\n\n\n- Scalability and Sustainability: The design based on AI tools allows the project to easily scale video production and adapt to new content trends on TikTok, ensuring the investment value is sustained long-term.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Social Media","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1793}