{"pr_id":"019ac1ca-98bd-734c-b431-d42555b0765e","title":"Vietnam Builder Hub: 24/7 Co-working and Incubation Space","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Cardano Vietnam devs work in isolation, lacking a physical hub and mentorship to build team. This disconnect leads to high project abandonment and few Mainnet dApps.","solution":"Build a 24/7 Co-working Hub providing free workspace, expert mentorship, and milestone-based grants to ensure 5 high-quality projects reach Mainnet network.","proposer_name":"Do Hoang Trung","proposer_relevant_experience":"**1\\. Do Hoang Trung \\- Project Lead**\n\nGitHub: [https://github\\.com/hoangtrung192](https://github.com/hoangtrung192)\n\nBio/Experience:\n\n- Project management: Over 2 years of experience leading tech events, including participating Hackathons (Hackathon 2025 Organizer) and developer bootcamps. Proven track record in team leadership and cross-functional coordination.\n- Technical expertise: A full-stack and blockchain developer proficient in Haskell and Aiken for Cardano smart contracts, as well as C/C++, Java, SQL, and TypeScript. Experienced with Mesh.js SDK for dApp integration.\n- Blockchain insight: Deep understanding of DeFi architecture, decentralized governance models, and Tokenomics design.\n- Catalyst experience: Strong capability in proposal writing and fund management.\n\nResponsibilities:\n\n- Overall project coordination and legal/budget accountability (60,000 ADA).\n- Submitting monthly Proof of Achievement (PoA) and Close-out reports to Catalyst.\n- Overseeing the quality assurance (QA) process for the 5 incubated Mainnet projects.\n\n**2\\. Bui Huong Giang \\- Community Manager**\n\nX [https://x\\.com/ebegings/](https://x.com/ebegings/:)\n\nBio/Experience:\n\n- Community building: Expert in building developer communities with an extensive network of Senior Developers, Vendors, and Tech Enterprises in Vietnam.\n- Event logistics: Experienced in operating end-to-end logistics for tech events ranging from 50-100 participants.\n- Partnership Management: Strong background in B2B partnership and stakeholder management within the local tech ecosystem.\n\nResponsibilities:\n\n- Managing daily Hub operations (Member onboarding, Check-in/out, facility support).\n- Leading the logistics and organization for 8 Technical Workshops and the final Demo Day.\n- Managing social media channels and executing the recruitment campaign for Hub members.\n\n**3\\. Phung Nguyen Trong An \\- Blockchain Developer**\n\nLinkedIn: [https://www\\.linkedin\\.com/in/tr%E1%BB%8Dng\\-an\\-664950392/?utm\\_source=share\\_via&amp;utm\\_content=profile&amp;utm\\_medium=member\\_android](https://www.linkedin.com/in/tr%E1%BB%8Dng-an-664950392/?utm_source=share_via&utm_content=profile&utm_medium=member_android)\n\nGitHub: [https://github\\.com/trongsanggvm06](https://github.com/trongsanggvm06)\n\nX: [https://x\\.com/AnTrong5426?t=jeDOSsJ\\_8DqCQPm6PCDaFw&amp;s=09](https://x.com/AnTrong5426?t=jeDOSsJ_8DqCQPm6PCDaFw&s=09)\n\nExperience:\n\n- Cardano specialist: Experienced Blockchain Developer specializing in Aiken and Plutus.\n- Track record: Has successfully deployed products to Mainnet and actively contributes to open source repositories in the Cardano ecosystem.\n\nResponsibilities:\n\n- Designing the curriculum and serving as the primary instructor for Technical Workshops.\n- Conducting Code Reviews and providing System Architecture consultancy for incubated teams.\n- Validating technical milestones to authorize the release of Builder Bounties/Grants.","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Vietnam Builder Hub: 24/7 Co-working and Incubation Space","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Do Hoang Trung","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Not Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano Vietnam devs work in isolation, lacking a physical hub and mentorship to build team. This disconnect leads to high project abandonment and few Mainnet dApps.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Build a 24/7 Co-working Hub providing free workspace, expert mentorship, and milestone-based grants to ensure 5 high-quality projects reach Mainnet network.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":{"links":[]},"sub_fields":null},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Fully open source","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Community","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"Target Audience:\n\n- Core builders: Haskell/Plutus/Aiken/Marlowe developers seeking teams.\n- University talent: Students researching and developing applications on Cardano.\n- Product owners: Individuals with business ideas seeking technical co-founders.\n\nEngagement Strategy:\n\nWe reach them through Phase 1 of our transformation funnel: Organizing open workshops to attract 100 members, from which we filter down to 10-15 potential teams committed to working physically at the Hub.\n\nImportance to Cardano:\n\nVietnam already has many education projects but lacks an environment for building real-world projects. This project fills that gap by connecting Coders with Business Builders, converting resources from &quot;learning&quot; to &quot;doing&quot; and launching actual products.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"- Infrastructure setup: Providing free open co-working space equipped with high-speed internet and whiteboards for coding.\n- Team Selection: Conducting open workshops to select 10-15 committed teams.\n- Weekly Community Calls: Hosting weekly sessions where teams must demo real progress (lines of code, UI/UX updates) instead of passive meetups.\n- On-site mentorship: Connecting teams with senior devs/experts to debug technical issues (Aiken/Haskell) immediately, minimizing downtime.\n- Milestone-based incentives: Managing the budget to award bounties, releasing funds only upon verified milestones (e.g., successful deployment to pre-production testnet).\n- Mainnet launch: Organizing a Demo Day and launching the 5 best projects on Mainnet (Phase 3).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"- Output quality: 5 Projects successfully deployed on mainnet (phase 3).\n- Team formation: 10-15 potential teams formed and committed to working at the Hub.\n- Community engagement: 100+ members attracted via open workshops (phase 1).\n- Development progress: Regular weekly real-time demos of code and UI/UX updates during Community Calls.\n- Comprehensive support: Completion of 4 months of intensive support in technology, legal, and tokenomics (phase 2).","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Vietnam is a hotspot for Blockchain innovation, yet Cardano developers operate in fragmented silos. The absence of a dedicated physical workspace hinders brainstorming, co-founder matching, and technical troubleshooting. In reality, the ecosystem has not effectively utilized this solution:\n\nIsolation: Developers often work alone, lacking immediate feedback on complex technical issues (Aiken/Haskell/Plutus).\n\nLack of accountability: Without positive peer pressure and commitment, many projects stall at the ideation phase or are abandoned halfway.\n\nSkill gap: There is a disconnect between Coders and Business Builders, preventing the creation of complete, market-ready products.\n\n**The Solution: VN Cardano Builder Hub**\n\nPhysical infrastructure:\n\nFree open co-working space for teams that pass the selection round.\n\nFully equipped with high-speed internet, workstations, and whiteboards for coding and architecture design.\n\nRecurring operations:\n\nWeekly Community Call: Instead of passive meetups, we host active weekly calls at the end of the week. Teams must demo real progress (lines of code, UI/UX updates, ecosystem highlights) to the community and mentors.\n\nMentorship: Direct connection with experienced senior devs, experts, and enterprises for on-the-spot technical debugging, minimizing project downtime.\n\nIncentive mechanism:\n\nA portion of the budget is allocated for bounties to reward active teams or early MVP completion. Funds are released only when teams achieve specific milestones (,successful deployment to pre-production testnet). This transforms the Hub into a healthy competitive environment.\n\n**Transformation Process:**\n\n- Phase 1: Attract 100 members via open workshops to filter and select 10-15 potential teams committed to working at the Hub.\n- Phase 2: Provide comprehensive support in Technology, Legal, and Tokenomics over 4 months.\n- Phase 3: Host a Demo Day and launch the 5 best projects on Mainnet.\n\n**Beneficiaries:**\n\nCore builders: Haskell/Plutus/Aiken/Marlowe devs seeking teams.\n\nUniversity talent: Students researching and developing applications on Cardano.\n\nProduct owners: Individuals with business ideas seeking technical co-founders.\n\n**Unique Value Proposition:**\n\nHere, builders are gathered among like-minded individuals speaking the same programming language. This synergy accelerates product development speed significantly compared to working in isolation from home.\n\n**Why is this important for Cardano?**\n\nIn reality, while Vietnam has seen many successful education and course-based projects, there is a distinct lack of environments for real-world project execution. Therefore, the success of this project will help attract a large wave of Blockchain developers to actively participate and build within the Cardano ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"**1\\. Strategic Value for the Cardano Ecosystem:**\n\nThe VN Builder Hub project addresses the &quot;last-mile product delivery&quot; challenge for the Cardano ecosystem in Vietnam:\n\n- Conversion: Vietnam boasts a large pool of developers interested in Blockchain, but the conversion rate to Cardano Devs remains low due to language barriers (Haskell) and the lack of a practical environment. This Hub acts as a catalyst to bridge that gap.\n- Physical anchor: Establishing a physical Hub in Southeast Asia serves as a destination where VCs and enterprise partners can scout for potential Cardano project teams.\n- On-chain growth: The ultimate goal is not just code, but live dApps on Mainnet. 5 successful projects will generate new users and continuous transaction volume for the Cardano network long after the project concludes.\n\n**2\\. Measurement and KPIs:**\n\nWe commit to measuring success via specific Quantitative and Qualitative metrics over the 6-month period:\n\n**_Quantitative Metrics:_**\n\n- 5 mainnet projects: This is the most critical KPI. We commit to incubating at least 5 projects that complete their MVP and deploy to the network.\n- 100 active builders: Attracting 100 developers to participate in the Hub ecosystem.\n- 12 intensive events: Organizing 12 Technical Workshops.\n- 300+ GitHub commits: Tracking the coding activity of projects within the Hub to ensure real work is being delivered.\n\n**_Qualitative Metrics:_**\n\n- The success rate of individual members finding Co-founders or forming complete teams at the Hub.\n- The measurable improvement of Developer skills, moving from zero knowledge of Plutus/Aiken to being capable of deploying Smart Contracts.\n- The volume of educational videos/documentation created from the workshops.\n\n**Sharing Outputs &amp; Opportunities:**\n\n- The Hub playbook: We will document the entire Hub operational process (setup, workshop organization, bounty management) and share it publicly. Cardano communities in other countries can replicate this model.\n- Monthly showcases: Every month, projects within the Hub will conduct short recorded demos for the global community to track progress.\n- Final demo day: A major concluding event where the top 5 projects will pitch to investors and the community. This footage will be widely promoted across Cardano media channels (Twitter, Telegram, Youtube).","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"**1\\. Proven track record and team capability:**\n\nOur team consists of active members with years of contribution to the Cardano Vietnam community, specializing in organizing and operating events within the Blockchain ecosystem. We possess the ideal skill set to run this Hub model:\n\n- Has 3 years of project management experience and has successfully participated in deploying numerous workshops, hackathons, and bootcamps. Additionally, possesses years of hands-on programming experience on Cardano.\n- Experienced in organizing Tech events and managing developer communities in Vietnam. Holds a strong network of relationships with local vendors and Senior Developers.\n\n**2\\. Feasibility validation \\(Why this project will succeed\\):**\n\nReal market demand: We conducted a preliminary survey within local developer groups. Currently, we have a waitlist of over 20 developers and 3 potential startup teams ready to join the Hub immediately upon opening.\n\nLow-Risk Infrastructure: Instead of building a new office (which entails high cost and risk), we have established a strategic partnership with a reputable Co-working Space provider. This allows us to activate the workspace specifically for the 4-month intensive incubation phase, avoiding unnecessary long-term lease liabilities.\n\n**3\\. Financial transparency and trust:**\n\nTo ensure the 60,000 ADA is utilized correctly, we implement strict financial controls:\n\nMulti-sig wallet: All project funds will be secured in a 2-of-3 Multi-sig wallet to prevent unauthorized spending or single points of failure.\n\nMilestone-based Disbursement:\n\nOperational costs: Disbursed monthly based on actual invoices.\n\nBuilder incentives: Disbursed only when teams achieve verified milestones (Testnet deployment) with clear on-chain proof.\n\nOpen Accounting: A public Google Sheet tracking every transaction (Time, TxHash, Purpose, Amount) will be updated weekly for community auditing.\n\n**4\\. Risk management:**\n\n- Volatility risk: Should the ADA price drop significantly, we will prioritize protecting the Builder Incentives budget (the core value driver) and cut non-essential Logistics/Marketing costs.\n- Participation risk: In cases where physical attendance is restricted (due to weather or health concerns), we have a contingency plan ready to switch all workshops to Discord/Zoom immediately, ensuring the implementation progress remains uninterrupted.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Infrastructure Setup and Community Launch","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Signed Co-working space lease agreement.\n- Selection of 15 potential teams to work at the Hub.\n- Fully equipped workspace (desks, chairs, internet, whiteboards, projector).\n- Communication channels established and announced.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Physical venue is ready for operation with a minimum capacity of 75 people simultaneously.\n- The list of 15 selected teams includes member details and initial project idea profiles.\n- All facilities and internet connection operate stably.\n- At least 1 announcement post about the Hub launch on official social media channels.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Copy of the lease agreement (sensitive information redacted).\n- Link to the list of 15 selected teams with their project idea profiles.\n- Video tour showing the fully setup Hub workspace.\n- Links to the Social Media channels (Twitter/Facebook/Telegram) showing the announcement.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Operation, Education and Team Formation","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Provide in-depth technical mentoring for teams (frequency: 2 sessions/month).\n- Consult on Business Model design for the projects.\n- Teams begin writing code and pushing to Github.\n- Organize 8 Weekly Community Calls to evaluate project progress and discuss Cardano ecosystem updates.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Organize a minimum of 4 in-depth 1-on-1 Review sessions between Mentors and teams.\n- Teams complete their draft Whitepapers.\n- Project Github Repositories begin showing initial code commits.\n- Successfully hold 8 Weekly Community Calls with materials archived.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Logs/Minutes recording the content of the mentoring sessions.\n- Link to the whitepapers of the teams.\n- Links to Github repositories showing coding activity history.\n- Links to media resources (recordings/screenshots) of the 8 Weekly Community Calls.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Refining and Legal","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Provide basic Legal orientation consulting for startup projects.\n- Filter the initial 15 teams down to the Top 5 best projects to prepare for Mainnet.\n- Support teams in deploying products to the Testnet/Pre-prod environment.\n- Finalize UI/UX for these 5 best projects.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Legal guidance documents or workshop minutes provided to teams.\n- Publish the official list of the Top 5 projects selected for the Mainnet round.\n- The 5 best projects successfully run key features on the Testnet.\n- Frontend interfaces of the 5 projects are complete and successfully connected to Cardano wallets.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Link to legal guidance documents or Video of the legal workshop.\n- Link to the official announcement regarding the Top 5 selected projects.\n- Links to access the Beta versions (testnet URLs) of the 5 projects.\n- Demo videos showing user operations (UI flow) on the 5 projects.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Demo Day, Mainnet Launch and Close-out","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Deploy the 5 best projects to the Mainnet for Cardano community.\n- Organize a Demo Day event for teams to pitch to the community/investors.\n- Finalize the Project Close-out Report (PCR) and Close-out Video (PCV).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 5 Projects are live on Mainnet (Users can interact with real ADA).\n- The Demo Day event takes place successfully with community participation (minimum 30 attendees).\n- Full submission of the final reports according to Catalyst requirements.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Links to access the dApps on Mainnet (Live URLs).\n- Video recording of the entire Demo Day event.\n- Link to the Close-out Report (PDF) and Project Close-out Video on Youtube.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":8,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":15000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**1\\. Do Hoang Trung \\- Project Lead**\n\nGitHub: [https://github\\.com/hoangtrung192](https://github.com/hoangtrung192)\n\nBio/Experience:\n\n- Project management: Over 2 years of experience leading tech events, including participating Hackathons (Hackathon 2025 Organizer) and developer bootcamps. Proven track record in team leadership and cross-functional coordination.\n- Technical expertise: A full-stack and blockchain developer proficient in Haskell and Aiken for Cardano smart contracts, as well as C/C++, Java, SQL, and TypeScript. Experienced with Mesh.js SDK for dApp integration.\n- Blockchain insight: Deep understanding of DeFi architecture, decentralized governance models, and Tokenomics design.\n- Catalyst experience: Strong capability in proposal writing and fund management.\n\nResponsibilities:\n\n- Overall project coordination and legal/budget accountability (60,000 ADA).\n- Submitting monthly Proof of Achievement (PoA) and Close-out reports to Catalyst.\n- Overseeing the quality assurance (QA) process for the 5 incubated Mainnet projects.\n\n**2\\. Bui Huong Giang \\- Community Manager**\n\nX [https://x\\.com/ebegings/](https://x.com/ebegings/:)\n\nBio/Experience:\n\n- Community building: Expert in building developer communities with an extensive network of Senior Developers, Vendors, and Tech Enterprises in Vietnam.\n- Event logistics: Experienced in operating end-to-end logistics for tech events ranging from 50-100 participants.\n- Partnership Management: Strong background in B2B partnership and stakeholder management within the local tech ecosystem.\n\nResponsibilities:\n\n- Managing daily Hub operations (Member onboarding, Check-in/out, facility support).\n- Leading the logistics and organization for 8 Technical Workshops and the final Demo Day.\n- Managing social media channels and executing the recruitment campaign for Hub members.\n\n**3\\. Phung Nguyen Trong An \\- Blockchain Developer**\n\nLinkedIn: [https://www\\.linkedin\\.com/in/tr%E1%BB%8Dng\\-an\\-664950392/?utm\\_source=share\\_via&amp;utm\\_content=profile&amp;utm\\_medium=member\\_android](https://www.linkedin.com/in/tr%E1%BB%8Dng-an-664950392/?utm_source=share_via&utm_content=profile&utm_medium=member_android)\n\nGitHub: [https://github\\.com/trongsanggvm06](https://github.com/trongsanggvm06)\n\nX: [https://x\\.com/AnTrong5426?t=jeDOSsJ\\_8DqCQPm6PCDaFw&amp;s=09](https://x.com/AnTrong5426?t=jeDOSsJ_8DqCQPm6PCDaFw&s=09)\n\nExperience:\n\n- Cardano specialist: Experienced Blockchain Developer specializing in Aiken and Plutus.\n- Track record: Has successfully deployed products to Mainnet and actively contributes to open source repositories in the Cardano ecosystem.\n\nResponsibilities:\n\n- Designing the curriculum and serving as the primary instructor for Technical Workshops.\n- Conducting Code Reviews and providing System Architecture consultancy for incubated teams.\n- Validating technical milestones to authorize the release of Builder Bounties/Grants.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Infrastructure** (20%): 12,000 ADA\n\nCo-working Space Rental (4 Months): 12,000 ADA.\n\nCalculation: 3,000 ADA/month x 4 months.\n\nDetails: Renting a suitable co-working space including electricity, water, internet, and necessary amenities. The space is functionally divided into 2 zones: a dedicated Team Working Zone and an Event/Workshop Zone.\n\n**Operations Team** (23%): 14,000 ADA\n\nOperations Personnel: 14,000 ADA.\n\nDetails: Compensation for the core team responsible for operations management, logistics coordination, and project supervision throughout the lifecycle.\n\n**Education and Mentoring** (15%): 9,000 ADA\n\nExpert Mentorship: 9,000 ADA.\n\nCalculation: 2,250 ADA/month x 4 months.\n\nDetails: Remuneration for Blockchain experts, enterprises, and mentors to conduct weekly 1-on-1 mentoring sessions and code reviews for the incubated teams.\n\n**Builder Incentives** (32%): 19,000 ADA\n\nGrants and Bounties: 19,000 ADA.\n\nDetails: Performance-based reward fund. This includes larger awards for teams that successfully deploy to Mainnet and micro-rewards for teams achieving specific incubation milestones. We allocate the largest portion of the budget here to directly support builders.\n\n**Events and Marketing** (10%): 6,000 ADA\n\nEvent Logistics: 6,000 ADA.\n\nDetails: Costs for equipment rental (audio/visual) and teabreaks (catering) for 8 technical workshops and community gatherings.\n\n**Total budget: 60,000 ADA ~$24,000**","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"1. High capital efficiency:\n\nWith a total request of 60,000 ADA, we commit to delivering 5 Mainnet projects. This equates to a capital cost of only 12,000 ADA per project. This is significantly lower than the standard direct funding route, which typically requires 30,000–50,000 ADA for a single individual MVP.\n\n2. Leveraging local cost advantages:\n\nPersonnel salaries and venue rentals are calculated based on Vietnamese market rates (which are substantially lower than in the US/EU). This geo-arbitrage allows us to allocate a massive 25% of the total budget (15,000 ADA) directly back to the Builders as incentives, creating the most tangible motivation for development.\n\n3. Zero infrastructure risk:\n\nWe have opted for a \"Co-working Partnership\" model (renting and upgrading existing space) rather than building from scratch. This strategy minimizes initial capital expenditure (CAPEX) and ensures the majority of funds are focused on operational expenditure (OPEX) and human capital development.\n\n4. Volatility management plan:\n\nWe are fully aware of ADA price volatility. Should the price drop below $0.35, we will trigger a contingency plan: reducing physical Event costs and shifting to online meetings. However, we strictly commit to protecting the budget for Builder Incentives and Mentoring, as these are the core value drivers of the project.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":false,"score":null,"author":null,"tags":"Community","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1794}