{"pr_id":"019ac2f7-16ef-74f3-82d2-fb28ef0bd0de","title":"Cardano AI Wallet Alerts for Instant Blockchain Events","event_id":15,"objective":38,"objective_title":"Cardano Use Cases: Prototype & Launch","summary":"Cardano users lack a free, open-source way to get instant wallet alerts. Current tools require polling, paid APIs, or limited triggers, leaving devs and non-devs with clunky, centralized solutions.","solution":"AI-powered event trigger framework for Cardano. Users set wallet alerts in plain language. AI builds triggers, links to multiple APIs, and delivers instant webhooks/notifications without coding.","proposer_name":"Abdul Aziz Alhassan","proposer_relevant_experience":"**Abdul Aziz Alhassan – Project Lead and Technical Coordinator**\n\nRole: Oversees the overall execution of the project, leads backend architecture and technical implementation, ensures alignment with Cardano ecosystem goals, and manages stakeholder engagement.\n\n**Links:**\n\nTwitter(X): [https://x\\.com/AbdulAzizKarma](https://x.com/AbdulAzizKarma)\n\nGitHub: [https://github\\.com/Abdulazizkarma1](https://github.com/Abdulazizkarma1)\n\nLinkedIn: [https://www\\.linkedin\\.com/in/alhassan\\-abdul\\-aziz\\-b63770228/](https://www.linkedin.com/in/alhassan-abdul-aziz-b63770228/)\n\n**Profile Highlights:**\n\n- Experienced in full-stack development, blockchain integrations, and smart contract auditing and AI automation with blockchain\n- Lead Developer for SafeSiso, a tech for public. An AI powered SMS &amp; WhatsApp chatbot to combat teenage pregnancy.\n- Longstanding and active Cardano community member and Delegated Representative (dRep), advocating for decentralized governance.\n- Frequent speaker at Cardano developer events and Web3 workshops in Ghana.\n- Passionate about onboarding African developers into the Cardano ecosystem.\n\n**Jeremiah Baani – Governance Lead and Engagement Coordinator**\n\n**Role:** Manages community outreach, governance participation, partnership development, and onboarding campaigns. Ensures feedback loops with local and global Cardano communities.\n\nLinks:\n\nTwitter(X): [https://x\\.com/Jerrybnj](https://x.com/Jerrybnj)\n\nLinkedIn: [https://gh\\.linkedin\\.com/in/jeremiah\\-baani\\-115280a0](https://gh.linkedin.com/in/jeremiah-baani-115280a0)\n\n**Profile Highlights:**\n\n- Experienced in full-stack development, blockchain development havent mastered financial contracts with, and smart contract auditing.\n- Cardano Ambassador with strong grassroots credibility.\n- Founder of Cardano Africa Academy and CTEIL (Center for Technology Education and Innovation Labs).\n- University lecturer and a blockchain researcher and experienced in youth training, education, and community mobilization.\n- Co-hosted the Cardano Summit in Northern Ghana and multiple Cardano Africa Academy events.\n- Leads Web3 literacy programs across Ghana, connecting students and builders to blockchain opportunities.\n\n**Umar Farouk \\- Blockchain Developer**\n\n**Links:**\n\n**Github:**[https://github\\.com/Tunteeya](https://github.com/Tunteeya)\n\n**Planned Hires**\n\nUI/UX Designer\n\nTo create a seamless, user-friendly dashboard for both technical and non-technical users.\n\nFocus on accessibility, clarity of wallet alerts, and multi-platform consistency.\n\nAI/ML Engineer\n\nTo build the natural language processing engine that translates plain-text rules into structured blockchain event triggers.\n\nEnsures accurate, scalable, and adaptive rule parsing for monitoring Cardano on-chain events.","url":null,"funds":120000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"Cardano AI Wallet Alerts for Instant Blockchain Events","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Abdul Aziz Alhassan","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 200,000","format":null,"answer":120000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":7,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano users lack a free, open-source way to get instant wallet alerts. Current tools require polling, paid APIs, or limited triggers, leaving devs and non-devs with clunky, centralized solutions.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"AI-powered event trigger framework for Cardano. Users set wallet alerts in plain language. AI builds triggers, links to multiple APIs, and delivers instant webhooks/notifications without coding.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://github.com/Abdulazizkarma1/Cardano-AI-Wallet-Alert"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Does your project have any dependencies on other organizations, technical or otherwise?","description":"Does your project have any dependencies on other organizations, technical or otherwise?","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"Cardano Node / Public APIs – For real-time blockchain event tracking. No licensing required. AI Model API – OpenAI or open-source LLM for natural language processing. Cloud Hosting – Backend + AI event engine hosting (AWS, Azure, or similar). Open-Source Libraries – Only OSI-approved; no proprietary licenses needed. Notification APIs – Telegram, Discord, Email, or SMS for alerts. Fallback Options – Self-hosted node + open-source AI to avoid single points of failure.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All project outputs will be fully open source for the entire lifecycle, hosted in a publicly accessible GitHub repository. We will use the MIT License to maximize community adoption and contribution. Backend Event Engine-Complete source code for tracking blockchain events. AI Integration Layer – Natural language instruction parser & alerts generator. Frontend Dashboard: UI for managing wallet alerts and event subscriptions. Documentation & SDK-Guides and developer tools for extending the system.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"AI","group":"Development & Tools"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what makes your idea innovative compared to what has been previously launched in the market (whether by you or others).","description":"Please provide your rationale.","format":null,"answer":"Our innovation lies in combining AI, event-driven monitoring, multi-channel notifications, and open-source architecture to create the first Cardano tool where anyone, developer or non-developer can configure complex blockchain alerts using simple language.\n\n\n\n**No existing solution offers:**\n\n\n\n- Natural-language rule creation\n- Open-source event-driven monitoring\n- A multi-channel, modular alert framework\n- A public SDK for integrating alerts into other Cardano apps\n- This proposal fills a major infrastructure gap with a completely new approach.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe what your prototype or MVP will demonstrate, and where it can be accessed.","description":"Please provide your rationale.","format":null,"answer":"The MVP already exists and is publicly accessible. It demonstrates real functionality: natural-language rule parsing, blockchain event monitoring, and automated notifications. All prototype code and demo materials are available on GitHub at:\n\n\n\n [https://github\\.com/Abdulazizkarma1/Cardano\\-AI\\-Wallet\\-Alert](https://github.com/Abdulazizkarma1/Cardano-AI-Wallet-Alert)","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Describe realistic measures of success, ideally with on-chain metrics.","description":"Please provide your rationale.","format":null,"answer":"Success is measured using clear, realistic milestones tied to:\n\n\n\nOn-chain data\n\n\n\nDeveloper adoption\n\n\n\nOpen-source transparency\n\n\n\nReal-world usage\n\n\n\nVerified performance metrics\n\n\n\nThese metrics allow Catalyst reviewers and the broader Cardano community to audit progress independently using on-chain data, GitHub history, and public dashboards.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**Perception of the Problem**\n\n\n\nRight now, monitoring on-chain events in the Cardano ecosystem is clunky, resource-heavy, and fragmented. Developers must either:\n\n\n\n- Run a full Cardano node + cardano-db-sync or cardano-graphql to poll addresses and filter events.\n- Rely on third-party APIs (Blockfrost, Koios, Tangocrypto) and write custom polling code.\n- Pay for webhook services that are centralized, have pre-set limitations, and are often closed-source.\n\n**All three have trade\\-offs:**\n\n\n\n- Running a node demands constant maintenance and infrastructure.\n- Polling wastes resources and risks missing events.\n- Paid services create vendor lock-in and limit innovation.\n\n\n\nNo open-source tool exists today that lets developers (or even non-coders) set custom, human-readable rules for blockchain event triggers and receive instant notifications without coding.\n\n\n\n**Proposed Solution**\n\n\n\nWe will create Cardano AI Wallet Alerts, an open-source, AI-powered event trigger framework. It will allow users to simply:\n\n\n\n- Input a Cardano wallet address or multiple addresses.\n- Type a plain-language instruction (e.g., “Notify me on Discord when wallet addr1... receives more than 200 ADA within 1 hour” or “Email me when my smart contract at policy xyz is spent”).\n- Select a notification method (email, Discord, Slack, webhook, Telegram, etc.).\n\n**The AI will:**\n\n\n\n- Parse the natural-language rule into precise blockchain event conditions.\n- Automatically configure the backend to monitor for these events via an indexing API (Blockfrost/Koios) or light-weight listener.\n- Trigger the notification instantly when the event occurs.\n- The core innovation: This removes the need for polling code, manual GraphQL queries, or vendor-locked webhook setups, while being open, transparent, and extensible for the community.\n\n**Why This Approach**\n\n\n\nWe chose this architecture because it bridges two currently separate worlds:\n\n\n\nEvent-driven blockchain listening (usually dev-only, code-heavy).\n\nNatural language task creation (AI translating plain English to machine logic).\n\nThis allows both developers (who can extend and integrate the SDK) and non-developers (who just want alerts) to use the same open-source framework.\n\n\n\n**Who We Will Engage**\n\n- \n- Developers: They’ll gain an extensible SDK/CLI to set event triggers programmatically and integrate into dApps, bots, or monitoring systems.\n- Community members: Non-technical users can create alerts through a web UI without touching code.\n- Businesses/Projects: Treasury managers, NFT projects, staking pools, and DeFi platforms needing automated responses to wallet events.\n\nProof of Impact\n\n\n\nWe will track:\n\n\n\nNumber of rules created by users.\n\nNumber of unique active wallets monitored.\n\nTime-to-notification performance metrics.\n\nCommunity contributions (forks, pull requests).\n\nAdoption by dApp developers integrating our framework.\n\nAdditionally, the repo will be public from day one, enabling measurable collaboration and transparency.\n\nUniqueness\n\n\n\nNatural Language to Trigger Rules: no existing Cardano solution does this in open-source form.\n\nMulti-notification channel support: not just webhook or email, but Discord, Telegram, etc.\n\nFully open-source: no closed APIs, no paid tier limitations.\n\nExtensible architecture: anyone can add new trigger types.\n\nWhy This Matters for Cardano\n\n\n\nCardano thrives when developers can build quickly and community members can interact with the chain without friction. Our tool:\n\n\n\nLowers technical barriers for real-time blockchain monitoring.\n\nEncourages open innovation (any dev can fork, extend, or integrate).\n\nReduces dependence on closed, centralized services for event triggers.\n\nStrengthens Cardano’s open-source ecosystem in line with the Cardano Open fund’s mission.\n\nWe’re not just solving a single problem, we’re enabling a whole class of automated, event-driven dApps and user experiences from DeFi liquidation alerts to NFT minting trackers, in a way that’s free, community-owned, and future-proof.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"Our project will make real-time wallet event detection accessible to every Cardano developer, removing the need for heavy node setups or paid closed-source services. By enabling instant, no-code trigger creation, we lower the barrier to building responsive dApps, payment processors, governance tools, and DeFi protocols.\n\n\n\n**Measuring Impact:**\n\n\n\nQuantitative: GitHub stars, forks, contributions, release downloads, SDK/CLI installs, webhook events triggered, and active projects using the framework.\n\n\n\nQualitative: Developer feedback via surveys, Discord, and the Cardano Forum; case studies from projects integrating our tool.\n\n\n\n**Sharing Outputs**\n\n\n\nWe will share all code, documentation, and updates in a public GitHub repo from day one, post tutorials and walkthroughs on the Cardano Forum, present updates at Cardano developer meetups, and create YouTube demos showing real-world use cases. This ensures global access and active adoption across the Cardano ecosystem.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Cardano AI Wallet Alerts will be developed as an open-source, event-driven monitoring framework built with a modular architecture for scalability, extensibility, and developer adoption.\n\n\n\n**Technical Feasibility**\n\n\n\n- Blockchain Data Access: Integration with Koios API ([https://api\\.koios\\.rest/\\)](https://api.koios.rest/)) and Blockfrost API ([https://blockfrost\\.io/\\)](https://blockfrost.io/)) to index wallet activity without requiring a local node. Optional node integration for advanced users.\n- AI Natural Language Processing: Python backend with FastAPI ([https://fastapi\\.tiangolo\\.com/\\)](https://fastapi.tiangolo.com/)) using OpenAI’s GPT-based parsing for translating plain English into executable blockchain event filters.\n- Event Detection: WebSocket and subscription-based architecture to avoid inefficient polling.\n- Latency target: 5 seconds from event occurrence to notification.\n- Notification Layer: Multi-channel support — email, Discord, Slack, Telegram, and webhooks via Twilio and Firebase Cloud Messaging.\n- Security: No private keys handled; wallet addresses only. Adherence to CIP-003 and CIP-95 ([https://cips\\.cardano\\.org/\\)](https://cips.cardano.org/))\n\n\n\n**Delivery Capability**\n\n\n\n- I have extensive blockchain and backend development experience, specifically in event-driven architectures and Cardano-specific tooling.\n- As a Delegated Representative (dRep) for the Cardano Africa Academy, I’m deeply embedded in Cardano governance and technical discourse.\n- I have reviewed and assessed proposals in Project Catalyst since Fund 10, giving me insight into what constitutes deliverable, realistic, and ecosystem-aligned solutions.\n\nPast Contributions Community Work\n\n\n\n- Cardano Africa Academy dRep representing African perspectives in Cardano governance.\n- Guest speaker at Cardano developer onboarding events in Ghana: slides ([https://drive\\.google\\.com/file/d/1lfBpfcvpXq\\-nWcqQ26\\_\\-DbgvlTNDvtVD/view?usp=sharing\\)](https://drive.google.com/file/d/1lfBpfcvpXq-nWcqQ26_-DbgvlTNDvtVD/view?usp=sharing)) | event media ([https://drive\\.google\\.com/drive/folders/1OZ59wk64RUOnOZScFY\\-jiRO31SrifE\\_J?usp=sharing\\)\\.](https://drive.google.com/drive/folders/1OZ59wk64RUOnOZScFY-jiRO31SrifE_J?usp=sharing).)\n- Co-founder of the Web3 Community at CKT-UTAS, training developers in Cardano smart contracts and tooling.\n-","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"AI Event Parsing and Core Backend","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Develop an AI-powered parser capable of converting plain language instructions (e.g., “Notify me when my wallet receives more than 100 ADA”) into structured blockchain event filters in JSON format.\n- Implement backend infrastructure connected to Koios and Blockfrost APIs for real-time blockchain event monitoring, including UTxO changes, token transfers, and smart contract triggers.\n- Build secure wallet rule creation API endpoints with authentication, enabling both UI and CLI interactions for future integrations.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- The AI parser consistently transforms natural language rules into valid, executable event filter JSON structures, tested against multiple on-chain scenarios.\n- Event filters persist securely in a database, with monitoring processes actively tracking real Cardano mainnet/testnet events.\n- End-to-end validation where a submitted rule results in accurate detection of the intended event without false positives or missed triggers","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public GitHub repository containing the backend codebase, AI parsing engine, and all supporting documentation for setup and testing.\n- Video demonstration showcasing rule creation from plain text to JSON output.\n- Test logs verifying accuracy of detection across at least 10 distinct blockchain event types, published for public review.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":3,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":42000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Multi-Channel Notifications and Web UI","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Integrate multiple notification channels, including whatsapp, email, Telegram, and SMS ensuring users can select preferred delivery methods for blockchain event alerts.\n- Develop a web-based dashboard for non-technical users to easily create, manage, and monitor event rules without needing to write code.\n- Implement a developer-friendly CLI tool enabling rule creation, modification, and deletion, designed for power users and automated workflows.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Alerts are successfully delivered to at least four different channels with sub-10-second latency from event detection to user notification.\n- Users can create, edit, and delete event rules via both the web UI and CLI without errors, confirmed through end-to-end tests.\n- Web dashboard provides responsive, mobile-friendly design and displays live event tracking data for active rules.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- GitHub repository containing the UI codebase, integrated with backend event processing logic and notification delivery pipelines.\n- Live demo showcasing multi-channel notification functionality.\n- Benchmark logs demonstrating latency tests across different network conditions and blockchain load scenarios.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":42000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Open-Source Release and Adoption Tracking","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Full public release of Cardano AI Wallet Alerts, including open-source code, installation guides, and configuration documentation for developers and community members.\n- Release of SDK and public API for third-party developers to integrate AI Wallet Alerts into their own applications, bots, and dashboards.\n- Deployment of a community adoption tracking dashboard, showing the number of rules created, active users, and top event types monitored.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Code released under a permissive open-source license (MIT/Apache 2.0) and accessible on a public repository with clear contribution guidelines.\n- Comprehensive documentation, video tutorials, and FAQs are publicly available to enable frictionless onboarding for new users.\n- At least 10 distinct community-created rules are running live on testnet or mainnet, demonstrating active adoption.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Public GitHub repo with tagged release, changelog, and release notes for version 1.0.\n- Screenshots and live access to the adoption dashboard displaying active usage metrics and event tracking statistics.\n- Final project close-out report and video demonstrating all key functionalities and community engagement results.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":7,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":36000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**Abdul Aziz Alhassan – Project Lead and Technical Coordinator**\n\nRole: Oversees the overall execution of the project, leads backend architecture and technical implementation, ensures alignment with Cardano ecosystem goals, and manages stakeholder engagement.\n\n**Links:**\n\nTwitter(X): [https://x\\.com/AbdulAzizKarma](https://x.com/AbdulAzizKarma)\n\nGitHub: [https://github\\.com/Abdulazizkarma1](https://github.com/Abdulazizkarma1)\n\nLinkedIn: [https://www\\.linkedin\\.com/in/alhassan\\-abdul\\-aziz\\-b63770228/](https://www.linkedin.com/in/alhassan-abdul-aziz-b63770228/)\n\n**Profile Highlights:**\n\n- Experienced in full-stack development, blockchain integrations, and smart contract auditing and AI automation with blockchain\n- Lead Developer for SafeSiso, a tech for public. An AI powered SMS &amp; WhatsApp chatbot to combat teenage pregnancy.\n- Longstanding and active Cardano community member and Delegated Representative (dRep), advocating for decentralized governance.\n- Frequent speaker at Cardano developer events and Web3 workshops in Ghana.\n- Passionate about onboarding African developers into the Cardano ecosystem.\n\n**Jeremiah Baani – Governance Lead and Engagement Coordinator**\n\n**Role:** Manages community outreach, governance participation, partnership development, and onboarding campaigns. Ensures feedback loops with local and global Cardano communities.\n\nLinks:\n\nTwitter(X): [https://x\\.com/Jerrybnj](https://x.com/Jerrybnj)\n\nLinkedIn: [https://gh\\.linkedin\\.com/in/jeremiah\\-baani\\-115280a0](https://gh.linkedin.com/in/jeremiah-baani-115280a0)\n\n**Profile Highlights:**\n\n- Experienced in full-stack development, blockchain development havent mastered financial contracts with, and smart contract auditing.\n- Cardano Ambassador with strong grassroots credibility.\n- Founder of Cardano Africa Academy and CTEIL (Center for Technology Education and Innovation Labs).\n- University lecturer and a blockchain researcher and experienced in youth training, education, and community mobilization.\n- Co-hosted the Cardano Summit in Northern Ghana and multiple Cardano Africa Academy events.\n- Leads Web3 literacy programs across Ghana, connecting students and builders to blockchain opportunities.\n\n**Umar Farouk \\- Blockchain Developer**\n\n**Links:**\n\n**Github:**[https://github\\.com/Tunteeya](https://github.com/Tunteeya)\n\n**Planned Hires**\n\nUI/UX Designer\n\nTo create a seamless, user-friendly dashboard for both technical and non-technical users.\n\nFocus on accessibility, clarity of wallet alerts, and multi-platform consistency.\n\nAI/ML Engineer\n\nTo build the natural language processing engine that translates plain-text rules into structured blockchain event triggers.\n\nEnsures accurate, scalable, and adaptive rule parsing for monitoring Cardano on-chain events.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**Budget Costs Total: 120,000 ADA**\n\n\n\n**Milestone 1: AI Event Parsing and Core Backend Development \\(42,000 ADA\\)**\n\n\n\nBackend Engineering (10,000 ADA): Smart event parsing logic, Koios/Blockfrost API integration, and rule creation endpoint.\n\nAI/NLP Model Training (8,000 ADA): Fine-tuning LLM for blockchain event parsing, dataset prep.\n\nCloud Infrastructure (18,000 ADA): Servers for backend + AI inference (3 years).\n\nProject Management (3,000 ADA): Milestone tracking, task allocation, and coordination.\n\nDocumentation & Internal Testing (3,000 ADA): API docs, backend usage guidelines, and QA testing.\n\n\n\n\n\n**Milestone 2: Multi\\-Channel Notifications and Web UI \\(42,000 ADA\\)**\n\n\n\nFrontend/UI/UX Development (14,000 ADA): Web dashboard for rule creation, event monitoring, and management.\n\nNotification System Integration (13,000 ADA): WhatsApp, Email, Telegram, and SMS.\n\nBackend Feature Expansion (5,500 ADA): Alert delivery optimization, failover handling, and latency tuning.\n\nCloud Infrastructure (6,250 ADA): Hosting and load balancing for UI and notification services.\n\nCommunity Beta Testing and Support (3,250 ADA): Incentives for testers, bug bounty, support docs.\n\n\n\n**Final Milestone: Open\\-Source Release and Adoption Tracking \\(36,000 ADA\\)**\n\n\n\nSDK/API Development (16,500 ADA): Dev integration tools, npm/PyPI packages.\n\nOpen-Source Documentation and Tutorials (6,000 ADA): Step-by-step guides, integration examples.\n\nMarketing and Community Engagement (6,500 ADA): Launch campaign, social media ads, and Cardano community events.\n\nImpact Measurement Dashboard (3,000 ADA): Track adoption metrics, rule usage stats, and event triggers.\n\nLegal and Compliance (4,000 ADA): Code audit, privacy compliance, terms of use.\n\n\n\n**Third\\-Party Services**\n\n\n\nKoios/Blockfrost API: Will use the free tier during testing and upgrade to paid if usage exceeds limits.\n\nOpenAI/LLM API: Initial development with free credits, budget for paid usage post-launch.\n\nCloud Hosting: AWS / Azure / Hetzner depending on latency and cost efficiency.\n\n\n\n\n\n**Funding Request: 120,000 ADA**\n\n\n\nAdditional Costs (Self-funded): None; all costs covered within request.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"The Cardano AI Wallet Alerts project delivers exceptional value by providing a real-time, AI-powered, open-source monitoring tool that addresses one of the biggest gaps in the ecosystem: timely, customizable blockchain notifications for both technical and non-technical users.\n\n\n\nWhy this is a good use of funds:\n\n\n\nDirect Ecosystem Utility: This tool empowers developers, stake pool operators, DeFi projects, NFT marketplaces, and end-users with instant alerts on wallet transactions, stake changes, token transfers, or smart contract triggers, improving transparency, reducing risk, and increasing trust.\n\nInfrastructure for Builders: By releasing an SDK and API under a permissive MIT/Apache license, we provide infrastructure that other Cardano projects can integrate directly into their apps without vendor lock-in. This compounds the value of Catalyst’s investment over time.\n\nCost Efficiency:\n\n\n\nDeveloper and AI engineer rates budgeted at 35–45 USD/hour are in line with industry averages for Africa-based and remote blockchain developers, which is significantly lower than Western freelance rates (often $70–120/hour).\n\nCloud infrastructure costs are minimized by using scalable, pay-as-you-go providers like AWS, Supabase, or Cardano-specific indexers like Koios, instead of expensive fixed hosting.\n\nMarketing and adoption efforts are targeted toward existing Cardano community hubs (e.g., Cardano Forum, Discords, Twitter Spaces) rather than high-cost broad campaigns.\n\nOpen-Source Multiplier Effect: The budget is not just funding a single product it funds reusable code, developer documentation, and an open standard for wallet event notifications that can be built upon indefinitely without further Catalyst funding.\n\nProportionality of Costs:\n\n\n\nThe 120,000 ADA request covers 100% of required expenses with no hidden shortfall.\n\n\n\nMilestone-based disbursement ensures Catalyst only pays when verifiable progress is delivered.\n\n\n\nSimilar scope blockchain alerting systems like Ethereum and Solana cost $90–100k to develop, making this proposal 40–50% cheaper while remaining feature-competitive.\n\n\n\nBy combining strategic technical investment, ecosystem-wide accessibility, and open-source development, this project delivers far more than a single product, it creates a foundational layer that strengthens Cardano’s utility, resilience, and attractiveness to builders and users alike.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that evidence of prior research, whitepaper, design, or proof-of-concept is provided.","description":"Foundational Work:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes ecosystem research and uses the findings to either (a) justify its uniqueness over existing solutions or (b) demonstrate the value of its novel approach.","description":"Ecosystem Value Proposition:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal demonstrates technical capability via verifiable in-house talent or a confirmed development partner (GitHub, LinkedIn, portfolio, etc.)","description":"Builder Credentials:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly defines the problem and the value of the on-chain utility.","description":"Problem & Use Case:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the primary goal of the proposal is a working prototype deployed on at least a Cardano testnet.","description":"Tangible Prototype:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal outlines a credible and clear technical plan and architecture.","description":"Technical Approach:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget and timeline (≤ 12 months) are realistic for the proposed work.","description":"Realistic Scope:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes a community engagement and feedback plan to amplify prototype adoption with the Cardano ecosystem.","description":"Community Engagement:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget is for future development only; excludes retroactive funding, incentives, giveaways, re-granting, or sub-treasuries.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"AI","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1795}