{"pr_id":"019ac2aa-3f5f-7394-9a44-796330961fba","title":"OncoChain – turning Cancer Research into On-Chain Action","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Cancer research lacks transparency, collaboration, and most importantly, blockchain integration. Oncology projects worldwide remain disconnected from Cardano, missing a key opportunity.","solution":"We will connect with cancer institutions and researchers, co-create real Cardano use cases, and share an open report to spark adoption and bring Cardano closer to science.","proposer_name":"Dandeu Leonardo, PhD","proposer_relevant_experience":"We’re a small team — but mighty where it counts. What brings us together is a shared purpose: to bridge the world of science with the possibilities of Cardano. Between us, we’ve got the science, the experience, the creative firepower — and the track record to back it up.\n\n1. Leonardo Dandeu – Project Lead &amp; Educational Lead\n\nLinkedin [https://www\\.linkedin\\.com/in/leonardo\\-dandeu\\-15ab33aa/](https://www.linkedin.com/in/leonardo-dandeu-15ab33aa/) | Research Profile [https://bicyt\\.conicet\\.gov\\.ar/fichas/p/leonardo\\-nestor\\-ruben\\-dandeu](https://bicyt.conicet.gov.ar/fichas/p/leonardo-nestor-ruben-dandeu)\n\nLeonardo is a licensed hematologist and breast cancer researcher with hands-on clinical and academic experience across Latin America. He’s currently a PhD fellow at CONICET — Argentina’s national science council — and lead author of a published study on breast cancer (PubMed [https://pubmed\\.ncbi\\.nlm\\.nih\\.gov/39927763/\\)\\.](https://pubmed.ncbi.nlm.nih.gov/39927763/).)\n\nBut he’s not just about lab coats and research papers. Leo has also been exploring the frontier between science and blockchain. He’s part of the DeSci Quark alumni network, has helped test their early educational programs, and won a Cardano Ideathon in 2024 with a proposal on blockchain for healthcare.\n\nIn this project, he’s the heart of the mission — guiding the vision, crafting the educational sessions, and connecting directly with oncology experts in the field.\n\n1. Nerina Ermacora – Project Coordinator &amp; Media/Design Lead\n\nLinkedin: [https://www\\.linkedin\\.com/in/nerina\\-ermacora/](https://www.linkedin.com/in/nerina-ermacora/)\n\nNerina brings a rare mix of precision, creativity, and people skills. She’s a specialist in client management and institutional relations — and also a talented visual designer. She was co‑proposer of the successfully completed DeSci Quark project ([https://desciquark\\.com/en/](https://desciquark.com/en/)) (Catalyst F13, ID 1300094), where she managed overall coordination, produced multimedia content (interviews, editing, visual design), and built strong bridges with researchers and students.\n\nFor this project, she’s managing day-to-day ops, producing all visual and video content, and taking care of communications with participants, guests, and the research community.\n\nTogether, we bring:\n\n✔ Real-world scientific knowledge (cancer, hematology, Latin American healthcare)\n\n✔ Hands-on experience with blockchain, Web3, and the Cardano ecosystem\n\n✔ Proven project delivery — education, design, and community building","url":null,"funds":45000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"OncoChain – turning Cancer Research into On-Chain Action","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Dandeu Leonardo, PhD","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Individual","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":45000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cancer research lacks transparency, collaboration, and most importantly, blockchain integration. Oncology projects worldwide remain disconnected from Cardano, missing a key opportunity.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"We will connect with cancer institutions and researchers, co-create real Cardano use cases, and share an open report to spark adoption and bring Cardano closer to science.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":{"links":[]},"sub_fields":null},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Yes — 100% open source.\n\nAlthough this project doesn't involve software or code, all outputs will be publicly available, free to use, adapt, and share.\n\nWe believe in open science, open knowledge, and open collaboration. This project is built to spread — not to be locked behind paywalls or permissions.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Healthcare","group":"Real World Applications"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We’re reaching out to a group that doesn’t usually show up in Web3 conversations: cancer researchers, scientists, and medical institutions across Latin America—especially those working on breast cancer and big data.\n\n**How?** Through personal outreach, partnerships with universities, and using the DeSci Quark network—which already connects 16+ speakers and projects across the region. That’s our launchpad.\n\nWe’ll run 3 online sessions. Short, clear, human-friendly. No prior blockchain knowledge needed. Just real stories, real tools, and hands-on ideas about how Cardano can help with transparency, collaboration, and research integrity in cancer science.\n\nThese sessions will be led by:\n\n – Leonardo Dandeu, PhD (a breast cancer researcher, licensed hematologist, and DeSci Quark alum who knows both sides: science and blockchain)\n\n – And special guests from the DeSci and Cardano communities who bring use cases to life.\n\n**Why now? Why Cardano?**\n\nBecause the tools are here. What’s missing is connection. Cancer researchers don’t need to become developers—but they do need to know how traceability and decentralization could help their work. We’re here to build that bridge.\n\n**What we’ll do \\(and measure\\):**\n\n ✔️ at least 3 open educational sessions\n\n ✔️ at least 10 interviews with real researchers\n\n ✔️ at least 50+ people reached (tracked with forms)\n\n ✔️ Knowledge growth, measured with pre/post surveys\n\nLet’s bring Cardano into the labs, clinics, and classrooms where it can truly make a difference.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"**What We’ll Actually Do \\(Step by Step\\)**:\n\nStart by mapping the landscape\n\nWe’ll dive into the world of oncology in Latin America—looking for institutions, researchers, and projects working on cancer (especially breast cancer) and data-heavy research. Then we’ll organize all that into a living, shareable resource.\n\n\n\n\n\n**Talk to the people doing the work**\n\n We’ll sit down with 10 experts—oncologists, data scientists, public health researchers—and ask them: What’s hard? What’s broken? Where could blockchain help? These interviews won’t just be data… they’ll be the heart of the whole project.\n\n\n\n\n\n**Run 3 friendly, hands\\-on online sessions**\n\nNo complex code. Just real talk about how blockchain—and Cardano specifically—can make a difference in medical research. These sessions will be tailored for non-tech folks in science, led by people who speak their language.\n\n\n\n\n\n**Co\\-create use cases with real researchers**\n\nTogether with those we meet, we’ll design at least 3 concrete Cardano-based solutions. Things that could actually be used in cancer research to improve things like traceability, data sharing, or research transparency.\n\n\n\n\n\n**Wrap it all up in a report \\(and make it free\\!\\)**\n\nOnce we’ve learned and built together, we’ll put everything into an open-access, easy-to-read report. It’ll include insights, stories, mapped opportunities, and ready-to-use ideas. We want others to read it, use it, and build on it.\n\n\n\n\n\n**Share it with the world**\n\nWe’ll spread the word on X, LinkedIn, and Cardano Forum.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"We’ll know this project is working when real scientists aren’t just listening — they’re leaning in, asking questions, and imagining how Cardano could fit into their research.\n\nHere’s how we’ll track our progress (and keep it real):\n\n What we’re aiming for:\n\n- 3 open-access learning sessions delivered, recorded, and shared\n- 50+ professionals joining and showing interest (we’ll track sign-ups)\n- 10 one-on-one interviews with researchers, oncologists, and data folks\n- 3 solid use cases co-created with scientists, clearly explained for others to build on\n- 1 open-access report—not just a PDF, but something useful, clear, and shareable\n- Pre- and post-session surveys to see if people’s understanding of Cardano really grows\n\n\n\nBut honestly, the biggest win?\n\nIt’s when a researcher finishes a session and says, “Huh... this blockchain thing might actually solve something we’re dealing with.”\n\nThat moment of curiosity—that’s what we’re chasing.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"We believe science deserves better tools — and let’s be honest, we all know Cardano has some of the best tech out there for the job. It’s built on peer-reviewed research, scientific rigor, and a commitment to doing things right. What better fit for the scientific world?\n\nBut here’s the thing...\n\nRight now, most researchers in Latin America — especially those working on cancer (like breast cancer) — are completely out of the Web3 loop. Not because they’re not curious... but because no one’s ever really invited them in. They’re stuck dealing with broken systems, scattered data, low collaboration, and to make things harder, super limited funding — particularly in LATAM.\n\nSo, we’re here to strengthen that bridge between science and Cardano. With real connections and practical actions.\n\n**What’s the plan? Simple\\. Connect, educate, co\\-create\\.**\n\nWe’ll start by mapping out the research scene — finding cancer researchers, labs, and institutions across Latin America that might benefit from blockchain. We’ll reach out personally, through universities and our DeSci Quark network (which already includes 16+ researchers and collaborators).\n\nNext, we’ll host 3 live online sessions — designed specifically for scientists who are curious, but totally new to blockchain. Just clear, beginner-friendly content that shows how Cardano could actually help in their work. These sessions will be led by people they can relate to — like Leonardo Dandeu, a breast cancer researcher and DeSci Quark alum who knows both worlds.\n\nBut we’re not stopping at conversations.\n\nWe’ll actually co-create use cases side by side with selected researchers. Think real-world examples: how Cardano can support traceability, improve research integrity, or unlock better collaboration across labs.\n\n**And to make sure this spreads?**\n\nWe’ll wrap everything into an open-access report — easy to read, easy to share, full of visuals, case studies, and takeaways. It’s built to inspire action and help others replicate the model across regions.\n\n**Why does this matter to Cardano?**\n\nBecause it opens doors. It brings in brilliant, dedicated people from the world of science — folks working on life-changing challenges — and shows them how Cardano can be part of the solution. That’s adoption with impact. It builds trust, expands our reach, and shows the world what this ecosystem is really capable of.\n\nWe’re not just planting ideas. We’re planting seeds — for long-term adoption, meaningful collaboration, and real-world change.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"We’re bringing Cardano into a space where it can really make a difference: C**ancer Research World\\.**\n\nMost oncology scientists — especially in Latin America — don’t know much (if anything) about blockchain. They're focused on saving lives, running clinical trials, managing data... not minting NFTs or staking ADA. And yet — Cardano has tools that could genuinely help them: better traceability, transparent data sharing, collaboration without borders.\n\n**That’s the opportunity\\.**\n\nWith this project, we’ll introduce 50+ professionals — researchers, doctors, analysts — to Cardano. Not with hype. But with conversations, real examples, and thoughtful sessions made just for them.\n\nWe’re not just “raising awareness.” We’re building a relationship.\n\n\n\n**The ripple effects?**\n\n-Researchers start to see Cardano as more than tech — as a partner in their mission.\n\n-The DeSci and Cardano worlds get a little closer.\n\n-More meaningful, high-impact use cases emerge (the kind you can’t fake).\n\n-And Cardano earns a seat at the table in conversations about science, health, and trust.\n\n\n\n\n\n**How we’ll know it’s working:**\n\n-At least 3 sessions hosted, with professionals registered and attending.\n\n-Surveys before and after, to measure the shift in understanding.\n\n-3+ Cardano use cases co-created, not imagined — real ideas from real people in the field.\n\n-Our final open-access report downloaded, shared, and talked about.\n\n\n\nAnd we’ll make it all public — on X, LinkedIn, and across the Cardano ecosystem .\n\nBecause if we want Cardano to grow, we need to show up in places that matter.\n\nThis project is one way to do just that — **with empathy, with purpose, and with people who care deeply about solving real\\-world problems\\.**","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"We’re building on real things that already work. This project grows from a solid base: a network that’s alive and kicking, lived experience in the field, and one goal that drives us — bringing Cardano closer to the world of science. Not in theory. In practice.\n\n**The people behind it\\.**\n\nFirst up, Leonardo Dandeu — a licensed hematologist, breast cancer researcher, and someone who knows the realities of healthcare in Latin America first-hand. He’s not just reading papers — he’s living it. And he’s been exploring how Cardano blockchain can actually help. He even won a Cardano Ideathon for his ideas on blockchain in health. So yeah, this isn’t just a curiosity for him — it’s a mission.\n\nAnd right there with him is Nerina Ermacora — creative lead, general coordinator, and co-proposer of the DeSci Quark project (funded and completed in Catalyst Fund 13). She was behind the scenes making it all happen: planning, recording, editing, and building real relationships with scientists and students. Her track record speaks for itself. She’s not “interested in science” — she’s part of the network that makes these bridges possible.\n\nTogether, they’re supported by the DeSci Quark community — a collective that’s been connecting the dots between researchers and Web3 builders for the last couple of years. We’re talking live workshops, open interviews, collaborations across 5+ countries — and dozens of hours of real content with scientists, educators, and innovators.\n\n**Connection\\. Education\\. Co\\-creation\\.**\n\nWe’ve done this before. We’ve hosted blockchain sessions for beginners. We’ve talked to scientists. We’ve helped “non-Web3” folks take their first step and feel comfortable doing it. That’s why we’re confident we can deliver: 3 educational sessions, 10 expert interviews, and an actionable open report. This isn’t guesswork — we’ve got the systems, the formats, and most of all, the trust.\n\n\n\n\n\nThis isn’t a big wild shot in the dark. It’s the natural next step for a team that’s already building this bridge — between two worlds that have so much to gain from each other.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Oncology Landscape Mapping & Stakeholder Outreach","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- A comprehensive map of oncology-related institutions, researchers, and initiatives across Latin America — with emphasis on breast cancer and data-driven projects.\n- Direct outreach to at least 30 researchers/institutions, documented via contact logs and responses.\n- Confirmation of participation for 3 online educational sessions (minimum 50 total attendees).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Submission of a public document listing all identified research institutions, scientists, and contact points across LATAM.\n- Submission of email/contact logs and confirmations from participants.\n- Calendar confirmation created for the 3 online sessions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"**Public Google Drive folder containing:**\n\n\n\n- Mapping document (PDF or spreadsheet)\n- Outreach logs\n- Links to event  pages and registration confirmations","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":18000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"40 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Education Sessions, Interviews & Use Case Design","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Delivery of 3 open-access educational sessions tailored for scientists with no blockchain background.\n- Completion of at least 10 expert interviews with oncology researchers and data scientists.\n- Co-creation of at least 3 real-world Cardano use cases in collaboration with researchers.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Recordings of all 3 sessions, with attendance logs and pre/post surveys.\n- Transcripts or summaries of 10 expert interviews, with consent for public sharing.\n- Documented description of 3 Cardano-based use cases, detailing the challenge addressed and how Cardano could help.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Google Drive folder containing:\n\n- Video links and survey results for each session\n- PDFs or written summaries of interviews\n- Final “Use Case Pack” with visuals and explanations","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":22500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"90 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Final Report & Video","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Design and publication of a visual, open-access final report that summarizes the entire project: from the mapping of cancer researchers in LATAM, to insights from expert interviews, to the co-created Cardano use cases. \n-  A short summary video that highlights the project journey, key takeaways, and practical examples of Cardano in action. The video will be published on YouTube and social platforms.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Submission of final report in both downloadable PDF. The report will include mapped research opportunities, interview insights, co-created Cardano use cases, and visual summaries to make it accessible for both technical and non-technical audiences. \n- A public YouTube link to the final summary video. The video will offer a concise walkthrough of the project’s highlights — showing what was done, why it matters, and how others can build on it.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Publicly accessible links will be provided to ensure full transparency and accountability:\n\n\n\n- Final open-access report: Hosted on Google Drive (PDF). \n- Summary video: Published on YouTube.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":4500,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"We’re a small team — but mighty where it counts. What brings us together is a shared purpose: to bridge the world of science with the possibilities of Cardano. Between us, we’ve got the science, the experience, the creative firepower — and the track record to back it up.\n\n1. Leonardo Dandeu – Project Lead &amp; Educational Lead\n\nLinkedin [https://www\\.linkedin\\.com/in/leonardo\\-dandeu\\-15ab33aa/](https://www.linkedin.com/in/leonardo-dandeu-15ab33aa/) | Research Profile [https://bicyt\\.conicet\\.gov\\.ar/fichas/p/leonardo\\-nestor\\-ruben\\-dandeu](https://bicyt.conicet.gov.ar/fichas/p/leonardo-nestor-ruben-dandeu)\n\nLeonardo is a licensed hematologist and breast cancer researcher with hands-on clinical and academic experience across Latin America. He’s currently a PhD fellow at CONICET — Argentina’s national science council — and lead author of a published study on breast cancer (PubMed [https://pubmed\\.ncbi\\.nlm\\.nih\\.gov/39927763/\\)\\.](https://pubmed.ncbi.nlm.nih.gov/39927763/).)\n\nBut he’s not just about lab coats and research papers. Leo has also been exploring the frontier between science and blockchain. He’s part of the DeSci Quark alumni network, has helped test their early educational programs, and won a Cardano Ideathon in 2024 with a proposal on blockchain for healthcare.\n\nIn this project, he’s the heart of the mission — guiding the vision, crafting the educational sessions, and connecting directly with oncology experts in the field.\n\n1. Nerina Ermacora – Project Coordinator &amp; Media/Design Lead\n\nLinkedin: [https://www\\.linkedin\\.com/in/nerina\\-ermacora/](https://www.linkedin.com/in/nerina-ermacora/)\n\nNerina brings a rare mix of precision, creativity, and people skills. She’s a specialist in client management and institutional relations — and also a talented visual designer. She was co‑proposer of the successfully completed DeSci Quark project ([https://desciquark\\.com/en/](https://desciquark.com/en/)) (Catalyst F13, ID 1300094), where she managed overall coordination, produced multimedia content (interviews, editing, visual design), and built strong bridges with researchers and students.\n\nFor this project, she’s managing day-to-day ops, producing all visual and video content, and taking care of communications with participants, guests, and the research community.\n\nTogether, we bring:\n\n✔ Real-world scientific knowledge (cancer, hematology, Latin American healthcare)\n\n✔ Hands-on experience with blockchain, Web3, and the Cardano ecosystem\n\n✔ Proven project delivery — education, design, and community building","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"**by milestone \\+ role**\n\nWe’ve kept our budget focused, fair, and grounded in reality. This is a lightweight, community-led project — not a heavy tech build — so the costs reflect our emphasis on human connection, educational delivery, and meaningful engagement.\n\n**Milestone 1:**\n\nThis first phase (2 months) sets the foundation — identifying relevant oncology teams across LATAM, designing our educational session format, preparing communications, and launching outreach. It includes strategy, research, and early prep for engagement.\n\nLeonardo Dandeu will lead the scientific mapping, define the educational content roadmap, and coordinate expert outreach (~80 hours).\n\nNerina Ermacora will handle visual/graphic prep, communications planning, and content logistics (~60 hours).\n\nTogether, they’ll co-create all session materials, initial contact messages, and participant onboarding docs (~100 hours combined).\n\nEstimated Cost: ₳18,000 (~$7,200)\n\n**Milestone 2:**\n\nThis is the heart of the project (3 months) — hosting three live educational sessions, conducting 10 interviews with oncology experts, and producing co-created Cardano use cases.\n\nLeonardo Dandeu will host and moderate all live sessions, prep interview guides, lead scientific conversations and create the use cases document (~180 hours).\n\nNerina Ermacora will manage all logistics, produce/record/edit interviews and live sessions, and coordinate researcher participation (~80 hours).\n\nTime is also allocated for follow-ups, note-taking, and transcription of key quotes and insights (~40 hours).\n\nEstimated Cost: ₳22,500 (~9,000)\n\nMilestone 3:\n\nIn this final stage, we’ll package everything into a practical, beautiful, open-access report — plus a short summary video to help share the project far and wide.\n\nNerina Ermacora will design the full report, edit visuals, and produce the video (script, subtitles, editing, distribution) (~40 hours).\n\nLeonardo Dandeu will synthesize insights from the sessions and interviews, write key content sections, and review the final publication (~20 hours).\n\nEstimated Cost: ₳4,500 (~$1,800)\n\n**Total Budget**\n\n₳45,000 ADA (roughly $18,000 USD). We’re applying a standard hourly rate of $30/hour, based on current freelance benchmarks for experienced professionals in education, media, and Web3 coordination. At the time of submission (Nov, 2025), the ADA/USD rate was 1 ADA ~ $0.40.\n\n_Transparent\\. Trackable\\. And fully aligned with the effort, time, and expertise required to make this project a success\\._","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"We’re asking for ₳45,000 — roughly $18,000 USD as of November 2025,  for a 6‑month project that brings Cardano into the world of cancer research through education, co‑creation, and real community engagement… _honestly, it’s a pretty modest ask_.\n\nAnd this isn’t some vague “exploration” with uncertain outcomes. It’s very concrete. We’re delivering 3 live educational sessions, 10 expert interviews, and a set of real Cardano use cases co-created with researchers who actually work on oncology every day.\n\nThe budget simply covers skilled, hands-on work — planning, teaching, interviewing, designing, producing content, and coordinating with institutions across Latin America.\n\n**_But the real question is: what does Cardano gain from this?_**\n\nA foothold in one of the most meaningful real-world sectors — healthcare, and more specifically, cancer research. New scientists discovering Cardano not through hype or speculation, but through practical examples they can actually use. A bridge — genuine, thoughtful — between the DeSci movement and the Cardano ecosystem.\n\nWe’re not overpromising. No moonshots here. Just solid, careful work by people who’ve already delivered in Catalyst and know how to move between the worlds of science and Web3.\n\nAnd the impact doesn’t end with us. The model is simple, replicable, and ready to be reused anywhere. It opens doors for Cardano in Latin America and beyond — in a field where integrity, transparency, and collaboration really matter.\n\nIn short: it’s real value, for real people, with real potential for Cardano.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Healthcare","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1796}