{"pr_id":"019ac33c-de24-790c-a748-987fc6e07ac1","title":"PR Workshop for Cardano Projects by professional PR agency","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"Cardano projects often struggle with public relations; many lack the skills to effectively market themselves, limiting their visibility and growth.","solution":"Yellow House GmbH will host a free PR workshop to empower Cardano projects with the skills needed to enhance their media presence and market effectively.","proposer_name":"Christopher Flato","proposer_relevant_experience":"Chris Flato: Chris breaths esports and gaming every day. He once managed Communications for ESL, the world's largest esports company, and his extensive network is matched only by his confidence in his gaming skills. He is doing what a CEO does, attending all possible conferences and making sure everybody is paid at the end of the month.\n\n\n\nNils Lassen: Nils brings years of PR and communications experience within and outside the gaming and esports ecosystem to our yellow house. As an all-rounder, he leads the operational business and supports our clients like a loyal husband in good times and bad. So, as a wise woman once said: “If you liked it then you shoulda put a ring on it”.","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"PR Workshop for Cardano Projects by professional PR agency","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Christopher Flato","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":4,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"Cardano projects often struggle with public relations; many lack the skills to effectively market themselves, limiting their visibility and growth.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Yellow House GmbH will host a free PR workshop to empower Cardano projects with the skills needed to enhance their media presence and market effectively.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://yellowhouse.gmbh/"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"All materials for the workshop will be open source.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Community Outreach","group":"Community & Outreach"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"We are targeting Cardano projects who want to receive help &amp; support in their marketing, specifically PR efforts. We know most Cardano projects are not at the size where they can actually hire PR experts, so we hope to give them a good boost even without the additional cost.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"Pre and Post-Workshop Surveys: To measure the increase in PR knowledge and confidence among participants.\n\nFollow-Up Interviews: Conducting interviews with participants to document how they applied what they learned.\n\nCase Studies: Highlighting specific successes where projects increased their visibility using strategies from the workshop.\n\nEngagement Metrics: Tracking social media and website analytics before and after the workshop to see tangible improvements.\n\n\n\nOur workshop is uniquely designed for the Cardano ecosystem, focusing on the specific challenges and opportunities within this blockchain environment. The participants will benefit from Yellow House GmbH's decade of experience in PR, gaining insights that are directly applicable and immediately beneficial.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"We will measure the impact by:\n\n\n\nKnowledge Gain: Assessing the increase in PR knowledge through pre and post-workshop assessments.\n\nApplication of Skills: Monitoring how participants apply skills over the months following the workshop.\n\nVisibility and Engagement: Measuring the media coverage and social media improvements of participating projects.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"Many emerging projects on the Cardano blockchain have groundbreaking ideas but fail to communicate their value effectively to a broader audience. Without strong public relations and marketing skills, these projects cannot attract the attention they need to grow, find investors, or engage users. This lack of visibility is a significant barrier to success and adoption within the vibrant Cardano ecosystem.\n\n\n\nYellow House GmbH believes that by equipping these projects with essential PR skills and knowledge, we can enable them to tell their stories compellingly. This empowerment will lead to increased visibility, attracting more support and recognition from the broader blockchain community. A workshop format is ideal because it allows for interactive, hands-on learning and direct feedback, making it more impactful than one-way communication methods.\n\n\n\nThis PR workshop will engage:\n\n\n\nCardano Project Leaders and Teams: To learn about effective PR strategies and apply them to their projects.\n\nMarketing and Communication Professionals: To share insights and best practices in blockchain PR.\n\nMedia Representatives: To discuss what they look for in stories and how projects can better interact with the press.\n\nCommunity Managers and Social Media Coordinators: To understand how to use digital platforms for better project storytelling.\n\nThe impact of the workshop will be demonstrated through:\n\n\n\nPre and Post-Workshop Surveys: To measure the increase in PR knowledge and confidence among participants.\n\nFollow-Up Interviews: Conducting interviews with participants to document how they applied what they learned.\n\nCase Studies: Highlighting specific successes where projects increased their visibility using strategies from the workshop.\n\nEngagement Metrics: Tracking social media and website analytics before and after the workshop to see tangible improvements.\n\nOur workshop is uniquely designed for the Cardano ecosystem, focusing on the specific challenges and opportunities within this blockchain environment. The participants will benefit from Yellow House GmbH's decade of experience in PR, gaining insights that are directly applicable and immediately beneficial.\n\n\n\nThis initiative is crucial for Cardano because improving the PR capabilities of its projects will lead to a more vibrant, dynamic, and successful ecosystem, attracting more users, developers, and investors.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This project offers excellent value for money by:\n\n\n\nDirectly Empowering the Community: The workshop builds capacity within the Cardano ecosystem, enabling projects to be more successful and self-sufficient.\n\nCreating Long-Term Value: Skills and knowledge gained from the workshop will continue to benefit the projects long after the workshop ends.\n\nLeveraging Expertise Efficiently: Using Yellow House GmbH's expertise ensures that the resources are used effectively to achieve significant improvements in PR for Cardano projects.\n\nThis proposal aims to significantly enhance the PR capabilities of projects within the Cardano ecosystem, ensuring they have the skills necessary to thrive and contribute to a more vibrant and successful Cardano community.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Yellow House GmbH is a professional PR and communications agency with:\n\n\n\nExpert Knowledge: Specialized in digital cultures and blockchain technology.\n\nProven Track Record: Successful in elevating the profiles of numerous tech and digital projects.\n\nDedicated Team: Experienced in conducting workshops and training sessions that empower participants with practical skills.\n\nThe approach's feasibility will be validated through:\n\n\n\nPilot Workshops: Conducting initial small-scale workshops to refine the curriculum based on feedback.\n\nCollaborative Planning: Working with Cardano community leaders to ensure the workshop meets the needs of the participants.\n\nFeedback Loops: Incorporating participant feedback to continually improve the workshop's content and delivery.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Workshop Development and Participant Enrollment","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Develop and finalize a comprehensive workshop curriculum that outlines all planned modules, learning objectives, hands-on activities, and support materials. Begin outreach efforts to promote the workshop to relevant Cardano project teams and community members, open the enrollment process, and complete participant registration. This includes managing inquiries, confirming eligibility, and ensuring that all selected participants have the necessary information prior to the workshop date.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The full workshop curriculum must be completed, reviewed, and approved internally. All instructional materials should be ready for delivery, including slides, worksheets, and reference guides. The participant list should be finalized with confirmed registrations, ensuring a diverse and representative group of attendees from various Cardano projects. All logistical requirements for participants—such as schedules, expectations, and preparatory instructions - should be communicated clearly.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A finalized workshop curriculum document, including agendas and learning materials, and a complete set of participant registration forms or digital confirmations. Additional evidence may include enrollment records, outreach summaries, and communication logs with participants.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":1,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":10000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"30 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Conduct the PR Workshop","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Successfully deliver the full-day PR workshop designed specifically for Cardano projects. This includes facilitating interactive discussions, presenting educational modules, conducting practical exercises, and providing real-time guidance tailored to participants' communication needs. The workshop should create an engaging and collaborative environment that maximizes learning and participation.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"The workshop must be delivered according to the finalized curriculum, maintaining a high standard of educational quality and participant engagement. Attendees should actively participate in activities, ask questions, and demonstrate an understanding of the PR concepts being taught. The facilitator should receive positive verbal feedback, and the workshop should run smoothly from start to finish with minimal disruptions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"A full set of workshop presentation slides, participant attendance records, and photos or screenshots capturing moments of engagement and interaction during the event. Additional evidence may include facilitator notes, participant feedback forms, and summaries of workshop discussions.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":30000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"70 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"Post-Workshop Support and Impact Assessment","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"Provide personalized follow-up support to participants after the workshop, which may include reviewing drafted PR materials, offering strategic guidance, hosting optional check-in meetings, or giving individualized recommendations. Conduct an impact assessment to evaluate how participants are applying the workshop content to improve their PR practices, communication strategies, and project visibility.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"Participants demonstrate measurable improvements in their PR activities, such as enhanced clarity in messaging, more consistent communication efforts, improved outreach results, or better engagement with their target audiences. These improvements must be documented through qualitative or quantitative assessment methods.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"Documentation summarizing all follow-up support provided, including communication records, feedback notes, or advisory materials; a comprehensive impact assessment report detailing observed outcomes, participant progress, and overall effectiveness of the workshop.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":20000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"Chris Flato: Chris breaths esports and gaming every day. He once managed Communications for ESL, the world's largest esports company, and his extensive network is matched only by his confidence in his gaming skills. He is doing what a CEO does, attending all possible conferences and making sure everybody is paid at the end of the month.\n\n\n\nNils Lassen: Nils brings years of PR and communications experience within and outside the gaming and esports ecosystem to our yellow house. As an all-rounder, he leads the operational business and supports our clients like a loyal husband in good times and bad. So, as a wise woman once said: “If you liked it then you shoulda put a ring on it”.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Cost Breakdown\n\n\n\nWorkshop Development: 20,000 for research, curriculum development, and material preparation.\n\nParticipant Support: 20,000 for providing materials and support to participants.\n\nMarketing and Outreach: 10,000 for promoting the workshop within the Cardano community.\n\nPost-Workshop Support and Impact Assessment: 10,000 for follow-up support and documentation.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"This project offers excellent value for money by:\n\n\n\nDirectly Empowering the Community: The workshop builds capacity within the Cardano ecosystem, enabling projects to be more successful and self-sufficient.\n\nCreating Long-Term Value: Skills and knowledge gained from the workshop will continue to benefit the projects long after the workshop ends.\n\nLeveraging Expertise Efficiently: Using Yellow House GmbH's expertise ensures that the resources are used effectively to achieve significant improvements in PR for Cardano projects.\n\nThis proposal aims to significantly enhance the PR capabilities of projects within the Cardano ecosystem, ensuring they have the skills necessary to thrive and contribute to a more vibrant and successful Cardano community.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Community Outreach","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1797}