{"pr_id":"019abfc4-e8eb-7d0d-b892-6098bf8712a7","title":"ROAD TO AI-POWERED DECENTRALIZATION ","event_id":15,"objective":39,"objective_title":"Cardano Open: Ecosystem","summary":"The core problem is the underdeveloped pipeline and lack of a structured, continuous journey for young Vietnamese builders to effectively integrate AI from Web2 space into the Cardano Web3 ecosystem","solution":"Addresses the lack of a structured pipeline to integrate AI from Web2 into the Cardano Web3 ecosystem in Vietnam, aiming to generate high-quality, officially recognized applications","proposer_name":"Hanna Nguyen","proposer_relevant_experience":"**1\\. Hanna Nguyen \\- Labs Manager, SCI Labs**\n\n- 5+ years of lead experience in the blockchain industry\n- 3+ years of incubation programs\n- Success in incubating 6 projects in 2 years, and 3 of them successfully in creating revenue and a stable community\n- Advisor for Growth and Marketing Strategy\n- X: [https://x\\.com/Hanna\\_SCI](https://x.com/Hanna_SCI)\n\n**2\\. Kurt Nguyen \\- Growth Manager, SCI Labs\\.**\n\n- 4+ years of experience in the blockchain industry\n- 2+ years of fintech experience in Japan\n- Founder of Phuoc Bau Community ( 1 of 10 top Crypto Communities in VN with 12,000+ users)\n- Researcher in Defi ( especially in LSDfi, RWAs, stablecoin analysis)\n- X: [https://x\\.com/kurtfortrade](https://x.com/kurtfortrade)\n- LinkedIn: [https://www\\.linkedin\\.com/in/giang\\-nguyen\\-184257188/](https://www.linkedin.com/in/giang-nguyen-184257188/)\n\n**3\\. Cindy Nguyen \\- Marketing Executive, SCI Labs**\n\n- 2+ years of experience in marketing and community management within the blockchain industry.\n- Experienced in managing and growing social media channels (Facebook, X, Telegram) for SCI Labs and its incubated projects, reaching a combined audience of 1,000+ followers.\n- Built and maintained the VNST community (an incubated project of SCI Labs) with 900+ MAU through consistent brand communication and performance tracking.\n- LinkedIn: [https://www\\.linkedin\\.com/in/minhchaunguyen16/](https://www.linkedin.com/in/minhchaunguyen16/)\n\n**4\\. Mina Ngo \\- Business Development Executive, SCI Labs**\n\n- 2+ years in business development and partnership in blockchain, community and CEX\n- Involved in the organization of 4+ blockchain hackathons\n- Strong understanding of hackathon dynamics, onboarding pipelines, prize design, judging frameworks and post-event conversion\n- Demonstrated ability to connect builders with investors, technical advisors and ecosystem stakeholders\n- LinkedIn: [http://linkedin\\.com/in/minh\\-phuong\\-1274171a3](http://linkedin.com/in/minh-phuong-1274171a3)\n\n**Advisor Nguyen Viet Thanh:**\n\n- CEO of Vtechcom-  A leading technology company in Vietnam\n- 10+ years of experience in enterprise software development and innovative technology solutions\n- Leads a highly skilled engineering team with a strong focus on creativity, R&amp;D, and cutting-edge tech applications\n- Extensive experience in researching, developing and building the Hydra ecosystem, including: \n\n        + Hydra SDK\n\n        + Hydra Playground\n\n        + Hydra Hex Core tools\n\n        + Hydra Wallet\n\n        + Hydra Explorer and various other developer-supporting tools within the ecosystem\n\n- LinkedIn: [https://www\\.linkedin\\.com/in/nguyenvietthanh/](https://www.linkedin.com/in/nguyenvietthanh/)","url":null,"funds":60000,"currency":"","extra":{"fields":[{"ref":"#/definitions/segment","title":"Proposal setup","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Proposal title","description":"Proposal title","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Please provide your proposal title","description":"**Proposal title**\n\nPlease note we suggest you use no more than 60 characters for your proposal title so that it can be easily viewed in the voting app.","format":null,"answer":"ROAD TO AI-POWERED DECENTRALIZATION ","sub_fields":null}]},{"ref":"#/definitions/section","title":"Applicant","description":"Proposer Information","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Applicant name and surname","description":"Name and surname of main applicant","format":null,"answer":"Hanna Nguyen","sub_fields":null},{"ref":"#/definitions/radioButtonSelect","title":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)?","description":"Are you submitting this proposal as an individual or as an entity (whether formally incorporated or not)","format":null,"answer":"Entity (Incorporated)","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Proposal Summary","description":"Key information about your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Budget Information","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/tokenValueCardanoADA","title":"Enter the amount of funding you are requesting in ADA","description":"Requested amount should be between $ADA 15,000 and $ADA 60,000","format":null,"answer":60000,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Time","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/durationInMonths","title":"Please specify how many months you expect your project to last ","description":"Specify the expected duration of your project. Projects must be completable within 2-12 months.","format":null,"answer":6,"sub_fields":null}]},{"ref":"#/definitions/section","title":"Translation Information","description":"Information about the proposal's language and translation status","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Please indicate if your proposal has been auto-translated","description":"Indicate if your proposal has been auto-translated into English from another language","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/languageCode","title":"Original Language","description":"If auto-translated, specify the original language of your proposal","format":null,"answer":"en","sub_fields":null}]},{"ref":"#/definitions/section","title":"Problem Statement","description":"Define the problem your proposal aims to solve","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"What is the problem you want to solve?","description":"Clearly define the problem you aim to solve. This will be visible in the Catalyst voting app.","format":null,"answer":"The core problem is the underdeveloped pipeline and lack of a structured, continuous journey for young Vietnamese builders to effectively integrate AI from Web2 space into the Cardano Web3 ecosystem","sub_fields":null}]},{"ref":"#/definitions/section","title":"Solution Overview","description":"Describe your proposed solution to the problem","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntry","title":"Summarize your solution to the problem","description":"Briefly describe your solution. Focus on what you will do or create to solve the problem.","format":null,"answer":"Addresses the lack of a structured pipeline to integrate AI from Web2 into the Cardano Web3 ecosystem in Vietnam, aiming to generate high-quality, officially recognized applications","sub_fields":null}]},{"ref":"#/definitions/section","title":"Supporting Documentation","description":"Additional resources and documentation for your proposal","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineHttpsURLEntryList","title":"Supporting links","description":"Links to any relevant documentation, code repositories, or marketing materials. All links must use HTTPS. Please make sure that submitters own or have rights to share any linked content.","format":null,"answer":["https://scilabs.io/","https://www.youtube.com/@Longngghienn","https://www.tiktok.com/@longkhongphainong","https://www.facebook.com/scilabs.io"],"sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Dependencies","description":"External dependencies and requirements for project success","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Describe any dependencies or write 'No dependencies'","description":"Here you should list any dependencies and prerequisites for your project's success. These are usually external factors (such as third-party suppliers, external resources, third-party software, etc.) that may cause a delay, since a project has less control over them. In case of third party software, indicate whether you have the necessary licenses and permission to use such software.","format":null,"answer":"No dependencies","sub_fields":null}]},{"ref":"#/definitions/section","title":"Project Open Source","description":"Will your project's output be fully open source? Open source refers to something people can modify and share because its design is publicly accessible.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/yesNoChoice","title":"Will your project's outputs be fully open source?","description":"Select Yes if the project is open source, No if it is not.","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/multiLineTextEntry","title":"Please provide details on the intellectual property (IP) status of your project outputs, including whether they will be released as open source or retained under another licence.","description":"Please provide here more information on the open source status of your project outputs","format":null,"answer":"Mentorship, playbooks, and educational materials will be open-source for community access, while teams retain their project IP, choosing to commercialize or open-source their solutions.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Theme Selection","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Theme","description":"Long-term vision and categorization of your project","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleGroupedTagSelector","title":"Please choose the most relevant theme and tag related to the outcomes of your proposal","description":null,"format":null,"answer":{"tag":"Events","group":"Events & Marketing"},"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Campaign Category","description":"Determine the eligibility of the proposal for this category","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Category Questions","description":"Answer the following questions to determine the eligibility of your proposal.","format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who you’re targeting, how you’ll reach them, and why this matters for Cardano?","description":"Please provide your rationale.","format":null,"answer":"**1\\. Who we target**:\n\n- Young builders, developers, and startup teams in Vietnam.\n- Individuals interested in integrating AI with Web3 technologies, especially on Cardano.\n- Skills focus: AI, blockchain development, DeFi, GovTech, identity systems, RWA (real-world assets) and on-chain data solutions.\n\n**2\\. How we reach them:**\n\n- A continuous pipeline of activities: Ideathon → Builder Hackathon → AI and Web2 Integration into Web3 Program.\n- Structured journey:  \n\n       + AI Genesis Ideathon: attract and generate innovative ideas.\n\n       + Advanced Hackathon: support prototype development and advanced projects.\n\n       + AI and Web2 Integration into Web3 Program: mentoring, technical workshops, and real-world product acceleration.\n\n- Engagement methods: mentorship, workshops, demo days, and community events.\n- Connect participants with experts, investors, and the broader Web3 community.\n\n**3\\. Why this matters for Cardano**\n\n- Cultivates a skilled builder ecosystem in Vietnam for AI-powered projects.\n- Provides a complete pipeline from ideation to Web3 integration.\n- Increases Cardano adoption and community engagement.\n- Fosters innovative projects showcasing Cardano’s strengths in AI, DeFi, and on-chain solutions.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Provide a list of key activities of your project:","description":"Please provide your rationale.","format":null,"answer":"**Milestone\\#1: AI Genesis Ideathon**\n\n- Educational Workshops: Conduct deep-dive sessions on AI fundamentals, Prompt Engineering, Ethics for on-chain AI, and exploring Hydra use cases with advisors from the VTECHCOM team.\n- Idea Generation and Matching: Facilitate the creation of AI for Cardano use cases (e.g., on-chain data augmentation, AI oracles, identity/AML).\n- Idea Pitching: Organize pitching sessions where each team presents their concept in 3-5 minutes to filter high-potential ideas.\n\n**Milestone \\#2: AI Cardano Impact Hackathon**\n\n- Advanced Hackathon: Conduct a 2-3 day hackathon focusing on high-impact tracks: AI for DeFi (risk models), AI for Identity (verifiable claims), and AI for GovTech (automation).\n- Infrastructure Provisioning: Provide teams with access to Hydra nodes and SDK toolkits for development within technical support from the Vtechcom team.\n- Product Testing and Audit: Establish a \"User Testing Corner\" for prototype testing with real users and perform light smart contract audits.\n- Final Demo Day: Organize a final pitching and awarding ceremony for advanced products.\n\n**Milestone \\#3: AI and Web2 Integration into Web3 Program Sharing**\n\n- Integration Labs: Host technical workshops on integrating Web2 AI into Web3 products and provide a Sandbox for testing AI models with smart contracts and on-chain data.\n- 1:1 Mentorship and Approval Support: Provide personalized support from AI and blockchain advisors to prepare documentation, demos, and pitches for the Da Nang blockchain development proposal.\n- Sharing sessions:  Sandbox pilot models and vision of International Finance Center from expert advisors.\n\n**Milestone \\#4: Sandbox Application and Report**\n\n- Project Acceleration &amp; Milestone Tracking: Support projects establish an AI → Web3 transition roadmap following requirements from sandbox. Preparing and submitting proposals for the sandbox pilot application.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What are your success metrics?","description":"Please provide your rationale.","format":null,"answer":"- Adoption: Engage at least 40 teams totally in the Ideathon and Hackathon and upskill 20 advanced AI developers (specializing in AI Agents, Privacy, and Trading).\n- Innovation Pipeline: Convert ideas into 10-15 functional prototypes  and refine them into 5-7 most potential MVPs focusing on DeFi, Identity, GovTech, and AI.\n- Impact: Successfully supported at least 1 Blockchain + AI project to be eligible to apply for the Da Nang development proposal/sandbox, creating a legal precedent for Cardano in Vietnam.\n- Community Reach: 100,000+ social reach","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Your Project and Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Solution","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please describe your proposed solution and how it addresses the problem","description":"Please describe your proposed solution and how it addresses the problem","format":null,"answer":"**A\\. Viet Nam Contextual Analysis**\n\n**1\\.1\\. The Blockchain and AI Ecosystem**\n\n- Vietnam is globally recognized as a top-tier hub for Web3 adoption, but faces a critical quality vs quantity; bottleneck in deep technology integration.\n- High Adoption, Low Deep-Tech Integration\n\n![](https://cdn.hstatic.net/files/200001096509/file/543076530_1092637136376447_6052563029799316075_n.jpg)\n\nSource: [https://www\\.chainalysis\\.com/blog/2025\\-global\\-crypto\\-adoption\\-index/](https://www.chainalysis.com/blog/2025-global-crypto-adoption-index/)\n\n- Data: Vietnam consistently ranks in the Top 5 globally for Crypto Adoption according to the Chainalysis Global Crypto Adoption Index 2024.\n- Market Size: Approximately 17% of the Vietnamese population owns cryptocurrency, ranking 6th globally.\n- The Disconnect: Despite this breadth, the ecosystem is dominated by GameFi and trading. A recent industry report notes that while there are over 5,000 active Web3 developers, the vast majority focus on application layers (frontend/basic smart contracts) rather than deep infrastructure or AI-on-chain integration\n\n**1\\.2\\. The Talent Paradox**\n\nThere is a significant mismatch between the available IT workforce and the specialized skills required for your proposal (AI Agents, Privacy, Data Oracles).\n\n- General Availability vs. Specialized Scarcity: Vietnam has a robust IT workforce, but specialized blockchain-AI engineers are rare. Reports indicate  for high-quality backend and blockchain developers, with strict demands for AI proficiency becoming a new standard.\n- The 10% Gap; Industry observations suggest that less than 10% of active Web3 projects in Vietnam effectively utilize advanced, on-chain AI models for core utility, as most  AI; labels in local projects remain superficial (marketing-driven) rather than technical.\n\n**1\\.3\\. The Regulatory Breakthrough: Da Nang Sandbox**\n\n- Legal Framework: Establishes a dedicated Free Trade Zone and introduces special regulatory mechanisms designed specifically for Da Nang.\n- The Sandbox Pilot: Authorizes Da Nang to implement controlled testing mechanisms (sandbox) for emerging technologies, prioritizing AI, semiconductors, and fintech/blockchain.\n- Strategic Fit: Creates a government-approved testing environment that enables the development and validation of RWA and GovTech solutions generated through the hackathon.\n\n**B\\. Problem Statement:**\n\nWhile Vietnam is a global leader in crypto adoption, the ecosystem faces a critical bottleneck preventing the transition from speculative trading to technological breakthroughs, specifically at the intersection of AI and Blockchain.\n\n**Problem 1: The Surface\\-Level Innovation Trap**\n\nVietnam possesses a dual-talent paradox. On one side, there is a massive pool of Web2 AI engineers; on the other, a vibrant Web3 community. However, these two groups operate in silos.\n\n- The Problem: Current blockchain projects in Vietnam largely focus on application layers (GameFi, basic DeFi) rather than deep infrastructure. There is a scarcity of developers capable of architecting complex systems like AI Oracles, Privacy-Preserving Identity, or AI Agents on Cardano.\n- The Consequence: Without a specialized pipeline, local builders cannot execute high-value use cases (e.g., AI for DeFi risk models or GovTech automation). The ecosystem remains stuck at the MVP stage without evolving into Deep Tech solutions.\n\n**Problem 2: The Regulatory Valley of Death**\n\nInnovative projects frequently stall before market entry because of unclear regulatory pathways.\n\n- The Context: Da Nang is positioning itself as an international financial center and is introducing mechanisms for a blockchain regulatory sandbox, creating a rare and historic opportunity for innovation.\n- The Problem: No clear bridge exists between “Hackathon code” and “Government sandbox” approval, resulting in a lack of legal literacy, proper documentation standards, and professional guidance needed for developers to qualify their projects for official pilot programs.\n- The Consequence: Innovative AI-Blockchain solutions remain theoretical and fail to achieve real-world impact (RWA) or government buy-in.\n\n**C\\. Strategic Framework:**\n\n**Pillar 1: Activation \\(Broaden the Funnel\\)**\n\n- Objective: Bridge the Web2-Web3 divide.\n- Activity: AI Genesis Ideathon\n- Strategy: Introduce AI fundamentals and Cardano's Hydra protocol early to align AI logic with blockchain architecture.\n- Tactics: Capture more than 25 teams and filter for those with genuine AI-for-Cardano use cases (e.g., data augmentation, recommender systems).\n\n**Pillar 2: Specialization \\(Deepen the Tech\\)**\n\n- Objective: Create technical proficiency in high-demand niches.\n- Activity: Impact Hackathon\n- Strategy: Provide mentorship and technical guidance from Vtechcom advisors and engineering team.Shift from general coding to specialized tracks:  \n\n       + AI for DeFi: Building risk models.\n\n       + AI for Identity: Creating on/off-chain verifiable claims.\n\n       + AI for GovTech: Automating administrative flows.\n\n- Tactics: Provide access to Hydra nodes and SDKs, ensuring teams build on sound infrastructure rather than just front-end wrappers.\n\n**Pillar 3: Legitimacy \\(Real\\-World Integration\\)**\n\n- Objective: Bridge the Regulatory Gap.\n- Activity: AI and Web2 Integration into Web3 Program\n- Strategy: Develop top projects as startups, guiding them toward regulatory readiness and market deployment.\n- Tactics: \n\n        + Sandbox Testing: Deploy models on-chain in a controlled environment.\n\n        + Application Support: Provide 1:1 mentorship on preparing dossiers for the Da Nang blockchain development proposal","sub_fields":null}]},{"ref":"#/definitions/section","title":"Impact","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please define the positive impact your project will have on the wider Cardano community","description":"Please define the positive impact your project will have on the wider Cardano community","format":null,"answer":"This initiative creates positive impacts that extend far beyond the Vietnamese market, establishing a framework for institutional adoption globally.\n\n**1\\. Ecosystem Impact \\(Quantitative\\)**\n\n- Talent Activation: Engage 40+ teams totally in the ideation and hackathon phase, ensuring a wide net for talent discovery.\n- Expert Development: Upskill 20 high-level developers specifically in advanced AI/Web3 intersections (AI Agents, Privacy, Trading), creating a specialized workforce that currently does not exist in Vietnam.\n- Product Creation: Generate 5-7 high-quality MVPs ready for deeper incubation.\n\n**2\\. Strategic Impact \\(Qualitative Long\\-Term\\)**\n\n- The Da Nang Precedent: The ultimate success metric is to have at least 1 Blockchain + AI project officially to be eligible to apply for the Da Nang development proposal.\n- Why this matters: This would establish the first legal precedent for a Cardano-based AI project in Vietnam’s public sector/sandbox, opening the door for future enterprise adoption.\n- Web2-to-Web3 Migration: Successfully creating a blueprint for how Web2 AI companies in Vietnam can pivot to Cardano, proving that the ecosystem is ready for complex, data-heavy applications.","sub_fields":null}]},{"ref":"#/definitions/section","title":"Capabilities & Feasibility","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","description":"What is your capability to deliver your project with high levels of trust and accountability? How do you intend to validate if your approach is feasible?","format":null,"answer":"Our capability is built on a foundation of proven operational scale, financial resilience, and established infrastructure. We are not proposing a new experiment; we are scaling a validated model.\n\n**1\\. Proven Execution at Scale**\n\nWe possess a verifiable track record of organizing high-impact blockchain events and educational campaigns in Vietnam. Our operational expertise is demonstrated by:\n\n- Hackathon Leadership: Successfully orchestrated 4 major hackathons, engaging over 100 teams and 500+ participants, proving our ability to manage complex logistics and developer pipelines.\n- Community Authority: Cultivated a massive educational footprint with 300,000+ YouTube followers and regularly hosted 8 builder meetups (1,000+ total attendees), bridging the gap between technical blockchain concepts and financial literacy.\n- Transparency: Our history of successful delivery is documented and verifiable\n- [https://drive\\.google\\.com/file/d/1P5YCeswLwbJqm1brRoMAQ4S4GNC73MlI/view?usp=sharing](https://drive.google.com/file/d/1P5YCeswLwbJqm1brRoMAQ4S4GNC73MlI/view?usp=sharing)\n\n**Feasibility Validation**: Our target of recruiting 30 teams and 20-30 high-level developers is highly feasible. These figures are conservative estimates derived from our baseline historical data, not aspirational guesses. By scaling from proven metrics rather than starting from zero, we virtually eliminate execution risk\n\n**2\\. Financial Strength and Co\\-Incubation Model**\n\n![](https://cdn.hstatic.net/files/200001096509/file/polkadot_vietnam_hackathon_2025.jpg)\n\nSource: [https://drive\\.google\\.com/file/d/16asRqaBlXAP1nZhvqGFwlTc5rDP9JnjQ/view](https://drive.google.com/file/d/16asRqaBlXAP1nZhvqGFwlTc5rDP9JnjQ/view)\n\n![](https://cdn.hstatic.net/files/200001096509/file/nibiru_-_project_incubated_by_sci_labs_won_first_prize_at_gmvn2024.png)\n\nSource: [https://drive\\.google\\.com/file/d/18AC5orkIrGYpuDCEkAtKrP0FM49cwdJw/view](https://drive.google.com/file/d/18AC5orkIrGYpuDCEkAtKrP0FM49cwdJw/view)\n\n![](https://cdn.hstatic.net/files/200001096509/file/475041599_472659022562400_1776780758321117790_n.jpg)\n\nSource: [https://www\\.facebook\\.com/share/17d9Zbquxp/](https://www.facebook.com/share/17d9Zbquxp/)\n\nWe bring significant skin in the game; to ensuring project success, moving beyond simple grant dependency.\n\n- **Track Record**: We have successfully incubated 5 projects, securing and deploying dedicated external funding packages of up to $100,000 USD per project/year.\n- **Co\\-Build Commitment:** We do not just host events; we invest. Our model ensures that winning teams receive continued financial and strategic support beyond the hackathon.\n\n**Feasibility Validation**: Our Co-Build Model validates feasibility by providing a financial safety net. The availability of external funding for incubation ensures that the project output has a clear pathway to survival and growth, generating significant leverage on the Catalyst funds requested.\n\n**3\\. Infrastructure Readiness and Strategic Network**\n\nWe are shovel-ready with the physical and human resources required to start immediately.\n\n- Physical Assets: We own and operate 2 dedicated co-working spaces, ensuring zero logistical friction for offline events, workshops, and team collaboration.\n- Network Effects: Our core team possesses deep ties with the Cardano APAC ecosystem, technical mentors, and industry experts, ensuring high-quality guidance for participants.\n\n**Feasibility Validation** : The project's feasibility is guaranteed by our existing infrastructure. With full-time staff and venues already secured, we face no logistical bottlenecks, allowing us to focus 100% of our effort on curriculum quality and participant support.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Milestones","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Milestones","description":"What are the key milestones you need to achieve in order to complete your project successfully?","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"What are the key milestones you need to achieve in order to complete your project successfully?","description":"The number of milestones required depends on the amount of funding requested. Please refer to the Guidance card on the right for details","format":null,"answer":null,"sub_fields":[{"ref":null,"title":"Milestone #1","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"AI GENESIS IDEATHON 2026","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Cardano Ideathon launched (1-2 months duration)\n- Targeted outreach campaigns via our channels to maximize visibility and recruitment of the 25+ target\n- 20 developers selected & enrolled in advanced training\n- 1-2 Builder Meet-ups executed\n- Hackathon recruitment campaign activated reaching 80% of target\n- User Adoption Campaign continues, expanding the funnel toward 300–350 total users","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Ideathon page live with submission system activated\n- Minimum 25 valid project submissions\n- 20 developers confirmed via registration & onboarding\n- At least 1 Builder Meet-up delivered with >50 participants\n- Hackathon recruitment hitting minimum 24/30 team pre-registrations\n- User adoption continues, adding 150+ new users (cumulative 300–350 engaged users","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Ideathon submission dashboard export\n- Developer enrollment list (names, emails, confirmation)\n- Meet-up registration + photo album + feedback form\n- Hackathon recruitment report (social analytics + registration data)\n- User adoption analytics and engagement data\n- Public posts promoting Ideathon & meet-ups","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":2,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":13000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"20 %","sub_fields":null}]},{"ref":null,"title":"Milestone #2","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"AI CARDANO IMPACT HACKATHON","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Cardano Hackathon (2–3 days) hosted successfully\n- 20+ teams submit MVPs\n- Complete the judging process to select the top 3–5 winning teams\n- Conclude the specialized training program, graduating the 20-30 developers fully capable of building on the Cardano","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Hackathon event executed with a minimum of 20 MVP submissions\n- Judging completed and winners publicly announced\n- 20–30 developers complete final assessment\n- Meetups conducted with >100 participants total","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Hackathon event media: photos, videos, agenda, MVP submission list\n- Judging result documents + winner announcement post\n- Graduate list + certificate PDFs (if applicable)\n- Meetup/Roadshow registration, photos, slide deck\n- Public recap posts across social channels","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":4,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":24000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"60 %","sub_fields":null}]},{"ref":null,"title":"Milestone #3","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"AI & WEB2 INTEGRATION INTO WEB3 PROGRAM WORKSHOP ","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Deliver 1-2 Technical Workshops on integrating AI/Web2 into Web3 products.\n- Conduct 1 Meeting/Sharing Session with advisors on sandbox experimentation and solution direction.\n- Provide 1:1 mentorship for at least 1 project/team preparing for sandbox or Web3 development.\n- Produce a complete resource package (slides, checklists, sandbox readiness guide).\n- Support at least 1 project application to reach “sandbox-ready” status for submission to Da Nang blockchain programs or similar initiatives.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- Minimum 50 total participants across workshops and mentoring sessions.\n- At least 1 technical workshop and 1 advisor meeting executed as scheduled.\n- At least 5-10 projects/teams receiving verified 1:1 mentorship sessions.\n- Minimum 1 project meeting “sandbox-ready” requirements approved by mentors.\n- All workshop materials and guidance documents publicly accessible (PDF/Notion/Drive).","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Attendance lists, event photos, videos, workshop materials.\n- Public resource documents: slides, PDF guides, and sandbox readiness checklist.\n- Mentorship logs: project list, mentor session notes, schedules.\n- Packaged “sandbox-ready” submissions for the project (summary, deck, technical overview).\n- Public promotional posts on official channels (X/Facebook/Telegram).","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":5,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":12000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"80 %","sub_fields":null}]},{"ref":null,"title":"Milestone #4","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/singleLineTextEntry","title":"Milestone Title","description":"A clear, concise title for this milestone","format":null,"answer":"SANDBOX APPLICATION AND REPORT","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Milestone Outputs","description":"What will be delivered in this milestone","format":null,"answer":"- Assist projects in building AI → Web3 roadmaps, with at least 1 project qualifying for sandbox submission.\n- Track the progress, KPIs, and milestones of at least 1 project in the sandbox to ensure progress.\n- Integrate feedback from mentors to optimize the product before submission to the sandbox or competitions.\n- Complete a final report summarizing activities and analyzing results from sandbox participating projects.\n- Recommend 1–2 projects to continue participation in hackathons or blockchain development programs in Da Nang.","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Acceptance Criteria","description":"Specific conditions that must be met","format":null,"answer":"- 1–2 projects with completed AI → Web3 roadmaps and clear, feasible milestones.\n- At least 1 project has fulfilled the requirements for sandbox submission or blockchain competitions in Da Nang.\n- Final report completed with accurate metrics: number of participants, number of experimental projects, and progress outcomes.\n- KPIs and milestone tracking for at least 1 project are approved by mentors.\n- Project(s) chosen to participate in larger competitions such as hackathons or ideathons","sub_fields":null},{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Evidence of Completion","description":"How you will demonstrate achievement","format":null,"answer":"- Final report: PDF document with detailed analysis of activities and results.\n- List of projects with completed roadmaps and KPIs.\n- Mentor feedback: Document showing mentor's recommendations to support project progress.\n- List of projects that have completed the sandbox application.\n- Statistical data: Summary of project count, participant numbers, progress, and results in the final report.\n- Public posts about the milestone achievements on official channels.","sub_fields":null},{"ref":"#/definitions/durationInMonths","title":"Delivery Month","description":"The month when this milestone will be delivered","format":null,"answer":6,"sub_fields":null},{"ref":"#/definitions/tokenValueCardanoADA","title":"Cost","description":"The cost of this milestone in ADA","format":null,"answer":11000,"sub_fields":null},{"ref":"#/definitions/dropDownSingleSelect","title":"Progress","description":"Current status of the milestone","format":null,"answer":"100 %","sub_fields":null}]}]}]}]},{"ref":"#/definitions/segment","title":"Final Pitch","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Project Team","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Who is participating in the project team and what are their roles?","description":"Who is participating in the project team and what are their roles?","format":null,"answer":"**1\\. Hanna Nguyen \\- Labs Manager, SCI Labs**\n\n- 5+ years of lead experience in the blockchain industry\n- 3+ years of incubation programs\n- Success in incubating 6 projects in 2 years, and 3 of them successfully in creating revenue and a stable community\n- Advisor for Growth and Marketing Strategy\n- X: [https://x\\.com/Hanna\\_SCI](https://x.com/Hanna_SCI)\n\n**2\\. Kurt Nguyen \\- Growth Manager, SCI Labs\\.**\n\n- 4+ years of experience in the blockchain industry\n- 2+ years of fintech experience in Japan\n- Founder of Phuoc Bau Community ( 1 of 10 top Crypto Communities in VN with 12,000+ users)\n- Researcher in Defi ( especially in LSDfi, RWAs, stablecoin analysis)\n- X: [https://x\\.com/kurtfortrade](https://x.com/kurtfortrade)\n- LinkedIn: [https://www\\.linkedin\\.com/in/giang\\-nguyen\\-184257188/](https://www.linkedin.com/in/giang-nguyen-184257188/)\n\n**3\\. Cindy Nguyen \\- Marketing Executive, SCI Labs**\n\n- 2+ years of experience in marketing and community management within the blockchain industry.\n- Experienced in managing and growing social media channels (Facebook, X, Telegram) for SCI Labs and its incubated projects, reaching a combined audience of 1,000+ followers.\n- Built and maintained the VNST community (an incubated project of SCI Labs) with 900+ MAU through consistent brand communication and performance tracking.\n- LinkedIn: [https://www\\.linkedin\\.com/in/minhchaunguyen16/](https://www.linkedin.com/in/minhchaunguyen16/)\n\n**4\\. Mina Ngo \\- Business Development Executive, SCI Labs**\n\n- 2+ years in business development and partnership in blockchain, community and CEX\n- Involved in the organization of 4+ blockchain hackathons\n- Strong understanding of hackathon dynamics, onboarding pipelines, prize design, judging frameworks and post-event conversion\n- Demonstrated ability to connect builders with investors, technical advisors and ecosystem stakeholders\n- LinkedIn: [http://linkedin\\.com/in/minh\\-phuong\\-1274171a3](http://linkedin.com/in/minh-phuong-1274171a3)\n\n**Advisor Nguyen Viet Thanh:**\n\n- CEO of Vtechcom-  A leading technology company in Vietnam\n- 10+ years of experience in enterprise software development and innovative technology solutions\n- Leads a highly skilled engineering team with a strong focus on creativity, R&amp;D, and cutting-edge tech applications\n- Extensive experience in researching, developing and building the Hydra ecosystem, including: \n\n        + Hydra SDK\n\n        + Hydra Playground\n\n        + Hydra Hex Core tools\n\n        + Hydra Wallet\n\n        + Hydra Explorer and various other developer-supporting tools within the ecosystem\n\n- LinkedIn: [https://www\\.linkedin\\.com/in/nguyenvietthanh/](https://www.linkedin.com/in/nguyenvietthanh/)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Budget & Costs","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"Please provide a cost breakdown of the proposed work and resources","description":"Please provide a cost breakdown of the proposed work and resources","format":null,"answer":"Please see below for a detailed breakdown of our budget. The base conversion rate for ADA-USD is 0.40\n\nExecutive summary:\n\n**Total Cost: 60,000 ADA**\n\n- Milestone 1: 13,000 ADA\n- Milestone 2: 24,000 ADA\n- Milestone 3: 13,000 ADA\n- Milestone 4 (End): 11,000 ADA\n\n\n\nLink details: [https://docs\\.google\\.com/spreadsheets/d/1\\_fTl1RGLfHF31Wmv0Rv2sn9370B70Wpr3WG8sUX1HCQ/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1_fTl1RGLfHF31Wmv0Rv2sn9370B70Wpr3WG8sUX1HCQ/edit?usp=sharing)","sub_fields":null}]},{"ref":"#/definitions/section","title":"Value for Money","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/multiLineTextEntryMarkdown","title":"How does the cost of the project represent value for the Cardano ecosystem?","description":"How does the cost of the project represent value for the Cardano ecosystem?","format":null,"answer":"Our proposal represents a high-efficiency investment for the Cardano Treasury by directing funds strictly toward impact-generating activities and delivering a crucial regulatory breakthrough that far exceeds the monetary cost.\n\n\n\n**1\\. Infrastructure Leverage: Zero \"Sunk Cost\" on Venues**\n\nA significant portion of typical event budgets is often wasted on logistics and rental fees. We eliminate this waste to maximize value.\n\n- The Asset: The project utilizes co-working spaces owned/operated by the organizing SCI Labs\n- The Value: This ensures that the requested budget flows directly into Developer Incentives (Prizes), Expert Mentorship, and Technical Infrastructure (Hydra nodes, Cloud), rather than passive real estate costs. Every ADA spent directly supports the builders.\n\n\n\n**2\\. Strategic ROI: The Regulatory Breakthrough**\n\nThe ultimate deliverable of this project is not just code, but legal legitimacy in a strategic market.\n\n- The Cost: The total is ~60,000 ADA to guide projects through the integration and go-to-market projects that could be potentially added to Sandbox \n- The Return: at least 1 project to apply to the Da Nang Blockchain Sandbox establishes a priceless legal precedent for Cardano in Vietnam. The value of opening a government-sanctioned pathway for Real-World Assets (RWA) and GovTech far outweighs the operational cost of the program.\n\n\n\n**3\\. Economies of Scale \\(The \"4\\-in\\-1\" Pipeline\\)**\n\nInstead of fragmenting the ecosystem's resources across multiple disconnected small proposals, this single plan funds a complete 6-month innovation lifecycle.\n\n- The Efficiency: For a consolidated budget, the ecosystem secures four distinct phases: Ideathon → Impact Hackathon → Real-World Integration.\n- The Benefit: This lowers the \"Customer Acquisition Cost\" (CAC) per developer. By retaining teams from Q1 through Q4, we maximize the lifetime value of every participant and reduce the churn rate typical of standalone hackathons.\n\n\n\n**4\\. High\\-Value Talent Acquisition**\n\nWe target a high-cost, high-demand demographic: AI Engineers (specializing in Agents, Privacy, and Trading).\n\n- The Value: Recruiting sophisticated Web2 AI talent is traditionally expensive. By combining an Ideathon with specialized Integration Labs and Mentorship, we provide a structured, low-cost funnel to bring these advanced developers into the Cardano ecosystem, creating a specialized workforce that currently does not exist.","sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Self-Assessment","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Self-Assessment Checklist","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal is a non-technical initiative, with ≤20% of the budget for tech support.","description":"Scope Fit:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal provides verifiable evidence (portfolio, links, reports) of the team's ability to deliver the project.","description":"Relevant Experience:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposer and all team members are in good standing with prior Catalyst projects.","description":"Catalyst Standing:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal includes clear objectives with both Output Metrics (what proposal did) and Adoption-Focused Metrics (what effect proposal had).","description":"Clear Goals & KPIs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal clearly explains the user journey and provides a credible plan for how the project will equip and motivate users for future on-chain activity.","description":"Pathway to Adoption:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the initiative clearly demonstrates how it will grow the Cardano ecosystem or onboard users.","description":"Community Value:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the project plan and timeline (≤ 12 months) are realistic and well-defined.","description":"Realistic Timeline:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the proposal commits to public outputs and justifies any exceptions.","description":"Public Outputs:","format":null,"answer":true,"sub_fields":null},{"ref":"#/definitions/agreementConfirmation","title":"I confirm that the budget adheres to all policies: it is for future work, follows the merchandise rule, and excludes establishing local treasuries, incentives/giveaways, re-grants.","description":"Budget Compliance:","format":null,"answer":true,"sub_fields":null}]}]},{"ref":"#/definitions/segment","title":"Required Acknowledgements","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/section","title":"Ongoing Projects","description":null,"format":null,"answer":{"projects":[],"has_ongoing_projects":false},"sub_fields":null},{"ref":"#/definitions/section","title":"Consent & Confirmation","description":null,"format":null,"answer":null,"sub_fields":[{"ref":"#/definitions/agreementConfirmation","title":"I Agree","description":"I confirm that I have read, understand and shall adhere to the [Project Catalyst Platform Terms of Use](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-terms-of-use), [Project Catalyst Platform Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/project-catalyst-platform-privacy-policy), [Terms & Conditions](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions), [Fund Rules](https://docs.projectcatalyst.io/current-fund/fund-basics/fund-rules), [Privacy Policy](https://docs.projectcatalyst.io/current-fund/fund-basics/project-catalyst-terms-and-conditions/catalyst-fc-privacy-policy). I understand that providing accurate and truthful information is essential for my proposal to remain eligible to participate in the current Fund.","format":null,"answer":true,"sub_fields":null}]}]}]},"links":null,"open_source":true,"score":null,"author":null,"tags":"Events","public_key":null,"files_url":null,"has_reviewed":null,"row_id":1798}